/*
 * PROJECT:     ReactOS Broadcom NetXtreme Driver
 * LICENSE:     GPL-2.0-or-later (https://spdx.org/licenses/GPL-2.0-or-later)
 * PURPOSE:     Hardware specific definitions
 * COPYRIGHT:   Copyright 2021-2022 Scott Maday <coldasdryice1@gmail.com>
 */
#pragma once

#define IEEE_802_ADDR_LENGTH 6

#define MAXIMUM_MULTICAST_ADDRESSES 16

#define MAX_ATTEMPTS        1000
#define MAX_ATTEMPTS_PHY    5000

#define NUM_RX_BUFFER_DESCRIPTORS   512
#define NUM_RX_RETURN_DESCRIPTORS   1024
#define NUM_TX_BUFFER_DESCRIPTORS   512

#define B57XX_ENDIAN_BYTESWAP           0
#define B57XX_ENDIAN_WORDSWAP           1
#define B57XX_ENDIAN_BYTESWAP_DATA      1
#define B57XX_ENDIAN_WORDSWAP_DATA      1
#if __BYTE_ORDER__ == __ORDER_LITTLE_ENDIAN__
#define B57XX_ENDIAN_BYTESWAP_NFDATA    0
#define B57XX_ENDIAN_WORDSWAP_NFDATA    1
#else
#define B57XX_ENDIAN_BYTESWAP_NFDATA    1
#define B57XX_ENDIAN_WORDSWAP_NFDATA    1
#endif

#define B57XX_ENDIAN_SWAP(ByteSwap, ByteSwapReg, WordSwap, WordSwapReg)                            \
    ((ByteSwap ? ByteSwapReg : 0) | (WordSwap ? WordSwapReg : 0))

#if __BYTE_ORDER__ == __ORDER_LITTLE_ENDIAN__
#define B57XX_PAIRED_WORD(Word1, Word2)                                                            \
    struct                                                                                         \
    {                                                                                              \
        USHORT Word2;                                                                              \
        USHORT Word1;                                                                              \
    }
#else
#define B57XX_PAIRED_WORD(Word1, Word2)                                                            \
    struct                                                                                         \
    {                                                                                              \
        USHORT Word1;                                                                              \
        USHORT Word2;                                                                              \
    }
#endif

#define BIT(x)  (1 << x)

typedef UCHAR MAC_ADDRESS[IEEE_802_ADDR_LENGTH], *PMAC_ADDRESS;

#include <pshpack1.h>

/* Ethernet frame header */
typedef struct _ETH_HEADER
{
    MAC_ADDRESS Destination;
    MAC_ADDRESS Source;
    USHORT PayloadType;
} ETH_HEADER, *PETH_HEADER;

/* B47XX NICs are big endian and need addresses in big endian format */
typedef struct _B57XX_PHYSICAL_ADDRESS
{
    LONG HighPart;
    ULONG LowPart;
} B57XX_PHYSICAL_ADDRESS, *PB57XX_PHYSICAL_ADDRESS;
C_ASSERT(sizeof(B57XX_PHYSICAL_ADDRESS) == 8);

typedef struct _B57XX_RING_CONTROL_BLOCK
{
    B57XX_PHYSICAL_ADDRESS HostRingAddress;
    B57XX_PAIRED_WORD
    (
        MaxLength,
        Flags
    );
    ULONG NICRingAddress;
} B57XX_RING_CONTROL_BLOCK, *PB57XX_RING_CONTROL_BLOCK;

typedef struct _B57XX_SEND_BUFFER_DESCRIPTOR
{
    B57XX_PHYSICAL_ADDRESS HostAddress;
    B57XX_PAIRED_WORD
    (
        Length,
        Flags
    );
    B57XX_PAIRED_WORD
    (
        Reserved,
        VLANTag
    );
} B57XX_SEND_BUFFER_DESCRIPTOR, *PB57XX_SEND_BUFFER_DESCRIPTOR;
C_ASSERT(sizeof(B57XX_SEND_BUFFER_DESCRIPTOR) == 16);

typedef struct _B57XX_RECEIVE_BUFFER_DESCRIPTOR
{
    B57XX_PHYSICAL_ADDRESS HostAddress;
    B57XX_PAIRED_WORD
    (
        Index,
        Length
    );
    B57XX_PAIRED_WORD
    (
        Type,
        Flags
    );
    B57XX_PAIRED_WORD
    (
        IPChecksum,
        TransportChecksum
    );
    B57XX_PAIRED_WORD
    (
        ErrorFlags,
        VLANTag
    );
    ULONG Reserved;
    ULONG Opaque;
} B57XX_RECEIVE_BUFFER_DESCRIPTOR, *PB57XX_RECEIVE_BUFFER_DESCRIPTOR;
C_ASSERT(sizeof(B57XX_RECEIVE_BUFFER_DESCRIPTOR) == 32);

typedef B57XX_PAIRED_WORD
(
    SendConsumerIndex, // Send ring
    ReceiveProducerIndex // Return ring
) B57XX_RING_INDEX_PAIR, *PB57XX_RING_INDEX_PAIR;

typedef struct _B57XX_STATUS_BLOCK
{
    ULONG Status;
    ULONG StatusTag;
    B57XX_PAIRED_WORD
    (
        ReceiveStandardConsumerIndex,
        ReceiveJumboConsumerIndex // Unused
    );
    B57XX_PAIRED_WORD
    (
        Reserved,
        ReceiveMiniConsumerIndex // Unused
    );
    B57XX_RING_INDEX_PAIR RingIndexPairs[1];
} B57XX_STATUS_BLOCK, *PB57XX_STATUS_BLOCK;
C_ASSERT(sizeof(B57XX_STATUS_BLOCK) == 20);

typedef ULONG B57XX_STATISTICS_BLOCK[512], *PB57XX_STATISTICS_BLOCK;
C_ASSERT(sizeof(B57XX_STATISTICS_BLOCK) == 2048);

#include <poppack.h>

/* Custom Blocks for general information and important hardware states */

typedef struct _B57XX_RECEIVE_PRODUCER_BLOCK
{
    B57XX_RING_CONTROL_BLOCK RingControlBlock;
    PB57XX_RECEIVE_BUFFER_DESCRIPTOR pRing; // Virtual host address
    ULONG Count; // Number of elements in the ring
    ULONG Index; // Host producer index
    PUCHAR HostBuffer; // Virtual host address
    ULONG FrameBufferLength; // Aligned size of the buffer for each received frame
} B57XX_RECEIVE_PRODUCER_BLOCK, *PB57XX_RECEIVE_PRODUCER_BLOCK;

typedef struct _B57XX_RECEIVE_CONSUMER_BLOCK
{
    B57XX_RING_CONTROL_BLOCK RingControlBlock;
    PB57XX_RECEIVE_BUFFER_DESCRIPTOR pRing; // Virtual host address
    ULONG Count; // Number of elements in the ring
    ULONG Index; // Host consumer index (tail)
} B57XX_RECEIVE_CONSUMER_BLOCK, *PB57XX_RECEIVE_CONSUMER_BLOCK;

typedef struct _B57XX_SEND_BLOCK
{
