Repository: reactos/ReactOS
Catalog: dll/shellext/acppage/pot/*.po
Languages: de_de, fr_fr, hu_hu, it_it, pl_pl, ro_ro, ru_ru, sk_sk, sq_al, sv_se, tr_tr, uk_ua

# DIALOGEX.IDD_ACPPAGESHEET.CAPTION
source: Compatibility
de_de: Kompatibilität
fr_fr: Compatibilité
hu_hu: Kompatibilitás
it_it: Compatibilità
pl_pl: Zgodność
ro_ro: Compatibilitate
ru_ru: Совместимость
sk_sk: Kompatibilita
sq_al: Pajtueshmëri
sv_se: Kompatibilitet
tr_tr: Uyumluluk
uk_ua: Сумісність

source: If you have problems running this program in ReactOS, select an operating system ReactOS should report to the application. Please note that this is a work in progress.
de_de: Falls dieses Programm Probleme verursacht, wählen Sie einen Kompatibilitätsmodus, unter dem das Programm möglicherweise korrekt funktioniert. Bitte beachten Sie dass sich diese Funktion aktuell in Entwicklung befindet.
fr_fr: Si vous avez des difficultés à lancer ce programme sous ReactOS, sélectionner le système d'exploitation que ReactOS montrera à l'application. Please note that this is a work in progress.
hu_hu: Ha probléma van, válassz ki egy operációs rendszert amit a ReactOS színlelni fog Please note that this is a work in progress.
it_it: Se ci sono problemi ad eseguire questo programma in ReactOS potete scegliere un sistema operativo da segnalare all'applicazione. Please note that this is a work in progress.
pl_pl: Jeżeli masz problemy z uruchamianiem tego programu w ReactOS, wybierz system operacyjny, który ReactOS powinien zgłaszać aplikacji. Please note that this is a work in progress.
ro_ro: Dacă aveți probleme cu acest program în ReactOS, selectați un sistem de operare care să fie raportat aplicației. Conștientizați că aceasta este o funcționalitate în dezvoltare.
ru_ru: Если у вас есть проблемы с запуском этой программы в ReactOS, выберите операционную систему, которой ReactOS будет представляться приложению. Please note that this is a work in progress.
sk_sk: Ak máte problémy so spustením tohto programu v systéme ReactOS, vyberte operačný systém, pod názvom ktorého sa systém ReactOS ohlási programu. Please note that this is a work in progress.
sq_al: Nëse keni probleme ne ekzekutimin e këtij programi në ReactOS, përzgjidhni një sistem operativ ReactOS duhet të raportojë për zbatimin. Please note that this is a work in progress.
sv_se: Ifall du har problem med att köra det här programmet i ReactOS, välj det operativsystem som ReactOS ska rapportera till programmet. Please note that this is a work in progress.
tr_tr: ReactOS'ta bu izlenceyi çalıştırırken sorunlarınız oluyorsa ReactOS'un uygulamaya bildireceği bir işletim dizgesi seçiniz. Please note that this is a work in progress.
uk_ua: Якщо у Вас виникли проблеми із запуском цієї програми у ReactOS, виберіть режим сумісності з потрібною версією ОС. Please note that this is a work in progress.

source: Compatibility mode
de_de: Kompatibilitätsmodus
fr_fr: Mode de compatibilité
hu_hu: Kompatibilitási mód
it_it: Modalità compatibile
pl_pl: Tryb zgodności
ro_ro: Modul de compatibilitate
ru_ru: Режим совместимости
sk_sk: Kompatibilný režim
sq_al: Mjeti Pajtueshmërise
sv_se: Kompatibilitetsläge
tr_tr: Uyumluluk Kipi
uk_ua: Режим сумісності

source: Run this program in compatibility mode for:
de_de: Programm im Kompatibilitätsmodus ausführen für:
fr_fr: Lancer ce programme en mode de compatibilité pour:
hu_hu: Ez a program kompatibilitási módban fut:
it_it: Esegui questo programma in modalità compatibile per:
pl_pl: Uruchom ten program w trybie zgodności z:
ro_ro: Lansați acest program în modul de compatibilitate pentru:
ru_ru: Запустить программу в режиме совместимости с:
sk_sk: Tento program spustiť v režime kompatibilnom so systémom:
sq_al: Ekzekuto kete program ne menyre pajtueshmerie per:
sv_se: Kör det här programmet i kompatibilitetsläge för:
tr_tr: Bu izlenceyi şu uyumluluk kipinde çalıştır:
uk_ua: Запускати програму в режимі сумісності для:

source: Display settings
de_de: Anzeigeeinstellungen
fr_fr: Réglages de l'écran
hu_hu: Megjelenitői beállítások
it_it: Impostazioni del monitor
pl_pl: Ustawienia ekranu
ro_ro: Configurația de afișare
ru_ru: Параметры экрана
sk_sk: Nastavenia obrazovky
sq_al: Shfaq konfigurimet
sv_se: Inställningar
tr_tr: Görüntü Ayarları
uk_ua: Настройки екрану

source: Run in 256 colors
de_de: Mit 256 Farben ausführen
fr_fr: Lancer en 256 colors
hu_hu: 256 szín
it_it: Esegui con 256 colori
pl_pl: Uruchom w 256 kolorach
ro_ro: Lansează în 256 culori
ru_ru: Использовать 256 цветов
sk_sk: Spustiť v režime 256 farieb
sq_al: Ekzekuto ne 256 colors
sv_se: Använd 256 färger
tr_tr: 256 Renkte Çalıştır
uk_ua: 256 кольорів

source: Run in 640x480 screenresolution
de_de: In Bildschirmauflösung 640 x 480 ausführen
fr_fr: Lancer en resolution d'écran 640x480
hu_hu: 640x480-as felbontás
it_it: Esegui con schermo a risoluzione 640x480
pl_pl: Uruchom w rozdzielczości ekranu 640x480
ro_ro: Lansează în rezoluție de 640x480 pixeli
ru_ru: Использовать разрешение экрана 640x480
sk_sk: Spustiť s rozlíšením obrazovky 640x480
sq_al: Ekzekuto ne 640x480 screenresolution
sv_se: Kör i skärmupplösningen 640 x 480
tr_tr: 640x480 Görüntülük Çözünürlüğünde Çalıştır
uk_ua: Роздільна здатність 640x480

source: Disable visual themes
de_de: Visuelle Designs deaktivieren
fr_fr: Désactiver les thèmes visuels
hu_hu: Témák kikapcsolása
it_it: Disabilita gli schemi di visualizzazione
pl_pl: Wyłącz kompozycje wizualne
ro_ro: Dezactivează temele vizuale
ru_ru: Отключить визуальное оформление
sk_sk: Vypnúť vizuálne motívy
sq_al: Çaktivizo themat vizuale
sv_se: Inaktivera teman
tr_tr: Görmelik Temaları Edilginleştir
uk_ua: Вимикати візуальні теми

source: E&dit compatibility modes...
de_de: Kompatibilitätsmodus ändern
fr_fr: E&diter les Modes de compatibilité
hu_hu: Sémák szerkesztése...
it_it: Modifica la modalità compatibile...
pl_pl: E&dytuj tryby zgodności...
ro_ro: E&ditează modurile de compatibilitate…
ru_ru: Настроить режимы совместимости...
sk_sk: &Upraviť režimy kompatibility...
sq_al: Modifiko mjetin e pajtueshmerise...
sv_se: &Redigera kompatibilitetslägen...
tr_tr: &Uyumluluk Kiplerini Düzenle...
uk_ua: &Режими сумісності...

source: Learn more about <A>program compatibility</A>.
de_de: Weitere Informationen über <A>Programmkompatibilität</A>.
it_it: Ulteriori informazioni sulla <A>compatibilità dei programmi</A>.
pl_pl: Dowiedz się więcej o <A>zgodności programów</A>.
ro_ro: Aflați mai multe despre <A>compatibilitate de program</A>.
ru_ru: Узнать больше о <A>совместимости программ</A>.
sk_sk: Ďalšie informácie o <A>kompatibilite programov</A>.
sv_se: Lär dig mer om <A>program-kompatibilitet</A>.
tr_tr: <A>İzlence uyumluluğu</A> konusunda daha çok öğren.

source: Edit Compatibility Modes
de_de: Kompatibilitätsmodus ändern
fr_fr: Editer les Modes de compatibilité
hu_hu: Sémák szerkesztése
it_it: Modifica la modalità compatibile
pl_pl: Edycja trybów zgodności
ro_ro: Modurile de compatibilitate
ru_ru: Изменить режимы совместимости
sk_sk: Úprava režimov kompatibility
sq_al: Modifiko Mjetin e Pajtueshmerise
sv_se: Redigera kompatibilitetslägen
tr_tr: Uyumluluk Kiplerini Düzenle
uk_ua: Редагування режимів сумісності

source: &Add...
de_de: &Hinzufügen...
fr_fr: &Ajouter...
hu_hu: &Hozzáadás...
it_it: &Aggiungi...
pl_pl: &Dodaj...
ro_ro: &Adăugare…
ru_ru: &Добавить...
sk_sk: Prid&ať...
sq_al: Shto...
sv_se: &Lägg till...
tr_tr: &Ekle...
uk_ua: &Додати...

source: &Edit...
de_de: &Ändern...
fr_fr: &Editer...
hu_hu: &Szerkesztés...
it_it: &Modifica...
pl_pl: &Edytuj...
ro_ro: E&ditare…
ru_ru: &Редактировать...
sk_sk: &Upraviť...
sq_al: Modifiko...
sv_se: &Ändra...
tr_tr: &Düzenle...
uk_ua: &Редагувати...

source: &Delete
de_de: &Löschen
fr_fr: &Supprimer
hu_hu: &Törlés
it_it: &Cancella
pl_pl: &Usuń
ro_ro: &Elimnă
ru_ru: &Удалить
sk_sk: O&dstrániť
sq_al: Fshi
sv_se: &Ta bort
tr_tr: &Sil
uk_ua: В&идалити

source: &OK
ro_ro: Con&firmă
tr_tr: Tamam

source: &Cancel
de_de: &Abbrechen
fr_fr: &Annuler
hu_hu: &Mégse
it_it: A&nnulla
pl_pl: &Anuluj
ro_ro: A&nulează
ru_ru: &Отмена
sk_sk: &Zrušiť
sq_al: Anulo
sv_se: &Avbryt
tr_tr: İptal
uk_ua: &Скасувати

# STRINGTABLE.IDS_TABTITLE
source: Compatibility
de_de: Kompatibilität
ro_ro: Compatibilitate
ru_ru: Совместимость
tr_tr: Uyumluluk

source: Compatibility modes cannot be set on this program because it is on a network drive.
de_de: Kompatibilitätsmodi können auf diesem Programm nicht angewendet werden, da es sich auf einem Netzlaufwerk befindet.
ro_ro: Modurile de compatibilitate nu pot fi instituite pentru acest program deoarece rezidă pe o unitate de stocare în rețea.
ru_ru: Режим совместимости не может быть установлен для этой программы, потому что она находится на сетевом диске.
tr_tr: Bir ağ sürücüsü üzerinde olduğundan bu izlencede uyumluluk kipleri ayarlanamaz.

source: Compatibility modes cannot be set on this program because it is a part of ReactOS.
de_de: Kompatibilitätsmodi können auf diesem Programm nicht angewendet werden, da es Teil von ReactOS ist.
ro_ro: Modurile de compatibilitate nu pot fi instituite pentru acest program deoarece este parte din ReactOS.
ru_ru: Режим совместимости не может быть использован для компонентов ReactOS.
tr_tr: ReactOS'un bir parçası olduğundan bu izlencede uyumluluk kipleri ayarlanamaz.

source: You did not add the mode, do you want to add it now?
de_de: Sie haben den Modus nicht hinzugefügt, möchten Sie ihn jetzt hinzufügen?
ro_ro: Nu ați specificat un mod. Doriți să specificați unul?
ru_ru: Вы не добавили режим, добавить его сейчас?
