<?php
/** Telugu (తెలుగు)
 *
 * @ingroup Language
 * @file
 *
 * @author Chaduvari
 * @author Mpradeep
 * @author Sunil Mohan
 * @author Veeven
 * @author Ævar Arnfjörð Bjarmason <avarab@gmail.com>
 * @author לערי ריינהארט
 * @author వైజాసత్య
 */

$namespaceNames = array(
	NS_MEDIA            => 'మీడియా',
	NS_SPECIAL          => 'ప్రత్యేక',
	NS_MAIN             => '',
	NS_TALK             => 'చర్చ',
	NS_USER             => 'సభ్యులు',
	NS_USER_TALK        => 'సభ్యులపై_చర్చ',
	# NS_PROJECT set by $wgMetaNamespace
	NS_PROJECT_TALK     => '$1_చర్చ',
	NS_IMAGE            => 'బొమ్మ',
	NS_IMAGE_TALK       => 'బొమ్మపై_చర్చ',
	NS_MEDIAWIKI        => 'మీడియావికీ',
	NS_MEDIAWIKI_TALK   => 'మీడియావికీ_చర్చ',
	NS_TEMPLATE         => 'మూస',
	NS_TEMPLATE_TALK    => 'మూస_చర్చ',
	NS_HELP             => 'సహాయము',
	NS_HELP_TALK        => 'సహాయము_చర్చ',
	NS_CATEGORY         => 'వర్గం',
	NS_CATEGORY_TALK    => 'వర్గం_చర్చ'
);

$namespaceAliases = array(
	'సభ్యుడు'          => NS_USER, # set for bug 11615
	'సభ్యునిపై_చర్చ'         => NS_USER_TALK,
	'బొమ్మపై_చర్చ'          => NS_IMAGE_TALK
);


$linkTrail = "/^([\xE0\xB0\x81-\xE0\xB1\xAF]+)(.*)$/sDu";

// nobody seems to use these anymore
/*$digitTransformTable = array(
	'0' => '౦',
	'1' => '౧',
	'2' => '౨',
	'3' => '౩',
	'4' => '౪',
	'5' => '౫',
	'6' => '౬',
	'7' => '౭',
	'8' => '౮',
	'9' => '౯'
);*/

$messages = array(
# User preference toggles
'tog-underline'               => 'లింకుల కింద గీతగీయి:',
'tog-highlightbroken'         => 'తెగిపోయిన లింకులను <a href="" class="new">ఇలా చూపించు</a> (ఇంకో పధ్ధతి: <a href="" class="internal">?</a>).',
'tog-justify'                 => 'పేరాలను ఇరు పక్కలా సమానంగా సర్దు',
'tog-hideminor'               => 'ఇటీవలి మార్పులలో చిన్న మార్పులను దాచిపెట్టు',
'tog-extendwatchlist'         => 'మార్పులన్నీ చూపించటానికి నా వీక్షణా జాబితాను పెద్దది చేయి',
'tog-usenewrc'                => 'మెరుగైన ఇటీవలి మార్పులు పేజీ (జావాస్క్రిప్టు)',
'tog-numberheadings'          => 'శీర్షికలకు ఆటోమాటిక్‌గా వరుస సంఖ్యలు పెట్టు',
'tog-showtoolbar'             => 'దిద్దుబాట్లు చేసేటప్పుడు, అందుకు సహాయపడే పరికరాలపెట్టెను చూపించు (జావాస్క్రిప్టు)',
'tog-editondblclick'          => 'డబుల్‌ క్లిక్కు చేసినప్పుడు పేజీని మార్చు (జావాస్క్రిప్టు)',
'tog-editsection'             => '[మార్చు] లింకు ద్వారా విభాగం మార్పు కావాలి',
'tog-editsectiononrightclick' => 'విభాగం పేరు మీద కుడి క్లిక్కుతో విభాగం మార్పు కావాలి (జావాస్క్రిప్టు)',
'tog-showtoc'                 => 'విషయసూచిక చూపించు (3 కంటే ఎక్కువ శీర్షికలున్న పేజీలకు)',
'tog-rememberpassword'        => 'ఈ కంప్యూటరులో నేను అన్ని సెషన్లలోనూ నా లాగిన్ను గుర్తుపెట్టుకో',
'tog-editwidth'               => 'మార్పుల బాక్సు పూర్తి వెడల్పు ఉంటుంది',
'tog-watchcreations'          => 'నేను సృష్టించిన పేజీలను నా వీక్షణ జాబితాకు కలుపు',
'tog-watchdefault'            => 'నేను దిద్దుబాట్లు చేసిన పేజీలను నా వీక్షణ జాబితాకు కలుపు',
'tog-watchmoves'              => 'నేను తరలించిన పేజీలను నా వీక్షణ జాబితాకు కలుపు',
'tog-watchdeletion'           => 'నేను తొలగించిన పేజీలను నా వీక్షణ జాబితాకు కలుపు',
'tog-minordefault'            => 'ప్రత్యేకంగా తెలుపనంతవరకూ నా మార్పులను చిన్న మార్పులుగా గుర్తించు',
'tog-previewontop'            => 'వ్యాసం మార్పుల తరువాత ఎలావుంటుందో మార్పుల‌ బాక్సుకు పైన చూపు',
'tog-previewonfirst'          => 'దిద్దిబాట్లు చేసిన వ్యాసాన్ని భద్రపరిచే ముందు ఎలా వుంటుందో ఒకసారి చూపించు',
'tog-nocache'                 => 'పేజీలను బ్రవుజరులో కాషింగు చెయ్యవద్దు',
'tog-enotifwatchlistpages'    => 'నా వీక్షణాజాబితా లోని పేజీలు మారినపుడు నాకు ఈ-మెయిలు పంపించు',
'tog-enotifusertalkpages'     => 'నా చర్చా పేజీలో మార్పులు జరిగినపుడు నాకు ఈ-మెయిలు పంపించు',
'tog-enotifminoredits'        => 'చిన్న మార్పులు చేసినప్పుడు కూడా నాకు ఈ-మెయిలు పంపించు',
'tog-enotifrevealaddr'        => 'ప్రకటన మెయిల్లలో నా ఈ-మెయిలు చిరునామాను చూపించు',
'tog-shownumberswatching'     => 'వీక్షకుల సంఖ్యను చూపించు',
'tog-fancysig'                => 'సంతకం మాత్రమే (ఆటోమెటిక్‌ లింకు లేకుండా)',
'tog-externaleditor'          => 'మామూలుగా బయటి కూర్పరిని వాడు (నిపుణులకు మాత్రమే, మీ కంప్యూటర్లో ప్రత్యేక అమరికలు అవసరమవుతాయి)',
'tog-externaldiff'            => 'మార్పులను చూడటానికి బయటి సాఫ్టువేరును వాడు (నిపుణులకు మాత్రమే, మీ కంప్యూటర్లో ప్రత్యేక అమరికలు అవసరమవుతాయి)',
'tog-showjumplinks'           => '"ఇక్కడికి గెంతు" లింకులను చూపించు',
'tog-uselivepreview'          => 'రాస్తున్నదానిని ఎప్పటికప్పుడు సరిచూడండి (జావాస్క్రిప్టు) (పరీక్షాదశలో ఉంది)',
'tog-forceeditsummary'        => 'దిద్దుబాటు సారాంశం ఖాళీగా ఉంటే ఆ విషయాన్ని నాకు సూచించు',
'tog-watchlisthideown'        => 'నా మార్పులను వీక్షణా జాబితాలో చూపించొద్దు',
'tog-watchlisthidebots'       => 'బాట్లు చేసిన మార్పులను నా వీక్షణా జాబితాలో చూపించొద్దు',
'tog-watchlisthideminor'      => 'చిన్న మార్పులను నా వీక్షణా జాబితాలో చూపించొద్దు',
'tog-ccmeonemails'            => 'నేను ఇతర సభ్యులకు పంపిస్తున్న ఈ-మెయిళ్ల కాపీని నాకు కూడా పంపు',
'tog-diffonly'                => 'తేడాలను చూపిస్తున్నపుడు, కింద చూపించే పేజీలోని సమాచారాన్ని చూపించొద్దు',
'tog-showhiddencats'          => 'దాచిన వర్గాలను చూపించు',

'underline-always'  => 'ఎల్లప్పుడూ',
'underline-never'   => 'ఎప్పటికీ వద్దు',
'underline-default' => 'బ్రవుజరు నుండి తీసుకో',

'skinpreview' => '(మునుజూపు/సరిచూడు)',

# Dates
'sunday'        => 'ఆదివారము',
'monday'        => 'సోమవారము',
'tuesday'       => 'మంగళవారము',
'wednesday'     => 'బుధవారము',
'thursday'      => 'గురువారము',
'friday'        => 'శుక్రవారము',
'saturday'      => 'శనివారము',
'sun'           => 'ఆది',
'mon'           => 'సోమ',
'tue'           => 'మంగళ',
'wed'           => 'బుధ',
'thu'           => 'గురు',
'fri'           => 'శుక్ర',
'sat'           => 'శని',
'january'       => 'జనవరి',
'february'      => 'ఫిబ్రవరి',
'march'         => 'మార్చి',
'april'         => 'ఏప్రిల్',
'may_long'      => 'మే',
'june'          => 'జూన్',
'july'          => 'జూలై',
'august'        => 'ఆగష్టు',
'september'     => 'సెప్టెంబరు',
'october'       => 'అక్టోబరు',
'november'      => 'నవంబరు',
'december'      => 'డిసెంబరు',
'january-gen'   => 'జనవరి',
'february-gen'  => 'ఫిబ్రవరి',
'march-gen'     => 'మార్చి',
'april-gen'     => 'ఏప్రిల్',
'may-gen'       => 'మే',
'june-gen'      => 'జూన్',
'july-gen'      => 'జూలై',
'august-gen'    => 'ఆగష్టు',
'september-gen' => 'సెప్టెంబరు',
'october-gen'   => 'అక్టోబరు',
'november-gen'  => 'నవంబరు',
'december-gen'  => 'డిసెంబరు',
'jan'           => 'జన',
'feb'           => 'ఫిబ్ర',
'mar'           => 'మార్చి',
'apr'           => 'ఏప్రి',
'may'           => 'మే',
'jun'           => 'జూన్',
'jul'           => 'జూలై',
'aug'           => 'ఆగ',
'sep'           => 'సెప్టెం',
'oct'           => 'అక్టో',
'nov'           => 'నవం',
'dec'           => 'డిసెం',

# Categories related messages
'pagecategories'                 => '{{PLURAL:$1|వర్గం|వర్గాలు}}',
'category_header'                => '"$1" వర్గంలో వ్యాసాలు',
'subcategories'                  => 'ఉపవర్గాలు',
'category-media-header'          => '"$1" వర్గంలో ఉన్న మీడియా ఫైళ్లు',
'category-empty'                 => "''ప్రస్తుతం ఈ వర్గంలో ఎలాంటి పేజీలుగానీ మీడియా ఫైళ్లుగానీ లేవు.''",
'hidden-categories'              => '{{PLURAL:$1|దాచిన వర్గం|దాచిన వర్గాలు}}',
'hidden-category-category'       => 'దాచిన వర్గాలు', # Name of the category where hidden categories will be listed
'category-subcat-count'          => '{{PLURAL:$2|ఈ వర్గంలో క్రింద చూపిస్తున్న ఒకే ఉపవర్గం ఉంది.|ఈ వర్గంలో ఉన్న మొత్తం $2 వర్గాలలో ప్రస్తుతం {{PLURAL:$1|ఒక ఉపవర్గాన్ని|$1 ఉపవర్గాలను}} చూపిస్తున్నాము.}}',
'category-subcat-count-limited'  => 'ఈ వర్గం క్రింద చూపిస్తున్న {{PLURAL:$1|ఒక ఉపవర్గం ఉంది|$1 ఉపవర్గాలు ఉన్నాయి}}.',
'category-article-count'         => '{{PLURAL:$2|ఈ వర్గంలో క్రింద చూపిస్తున్న ఒకే పేజీ ఉంది.|ఈ వర్గంలో ఉన్న మొత్తం $2 పేజీలలో ప్రస్తుతం {{PLURAL:$1|ఒక పేజీని|$1 పేజీలను}} చూపిస్తున్నాము.}}',
'category-article-count-limited' => 'ఈ వర్గం క్రింద చూపిస్తున్న {{PLURAL:$1|ఒక పేజీ ఉంది|$1 పేజీలు ఉన్నాయి}}.',
'category-file-count'            => '{{PLURAL:$2|ఈ వర్గంలో క్రింద చూపిస్తున్న ఒకే ఫైలు ఉంది.|ఈ వర్గంలో ఉన్న మొత్తం $2 పేజీలలో ప్రస్తుతం {{PLURAL:$1|ఒక ఫైలును|$1 ఫైళ్లను}} చూపిస్తున్నాము.}}',
'category-file-count-limited'    => 'ఈ వర్గం క్రింద చూపిస్తున్న {{PLURAL:$1|ఒక ఫైలు ఉంది|$1 ఫైళ్లు ఉన్నాయి}}.',
'listingcontinuesabbrev'         => ' (కొనసాగింపు)',

'mainpagetext'      => "<big>'''మీడియా వికీని విజయవంతంగా ప్రతిష్టించాం.'''</big>",
'mainpagedocfooter' => 'వికీ సాఫ్టువేరును వాడటనికి కావలిసిన సమాచారం కోసం [http://meta.wikimedia.org/wiki/Help:Contents వాడుకరుల గైడు]ను సందర్శించండి.

== మొదలు పెట్టండి ==

* [http://www.mediawiki.org/wiki/Manual:Configuration_settings మీడియావికీ పనితీరు, అమరిక మార్చుకునేందుకు వీలుకల్పించే చిహ్నాల జాబితా]
* [http://www.mediawiki.org/wiki/Manual:FAQ మీడియావికీపై తరుచుగా అడిగే ప్రశ్నలు]
* [http://lists.wikimedia.org/mailman/listinfo/mediawiki-announce మీడియావికీ సాఫ్టువేరు కొత్త వెర్షను విడుదలల గురించి తెలిపే మెయిలింగు లిస్టు]',

'about'          => 'గురించి',
'article'        => 'వ్యాసము',
'newwindow'      => '(కొత్త విండోలో వస్తుంది)',
'cancel'         => 'రద్దు',
'qbfind'         => 'వెతుకు',
'qbbrowse'       => 'విహరించు',
'qbedit'         => 'మార్చు',
'qbpageoptions'  => 'ఈ పేజీ',
'qbpageinfo'     => 'సందర్భం',
'qbmyoptions'    => 'నా పేజీలు',
'qbspecialpages' => 'ప్రత్యేక పేజీలు',
'moredotdotdot'  => 'ఇంకా...',
'mypage'         => 'నా పేజీ',
'mytalk'         => 'నా గురించి చర్చ',
'anontalk'       => 'ఈ ఐ.పి.కి సంబంధించిన చర్చ',
'navigation'     => 'మార్గదర్శకం',
'and'            => 'మరియు',

# Metadata in edit box
'metadata_help' => 'మెటాడేటా:',

'errorpagetitle'    => 'లోపం',
'returnto'          => 'తిరిగి $1 పేజీకి వెళ్లు.',
'tagline'           => '{{SITENAME}} నుండి',
'help'              => 'సహాయం',
'search'            => 'అన్వేషణ',
'searchbutton'      => 'వెతుకు',
'go'                => 'వెళ్లు',
'searcharticle'     => 'వెళ్లు',
'history'           => 'పేజీ చరిత్ర',
'history_short'     => 'చరిత్ర',
'updatedmarker'     => 'నేను కిందటిసారి వచ్చిన తరువాత జరిగిన మార్పులు',
'info_short'        => 'సమాచారం',
'printableversion'  => 'ముద్రణా సంచిక',
'permalink'         => 'శాశ్వత లింకు',
'print'             => 'ముద్రించు',
'edit'              => 'మార్చు',
'create'            => 'సృష్టించు',
'editthispage'      => 'ఈ పేజీని మార్చు',
'create-this-page'  => 'ఈ పేజీని సృష్టించండి',
'delete'            => 'తుడిచివేయి',
'deletethispage'    => 'ఈ పేజీని తుడిచివేయి',
'undelete_short'    => '{{PLURAL:$1|ఒక్క రచనను|$1 రచనలను}} పునఃస్థాపించు',
'protect'           => 'సంరక్షించు',
'protect_change'    => 'మార్చు',
'protectthispage'   => 'ఈ పేజీని సంరక్షించు',
'unprotect'         => 'సంరక్షించ వద్దు',
'unprotectthispage' => 'ఈ పేజీని సంరక్షించవద్దు',
'newpage'           => 'కొత్త పేజీ',
'talkpage'          => 'ఈ పేజీని చర్చించు',
'talkpagelinktext'  => 'చర్చ',
'specialpage'       => 'ప్రత్యేక పేజీ',
'personaltools'     => 'వ్యక్తిగత పరికరాలు',
'postcomment'       => 'వ్యాఖ్యానము చేయండి',
'articlepage'       => 'వ్యాసము చూడండి',
'talk'              => 'చర్చ',
'views'             => 'పేజీకి సంభందించిన లింకులు',
'toolbox'           => 'పరికరాలపెట్టె',
'userpage'          => 'సభ్యుని పేజీని చూడు',
'projectpage'       => 'ప్రాజెక్టు పేజీని చూడు',
'imagepage'         => 'మీడియా పేజీని చూడండి',
'mediawikipage'     => 'సందేశం పేజీని చూడు',
'templatepage'      => 'మూస పేజీని చూడు',
'viewhelppage'      => 'సహాయం పేజీని చూడు',
'categorypage'      => 'వర్గం పేజీని చూడు',
'viewtalkpage'      => 'చర్చను చూడు',
'otherlanguages'    => 'ఇతర భాషలలొ',
'redirectedfrom'    => '($1 నుండి మళ్ళించబడింది)',
'redirectpagesub'   => 'దారిమార్పు పేజీ',
'lastmodifiedat'    => 'ఈ పేజీకి $2, $1న చివరి మార్పు జరిగినది.', # $1 date, $2 time
'viewcount'         => 'ఈ పేజీ {{PLURAL:$1|ఒక్క సారి|$1 సార్లు}} దర్శించబడింది.',
'protectedpage'     => 'సంరక్షణలోని పేజీ',
'jumpto'            => 'ఇక్కడికి గెంతు:',
'jumptonavigation'  => 'పేజీకి సంబంధించిన లింకులు',
'jumptosearch'      => 'అన్వేషణ',

# All link text and link target definitions of links into project namespace that get used by other message strings, with the exception of user group pages (see grouppage) and the disambiguation template definition (see disambiguations).
'aboutsite'            => '{{SITENAME}} గురించి',
'aboutpage'            => 'Project:గురించి',
'bugreports'           => 'దోషాల నివేదనలు',
'bugreportspage'       => 'Project:దోషాల నివేదనలు',
'copyright'            => 'విషయ సంగ్రహం $1  కి లోబడి లభ్యం.',
'copyrightpagename'    => '{{SITENAME}} ప్రచురణ హక్కు',
'copyrightpage'        => '{{ns:project}}:ప్రచురణ హక్కులు',
'currentevents'        => 'వర్తమాన ఘటనలు',
'currentevents-url'    => 'Project:వర్తమాన ఘటనలు',
'disclaimers'          => 'అస్వీకారములు',
'disclaimerpage'       => 'Project:సాధారణ అస్వీకారము',
'edithelp'             => 'దిద్దుబాటు సహాయం',
'edithelppage'         => 'Help:దిద్దుబాట్లు ఎలా చెయ్యాలి',
'faq'                  => 'తరచూ అడిగే ప్రశ్నలు',
'faqpage'              => 'Project:తరచూ అడిగే ప్రశ్నలు',
'helppage'             => 'Help:సూచిక',
'mainpage'             => 'మొదటి పేజీ',
'mainpage-description' => 'మొదటి పేజీ',
'policy-url'           => 'Project:విధానం',
'portal'               => 'సముదాయ పందిరి',
'portal-url'           => 'Project:సముదాయ పందిరి',
'privacy'              => 'గోప్యతా విధానం',
'privacypage'          => 'Project:గోప్యతా విధానం',

'badaccess'        => 'అనుమతి లోపం',
'badaccess-group0' => 'మీరు చేయతలపెట్టిన పనికి మీకు హక్కులు లేవు.',
'badaccess-group1' => 'మీరు ప్రస్తుతం చేయతలపెట్టిన పని $1 గుంపుకు చెందిన వాడుకరులు మాత్రమే చేయగలరు.',
'badaccess-group2' => 'మీరు ప్రస్తుతం చేయతలపెట్టిన పని $1 గుంపులకు చెందిన వాడుకరులు మాత్రమే చేయగలరు.',
'badaccess-groups' => 'మీరు ప్రస్తుతం చేయతలపెట్టిన పని $1 గుంపులకు చెందిన వాడుకరులు మాత్రమే చేయగలరు.',

'versionrequired'     => 'మీడియావికీ సాఫ్టువేరు వెర్షను $1 కావాలి',
'versionrequiredtext' => 'ఈ పేజీని వాడటానికి మీకు మీడియావికీ సాఫ్టువేరు వెర్షను $1 కావాలి. [[Special:Version|వెర్షను పేజీ]]ని చూడండి.',

'ok'                      => 'సరే',
'retrievedfrom'           => '"$1" నుండి వెలికితీశారు',
'youhavenewmessages'      => 'మీకు $1 ఉన్నాయి ($2).',
'newmessageslink'         => 'కొత్త సందేశాలు',
'newmessagesdifflink'     => 'క్రితం సంచికతో గల తేడాలు',
'youhavenewmessagesmulti' => '$1లో మీకో సందేశం ఉంది',
'editsection'             => 'మార్చు',
'editold'                 => 'మార్చు',
'viewsourceold'           => 'మూలాన్ని చూడండి',
'editsectionhint'         => 'విభాగాన్ని మార్చు: $1',
'toc'                     => 'విషయ సూచిక',
'showtoc'                 => 'చూపించు',
'hidetoc'                 => 'దాచు',
'thisisdeleted'           => '$1ను చూస్తారా, పునఃస్థాపిస్తారా?',
'viewdeleted'             => '$1 చూస్తారా?',
'restorelink'             => '{{PLURAL:$1|ఒక తొలగించిన మార్పు|$1 తొలగించిన మార్పులు}}',
'feedlinks'               => 'ఫీడు:',
'feed-invalid'            => 'మీరు కోరిన ఫీడు సరైన రకం కాదు.',
'feed-unavailable'        => '{{SITENAME}}లో సిండికేషన్ ఫీడులు అందుబాటులో లేవు.',
'site-rss-feed'           => '$1 ఆరెసెస్సు(RSS) ఫీడు',
'site-atom-feed'          => '$1 ఆటం(Atom) ఫీడు',
'page-rss-feed'           => '"$1" ఆరెసెస్సు(RSS) ఫీడు',
'page-atom-feed'          => '"$1" ఆటం(Atom) ఫీడు',
'red-link-title'          => '$1 (ఇంకా రాయలేదు)',

# Short words for each namespace, by default used in the namespace tab in monobook
'nstab-main'      => 'వ్యాసము',
'nstab-user'      => 'సభ్యుని పేజీ',
'nstab-media'     => 'మీడియా పేజీ',
'nstab-special'   => 'ప్రత్యేక',
'nstab-project'   => 'ప్రాజెక్టు పేజీ',
'nstab-image'     => 'ఫైలు',
'nstab-mediawiki' => 'సందేశము',
'nstab-template'  => 'మూస',
'nstab-help'      => 'సహాయము',
'nstab-category'  => 'వర్గము',

# Main script and global functions
'nosuchaction'      => 'అటువంటి కార్యం లేదు',
'nosuchactiontext'  => 'మీరు URLలో పేర్కొన్న కార్యాన్ని
ఈ వికీ గుర్తించలేక పోయింది',
'nosuchspecialpage' => 'అటువంటి ప్రత్యేక పేజీ లేదు',
'nospecialpagetext' => "<big>'''మీరు అడిగిన ప్రత్యేకపేజీ సరైనది కాదు.'''</big>

సరైన ప్రత్యేకపేజీల జాబితా [[Special:SpecialPages|{{int:specialpages}}]] వద్ద ఉంది.",

# General errors
'error'                => 'లోపం',
'databaseerror'        => 'డేటాబేసు లోపం',
'dberrortext'          => 'డేటాబేసుకు పంపిన క్వీరీలో ఒక తప్పు దొర్లింది.
ఇది సాఫ్టువేరులోనే ఉన్న లోపం గావచ్చు.
చివరి సారిగా డేటాబేసుకు పంపిన క్వీరీ ఇది:
<blockquote><tt>$1</tt></blockquote>
దీనిని "<tt>$2</tt>" అనే ఫంక్షను నుండి వచ్చింది.
MySQL ఇచ్చిన లోప-సమాచారం "<tt>$3: $4</tt>".',
'dberrortextcl'        => 'డేటాబేసుకు పంపిన క్వీరీలో ఒక తప్పు దొర్లింది.
చివరి సారిగా డేటాబేసుకు పంపిన క్వీరీ ఇది:
"$1"
దీనిని "$2" అనే ఫంక్షను నుండి వచ్చింది.
MySQL ఇచ్చిన లోప-సమాచారం "$3: $4".',
'noconnect'            => 'క్షమించండి! ఈ వికీ కొన్ని సాంకేతిక ఇబ్బందులను ఎదుర్కొంటుంది, అందువలన డాటాబేసు సర్వరును సంప్రదించలేకపోతున్నాం.<br />
$1',
'nodb'                 => '$1 అనే డేటాబేసును ఎంచుకోలేక పోతున్నాను',
'cachederror'          => 'కింది పీజీ ముందే సేకరించి పెట్టుకున్నది, కాబట్టి తాజా మార్పులు దీనిలో లేకపోవచ్చు.',
'laggedslavemode'      => 'హెచ్చరిక: పేజీలో ఇటీవల జరిగిన మార్పులు ఉండకపోవచ్చు.',
'readonly'             => 'డేటాబేసు లాక్‌చెయ్యబడింది',
'enterlockreason'      => 'డేటాబేసుకు వేయబోతున్న లాకుకు కారణం తెలుపండి, దానితోపాటే ఎంతసమయం తరువాత ఆ లాకు తీసేస్తారో కూడా తెలుపండి',
'readonlytext'         => 'డేటాబేసు ప్రస్తుతం లాకు చేయబడింది. మార్పులు, చేర్పులు ప్రస్తుతం చెయ్యలేరు. మామూలుగా జరిగే నిర్వహణ కొరకు ఇది జరిగి ఉండవచ్చు; అది పూర్తి కాగానే తిరిగి మామూలుగా పనిచేస్తుంది.

దీనిని లాకు చేసిన నిర్వాహకుడు ఇలా తెలియజేస్తున్నాడు: $1',
'missing-article'      => '"$1" $2 అనే పేజీ పాఠ్యం డేటాబేసులో దొరకలేదు.

కాలదోషం పట్టిన తేడా కోసం చూసినపుడుగానీ, తొలగించిన పేజీ చరితం కోసం చూసినపుడుగానీ ఇది సాధారణంగా జరుగుతుంది.

ఒకవేళ అలా కాకపోతే, మీరో బగ్‌ను కనుక్కున్నట్టే.
ఈ URLను సూచిస్తూ, దీన్ని ఓ [[Special:ListUsers/sysop|నిర్వాహకునికి]] తెలియజెయ్యండి.',
'missingarticle-rev'   => '(కూర్పు#: $1)',
'missingarticle-diff'  => '(తేడా: $1, $2)',
'readonly_lag'         => 'అనుచర (స్లేవ్) డేటాబేసు సర్వర్లు, ప్రధాన (మాస్టరు) సర్వరును అందుకునేందుకుగాను, డేటాబేసు ఆటోమాటిక్‌గా లాకు అయింది.',
'internalerror'        => 'అంతర్గత లోపం',
'internalerror_info'   => 'అంతర్గత లోపం: $1',
'filecopyerror'        => 'ఫైలు "$1"ని "$2"కు కాపీ చెయ్యటం కుదరలేదు.',
'filerenameerror'      => 'ఫైలు "$1" పేరును "$2"గా మార్చటం కుదరలేదు.',
'filedeleteerror'      => 'ఫైలు "$1"ని తీసివేయటం కుదరలేదు.',
'directorycreateerror' => '"$1" అనే డైరెక్టరీని సృష్టించలేక పోతున్నాను.',
'filenotfound'         => 'ఫైలు "$1" కనబడలేదు.',
'fileexistserror'      => '"$1" అనే ఫైలు ఉంది, కాని అందులోకి రాయలేకపోతున్నాను',
'unexpected'           => 'అనుకోని విలువ: "$1"="$2".',
'formerror'            => 'లోపం: ఈ ఫారాన్ని పంపించలేకపోతున్నాను',
'badarticleerror'      => 'ఈ పేజీపై ఈ పని చేయడం కుదరదు.',
'cannotdelete'         => 'అడిగిన పేజీ లేదా ఫైలును తీసివేయటం కుదరలేదు. (ఇప్పటికే ఎవరైనా తీసివేసి ఉండవచ్చు)',
'badtitle'             => 'తప్పు శీర్షిక',
'badtitletext'         => 'మీరు కోరిన పేజీ పేరు సరైయినది కాదు, ఖాళీగా ఉంది, లేదా తప్పుగా చేర్చిన అంతర్వికీ లింకు అయ్యుండాలి.  పేజీ పేర్లలో ఉపయోగించకూడని అక్షరాలు వాటిలో ఉన్నట్లున్నాయి.',
'perfdisabled'         => 'క్షమించండి! ఈ అంశంవలన డేటాబేసు బాగా స్లో అయిపోయి, ఎవరూ వికీని వాడుకోలేరు. కాబట్టి, ప్రస్తుతానికి ఈ అంశాన్ని అందుబాటులో లేకుండా చేస్తున్నాం.',
'perfcached'           => 'కింది డేటా ముందే సేకరించి పెట్టుకున్నది. కాబట్టి తాజా డేటాతో పోలిస్తే తేడాలుండవచ్చు.',
'perfcachedts'         => 'కింది సమాచారం ముందే సేకరించి పెట్టుకున్నది. దీన్ని $1న చివరిసారిగా తాజాకరించారు.',
'querypage-no-updates' => 'ప్రస్తుతం ఈ పజీపై మార్పులును అనుమతించటం లేదు. ఇక్కడున్న సమాచారం కూడా రీఫ్రెష్ అవ్వదు.',
'wrong_wfQuery_params' => 'wfQuery()కి తప్పుడు పారామీటర్లు వచ్చాయి<br />
ఫంక్షను: $1<br />
క్వీరీ: $2',
'viewsource'           => 'మూలాన్ని చూపించు',
'viewsourcefor'        => '$1 కొరకు',
'actionthrottled'      => 'కార్యాన్ని ఆపేసారు',
'actionthrottledtext'  => 'స్పామును తగ్గించటానికి తీసుకున్న నిర్ణయాల వల్ల, మీరు ఈ కార్యాన్ని అతి తక్కువ సమయంలో బోలెడన్ని సార్లు చేయకుండా అడ్డుకుంటున్నాము. కొన్ని నిమిషాలు ఆగి మరలా ప్రయత్నించండి.',
'protectedpagetext'    => 'ఈ పేజీపై దిద్దుబాట్లు చెయ్యనివ్వకుండా లాకు చేసాం.',
'viewsourcetext'       => 'మీరీ పేజీ సోర్సును చూడవచ్చు, కాపీ చేసుకోవచ్చు:',
'protectedinterface'   => 'సాఫ్టువేరు ఇంటరుఫేసుకు చెందిన టెక్స్టును ఈ పేజీ అందిస్తుంది. దుశ్చర్యల నివారణ కోసమై దీన్ని లాకు చేసాం.',
'editinginterface'     => 'హెచ్చరిక: సాఫ్టువేరుకు ఇంటరుఫేసు టెక్స్టును అందించే పేజీని మీరు సరిదిద్దుతున్నారు. ఈ పేజీలో చేసే మార్పులు ఇతర వాడుకదార్లకు ఇంటరుఫేసు కనబడే విధానంలో తేడా కలుగజేస్తుంది. అనువాదాల కొరకైతే, [http://translatewiki.net/wiki/Main_Page?setlang=te బేటావికీ]ని, వాడండి.',
'sqlhidden'            => '(SQL క్విరీని చూపించటం లేదు)',
'cascadeprotected'     => 'కింది {{PLURAL:$1|పేజీని|పేజీలను}} కాస్కేడింగు ఆప్షనుతో చేసి సంరక్షించారు. ప్రస్తుత పేజీ, ఈ పేజీల్లో ఇంక్లూడు అయి ఉంది కాబట్టి, దిద్దుబాటు చేసే వీలు లేకుండా ఇది కూడా రక్షణలో ఉంది.
$2',
'namespaceprotected'   => "'''$1''' నేంస్పేసులో మార్పులు చేయటానికి మీకు అనుమతి లేదు.",
'customcssjsprotected' => 'వేరే వాడుకరి వ్యక్తిగత సెట్టింగులు ఉన్నాయి కాబట్టి, ఈ పేజీలో దిద్దుబాటు చేసేందుకు మీకు అనుమతి లేదు.',
'ns-specialprotected'  => 'ప్రత్యేక పేజీలపై దిద్దుబాట్లు చేయలేరు.',
'titleprotected'       => "సభ్యులు [[User:$1|$1]] ఈ పేజీని సృష్టించనివ్వకుండా నిరోదిస్తున్నారు.
అందుకు ఇచ్చిన కారణం: ''$2''.",

# Virus scanner
'virus-badscanner'     => 'తప్పుడు స్వరూపణం: తెలియని వైరస్ స్కానర్: <i>$1</i>',
'virus-scanfailed'     => 'స్కాన్ విఫలమైంది (సంకేతం $1)',
'virus-unknownscanner' => 'అజ్ఞాత యాంటీవైరస్:',

# Login and logout pages
'logouttitle'                => 'సభ్యుని నిష్క్రమణ',
'logouttext'                 => '<strong>ఇప్పుడు మీరు నిష్క్రమించారు.</strong>

మీరు {{SITENAME}}ని అజ్ఞాతంగా వాడుతుండొచ్చు లేదా వేరే పేరుతో గాని ఇదే పేరుతోగాని మళ్ళీ ప్రవేశించవచ్చు.
ఒక గమనిక: బ్రౌజరులోని కోశాన్ని శుభ్రపరిచే వరకు కొన్ని పేజీలు మీరింకా లాగిన్‌ అయి ఉన్నట్లుగానే చూపించవచ్చు.',
'welcomecreation'            => '== స్వాగతం, $1! ==

మీ ఖాతాని సృష్టించాం.
మీ [[Special:Preferences|{{SITENAME}} అభిరుచులను]] మార్చుకోవడం మరువకండి.',
'loginpagetitle'             => 'వాడుకరి ప్రవేశం',
'yourname'                   => 'సభ్యనామము',
'yourpassword'               => 'మీ సంకేతపదం',
'yourpasswordagain'          => 'మళ్లీ సంకేతపదం ఇవ్వండి',
'remembermypassword'         => 'ఈ కంప్యూటరులో నన్ను గుర్తుపెట్టుకో',
'yourdomainname'             => 'మీ డోమైను',
'externaldberror'            => 'బయట ఉన్న డేటాబేసులోకి లాగిన్ అవ్వటంలో లోపం ఉంది లేదా మీరు ఇచ్చిన బయటి ఖాతా నుండి డేటాబేసుపై మార్పులు చేయటాన్ని నిషేదించినట్లున్నారు.',
'loginproblem'               => '<b>మీ లాగిన్‌తో ఏదో ఇబ్బంది ఉంది.</b><br />మళ్ళీ ప్రయత్నించండి!',
'login'                      => 'ప్రవేశించండి',
'nav-login-createaccount'    => 'లోనికి ప్రవేశించండి / ఖాతాని సృష్టించుకోండి',
'loginprompt'                => '{{SITENAME}}లోకి ప్రవేశించాలంటే మీ విహారిణిలో కూకీలు చేతనమై ఉండాలి.',
'userlogin'                  => 'ప్రవేశం / ఖాతా సృష్టింపు',
'logout'                     => 'నిష్క్రమించు',
'userlogout'                 => 'నిష్క్రమించు',
'notloggedin'                => 'లోనికి ప్రవేశించి లేరు',
'nologin'                    => 'ఖాతా లేదా? $1.',
'nologinlink'                => 'ఖాతాని సృష్టించుకోండి',
'createaccount'              => 'ఖాతాని సృష్టించు',
'gotaccount'                 => 'ఇప్పటికే మీకు ఖాతా ఉందా? $1.',
'gotaccountlink'             => 'ప్రవేశించండి',
'createaccountmail'          => 'ఈ-మెయిలు ద్వారా',
'badretype'                  => 'మీరు ఇచ్చిన రెండు సంకేతపదాలు ఒకదానితో మరొకటి సరిపోలడం లేదు.',
'userexists'                 => 'మీరిచ్చిన వాడుకరిపేరు ఇప్పటికే వాడుకలో ఉంది.
వేరే పేరు ఎంచుకోండి.',
'youremail'                  => 'మీ ఈ-మెయిలు*',
'username'                   => 'వాడుకరిపేరు:',
'uid'                        => 'వాడుకరి ID:',
'prefs-memberingroups'       => '{{PLURAL:$1|గుంపు|గుంపుల}} లో సభ్యులు:',
'yourrealname'               => 'అసలు పేరు*',
'yourlanguage'               => 'భాష:',
'yournick'                   => 'ముద్దు పేరు',
'badsig'                     => 'సంతకాన్ని సరిగ్గా ఇవ్వలేదు; HTML ట్యాగులను ఒకసారి పరిశీలించండి.',
'badsiglength'               => 'మీ సంతకం చాలా పెద్దగా ఉంది.
ఇది తప్పనిసరిగా $1 {{PLURAL:$1|అక్షరం|అక్షరాల}} లోపులోనే ఉండాలి.',
'email'                      => 'ఈ-మెయిలు',
'prefs-help-realname'        => 'అసలు పేరు (తప్పనిసరి కాదు), మీ అసలు పేరు ఇస్తేగనక, మీ రచనలన్నీ మీ అసలు పేరుతోనే గుర్తిస్తూ ఉంటారు.',
'loginerror'                 => 'ప్రవేశంలో పొరపాటు',
'prefs-help-email'           => 'ఈ-మెయిలు చిరునామా తప్పనిసరి కాదు, కానీ మీరు మీ సంకేతపదం మర్చిపోతే కొత్త సంకేతపదాన్ని మీకు పంపించడానికి పనికొస్తుంది.
ఈ-మెయిలు ఇస్తే, మీ అస్తిత్వాన్ని బయల్పరచనవసరం లేకుండానే ఇతరులు మీ వాడుకరి లేదా వాడుకరి_చర్చ పేజీల ద్వారా మిమ్మల్ని సంప్రదించవచ్చా అని కూడా మీరు ఎంచుకోవచ్చు.',
'prefs-help-email-required'  => 'ఈ-మెయిలు చిరునామా తప్పనిసరి.',
'nocookiesnew'               => 'ఎకౌంటు సృష్టించాం గానీ, మీరు లాగిన్ కాలేదు. సభ్యులను లాగిన్ చేసేందుకు {{SITENAME}} కూకీలను వాడుతుంది. మీ బ్రౌజరులో కూకీలు అశక్తమై ఉన్నాయి. వాటిని సశక్తం చేసి, మీ కొత్త సభ్యనామం, సంకేతపదాలతో మళ్ళీ లాగిన్ అవండి.',
'nocookieslogin'             => 'సభ్యుల లాగిన్ కొరకు {{SITENAME}} కూకీలను వాడుతుంది. మీ కంప్యూటర్ కూకీలు దాచుకోటానికి సిద్ధంగా లేదు. దానిని సిద్ధంచేసి మళ్ళీ ప్రయత్నించండి.',
'noname'                     => 'మీరు సరైన సభ్యనామం ఇవ్వలేదు.',
'loginsuccesstitle'          => 'ప్రవేశం విజయవంతమైనది',
'loginsuccess'               => "'''మీరు ఇప్పుడు {{SITENAME}}లోనికి \"\$1\"గా ప్రవేశించారు.'''",
'nosuchuser'                 => '"$1" అనే పేరుతో వాడుకరులు లేరు.
పేరు సరిచూసుకోండి, లేదా [[Special:Userlogin/signup|కొత్త ఖాతా సృష్టించుకోండి]].',
'nosuchusershort'            => '"<nowiki>$1</nowiki>" అనే పేరుతో సభ్యులు లేరు. పేరు సరి చూసుకోండి.',
'nouserspecified'            => 'సభ్యనామాన్ని తప్పనిసరిగా ఎంచుకోవాలి.',
'wrongpassword'              => 'ఈ సంకేతపదం సరైనది కాదు. దయచేసి మళ్లీ ప్రయత్నించండి.',
'wrongpasswordempty'         => 'ఖాళీ సంకేతపదం ఇచ్చారు. మళ్ళీ ప్రయత్నించండి.',
'passwordtooshort'           => 'మీ సంకేతపదం తప్పు లేదా మరీ చిన్నగా వుంది.
అది కనీసం {{PLURAL:$1|1 అక్షరం|$1 అక్షరాల}} పొడవు ఉండి మరియు మీ వాడుకరిపేరు కాకుండా ఉండాలి.',
'mailmypassword'             => 'కొత్త సంకేతపదాన్ని ఈ-మెయిల్లో పంపించు',
'passwordremindertitle'      => '{{SITENAME}} కోసం ఒక కొత్త సంకేతపదము వచ్చింది',
'passwordremindertext'       => '{{SITENAME}} ($4) లో కొత్త సంకేతపదం పంపించమని ఎవరో (బహుశ మీరే, ఐ.పీ. చిరునామా $1 నుండి) అడిగారు. వాడుకరి "$2" కొరకు "$3" అనే తాత్కాలిక సంకేతపదం సిద్ధంచేసి ఉంచాం. మీ ఉద్దేశం ఇదే అయితే, ఇప్పుడు మీరు సైటులోనికి ప్రవేశించి కొత్త సంకేతపదాన్ని ఎంచుకోవచ్చు.

ఒకవేళ ఈ అభ్యర్థన మీరుకాక మరెవరో చేసారనుకున్నా లేదా మీ సంకేతపదం మీకు గుర్తుకువచ్చి దాన్ని మార్చుకూడదు అనుకుంటున్నా, ఈ సందేశాన్ని మర్చిపోయి మీ పాత సంకేతపదాన్ని వాడడం కొనసాగించవచ్చు.',
'noemail'                    => 'సభ్యులు "$1"కు ఈ-మెయిలు చిరునామా నమోదయి లేదు.',
'passwordsent'               => '"$1" గారు! మీరు నమోదు చేసుకున్న ఈ-మెయిలు చిరునామాకు ఒక కొత్త సంకేతపదము పంపబడినది.
అది అందిన తర్వాత దయచేసి మరలా లాగిన్‌ అవ్వండి.',
'blocked-mailpassword'       => 'దిద్దుబాట్లు చెయ్యకుండా ఈ ఐపీఅడ్రసును నిరోధించాం. అంచేత, దుశ్చర్యల నివారణ కోసం గాను, మరచిపోయిన సంకేతపదాన్ని పొందే అంశాన్ని అనుమతించము.',
'eauthentsent'               => 'ఇచ్చిన ఈ-మెయిలు అడ్రసుకు ధృవీకరణ మెయిలు వెళ్ళింది.
మరిన్ని మెయిళ్ళు పంపే ముందు, మీరు ఆ మెయిల్లో సూచించినట్లుగా చేసి, ఈ చిరునామా మీదేనని ధృవీకరించండి.',
'throttled-mailpassword'     => 'గడచిన {{PLURAL:$1|ఒక గంటలో|$1 గంటల్లో}} ఇప్పటికే ఒక సంకేతపదపు రిమైండరుని పంపించివున్నాం.
దుశ్చర్యలను నివారించేందుకు గాను, {{PLURAL:$1|ఒక గంటకి|$1 గంటలకి}} ఒక్కసారి మాత్రమే సంకేతపదపు రిమైండరుని పంపిస్తాము.',
'mailerror'                  => 'మెయిలు పంపించడంలో లోపం: $1',
'acct_creation_throttle_hit' => 'క్షమించండి, మీరిప్పటికే $1 అకౌంట్లు సృష్టించారు. ఇహ కుదరదు.',
'emailauthenticated'         => 'మీ ఈ-మెయిలు చిరునామా $1న ధృవీకరింపబడింది.',
'emailnotauthenticated'      => 'మీ ఈ-మెయిలు చిరునామాను ఇంకా ధృవీకరించలేదు. కాబట్టి కింద పేర్కొన్న అంశాలకు ఎటువంటి ఈ-మెయులునూ పంపించము.',
'noemailprefs'               => 'కింది అంశాలు పని చెయ్యటానికి ఈ-మెయిలు చిరునామాను నమొదుచయ్యండి.',
'emailconfirmlink'           => 'మీ ఈ-మెయిలు చిరునామాను ధృవీకరించండి',
'invalidemailaddress'        => 'మీరు ఇచ్చిన ఈ-మెయిలు చిరునామా సరైన రీతిలో లేనందున అంగీకరించటంలేదు.
దయచేసి ఈ-మెయిలు చిరునామాను సరైన రీతిలో ఇవ్వండి లేదా ఖాళీగా వదిలేయండి.',
'accountcreated'             => 'ఖాతాని సృష్టించాం',
'accountcreatedtext'         => '$1 కి వాడుకరి ఖాతాని సృష్టించాం.',
'createaccount-title'        => '{{SITENAME}} కోసం ఖాతా సృష్టి',
'createaccount-text'         => '$4 వద్ద ఉన్న {{SITENAME}}లో మీ ఈమెయిలు చిరునామాను ఇచ్చి ఎవరో ఖాతా సృష్టించారు. ఖాతా పేరు "$2", దాని ప్రస్తుత సంకేతపదం $3.
మీరు సంకేత పదాన్ని మార్చుకోవాలని అనుకుంటే ఇప్పుడు లాగిన్ అవ్వాలి.

ఈ ఖాతా మీకు తెలియకుండా సృష్టిస్తే గనక ఈ సందేశాన్ని పట్టించుకోకండి.',
'loginlanguagelabel'         => 'భాష: $1',

# Password reset dialog
'resetpass'               => 'ఎకౌంటు సంకేతపదాన్ని మార్చండి',
'resetpass_announce'      => 'మీరు తాత్కాలిక ఈమెయిలు కోడుతో లాగిన్ అయి ఉన్నారు. లాగిన్ పూర్తి అయేందుకు, కొత్త సంకేతపదాన్ని ఎంచుకోవాలి:',
'resetpass_header'        => 'సంకేతపదాన్ని మార్చు',
'resetpass_submit'        => 'సంకేతపదాన్ని మార్చి లాగిన్ కండి',
'resetpass_success'       => 'మీ సంకేతపదాన్ని జయప్రదంగా మార్చాం! ఇక మిమ్మల్ని లాగిన్ చేస్తున్నాం...',
'resetpass_bad_temporary' => 'ఈ తాత్కాలిక సంకేతపదం తప్పు. మీ సంకేతపదాన్ని మార్చి ఉండాలి లేదా మరో కొత్త తాత్కాలిక సంకేతపదం కోసం అడిగి ఉండాలి.',
'resetpass_forbidden'     => '{{SITENAME}}లో సంకేతపదాలను మార్చటం కుదరదు',
'resetpass_missing'       => 'ఫారంలో సమాచారం లేదు.',

# Edit page toolbar
'bold_sample'     => 'బొద్దు అక్షరాలు',
'bold_tip'        => 'బొద్దు అక్షరాలు',
'italic_sample'   => 'వంగిన అక్షరాలు',
'italic_tip'      => 'వంగిన అక్షరాలు',
'link_sample'     => 'లింకు పేరు',
'link_tip'        => 'అంతర్గత లింకు',
'extlink_sample'  => 'http://www.example.com లింకు పేరు',
'extlink_tip'     => 'బయటి లింకు (దీనికి ముందు http:// ఇవ్వటం మరువకండి)',
'headline_sample' => 'శీర్షిక పాఠ్యం',
'headline_tip'    => '2వ స్థాయి శీర్షిక',
'math_sample'     => 'సూత్రాన్ని ఇక్కడ ఇవ్వండి',
'math_tip'        => 'గణిత సూత్రం (LaTeX)',
'nowiki_sample'   => 'ఫార్మాటు చేయకూడని పాఠ్యాన్ని ఇక్కడ చేర్చండి',
'nowiki_tip'      => 'వికీ ఫార్మాటును పట్టించుకోవద్దు',
'image_tip'       => 'పొదిగిన ఫైలు',
'media_tip'       => 'ఫైలు లింకు',
'sig_tip'         => 'టైంస్టాంపుతో సహా మీ సంతకం',
'hr_tip'          => 'అడ్డగీత (అరుదుగా వాడండి)',

# Edit pages
'summary'                          => 'సారాంశము',
'subject'                          => 'విషయం/శీర్షిక',
'minoredit'                        => 'ఇది ఒక చిన్న మార్పు',
'watchthis'                        => 'ఈ పేజీ మీద కన్నేసి ఉంచు',
'savearticle'                      => 'పేజీ భధ్రపరచు',
'preview'                          => 'సరిచూడు',
'showpreview'                      => 'సరిచూడు',
'showlivepreview'                  => 'తాజా మునుజూపు',
'showdiff'                         => 'తేడాలు చూపించు',
'anoneditwarning'                  => "'''హెచ్చరిక:''' మీరు లాగిన్ అయిలేరు. ఈ పేజీ దిద్దుబాటు చరిత్రలో మీ ఐ.పి.అడ్రసు నమొదు అవుతుంది.",
'missingsummary'                   => "'''గుర్తు చేస్తున్నాం:''' మీరు దిద్దుబాటు సారాంశమేమీ ఇవ్వలేదు. పేజీని మళ్ళీ భద్రపరచమని చెబితే సారాంశమేమీ లేకుండానే దిద్దుబాటును భద్రపరుస్తాం.",
'missingcommenttext'               => 'కింద ఓ వ్యాఖ్య రాయండి.',
'missingcommentheader'             => "'''గుర్తు చేస్తున్నాం''': ఈ వ్యాఖ్యకు మీరు విషయం/శీర్షిక పెట్టలేదు. పేజీని మళ్ళీ భద్రపరచమని చెబితే, మీ విభాగాన్ని శీర్షికేమీ లేకుండానే భద్రపరుస్తాం.",
'summary-preview'                  => 'మీరు రాసిన సారాంశం',
'subject-preview'                  => 'విషయం/శీర్షిక మునుజూపు',
'blockedtitle'                     => 'సభ్యునిపై నిరోధం అమలయింది',
'blockedtext'                      => '<big>\'\'\'మీ వాడుకరి పేరుని లేదా ఐ.పీ. చిరునామాని నిరోధించారు.\'\'\'</big>

నిరోధించినది $1.
అందుకు ఇచ్చిన కారణం: \'\'$2\'\'

* నిరోధం మొదలైన సమయం: $8
* నిరోధించిన కాలం: $6
* నిరోధానికి గురైనవారు: $7

ఈ నిరోధంపై చర్చించేందుకు $1ను గాని, మరెవరైనా [[{{MediaWiki:Grouppage-sysop}}|నిర్వాహకులను]] గాని సంప్రదించండి.
మీ [[Special:Preferences|ఖాతా అభిరుచులలో]] సరైన ఈ-మెయిలు చిరునామా ఇచ్చివుంటే తప్ప, "ఈ సభ్యునికి ఈ-మెయిలు పంపు" అనే అంశాన్ని వాడుకోలేరని గమనించండి. ఆ అంశాన్ని వాడుకోవడంలో మీపై నిరోధం లేదు.
మీ ప్రస్తుత ఐ.పీ. చిరునామా $3, మరియు నిరోధపు ID $5.
మీ సంప్రదింపులన్నిటిలోనూ వీటిని పేర్కొనండి.',
'autoblockedtext'                  => 'మీ ఐపిఅడ్రసు ఆటోమాటిగ్గా నిరోధించబడింది. ఎందుకంటే ఇదే ఐపీ అడ్రసు నుండి దుశ్చర్యలకు పాల్పడిన ఇంకో వాడుకరిని $1 నిరోధించారు.
దానికి ఇచ్చిన కారణం ఇది:

:\'\'$2\'\'

* నిరోధం మొదలైన సమయం: $8
* నిరోధించిన కాలం: $6

ఈ నిరోధం గురించి చర్చించేందుకు మీరు $1 ను గానీ, లేదా ఇతర [[{{MediaWiki:Grouppage-sysop}}|నిర్వాహకులను]] గానీ సంప్రదించండి.

మీ [[Special:Preferences|అభిరుచులలో]] సరైన ఈమెయిలు ఐడీని ఇచ్చి ఉంటే తప్ప, మీరు "ఈ సభ్యునికి మెయిలు పంపు" అనే అంశాన్ని వాడజాలరని గమనించండి.

మీ నిరోధం ఐడి: $5. మీ సంప్రదింపులన్నిటిలోను ఈ ఐడిని ఉదహరించండి.',
'blockednoreason'                  => 'కారణమేమీ ఇవ్వలేదు',
'blockedoriginalsource'            => "'''$1''' యొక్క మూలాన్ని కింద ఇచ్చాం:",
'blockededitsource'                => "'''$1''' లో '''మీ దిద్దుబాట్ల''' పూర్తి పాఠాన్ని కింద ఇచ్చాం:",
'whitelistedittitle'               => 'మార్పులు చెయ్యడానికి ప్రవేశించివుండాలి',
'whitelistedittext'                => 'పేజీలకి మార్పులు చెయ్యడానికి మీరు $1 అయి ఉండాలి.',
'confirmedittitle'                 => 'మార్పులు చేసేముందు ఈ-మెయిలు చిరునామా ధృవీకరణ తప్పనిసరి',
'confirmedittext'                  => 'పేజీల్లో మార్పులు చేసేముందు మీ ఈ-మెయిలు చిరునామా ధృవీకరించాలి. [[Special:Preferences|మీ అభిరుచుల]]లో మీ ఈ-మెయిలు చిరునామా రాసి, ధృవీకరించండి.',
'nosuchsectiontitle'               => 'అటువంటి విభాగం లేదు',
'nosuchsectiontext'                => 'మీరు సరిదిద్దడానికి ప్రయత్నించిన విభాగం లేదు.  $1 అనే విభాగం లేనందున, మీ దిద్దుబాటుని భద్రపరచడానికి తగిన చోటు లేదు.',
'loginreqtitle'                    => 'లాగిన్‌ ఆవసరము',
'loginreqlink'                     => 'ప్రవేశించండి',
'loginreqpagetext'                 => 'ఇతర పేజీలు చూడడానికి మీరు $1 అయి ఉండాలి.',
'accmailtitle'                     => 'సంకేతపదం పంపించబడింది.',
'accmailtext'                      => '"$1" యొక్క సంకేతపదం $2కు పంపించబడింది.',
'newarticle'                       => '(కొత్తది)',
'newarticletext'                   => "ఈ లింకుకు సంబంధించిన పేజీ ఉనికిలొ లేదు.
కింది పెట్టెలో మీ రచనను టైపు చేసి ఆ పేజీని సృష్టించండి (దీనిపై సమాచారం కొరకు [[{{MediaWiki:Helppage}}|సహాయం]] పేజీ చూడండి). మీరిక్కడికి పొరపాటున వచ్చి ఉంటే, మీ బ్రౌజరు '''back''' మీట నొక్కండి.",
'anontalkpagetext'                 => "----''ఇది ఒక అజ్ఞాత వాడుకరికై చర్చా పేజీ. ఆ వాడుకరి ఇంకా తనకై ఖాతాని సృష్టించుకోలేదు, ఉన్నా దానిని ఉపయోగించడం లేదు.
వారిని గుర్తించడానికి అంకెల ఐ.పీ. చిరునామానే వాడుతాం. ఓ ఐ.పీ. చిరునామాని చాలా మంది వాడుకర్లు వాడే అవకాశం ఉంది.
మీరూ ఓ అజ్ఞాత వాడుకరి అయితే మరియు సంబంధంలేని వ్యాఖ్యలు మిమ్మల్ని ఉద్దేశించినట్టుగా అనిపిస్తే, భవిష్యత్తులో ఇతర అజ్ఞాత వాడుకర్లతో అయోమయం లేకుండా ఉండటానికి, దయచేసి [[Special:UserLogin/signup|ఖాతా సృష్టించుకోండి]] లేదా [[Special:UserLogin|లోనికి ప్రవేశించండి]].''",
'noarticletext'                    => 'ప్రస్తుతం ఈ పేజీ ఖాళీగా ఉంది, మీరు ఈ పేజీ శీర్షిక కోసం వేరే పేజీలలో [[Special:Search/{{PAGENAME}}|వెతకవచ్చు]] లేదా [{{fullurl:{{FULLPAGENAME}}|action=edit}} ఈ పేజీని సృష్టించవచ్చు].',
'userpage-userdoesnotexist'        => '"$1" అనే వాడుకరి ఖాతా నమోదయిలేదు. మీరు ఈ పేజీని సృష్టించ/సరిదిద్దాలనుకుంటే, సరిచూసుకోండి.',
'clearyourcache'                   => "'''గమనిక - భద్రపరచిన తర్వాత, మార్పులను చూడడానికి మీ విహారిణి యొక్క కోశాన్ని తీసేయాల్సిరావచ్చు.''' '''మొజిల్లా/ ఫైర్‌ఫాక్స్‌ / సఫారి:''' ''Shift'' మీటని నొక్కిపట్టి ''రీలోడ్''ని నొక్కండి లేదా ''Ctrl-F5'' అనే మీటల్ని లేదా ''Ctrl-R'' (మాకింటోషులో ''Command-R'') అనే మీటల్ని కలిపి నొక్కండి; '''కాంకరర్: '''''రీలోడ్''ని నొక్కండి లేదా ''F5'' మీటని నొక్కండి; '''ఒపెరా:''' ''Tools → Preferences'' ద్వారా కోశాన్ని శుభ్రపరచండి; '''ఇంటర్నెట్ ఎక్ప్లోరర్:'''''Ctrl'' మీటని నొక్కిపట్టి ''రీఫ్రెష్''ని నొక్కండి లేదా ''Ctrl-F5'' మీటల్ని కలిపి నొక్కండి.",
'usercssjsyoucanpreview'           => "<strong>చిట్కా:</strong> భద్రపరిచేముందు మీ CSS/JSలను పరీక్షించడానికి 'సరిచూడు' అనే బొత్తాన్ని వాడండి.",
'usercsspreview'                   => "'''మీరు వాడుకరి CSSను కేవలం సరిచూస్తున్నారని గుర్తుంచుకోండి.''' 
'''దాన్నింకా భద్రపరచలేదు!'''",
'userjspreview'                    => "'''గుర్తుంచుకోండి, మీరింకా మీ వాడుకరి జావాస్క్రిప్ట్&zwnj;ను భద్రపరచలేదు, కేవలం పరీక్షిస్తున్నారు/సరిచూస్తున్నారు!'''",
'userinvalidcssjstitle'            => "'''హెచ్చరిక:''' \"\$1\" అనే తొడుగు లేదు. .css మరియు .js పేజీల పేర్లు ఇంగ్లీషు లోవరు కేసులోనే ఉండాలన్న సంగతి గుర్తుంచుకోండి. ఉదాహరణకు {{ns:user}}:Foo/monobook.css. అంతేగానీ, {{ns:user}}:Foo/Monobook.css -ఇలా కాదు.",
'updated'                          => '(తాజా అయ్యింది)',
'note'                             => '<strong>గమనిక:</strong>',
'previewnote'                      => '<strong>ఇది మునుజూపు మాత్రమే;
మార్పులని ఇంకా భద్రపరచలేదు!</strong>',
'previewconflict'                  => 'భద్రపరచిన తరువాత పై టెక్స్ట్‌ ఏరియాలోని టెక్స్టు ఇలాగ కనిపిస్తుంది.',
'session_fail_preview'             => '<strong>క్షమించండి! సెషను డేటా పోవడం వలన మీ మార్పులను స్వీకరించలేకపోతున్నాం.
మళ్ళీ ప్రయత్నించండి. అయినా పని జరక్కపోతే, ఓ సారి లాగౌట్ అయి, మళ్ళీ లాగిన్ అయి ప్రయత్నించండి.</strong>',
'session_fail_preview_html'        => "<strong>సారీ! సెషను డేటా పోవడం వలన మీ దిద్దుబాటును ప్రాసెస్ చెయ్యలేలేక పోతున్నాం.</strong>

''{{SITENAME}}లో ముడి HTML సశక్తమై ఉంది కాబట్టి, జావాస్క్రిప్టు దాడుల నుండి రక్షణగా మునుజూపును దాచేశాం.''

<strong>మీరు చేసినది సరైన దిద్దుబాటే అయితే, మళ్ళీ ప్రయత్నించండి. అయినా పనిచెయ్యకపోతే, ఓ సారి లాగౌటయ్యి, మళ్ళీ లాగినయి చూడండి.</strong>",
'token_suffix_mismatch'            => '<strong>మీ క్లయంటు, దిద్దుబాటు టోకెన్‌లోని వ్యాకరణ గుర్తులను గజిబిజి చేసింది కాబట్టి మీ దిద్దుబాటును తిరస్కరించాం. పేజీలోని పాఠ్యాన్ని చెడగొట్టకుండా ఉండేందుకు గాను, ఆ దిద్దుబాటును రద్దు చేశాం. వెబ్‌లో ఉండే లోపభూయిష్టమైన అజ్ఞాత ప్రాక్సీ సర్వీసులను వాడినపుడు ఒక్కోసారి ఇలా జరుగుతుంది.</strong>',
'editing'                          => '$1కి మార్పులు',
'editingsection'                   => '$1కు మార్పులు (విభాగం)',
'editingcomment'                   => '$1 దిద్దుబాటు (వ్యాఖ్య)',
'editconflict'                     => 'దిద్దుబాటు ఘర్షణ: $1',
'explainconflict'                  => "మీరు మార్పులు చెయ్యడం మొదలుపెట్టిన తరువాత, ఇతర సభ్యులు ఈ పేజీలో మార్పులు చేసారు.
పైన ఉన్న టెక్స్ట్ ఏరియాలో ప్రస్తుతపు సంచిక ఉన్నది.
మీరు చేసిన మార్పులు కింద ఉన్న టెక్స్ట్ ఏరియాలో చూపించబడ్డాయి.
మీరు మీ మార్పులను ప్రస్తుతపు సంచికతో విలీనం చెయ్యవలసి ఉంటుంది. మీరు \"పేజీని భద్రపరుచు\"ను నొక్కినపుడు, పైన ఉన్న సంచిక '''మాత్రమే''' భద్రపరచబడుతుంది.",
'yourtext'                         => 'మీ పాఠ్యం',
'storedversion'                    => 'భద్రపరచిన కూర్పు',
'nonunicodebrowser'                => '<strong>WARNING: Your browser is not unicode compliant. A workaround is in place to allow you to safely edit pages: non-ASCII characters will appear in the edit box as hexadecimal codes.</strong>',
'editingold'                       => '<strong>హెచ్చ రిక: ఈ పేజీ యొక్క కాలం చెల్లిన సంచికను మీరు మరుస్తున్నారు. దీనిని భద్రపరిస్తే, ఆ సంచిక తరువాత ఈ పేజీలో జరిగిన మార్పులన్నీ పోతాయి.</strong>',
'yourdiff'                         => 'తేడాలు',
'copyrightwarning'                 => '{{SITENAME}}కు సమర్పించే అన్ని రచనలూ $2కు లోబడి ప్రచురింపబడినట్లుగా భావించబడతాయి (వివరాలకు $1 చూడండి). మీ రచనలను ఎవ్వరూ మార్చ రాదనీ లెదా వేరే ఎవ్వరూ వాడుకో రాదని మీరు భావిస్తే, ఇక్కడ ప్రచురించకండి.<br /> మీ స్వీయ రచనను గాని, సార్వజనీనమైన రచననుగాని, ఇతర ఉచిత వనరుల నుండి సేకరించిన రచననుగాని మాత్రమే ప్రచురిస్తున్నానని కూడా మీరు ప్రమాణం చేస్తున్నారు. <strong>కాపీహక్కులుగల రచనను తగిన అనుమతి లేకుండా సమర్పించకండి!</strong>',
'copyrightwarning2'                => '{{SITENAME}}లో ప్రచురించే రచనలన్నిటినీ ఇతర రచయితలు సరిదిద్దడం, మార్చడం, తొలగించడం చేసే అవకాశం ఉంది. మీ రచనలను అలా నిర్దాక్షిణ్యంగా దిద్దుబాట్లు చెయ్యడం మీకిష్టం లేకపోతే, వాటిని ఇక్కడ ప్రచురించకండి. <br />
ఈ రచనను మీరే చేసారని, లేదా ఏదైనా సార్వజనిక వనరు నుండి కాపీ చేసి తెచ్చారని, లేదా అలాంటి ఉచిత, స్వేచ్ఛా వనరు నుండి తెచ్చారని మాకు వాగ్దానం చేస్తున్నారు. (వివరాలకు $1 చూడండి).
<strong>తగు అనుమతులు లేకుండా కాపీ హక్కులు గల రచనలను సమర్పించకండి!</strong>',
'longpagewarning'                  => '<strong>హెచ్చరిక: ఈ పేజీ సైజు $1  కిలోబైట్లు ఉంది; 32kb కంటే పెద్ద పేజీల తోటి కొన్ని బ్రౌజర్లు ఇబ్బంది పడతాయి. పేజీని చిన్న పేజీలుగా విడగొట్టడానికి అవకాశం ఉందేమో చూడండి. </strong>',
'longpageerror'                    => '<strong>లోపం: మీరు సమర్పించిన టెక్స్టు, గరిష్ఠ పరిమితి అయిన $2 కిలోబైట్లను మించి $1 కిలోబైట్ల పొడవుంది. దీన్ని భద్రపరచలేము.</strong>',
'readonlywarning'                  => '<strong>హెచ్చరిక: నిర్వహణ కొరకు డేటాబేసు లాకు చెయ్యబడింది కాబట్టి, మీ మార్పులు, చేర్పులను ఇప్పుడు భద్రపరచలేరు. మీ మార్పులను ఒక టెక్స్టు ఫైలులోకి కాపీ చేసి, భద్రపరచుకొని, తరువాత సమర్పించండి.</strong>',
'protectedpagewarning'             => '<strong>హెచ్చరిక: ఈ పేజీ సంరక్షించబడినది, నిర్వాహకులు మాత్రమే మార్చగలరు. మీరు *** రక్షిత పేజీ మార్గదర్శకాలను పాటిస్తున్నారని నిర్ధారించుకోండి.</strong>',
'semiprotectedpagewarning'         => "'''గమనిక:''' నమోదయిన సభ్యులు మాత్రమే మార్పులు చెయ్యగలిగేలా ఈ పేజీ లాకు చెయ్యబడింది.",
'cascadeprotectedwarning'          => "'''హెచ్చరిక:''' ఈ పేజీ, కాస్కేడింగు రక్షణలో ఉన్న కింది {{PLURAL:$1|పేజీ|పేజీల్లో}} ఇంక్లూడు అయి ఉంది కాబట్టి, నిర్వాహకులు తప్ప ఇతరులు దిద్దుబాటు చేసే వీలు లేకుండా పేజీని లాకు చేసాం:",
'titleprotectedwarning'            => '<strong>హెచ్చరిక:  కొద్దిమంది వాడుకరులు మాత్రమే సృష్టించగలిగే విధంగా ఈ పేజీకి తాళం వేసారు.</strong>',
'templatesused'                    => 'ఈ పేజీలో వాడిన మూసలు:',
'templatesusedpreview'             => 'ఈ మునుజూపులో వాడిన మూసలు:',
'templatesusedsection'             => 'ఈ విభాగంలో వాడిన మూసలు:',
'template-protected'               => '(సంరక్షితం)',
'template-semiprotected'           => '(సెమీ-రక్షణలో ఉంది)',
'hiddencategories'                 => 'ఈ పేజీ {{PLURAL:$1|ఒక దాచిన వర్గంలో|$1 దాచిన వర్గాల్లో}} ఉంది:',
'nocreatetitle'                    => 'పేజీని సృష్టించడాన్ని నియంత్రించాం.',
'nocreatetext'                     => '{{SITENAME}}లో కొత్త పేజీలు సృష్టించడాన్ని నియంత్రించారు.
మీరు వెనక్కి వెళ్ళి వేరే పేజీలు మార్చవచ్చు, లేదా [[Special:UserLogin|లోనికి ప్రవేశించండి లేదా ఖాతా సృష్టించుకోండి]].',
'nocreate-loggedin'                => '{{SITENAME}}లో కొత్త పేజీలను సృష్టించేందుకు మీకు అనుమతి లేదు.',
'permissionserrors'                => 'అనుమతుల తప్పిదాలు',
'permissionserrorstext'            => 'కింద పేర్కొన్న {{PLURAL:$1|కారణం|కారణాల}} మూలంగా, ఆ పని చెయ్యడానికి మీకు అనుమతిలేదు:',
'permissionserrorstext-withaction' => 'ఈ క్రింది {{PLURAL:$1|కారణం|కారణాల}} వల్ల, మీకు $2 చేయడానికి అనుమతి లేదు:',
'recreate-deleted-warn'            => "'''హెచ్చరిక: ఇంతకు మునుపు ఒకసారి తొలగించిన పేజీని మళ్లీ సృష్టిద్దామని మీరు ప్రయత్నిస్తున్నారు.'''

ఈ పేజీపై మార్పులు చేసేముందు, అవి ఇక్కడ ఉండతగినవేనా కాదా అని ఒకసారి ఆలోచించండి.
మీ సౌలభ్యం కొరకు తొలగింపు లాగ్ ఇక్కడ ఇచ్చారు:",

# Parser/template warnings
'expensive-parserfunction-warning'        => 'గమనిక: ఈ పేజీలో ఉన్న పార్సరు సందేశాలను నిర్వర్తించడానికి చాలా సమయం తీసుకుంటుంది.

$2 కంటే తక్కువ సంఖ్యలో పార్సలు సందేశాలు ఉండాలి, ప్రస్తుతం $1 ఉన్నాయి.',
'expensive-parserfunction-category'       => 'పార్సరు సందేశాలు అధికంగా ఉన్న పేజీలు',
'post-expand-template-inclusion-warning'  => 'హెచ్చరిక: మూస చేర్పు సైజూ చాలా పెద్దదిగా ఉంది.
కొన్ని మూసలను చేర్చము.',
'post-expand-template-inclusion-category' => 'మూస చేర్పు సైజును అధిగమించిన పేజీలు',
'post-expand-template-argument-warning'   => 'హెచ్చరిక: చాల పెద్ద సైజున్న మూస ఆర్గ్యుమెంటు, కనీసం ఒకటి, ఈ పేజీలో ఉంది. 
ఈ ఆర్గ్యుమెంట్లను వదలివేసాం.',
'post-expand-template-argument-category'  => 'తొలగించిన మూస ఆర్గ్యుమెంట్లు ఉన్న పేజీలు',

# "Undo" feature
'undo-success' => 'దిద్దుబాటును రద్దు చెయ్యవచ్చు. కింది పోలికను చూసి, మీరు చెయ్యదలచినది ఇదేనని నిర్ధారించుకోండి. ఆ తరువాత మార్పులను భద్రపరచి దిద్దుబాటు రద్దును పూర్తి చెయ్యండి.',
'undo-failure' => 'మధ్యలో జరిగిన దిద్దుబాట్లతో తలెత్తిన ఘర్షణ కారణంగా ఈ దిద్దుబాటును రద్దు చెయ్యలేక పోయాం.',
'undo-norev'   => 'ఈ దిద్దుబాటును అసలు లేకపోవటం వలన, లేదా తొలగించేయడం వలన రద్దుచేయలేకపోతున్నాం.',
'undo-summary' => '[[Special:Contributions/$2|$2]] ([[User talk:$2|చర్చ]]) దిద్దుబాటు చేసిన కూర్పు $1 ను రద్దు చేసారు',

# Account creation failure
'cantcreateaccounttitle' => 'ఈ ఖాతా తెరవలేము',
'cantcreateaccount-text' => "ఈ ఐపీ అడ్రసు ('''$1''') నుండి ఖాతా సృష్టించడాన్ని [[User:$3|$3]] నిరోధించారు.

$3 చెప్పిన కారణం: ''$2''",

# History pages
'viewpagelogs'        => 'ఈ పేజీకి సంబంధించిన లాగ్‌లను చూడండి',
'nohistory'           => 'ఈ పేజీకి మార్పుల చరిత్ర లేదు.',
'revnotfound'         => 'సంచిక కనబడలేదు',
'revnotfoundtext'     => 'మీరడిగిన పేజీ పాత కూర్పు దొరకలేదు. ఆ పేజీ కోసం మీరు వాడిన URLను సరిచూసుకోండి.',
'currentrev'          => 'ప్రస్తుతపు సంచిక',
'revisionasof'        => '$1 నాటి సంచిక',
'revision-info'       => '$1 నాటి కూర్పు. రచయిత: $2',
'previousrevision'    => '←పాత సంచిక',
'nextrevision'        => 'దీని తరువాతి సంచిక→',
'currentrevisionlink' => 'ప్రస్తుతపు సంచిక',
'cur'                 => 'ప్రస్తుత',
'next'                => 'తరువాయి',
'last'                => 'గత',
'page_first'          => 'మొదటి',
'page_last'           => 'చివరి',
'histlegend'          => 'తేడా ఎంపిక: సంచికల యొక్క రేడియో బాక్సులను ఎంచుకొని ఎంటర్‌ నొక్కండి, లేదా పైన/ కింద ఉన్న మీటను నొక్కండి.<br />
సూచిక: (ప్రస్తుత) = ప్రస్తుత సంచికతో కల తేడాలు, (గత) = ఇంతకు ముందరి సంచికతో గల తేడాలు, చి = చిన్న మార్పు',
'deletedrev'          => '[తొలగించబడినది]',
'histfirst'           => 'తొట్టతొలి',
'histlast'            => 'చిట్టచివరి',
'historysize'         => '({{PLURAL:$1|ఒక బైటు|$1 బైట్లు}})',
'historyempty'        => '(ఖాళీ)',

# Revision feed
'history-feed-title'          => 'కూర్పుల చరిత్ర',
'history-feed-description'    => 'ఈ పేజీకి వికీలో కూర్పుల చరిత్ర',
'history-feed-item-nocomment' => '$2 వద్ద ఉన్న $1', # user at time
'history-feed-empty'          => 'మీరడిగిన పేజీ లేదు.
దాన్ని వికీలోంచి తొలగించి ఉండొచ్చు, లేదా పేరు మార్చి ఉండొచ్చు.
సంబంధిత కొత్త పేజీల కోసం [[Special:Search|వికీలో వెతికి చూడండి]].',

# Revision deletion
'rev-deleted-comment'         => '(వ్యాఖ్యను తొలగించాం)',
'rev-deleted-user'            => '(సభ్యనామాన్ని తొలగించాం)',
'rev-deleted-event'           => '(దినచర్యని తొలగించాం)',
'rev-deleted-text-permission' => '<div class="mw-warning plainlinks">
సార్వజనిక సంగ్రహం నుండి ఈ పేజీ కూర్పును తొలగించాం.
[{{fullurl:Special:Log/delete|page={{FULLPAGENAMEE}}}} తొలగింపు లాగ్]లో వివరాలు ఉండవచ్చు.</div>',
'rev-deleted-text-view'       => '<div class="mw-warning plainlinks">
సార్వజనిక సంగ్రహం నుండి ఈ పేజీ కూర్పును తొలగించాం.
{{SITENAME}} లో నిర్వాహకుడిగా మీరు దాన్ని చూడవచ్చు;
[{{fullurl:Special:Log/delete|page={{FULLPAGENAMEE}}}} తొలగింపు లాగ్]లో వివరాలు ఉండవచ్చు.</div>',
'rev-delundel'                => 'చూపించు/దాచు',
'revisiondelete'              => 'కూర్పులను తొలగించు/తొలగింపును రద్దుచెయ్యి',
'revdelete-nooldid-title'     => 'తప్పుడు లక్ష్యపు కూర్పు',
'revdelete-nooldid-text'      => 'ఈ పని ఏ కూర్పు లేదా కూర్పుల మీద చెయ్యాలో మీరు సూచించలేదు, లేదా మీరు సూచించిన కూర్పు లేదు, లేదా ప్రస్తుత కూర్పునే దాచాలని ప్రయత్నిస్తున్నారు.',
'revdelete-selected'          => '[[:$1]] యొక్క {{PLURAL:$2|ఎంచుకున్న కూర్పు|ఎంచుకున్న కూర్పులు}}:',
'logdelete-selected'          => '{{PLURAL:$1|ఎంచుకున్న చిట్టా ఘటన|ఎంచుకున్న చిట్టా ఘటనలు}}:',
'revdelete-text'              => 'తొలగించిన కూర్పులు, ఘటనలూ చరితం లోనూ, లాగ్‌లలోనూ కనిపిస్తాయి. కానీ వాటిలో కొన్ని భాగాలు సార్వజనికంగా అందుబాటులో ఉండవు.

{{SITENAME}}లోని ఇతర నిర్వాహకులు ఆ దాచిన భాగాలను కూడా చూడగలరు. వాళ్ళు దాన్ని ఇదే పేజీ ద్వారా పునస్థాపించనూ గలరు; మరిన్ని నిబంధనలు పెడితే తప్ప.',
'revdelete-legend'            => 'సందర్శక నిబంధనలు అమర్చు',
'revdelete-hide-text'         => 'కూర్పు పాఠ్యాన్ని దాచు',
'revdelete-hide-name'         => 'చర్యను, లక్ష్యాన్నీ దాచు',
'revdelete-hide-comment'      => 'దిద్దుబాటు వ్యాఖ్యను దాచు',
'revdelete-hide-user'         => 'దిద్దుబాటు చేసినవారి సభ్యనామాన్ని/ఐపీని దాచు',
'revdelete-hide-restricted'   => 'ఈ నిబంధనలను నిర్వాహకులకు వర్తించి ఆపై ఈ ఎంపికకు తాళం వేయి',
'revdelete-suppress'          => 'డేటాను అందరిలాగే నిర్వాహకులకు కూడా కనబడనివ్వకు',
'revdelete-hide-image'        => 'ఫైలులోని విషయాన్ని దాచు',
'revdelete-unsuppress'        => 'పునస్థాపిత కూర్పులపై నిబంధనలను తీసివెయ్యి',
'revdelete-log'               => 'లాగ్ వ్యాఖ్య:',
'revdelete-submit'            => 'ఎంచుకున్న కూర్పుకు అమలు చెయ్యి',
'revdelete-logentry'          => '[[$1]] కూర్పు కనబడే విధానాన్ని మార్చాం',
'logdelete-logentry'          => '[[$1]] ఘటన కనబడే విధానాన్ని మార్చాం',
'revdelete-success'           => "'''కూర్పు కనబడే విధానాన్ని జయప్రదంగా సెట్ చేసాం'''",
'logdelete-success'           => "'''ఘటన కనబడే విధానాన్ని జయప్రదంగా సెట్ చేసాం.'''",
'revdel-restore'              => 'కనిపించే విధానం మార్చు',
'pagehist'                    => 'పేజీ చరిత్ర',
'deletedhist'                 => 'తొలగించిన చరిత్ర',
'revdelete-content'           => 'సమాచారాన్ని',
'revdelete-summary'           => 'మార్పు సంగ్రహం',
'revdelete-uname'             => 'వాడుకరిపేరు',
'revdelete-restricted'        => 'నిర్వాహకులకు ఆంక్షలు విధించాను',
'revdelete-unrestricted'      => 'నిర్వాహకులకున్న ఆంక్షలను ఎత్తేశాను',
'revdelete-hid'               => '$1 చూపించవద్దు',
'revdelete-unhid'             => '$1 చూపించు',
'revdelete-log-message'       => '$2 {{PLURAL:$2|కూర్పు|కూర్పుల}}పై $1',
'logdelete-log-message'       => '$2 {{PLURAL:$2|ఘటన|ఘటనల}}కు $1',

# Suppression log
'suppressionlog'     => 'అణచివేత లాగ్',
'suppressionlogtext' => 'నిర్వాహకులకు కనబడని విషయం కలిగిన తొలగింపులు, నిరోధాల జాబితా ఇది. 
ప్రస్తుతం అమల్లో ఉన్న నిషేధాలు, నిరోధాల జాబితా కోసం [[Special:IPBlockList|ఐపీ నిరోధాల జాబితా]] చూడండి.',

# History merging
'mergehistory'                     => 'పేజీ చరితాలను విలీనం చెయ్యి',
'mergehistory-header'              => 'ఓ పేజీ చరితం లోని కూర్పులను మరో పేజీలోకి విలీనం చెయ్యడానికి ఈ పేజీని వాడండి.
మీరు చెయ్యబోయే మార్పు చరితం క్రమాన్ని పాటిస్తుందని నిర్ధారించుకోండి.',
'mergehistory-box'                 => 'రెండు పేజీల కూర్పులను విలీనం చెయ్యి:',
'mergehistory-from'                => 'మూల పేజీ:',
'mergehistory-into'                => 'లక్ష్యిత పేజీ:',
'mergehistory-list'                => 'విలీనం చెయ్యదగ్గ దిద్దుబాటు చరితం',
'mergehistory-merge'               => '[[:$1]] యొక్క కింది కూర్పులను [[:$2]] తో విలీనం చెయ్యవచ్చు. ఫలానా సమయమూ, దాని కంటే ముందూ తయారైన కూర్పులతో మాత్రమే విలీనం చెయ్యాలనుకుంటే, సంబంధిత రేడియో బటనున్న నిలువు వరుసను వాడండి. నేవిగేషను లింకులను వాడితే ఈ వరుస రీసెట్ అవుతుంది.',
'mergehistory-go'                  => 'విలీనం చెయ్యదగ్గ దిద్దుబాట్లను చూపించు',
'mergehistory-submit'              => 'కూర్పులను విలీనం చెయ్యి',
'mergehistory-empty'               => 'ఏ కూర్పులనూ విలీనం చెయ్యలేము.',
'mergehistory-success'             => '[[:$1]] యొక్క $3 {{PLURAL:$3|కూర్పుని|కూర్పులను}} [[:$2]] లోనికి జయప్రదంగా విలీనం చేసాం.',
'mergehistory-fail'                => 'చరితాన్ని విలీనం చెయ్యలేకపోయాం. పేజీని, సమయాలను సరిచూసుకోండి.',
'mergehistory-no-source'           => 'మూలం పేజీ, $1 లేదు.',
'mergehistory-no-destination'      => 'గమ్యం పేజీ, $1 లేదు.',
'mergehistory-invalid-source'      => 'మూలం పేజీకి సరైన పేరు ఉండాలి.',
'mergehistory-invalid-destination' => 'గమ్యం పేజీకి సరైన పేరు ఉండాలి.',
'mergehistory-autocomment'         => '[[:$1]]ని [[:$2]] లోనికి విలీనం చేసారు',
'mergehistory-comment'             => '[[:$1]]ని [[:$2]] లోనికి విలీనం చేసారు: $3',

# Merge log
'mergelog'           => 'లాగ్‌ను విలీనం చెయ్యి',
'pagemerge-logentry' => '[[$1]] ను [[$2]] లోకి విలీనం చేసాం ($3 కూర్పు దాకా)',
'revertmerge'        => 'విలీనం రద్దు చెయ్యి',
'mergelogpagetext'   => 'ఒక పేజీ చరితాన్ని మరో పేజీ చరితం లోకి ఇటీవల చేసిన విలీనాల జాబితా ఇది.',

# Diffs
'history-title'           => '"$1" కూర్పుల చరితం',
'difference'              => '(సంచికల మధ్య తేడా)',
'lineno'                  => 'లైను $1:',
'compareselectedversions' => 'ఎంచుకున్న సంచికలను పోల్చిచూడు',
'editundo'                => 'దిద్దుబాటు రద్దుచెయ్యి',
'diff-multi'              => '(మధ్యలో ఉన్న {{PLURAL:$1|ఒక కూర్పును|$1 కూర్పులను}} చూపించటం లేదు.)',

# Search results
'searchresults'             => 'అన్వేషణ ఫలితాలు',
'searchresulttext'          => '{{SITENAME}}లో అన్వేషించే విషయమై మరింత సమాచారం కొరకు [[{{MediaWiki:Helppage}}|{{int:help}}]] చూడండి.',
'searchsubtitle'            => "మీరు '''[[:$1]]''' కోసం వెతికారు",
'searchsubtitleinvalid'     => "మీరు '''$1''' కోసం వెతికారు",
'noexactmatch'              => "'''\"\$1\" శీర్షికతొ పేజీలేమీలేవు.''' మీరు ఈ శీర్షికతొ పేజీని [[:\$1|సృష్టించవచ్చు]].",
'noexactmatch-nocreate'     => "'''\"\$1\" అనే పేరుతో పేజీ లేదు.'''",
'toomanymatches'            => 'చాలా పోలికలు వచ్చాయి, దయచేసి మరో ప్రశ్నని ప్రయత్నించండి',
'titlematches'              => 'వ్యాస శీర్షిక సరిపోయింది',
'notitlematches'            => 'పేజీ పేరు సరిపోలడం లేదు',
'textmatches'               => 'పేజిలోని పాఠం సరిపోలింది',
'notextmatches'             => 'పేజీ పాఠ్యమేదీ సరిపోలడం లేదు',
'prevn'                     => 'క్రితం $1',
'nextn'                     => 'తరువాతి $1',
'viewprevnext'              => '($1) ($2) ($3) చూపించు.',
'search-result-size'        => '$1 ({{PLURAL:$2|1 పదం|$2 పదాలు}})',
'search-result-score'       => 'సంబంధం: $1%',
'search-redirect'           => '(దారిమార్పు $1)',
'search-section'            => '(విభాగం $1)',
'search-suggest'            => 'మీరు అంటున్నది ఇదా: $1',
'search-interwiki-caption'  => 'సోదర ప్రాజెక్టులు',
'search-interwiki-default'  => '$1 ఫలితాలు:',
'search-interwiki-more'     => '(మరిన్ని)',
'search-mwsuggest-enabled'  => 'సూచనలతో',
'search-mwsuggest-disabled' => 'సూచనలు వద్దు',
'search-relatedarticle'     => 'సంబంధించినవి',
'mwsuggest-disable'         => 'AJAX సూచనలను అచేతనంచేయి',
'searchrelated'             => 'సంబంధించినవి',
'searchall'                 => 'అన్నీ',
'showingresults'            => "కింద ఉన్న {{PLURAL:$1|'''ఒక్క''' ఫలితం|'''$1''' ఫలితాలు}}, #'''$2''' నుండి మొదలుకొని చూపిస్తున్నాం.",
'showingresultsnum'         => "కింద ఉన్న {{PLURAL:$3|'''ఒక్క''' ఫలితం|'''$3''' ఫలితాలు}}, #'''$2''' నుండి మొదలుకొని చూపిస్తున్నాం.",
'showingresultstotal'       => "{{PLURAL:$3|ఒకే ఒక్క ఫలితాన్ని|'''$3'''లో '''$1 - $2''' ఫలితాలను}} క్రింద చూపిస్తున్నాం",
'nonefound'                 => "'''గమనిక''': డిఫాల్టుగా కొన్ని నేమ్‌స్పేసుల్లో మాత్రమే వెతుకుతాం. చర్చాపేజీలు, మూసలు మొదలైన వాటితో సహా ఆన్ని నేమ్‌స్పేసుల్లోను వెతికేందుకు మీ అన్వేషకానికి ముందు ''all:'' అనే పదం ఉంచండి. లేదా మీరు వెతకదలచిన నేమ్‌స్పేసును ఆదిపదంగా పెట్టండి.",
'powersearch'               => 'నిశితంగా వెతుకు',
'powersearch-legend'        => 'నిశితమైన అన్వేషణ',
'powersearch-ns'            => 'ఈ నేమ్‌స్పేసుల్లో వెతుకు:',
'powersearch-redir'         => 'దారిమార్పులను చూపించు',
'powersearch-field'         => 'దీని కోసం వెతుకు:',
'search-external'           => 'బయటి అన్వేషణ',
'searchdisabled'            => '{{SITENAME}} అన్వేషణ తాత్కాలికంగా పని చెయ్యడం లేదు. ఈలోగా మీరు గూగుల్‌ ఉపయోగించి అన్వేషించవచ్చు. ఒక గమనిక: గూగుల్‌ ద్వారా కాలదోషం పట్టిన ఫలితాలు రావడానికి అవకాశం ఉంది.',

# Preferences page
'preferences'              => 'అభిరుచులు',
'mypreferences'            => 'నా అభిరుచులు',
'prefs-edits'              => 'దిద్దుబాట్ల సంఖ్య:',
'prefsnologin'             => 'లాగిన్‌ అయిలేరు',
'prefsnologintext'         => 'వాడుకరి అభిరుచులను మార్చుకోడానికి, మీరు <span class="plainlinks">[{{fullurl:Special:Userlogin|returnto=$1}} లోనికి ప్రవేశించి]</span> ఉండాలి.',
'prefsreset'               => 'ఇదివరకటి అభిరుచులు పునరుధ్ధరించబడ్డాయి.',
'qbsettings'               => 'క్విక్‌బార్',
'qbsettings-none'          => 'ఏదీకాదు',
'qbsettings-fixedleft'     => 'స్థిర ఎడమ',
'qbsettings-fixedright'    => 'స్థిర కుడి',
'qbsettings-floatingleft'  => 'ఎడమకు ఒదిగి',
'qbsettings-floatingright' => 'కుడికి ఒదిగి',
'changepassword'           => 'సంకేతపదం మార్చండి',
'skin'                     => 'తొడుగు',
'math'                     => 'గణితం',
'dateformat'               => 'తేదీ ఆకృతి',
'datedefault'              => 'ఏదైనా పరవాలేదు',
'datetime'                 => 'తేదీ, సమయం',
'math_failure'             => 'పార్స్ చెయ్యలేకపోయాం',
'math_unknown_error'       => 'గుర్తుతెలియని పొరపాటు',
'math_unknown_function'    => 'తెలియని ఫంక్షన్',
'math_lexing_error'        => 'లెక్సింగ్ లోపం',
'math_syntax_error'        => 'సింటాక్సు లోపం',
'math_image_error'         => 'PNG మార్పిడి విఫలమైంది; latex, dvips, gs లు సరిగా ఇన్‌స్టాలు అయ్యాయో లేదో చూసి, అప్పుడు మార్చండి',
'math_bad_tmpdir'          => 'math తాత్కాలిక డైరెక్టరీని సృష్టించలేకపోడం కానీ, అందులో రాయలేకపోవడంగానీ జరిగింది',
'math_bad_output'          => 'math ఔట్‌పుట్ డైరెక్టరీని సృష్టించలేకపోడం కానీ, అందులో రాయలేకపోవడంగానీ జరిగింది',
'math_notexvc'             => 'texvc ఎక్జిక్యూటబుల్ కనబడడం లేదు; కాన్ఫిగరు చెయ్యడానికి math/README చూడండి.',
'prefs-personal'           => 'సభ్యుని వివరాలు',
'prefs-rc'                 => 'ఇటీవలి మార్పులు, మొలకలు',
'prefs-watchlist'          => 'వీక్షణ జాబితా',
'prefs-watchlist-days'     => 'వీక్షణ జాబితాలో చూపించవలసిన రోజులు:',
'prefs-watchlist-edits'    => 'విస్తృత వీక్షణ జాబితాలో చూపించవలసిన దిద్దుబాట్లు:',
'prefs-misc'               => 'ఇతరాలు',
'saveprefs'                => 'భధ్రపరచు',
'resetprefs'               => 'మునుపటి వలె',
'oldpassword'              => 'పాత సంకేతపదము',
'newpassword'              => 'కొత్త సంకేతపదము',
'retypenew'                => 'సంకేతపదం, మళ్ళీ',
'textboxsize'              => 'మార్పులు',
'rows'                     => 'వరుసలు',
'columns'                  => 'వరుసలు:',
'searchresultshead'        => 'అన్వేషణ',
'resultsperpage'           => 'పేజీకి ఫలితాలు:',
'contextlines'             => 'హిట్టుకు లైన్లు:',
'contextchars'             => 'లైనుకు సందర్భాలు:',
'stub-threshold'           => '<a href="#" class="stub">మొలక లింకు</a> ఫార్మాటింగు కొరకు హద్దు (బైట్లు):',
'recentchangesdays'        => 'ఇటీవలి మార్పులు లో చూపించవలసిన రోజులు:',
'recentchangescount'       => 'ఇటీవలి మార్పులు, చరిత్ర మరియు చిట్టా పేజీలలో చూపించాల్సిన మార్పుల సంఖ్య:',
'savedprefs'               => 'మీ అభిరుచులు భద్రపరచబడ్డయి.',
'timezonelegend'           => 'టైం జోను',
'timezonetext'             => '¹సర్వరు సమయానికి (యు.టీ.సీ.), మీ స్థానిక సమయానికి మధ్య గల తేడా, గంటల్లో.',
'localtime'                => 'స్థానిక సమయం',
'timezoneoffset'           => 'తేడా¹',
'servertime'               => 'సర్వరు సమయం',
'guesstimezone'            => 'తేడాను బ్రౌజరు నుండి తీసుకో',
'allowemail'               => 'ఇతర సభ్యుల నుండి ఈ-మెయిలు రానివ్వు',
'prefs-searchoptions'      => 'అన్వేషణ ఎంపికలు',
'prefs-namespaces'         => 'పేరుబరులు',
'defaultns'                => 'డిఫాల్టుగా ఈ నేంస్పేసులలో అన్వేషించు:',
'default'                  => 'డిఫాల్టు',
'files'                    => 'ఫైళ్ళు',

# User rights
'userrights'                  => 'సభ్యుల హక్కుల మేనేజిమెంటు', # Not used as normal message but as header for the special page itself
'userrights-lookup-user'      => 'సభ్యుల సమూహాలను మేనేజి చెయ్యండి',
'userrights-user-editname'    => 'సభ్యనామాన్ని ఇవ్వండి:',
'editusergroup'               => 'వాడుకరి గుంపులను మార్చు',
'editinguser'                 => "'''[[User:$1|$1]]''' ([[User talk:$1|{{int:talkpagelinktext}}]] | [[Special:Contributions/$1|{{int:contribslink}}]]) అనే పేరుగల సభ్యునికి హక్కులను మారుస్తున్నాము.",
'userrights-editusergroup'    => 'సభ్యుల సమూహాలను మార్చండి',
'saveusergroups'              => 'వాడుకరి గుంపులను భద్రపరచు',
'userrights-groupsmember'     => 'సభ్యులు:',
'userrights-groups-help'      => 'ఈ వాడుకరి ఏయే గుంపులలో ఉండవచ్చో మీరు మార్చవచ్చు.
* టిక్కు పెట్టివుంటే ఆ గుంపులో ఈ వాడుకరి ఉన్నట్టు.
* టిక్కు లేకుంటే ఆ గుంపులో ఈ వాడుకరి లేనట్టు.
* <nowiki>*</nowiki> ఉంటే ఒకసారి ఆ గుంపుని చేర్చాకా మీరు తీసివేయలేరు, లేదా తీసివేసాకా తిరిగి చేర్చలేరు.',
'userrights-reason'           => 'మార్పుకు కారణం:',
'userrights-no-interwiki'     => 'ఇతర వికీలలో వాడుకరి హక్కులను మార్చడానికి మీకు అనుమతి లేదు.',
'userrights-nodatabase'       => '$1 అనే డేటాబేసు లేదు లేదా అది స్థానికం కాదు.',
'userrights-nologin'          => 'వాడుకరి హక్కులను ఇవ్వడానికి మీరు తప్పనిసరిగా ఓ నిర్వాహక ఖాతాతో [[Special:UserLogin|లోనికి ప్రవేశించాలి]].',
'userrights-notallowed'       => 'వాడుకరి హక్కులను మార్చగలిగే అనుమతి మీ ఖాతాకు లేదు.',
'userrights-changeable-col'   => 'మీరు మార్చదగిన గుంపులు',
'userrights-unchangeable-col' => 'మీరు మార్చలేని గుంపులు',

# Groups
'group'               => 'గుంపు:',
'group-user'          => 'వాడుకరులు',
'group-autoconfirmed' => 'ఆటోమాటిగ్గా నిర్థారించబడిన వాడుకరులు',
'group-bot'           => 'బాట్‌లు',
'group-sysop'         => 'నిర్వాహకులు',
'group-bureaucrat'    => 'అధికారులు',
'group-suppress'      => 'పరాకులు',
'group-all'           => '(అందరూ)',

'group-user-member'          => 'వాడుకరి',
'group-autoconfirmed-member' => 'ఆటోమాటిగ్గా నిర్థారించబడిన వాడుకరి',
'group-bot-member'           => 'బాట్',
'group-sysop-member'         => 'నిర్వాహకుడు',
'group-bureaucrat-member'    => 'అధికారి',
'group-suppress-member'      => 'పరాకు',

'grouppage-user'          => '{{ns:project}}:వాడుకరులు',
'grouppage-autoconfirmed' => '{{ns:project}}:ఆటోమాటిగ్గా నిర్థారించబడిన వాడుకరులు',
'grouppage-bot'           => '{{ns:project}}:బాట్లు',
'grouppage-sysop'         => '{{ns:project}}:నిర్వాహకులు',
'grouppage-bureaucrat'    => '{{ns:project}}:అధికార్లు',
'grouppage-suppress'      => '{{ns:project}}:పరాకు',

# Rights
'right-read'                 => 'పేజీలు చదవడం',
'right-edit'                 => 'పేజీలను మార్చడం',
'right-createpage'           => 'పేజీలను సృష్టించడం (చర్చాపేజీలు కానివి)',
'right-createtalk'           => 'చర్చా పేజీలను సృష్టించడం',
'right-createaccount'        => 'కొత్త వాడుకరి ఖాతాలను సృష్టించడం',
'right-minoredit'            => 'మార్పుని చిన్నదిగా గుర్తించడం',
'right-move'                 => 'పేజీలను తరలించడం',
'right-move-subpages'        => 'పేజీలను వాటి ఉపపేజీలతో బాటుగా తరలించడం',
'right-suppressredirect'     => 'పేజీని తరలించేటపుడు పాత పేరు నుండి దారిమార్పును సృష్టించకుండా ఉండటం',
'right-upload'               => 'ఫైళ్ళను ఎగుమతి చేయడం',
'right-reupload'             => 'ఇప్పటికే ఉన్న ఫైలును తిరగరాయి',
'right-reupload-own'         => 'తానే ఇదివరలో అప్‌లోడు చేసిన ఫైలును తిరగరాయి',
'right-reupload-shared'      => 'స్థానికంగా ఉమ్మడి మీడియా సొరుగులోని ఫైళ్ళను అధిక్రమించు',
'right-upload_by_url'        => 'URL అడ్రసునుండి ఫైలును అప్‌లోడు చెయ్యి',
'right-purge'                => 'పేజీకి సంబంధించిన సైటు కాషెను, నిర్ధారణ కోరకుండానే తొలగించు',
'right-autoconfirmed'        => 'అర్ధ సంరక్షణలో ఉన్న పేజీలలో దిద్దుబాటు చెయ్యి',
'right-bot'                  => 'ఆటోమాటిక్ ప్రాసెస్ లాగా భావించబడు',
'right-nominornewtalk'       => 'చర్చా పేజీల్లో జరిగిన అతి చిన్న మార్పులకు కొత్తసందేశము వచ్చిందన్న సూచన చెయ్యవద్దు',
'right-apihighlimits'        => 'API ప్రశ్నల్లో ఉన్నత పరిమితులను వాడు',
'right-writeapi'             => 'రైట్ API వినియోగం',
'right-delete'               => 'పేజీలను తొలగించడం',
'right-bigdelete'            => 'చాలా పెద్ద చరితం ఉన్న పేజీలను తొలగించు',
'right-deleterevision'       => 'పేజీల ప్రత్యేకించిన కూర్పులను తొలగించు, తొలగింపును నివారించు',
'right-deletedhistory'       => 'తొలగింపులను, వాటి పాఠ్యం లేకుండా, చరితంలో చూడు',
'right-browsearchive'        => 'తొలగించిన పేజీలను వెతుకు',
'right-undelete'             => 'పేజీ తొలగింపును రద్దు చెయ్యి',
'right-suppressrevision'     => 'నిర్వాహకులకు కనబడకుండా ఉన్న కూర్పులను సమీక్షించి పౌనస్థాపించు',
'right-suppressionlog'       => 'గోప్యంగా ఉన్న లాగ్‌లను చూడు',
'right-block'                => 'దిద్దుబాటు చెయ్యకుండా ఇతర సభ్యులను నిరోధించు',
'right-blockemail'           => 'ఈమెయిలు పంపకుండా సభ్యుని నిరోధించు',
'right-hideuser'             => 'ప్రజలకు కనబడకుండా చేసి, సభ్యనామాన్ని నిరోధించు',
'right-ipblock-exempt'       => 'ఐపీ నిరోధాలు, ఆటో నిరోధాలు, శ్రేణి నిరోధాలను తప్పించు',
'right-proxyunbannable'      => 'ప్రాక్సీల ఆటోమాటిక్ నిరోధాన్ని తప్పించు',
'right-protect'              => 'సంరక్షణ స్థాయిలను మార్చు, సంరక్షిత పేజీలలో దిద్దుబాటు చెయ్యి',
'right-editprotected'        => 'సంరక్షిత పేజీలలో దిద్దుబటు చెయ్యి (కాస్కేడింగు సంరక్షణ లేనివి)',
'right-editinterface'        => 'యూజరు ఇంటరుఫేసులో దిద్దుబాటు చెయ్యి',
'right-editusercssjs'        => 'ఇతర వాడుకరుల CSS, JS ఫైళ్ళలో దిద్దుబాటు చెయ్యి',
'right-rollback'             => 'ఒకానొక పేజీలో చివరి దిద్దుబాటు చేసిన వాడుకరి చేసిన దిద్దుబాట్లను వెనక్కి తీసుకుపో',
'right-markbotedits'         => 'వెనక్కి తెచ్చిన దిద్దుబాట్లను బాట్ దిద్దుబాట్లుగా గుర్తించు',
'right-noratelimit'          => 'రేటు పరిమితులు ప్రభావం చూపవు',
'right-import'               => 'ఇతర వికీల నుండి పేజీలను దిగుమతి చేసుకో',
'right-importupload'         => 'ఫైలు అప్‌లోడు నుండి పేజీలను దిగుమతి చేసుకో',
'right-patrol'               => 'ఇతరుల దిద్దుబాట్లను నిఘాలో ఉన్నట్లుగా గుర్తించు',
'right-autopatrol'           => 'తానే చేసిన మార్పులను నిఘాలో ఉన్నట్లుగా ఆటోమాటిగా గుర్తించు',
'right-patrolmarks'          => 'ఇటీవలి మార్పుల నిఘా గుర్తింపులను చూడు',
'right-unwatchedpages'       => 'వీక్షణలో లేని పేజీల జాబితాను చూడు',
'right-trackback'            => 'ట్రాక్‌బ్యాక్‌ను సమర్పించు',
'right-mergehistory'         => 'పేజీల యొక్క చరిత్రలని విలీనం చేయగలగడం',
'right-userrights'           => 'వాడుకరులందరి హక్కులను మార్చు',
'right-userrights-interwiki' => 'ఇతర వికీల్లోని వాడుకరుల హక్కులను మార్చు',
'right-siteadmin'            => 'డేటాబేసును లాక్, అన్‌లాక్ చెయ్యి',

# User rights log
'rightslog'      => 'సభ్యుల హక్కుల లాగ్',
'rightslogtext'  => 'ఇది సభ్యుల హక్కులకు చేసిన మార్పుల లాగ్.',
'rightslogentry' => '$1 గారి సభ్యత్వ గుంపును $2 నుండి $3 కి మార్చారు',
'rightsnone'     => '(ఏమీలేవు)',

# Recent changes
'nchanges'                          => '{{PLURAL:$1|ఒక మార్పు|$1 మార్పులు}}',
'recentchanges'                     => 'ఇటీవలి మార్పులు',
'recentchangestext'                 => 'వికీలో ఇటీవలి కాలంలో జరిగిన మార్పులను ఈ పేజీలో చూడండి.',
'recentchanges-feed-description'    => 'ఈ ఫీడు ద్వారా వికీలో జరుగుతున్న మార్పుల గురించి ఎప్పటికప్పుడు సమాచారాన్ని పొందండి.',
'rcnote'                            => "$4 నాడు $5 సమయానికి, గత {{PLURAL:$2|ఒక్క రోజులో|'''$2''' రోజులలో}} చేసిన చివరి {{PLURAL:$1|ఒక్క మార్పు కింద ఉంది|'''$1''' మార్పులు కింద ఉన్నాయి}}.",
'rcnotefrom'                        => '<b>$2</b> నుండి జరిగిన మార్పులు (<b>$1</b> వరకు చూపబడ్డాయి).',
'rclistfrom'                        => '$1 వద్ద మొదలు పెట్టి కొత్త మార్పులు చూపించు',
'rcshowhideminor'                   => 'చిన్న మార్పులను $1',
'rcshowhidebots'                    => 'బాట్లను $1',
'rcshowhideliu'                     => 'ప్రవేశించిన వాడుకరుల మార్పులను $1',
'rcshowhideanons'                   => 'అజ్ఞాత సభ్యులను $1',
'rcshowhidepatr'                    => 'నిఘాలో ఉన్న మార్పులను $1',
'rcshowhidemine'                    => 'నా మార్పులను $1',
'rclinks'                           => 'గత  $2 రోజుల లోని చివరి $1 మార్పులను చూపించు <br />$3',
'diff'                              => 'తేడాలు',
'hist'                              => 'చరిత్ర',
'hide'                              => 'దాచు',
'show'                              => 'చూపించు',
'minoreditletter'                   => 'చి',
'newpageletter'                     => 'కొ',
'boteditletter'                     => 'బా',
'number_of_watching_users_pageview' => '[వీక్షిస్తున్న సభ్యులు: {{PLURAL:$1|ఒక్కరు|$1}}]',
'rc_categories'                     => 'ఈ వర్గాలకు పరిమితం చెయ్యి ("|" తో వేరు చెయ్యండి)',
'rc_categories_any'                 => 'ఏదయినా',
'newsectionsummary'                 => '/* $1 */ కొత్త విభాగం',

# Recent changes linked
'recentchangeslinked'          => 'సంబంధిత మార్పులు',
'recentchangeslinked-title'    => '$1 కు సంబంధించిన మార్పులు',
'recentchangeslinked-noresult' => 'మీరిచ్చిన కాలంలో ఇక్కడికి లింకు ఉన్న పేజీలలో ఎటువంటు మార్పులూ జరగలేదు.',
'recentchangeslinked-summary'  => "దీనికి లింకై ఉన్న పేజీల్లో జరిగిన చివరి మార్పులు ఇక్కడ చూడవచ్చు. మీ వీక్షణ జాబితాలో ఉన్న పేజీలు '''బొద్దు'''గా ఉంటాయి.",
'recentchangeslinked-page'     => 'పేజీ పేరు:',
'recentchangeslinked-to'       => 'ఇచ్చిన పేజీకి లింకయివున్న పేజీలలో జరిగిన మార్పులను చూపించు',

# Upload
'upload'                      => 'ఫైలు అప్‌లోడ్',
'uploadbtn'                   => 'ఫైలు అప్‌లోడు చెయ్యి',
'reupload'                    => 'మళ్ళీ అప్‌లోడు చెయ్యి',
'reuploaddesc'                => 'మళ్ళీ అప్‌లోడు ఫారంకు వెళ్ళు.',
'uploadnologin'               => 'లాగిన్‌ అయిలేరు',
'uploadnologintext'           => 'ఫైలు అప్‌లోడు చెయ్యాలంటే, మీరు [[Special:UserLogin|లాగిన్‌]] కావాలి',
'upload_directory_missing'    => 'ఎగుమతి డైరెక్టరీ ($1) తప్పింది మరియు వెబ్ సర్వర్ దాన్ని సృష్టించలేకున్నది.',
'upload_directory_read_only'  => 'అప్‌లోడు డైరెక్టరీ ($1), వెబ్‌సర్వరు రాసేందుకు అనుకూలంగా లేదు.',
'uploaderror'                 => 'అప్‌లోడు లోపం',
'uploadtext'                  => "ఫైళ్ళను ఎగుమతి చేయడానికి కింది ఫారాన్ని ఉపయోగించండి.
ఇదివరలో ఎగుమతి చేసిన ఫైళ్ళను చూడడానికి లేదా వెతకడానికి [[Special:ImageList|ఎగుమతైన ఫైళ్ళ జాబితా]]కు వెళ్ళండి,
ఎగుమతులు మరియు తొలగింపులు [[Special:Log/upload|ఎగుమతుల చిట్టా]]లో కూడా నమోదవుతాయి.

ఫైలును ఏదైనా పేజీలో చేర్చడానికి, కింద చూపిన వాటిలో ఏదేనీ విధంగా లింకుని వాడండి:
* ఫైలు యొక్క పూర్తి కూర్పుని వాడడానికి '''<tt><nowiki>[[</nowiki>{{ns:image}}<nowiki>:File.jpg]]</nowiki></tt>'''
* ఎడమ వైపు మార్జినులో 200 పిక్సెళ్ళ వెడల్పుగల బొమ్మ  మరియు 'ప్రత్యామ్నాయ పాఠ్యం' అన్న వివరణతో గల పెట్టె కోసం  '''<tt><nowiki>[[</nowiki>{{ns:image}}<nowiki>:File.png|200px|thumb|left|ప్రత్యామ్నాయ పాఠ్యం]]</nowiki></tt>'''
* ఫైలుని చూపించకుండా, నేరుగా ఫైలుకే లింకు ఇవ్వడానికి '''<tt><nowiki>[[</nowiki>{{ns:media}}<nowiki>:File.ogg]]</nowiki></tt>'''",
'upload-permitted'            => 'అనుమతిగల ఫైలు రకాలు: $1.',
'upload-preferred'            => 'అనుమతించే ఫైలు రకాలు: $1.',
'upload-prohibited'           => 'నిషేధించిన ఫైలు రకాలు: $1.',
'uploadlog'                   => 'అప్‌లోడు లాగ్',
'uploadlogpage'               => 'ఎగుమతుల చిట్టా',
'uploadlogpagetext'           => 'ఇటీవల జరిగిన ఫైలు అప్‌లోడుల జాబితా ఇది.',
'filename'                    => 'ఫైలు పేరు',
'filedesc'                    => 'సారాంశం',
'fileuploadsummary'           => 'సారాంశం:',
'filestatus'                  => 'కాపీహక్కు స్థితి:',
'filesource'                  => 'మూలం:',
'uploadedfiles'               => 'ఎగుమతయిన ఫైళ్ళు',
'ignorewarning'               => 'హెచ్చరికను పట్టించుకోకుండా ఫైలును భద్రపరచు',
'ignorewarnings'              => 'హెచ్చరికలను పట్టించుకోవద్దు',
'minlength1'                  => 'పైలు పేర్లు కనీసం ఒక్క అక్షరమైనా ఉండాలి.',
'illegalfilename'             => 'ఫైలు పేరు "$1"లోని కొన్ని అక్షరాలు, పేజీ శీర్షికలలో వాడకూడనివి ఉన్నాయి. ఫైలు పేరు మార్చి, మళ్ళీ అప్‌లోడు చెయ్యడానికి ప్రయత్నించండి.',
'badfilename'                 => 'ఫైలు పేరు "$1"కి మార్చబడినది.',
'filetype-badmime'            => '"$1" MIME రకం ఉన్న ఫైళ్ళను ఎగుమతికి అనుమతించం.',
'filetype-unwanted-type'      => "'''\".\$1\"''' అనేది అవాంఛిత ఫైలు రకం. 
\$2 {{PLURAL:\$3|అనేది వాడదగ్గ ఫైలు రకం|అనేవి వాడదగ్గ ఫైలు రకాలు}}.",
'filetype-banned-type'        => "'''\".\$1\"''' అనే ఫైలు రకాన్ని అనుమతించం.
అనుమతించే {{PLURAL:\$3|ఫైలు రకం ఇదీ|ఫైలు రకాలు ఇవీ}}: \$2.",
'filetype-missing'            => 'ఫైలుకి పొడగింపు (".jpg" లాంటిది) లేదు.',
'large-file'                  => 'ఫైళ్ళు $1 కంటే పెద్దవిగా ఉండకుండా ఉంటే మంచిది; ఈ ఫైలు $2 ఉంది.',
'largefileserver'             => 'ఈ ఫైలు సైజు సర్వరులో విధించిన పరిమితి కంటే ఎక్కువగా ఉంది.',
'emptyfile'                   => 'మీరు అప్‌లోడు చేసిన ఫైలు ఖాళీగా ఉన్నట్లుంది. ఫైలు పేరును ఇవ్వడంలో స్పెల్లింగు తప్పు దొర్లి ఉండొచ్చు. మీరు అప్‌లోడు చెయ్యదలచింది ఇదో కాదో నిర్ధారించుకోండి.',
'fileexists'                  => 'ఈ పేరుతో ఒక ఫైలు ఇప్పటికే ఉంది. దీనిని మీరు మార్చాలో లేదో తెలియకపోతె ఫైలు <strong><tt>$1</tt></strong>ని చూడండి.',
'filepageexists'              => 'ఈ ఫైలు కొరకు వివరణ పేజీని <strong><tt>$1</tt></strong> వద్ద ఈసరికే సృష్టించారు, కానీ ఆ పేరుతో ప్రస్తుతం ఏ ఫైలూ లేదు. మీరు ఇస్తున్న సంగ్రహం ఆ వివరణ పేజీలో కనబడదు. మీ సంగ్రహం అక్కడ కనబడాలంటే, నేరుగా అక్కడే చేర్చాలి.',
'fileexists-extension'        => 'ఇటువంటి పేరుతో మరో ఫైలు ఉంది:<br />
ఎగుమతి చేస్తున్న ఫైలు పేరు: <strong><tt>$1</tt></strong><br />
ప్రస్తుతం ఉన్న ఫైలు పేరు: <strong><tt>$2</tt></strong><br />
దయచేసి మరో పేరు ఎంచుకోండి.',
'fileexists-thumb'            => "<center>'''ప్రస్తుత ఫైలు'''</center>",
'fileexists-thumbnail-yes'    => 'ఈ ఫైలు కుదించిన బొమ్మ లాగా ఉంది <i>(థంబ్‌నెయిలు)</i>. <strong><tt>$1</tt></strong> ఫైలు చూడండి.<br />
గుర్తు పెట్టబడిన ఫైలు అసలు సైజే అది అయితే, మరో థంబ్‌నెయిలును అప్‌లోడు చెయ్యాల్సిన అవసరం లేదు.',
'file-thumbnail-no'           => 'ఫైలు పేరు <strong><tt>$1</tt></strong> తో మొదలవుతోంది. అది సైజు తగ్గించిన <i>(థంబ్నెయిల్)</i> లాగా అనిపిస్తోంది.
ఈ బొమ్మ యొక్క పూర్తి స్పష్టత కూర్పు ఉంటే, దాన్ని అప్లోడు చెయ్యండి. లేదా ఫైలు పేరును మార్చండి.',
'fileexists-forbidden'        => 'ఈ పేరుతో ఇప్పటికే ఒక ఫైలు ఉంది; దీన్ని మరో పేరుతో అప్‌లోడు చెయ్యండి.
[[Image:$1|thumb|center|$1]]',
'fileexists-shared-forbidden' => 'ఈ పేరుతో ఇప్పటికే ఒక ఫైలు అందరి ఫైళ్ళ ఖజానాలో ఉంది; దీన్ని మరో పేరుతో అప్‌లోడు చెయ్యండి.
[[Image:$1|thumb|center|$1]]',
'file-exists-duplicate'       => 'ఈ ఫైలు క్రింద పేర్కొన్న {{PLURAL:$1|ఫైలుకి|ఫైళ్ళకి}} నకలు:',
'successfulupload'            => 'అప్‌లోడు జయప్రదం',
'uploadwarning'               => 'అప్‌లోడు హెచ్చరిక',
'savefile'                    => 'ఫైలు భధ్రపరచు',
'uploadedimage'               => '"[[$1]]" అప్‌లోడు అయింది',
'overwroteimage'              => '"[[$1]]" యొక్క కొత్త కూర్పును అప్‌లోడు చేసాం.',
'uploaddisabled'              => 'క్షమించండి, అప్‌లోడు చెయ్యడం ప్రస్తుతానికి ఆపబడింది',
'uploaddisabledtext'          => '{{SITENAME}} లో ఫైలు అప్‌లోడులను అశక్తం చేసాం.',
'uploadscripted'              => 'ఈ ఫైల్లో HTML కోడు గానీ స్క్రిప్టు కోడు గానీ ఉంది. వెబ్ బ్రౌజరు దాన్ని పొరపాటుగా అనువదించే అవకాశం ఉంది.',
'uploadcorrupt'               => 'ఫైలు చెడిపోయింది లేదా దాని పేరులోని పొడగింపు తప్పు. ఒకసారి సరిచూసి మళ్ళీ ప్రయత్నించండి.',
'uploadvirus'                 => 'ఈ ఫైలులో వైరస్‌ ఉంది! వివరాలు: $1',
'sourcefilename'              => 'మూలం ఫైలుపేరు:',
'destfilename'                => 'ఉద్దేశించిన ఫైలుపేరు:',
'upload-maxfilesize'          => 'గరిష్ట ఫైలు పరిమాణం: $1',
'watchthisupload'             => 'ఈ పేజీని గమనించు',
'filewasdeleted'              => 'ఇదే పేరుతో ఉన్న ఒక ఫైలును గతంలో అప్లోడు చేసారు, తరువాతి కాలంలో దాన్ని తొలగించారు. దాన్నీ మళ్ళీ అప్లోడు చేసే ముందు, మీరు $1 ను చూడాలి',
'upload-wasdeleted'           => "'''హెచ్చరిక: గతంలో తొలగించబడ్డ ఫైలుని మీరు ఎక్కిస్తున్నారు.'''

ఈ ఫైలుని ఎక్కిచడం సరియో కాదో చూసుకోండి.
ఈ సౌలభ్యంకోసం తొలగింపు లాగ్ ఇక్కడ ఇస్తున్నాం:",
'filename-bad-prefix'         => 'మీరు అప్లోడు చేస్తున్న ఫైలు పేరు <strong>"$1"</strong> తో మొదలవుతుంది. ఇది డిజిటల్ కెమెరాలు ఆటోమాటిగ్గా ఇచ్చే పేరు. మరింత వివరంగా ఉండే పేరును ఎంచుకోండి.',

'upload-proto-error'      => 'తప్పు ప్రోటోకోల్',
'upload-proto-error-text' => 'రిమోట్ అప్‌లోడులు చెయ్యాలంటే URLలు <code>http://</code> లేదా <code>ftp://</code> తో మొదలు కావాలి.',
'upload-file-error'       => 'అంతర్గత లోపం',
'upload-file-error-text'  => 'సర్వరులో తాత్కాలిక ఫైలును సృష్టించబోగా ఏదో అంతర్గత లోపం తలెత్తింది. ఎవరైనా సిస్టము నిర్వాహకుని సంప్రదించండి.',
'upload-misc-error'       => 'తెలియని అప్‌లోడు లోపం',
'upload-misc-error-text'  => 'అప్‌లోడు చేస్తూండగా ఏదో తెలియని లోపం తలెత్తింది. URL సరైనదేనని, అది అందుబాటులోనే ఉందని నిర్ధారించుకుని మళ్ళీ ప్రయత్నిందండి. సమస్య అలాగే ఉంటే, సిస్టము నిర్వాహకుని సంప్రదించండి.',

# Some likely curl errors. More could be added from <http://curl.haxx.se/libcurl/c/libcurl-errors.html>
'upload-curl-error6'       => 'URL కు వెళ్ళలేకపోయాం',
'upload-curl-error6-text'  => 'ఇచ్చిన URL కు వెళ్ళలేకపోయాం. URL సరైనదేనని, సైటు పనిచేస్తూనే ఉన్నదనీ నిర్ధారించుకోండి.',
'upload-curl-error28'      => 'అప్లోడు కాలాతీతం',
'upload-curl-error28-text' => 'చాలా సమయం తరువాత కూడా సైటు స్పందించలేదు. సైటు పనిచేస్తూనే ఉందని నిర్ధారించుకుని, కాస్త ఆగి మళ్ళీ ప్రయత్నించండి. రద్దీ కాస్త తక్కువగా ఉన్నపుడు ప్రయత్నిస్తే నయం.',

'license'            => 'లైసెన్సు వివరాలు:',
'nolicense'          => 'దేన్నీ ఎంచుకోలేదు',
'license-nopreview'  => '(మునుజూపు అందుబాటులో లేదు)',
'upload_source_url'  => ' (సార్వజనికంగా అందుబాటులో ఉన్న, సరైన URL)',
'upload_source_file' => ' (మీ కంప్యూటర్లో ఒక ఫైలు)',

# Special:ImageList
'imagelist-summary'     => 'ఈ ప్రత్యేక పేజీ ఇప్పటి వరకూ అప్లోడయిన ఫైళ్లను చూపిస్తుంది.
ఏ క్రమాన్నీ పేర్కొనకపోతే ఇటీవలే అప్లోడయిన ఫైళ్లను ముందుగా చూపిస్తుంది.
నిలువు వరుసలకున్న శీర్షికలపై నొక్కితే క్రమపరిచే విధానం మారుతుంది.',
'imagelist_search_for'  => 'మీడియా పేరుకై వెతుకు:',
'imgfile'               => 'ఫైలు',
'imagelist'             => 'ఫైళ్ళ జాబితా',
'imagelist_date'        => 'తేదీ',
'imagelist_name'        => 'పేరు',
'imagelist_user'        => 'వాడుకరి',
'imagelist_size'        => 'పరిమాణం',
'imagelist_description' => 'వివరణ',

# Image description page
'filehist'                       => 'ఫైలు చరితం',
'filehist-help'                  => 'తేదీ/సమయం ను నొక్కి ఆ సమయాన ఫైలు ఎలా ఉండేదో చూడవచ్చు.',
'filehist-deleteall'             => 'అన్నిటినీ తొలగించు',
'filehist-deleteone'             => 'దీన్ని తొలగించు',
'filehist-revert'                => 'తిరుగుసేత',
'filehist-current'               => 'ప్రస్తుత',
'filehist-datetime'              => 'తేదీ/సమయం',
'filehist-user'                  => 'వాడుకరి',
'filehist-dimensions'            => 'కొలతలు',
'filehist-filesize'              => 'ఫైలు సైజు',
'filehist-comment'               => 'వ్యాఖ్య',
'imagelinks'                     => 'లింకులు',
'linkstoimage'                   => 'కింది {{PLURAL:$1|పేజీ|$1 పేజీల}} నుండి ఈ ఫైలుకి లింకులు ఉన్నాయి:',
'nolinkstoimage'                 => 'ఈ ఫైలుకు లింకున్న పేజీలు లేవు.',
'morelinkstoimage'               => 'ఈ ఫైలుకు ఇంకా [[Special:WhatLinksHere/$1| లింకులను]] చూడు',
'redirectstofile'                => 'క్రింద పేర్కొన్న {{PLURAL:$1|ఫైలు ఈ ఫైలుకి దారిమార్పు చెందుతుంది|$1 ఫైళ్ళు ఈ ఫైలుకి దారిమార్పు చెందుతాయి}}:',
'duplicatesoffile'               => 'క్రింద పేర్కొన్న {{PLURAL:$1|ఫైలు ఈ ఫైలుకి నకలు|$1 ఫైళ్ళు ఈ ఫైలుకి నకళ్ళు}}:',
'sharedupload'                   => 'ఈ ఫైలు ఒక ఉమ్మడి అప్లోడు, దీనిని ఇతర ప్రాజెక్టులలో కూడా ఉపయోగిస్తూ ఉండవచ్చు.',
'shareduploadwiki'               => 'మరింత సమాచారం కొరకు [$1 ఫైలు వివరణ పేజీ] చూడండి.',
'shareduploadwiki-desc'          => 'భాగస్వామ్య ఖజానాలో ఉన్న దీని $1 లోని వివరణని క్రింద చూపించాం.',
'shareduploadwiki-linktext'      => 'ఫైలు వివరణ పేజీ',
'shareduploadduplicate'          => 'భాగస్వామ్య ఖజానాలోని $1 కు ఈ ఫైలు నకలు',
'shareduploadduplicate-linktext' => 'మరొక ఫైలు',
'shareduploadconflict'           => 'భాగస్వామ్య ఖజానాలోని $1 యొక్క పేరే ఈ ఫైలుకూ ఉంది',
'shareduploadconflict-linktext'  => 'మరొక ఫైలు',
'noimage'                        => 'ఆ పేరుతో ఫైలేమీ లేదు, కానీ మీరు $1',
'noimage-linktext'               => 'ఎగుమతి చెయ్యవచ్చు',
'uploadnewversion-linktext'      => 'ఈ ఫైలు కొత్త కూర్పును అప్‌లోడు చెయ్యండి',
'imagepage-searchdupe'           => 'ఫైళ్ల మారుప్రతుల కొరకు వెతుకు',

# File reversion
'filerevert'                => '$1 ను వెనక్కు తీసుకుపో',
'filerevert-legend'         => 'ఫైలును వెనక్కు తీసుకుపో',
'filerevert-intro'          => "మీరు '''[[Media:$1|$1]]''' ను [$3, $2 నాటి $4 కూర్పు]కు తీసుకు వెళ్తున్నారు.",
'filerevert-comment'        => 'వ్యాఖ్య:',
'filerevert-defaultcomment' => '$2, $1 నాటి కూర్పుకు తీసుకువెళ్ళాం',
'filerevert-submit'         => 'వెనక్కు తీసుకువెళ్ళు',
'filerevert-success'        => "'''[[Media:$1|$1]]''' ను  [$3, $2 నాటి $4 కూర్పు]కు తీసుకువెళ్ళాం.",
'filerevert-badversion'     => 'మీరిచ్చిన టైముస్టాంపుతో ఈ ఫైలుకు స్థానిక కూర్పేమీ లేదు.',

# File deletion
'filedelete'                  => '$1ని తొలగించు',
'filedelete-legend'           => 'ఫైలుని తొలగించు',
'filedelete-intro'            => "'''[[Media:$1|$1]]'''ని మీరు తొలగిస్తున్నారు.",
'filedelete-intro-old'        => "మీరు '''[[Media:$1|$1]]''' యొక్క  [$4 $3, $2] నాటి కూర్పును తొలగిస్తున్నారు.",
'filedelete-comment'          => 'వ్యాఖ్య:',
'filedelete-submit'           => 'తొలగించు',
'filedelete-success'          => "'''$1'''ని తొలగించాం.",
'filedelete-success-old'      => '<span class="plainlinks">\'\'\'[[Media:$1|$1]]\'\'\' యొక్క  $3, $2 నాటి కూర్పును తొలగించాం.</span>',
'filedelete-nofile'           => "'''$1''' అనే ఫైలు {{SITENAME}}లో లేదు.",
'filedelete-nofile-old'       => "'''$1''' యొక్క పాత కూర్పుల్లో మీరిచ్చిన పరామితులు కలిగిన కూర్పేమీ లేదు.",
'filedelete-iscurrent'        => 'ఈ ఫైలు యొక్క సరికొత్త కూర్పును తొలగించబోతున్నారు. ముందో పాత కూర్పుకు తీసుకువెళ్ళండి.',
'filedelete-otherreason'      => 'ఇతర/అదనపు కారణం:',
'filedelete-reason-otherlist' => 'ఇతర కారణం',
'filedelete-reason-dropdown'  => '*తొలగింపునకు సాధారణ కారణాలు
** కాపీహక్కుల ఉల్లంఘన
** డూప్లికేట్ ఫైలు',
'filedelete-edit-reasonlist'  => 'తొలగింపు కారణాలని మార్చండి',

# MIME search
'mimesearch'         => 'బొమ్మల మెటాడేటా(MIME)ను వెతకండి',
'mimesearch-summary' => 'ఈ పేజీ MIME-రకాన్ననుసరించి ఫైళ్ళను వడగట్టేందుకు దోహదం చేస్తుంది. Input: contenttype/subtype, ఉదా. <tt>బొమ్మ/jpeg</tt>.',
'mimetype'           => 'MIME రకం:',
'download'           => 'డౌన్‌లోడు',

# Unwatched pages
'unwatchedpages' => 'వీక్షణలో లేని పేజీలు',

# List redirects
'listredirects' => 'దారిమార్పుల జాబితా',

# Unused templates
'unusedtemplates'     => 'వాడని మూసలు',
'unusedtemplatestext' => 'ఏ ఇతర పేజీలోనూ చేరని మూస పేజీలన్నీ ఇక్కడ ఉన్నాయి.మూసలను తొలగించే ముందు వాటికి ఉన్న ఇతర లింకుల కోసం చూడడం గుర్తుంచుకోండి.',
'unusedtemplateswlh'  => 'ఇతర లింకులు',

# Random page
'randompage'         => 'యాధృచ్ఛిక పేజీ',
'randompage-nopages' => 'ఈ నేమ్ స్పేసులో పేజీలు లేవు.',

# Random redirect
'randomredirect'         => 'యాదృచ్చిక దారిమార్పు',
'randomredirect-nopages' => 'ఈ నేమ్ స్పేసులో దారిమార్పులు లేవు.',

# Statistics
'statistics'             => 'గణాంకాలు',
'sitestats'              => '{{SITENAME}} గణాంకాలు',
'userstats'              => 'సభ్యుల గణాంకాలు',
'sitestatstext'          => "డెటాబేసులో ప్రస్తుతం {{PLURAL:\$2|ఒకే ఒక్క వ్యాసం ఉంది|'''\$2''' వ్యాసాలున్నాయి}}.
{{SITENAME}}కు సంబంధించిన పేజీలు, \"చర్చ\" పేజీలు, \"మొలక\" పేజీలు, \"దారిమార్పు\" పేజీలు, మరియు {{SITENAME}}లో వ్యాసాలుగా భావించడానికి వీలుకాని ఇతర పేజీలు కలుపుకొని డేటాబేసులో {{PLURAL:\$1|ఒక్క పేజీనే ఉంది|మొత్తము '''\$1''' సక్రమమైన పేజీలు వున్నాయి}}.

{{PLURAL:\$8|ఒక్క ఫైలు అప్లోడు చేయబడింది|'''\$8''' ఫైళ్ళు అప్‌లోడ్ చేయబడ్డాయి}}.

ఈ {{SITENAME}} ప్రారంభమైనప్పటి నుండి మొత్తం {{PLURAL:\$3|ఒక్క పేజీ దర్శనం|'''\$3''' పేజీ దర్శనలు}}, మరియు {{PLURAL:\$4|ఒక పేజీ మార్పు|'''\$4''' పేజీ మార్పులు}} జరిగాయి.
అంటే, సగటున ప్రతీ పేజీకి '''\$5''' మార్పులు మరియు ప్రతీ మార్పుకి '''\$6''' దర్శనలు.

[http://www.mediawiki.org/wiki/Manual:Job_queue చేయవలసిన పనుల జాబితా] పొడవు '''\$7'''.",
'userstatstext'          => "ప్రస్తుతము {{PLURAL:$1|ఒక వాడుకరి మాత్రమే|'''$1''' మంది సభ్యులు}}, సభ్యునిగా [[Special:ListUsers|నమోదు చేసుకున్నారు]]. వారిలో {{PLURAL:$2|ఒక్క సభునికి|'''$2''' సభ్యులకు}} (లేదా '''$4%''') $5 హక్కులు ఉన్నాయి.",
'statistics-mostpopular' => 'ఎక్కువగా చూసిన పేజీలు',

'disambiguations'      => 'అయోమయ నివృత్తి పేజీలు',
'disambiguationspage'  => 'Template:అయోమయ నివృత్తి',
'disambiguations-text' => "కింది పేజీలు '''అయోమయ నివృత్తి''' పేజీకి లింకవుతున్నాయి. కానీ అవి సంబంధిత పేజీకి నేరుగా లింకు అవాలి. <br /> [[MediaWiki:Disambiguationspage]] నుంది లింకు ఉన్న మూసను వాడే పేజీని అయోమయ నివృత్తి పేజీగా భావిస్తారు.",

'doubleredirects'     => 'జంట దారిమార్పులు',
'doubleredirectstext' => 'ప్రతీ వరుసలోను మొదటి, రెండవ దారిమార్పు లింకులు, రెండో దారిమార్పు పేజీలోని వ్యాసపు మొదటి లైను ఉన్నాయి. మొదటి దారిమార్పు యొక్క అసలైన లక్ష్యం ఈ రెండో దారిమార్పు పేజీయే!',

'brokenredirects'        => 'తెగిపోయిన దారిమార్పులు',
'brokenredirectstext'    => 'కింది దారిమార్పులు లేని పేజీలకు మాళ్ళించుతున్నాయి.',
'brokenredirects-edit'   => '(మార్చు)',
'brokenredirects-delete' => '(తొలగించు)',

'withoutinterwiki'         => 'భాషా లింకులు లేని పేజీలు',
'withoutinterwiki-summary' => 'క్రింది పేజీల నుండి ఇతర భాషా వికీలకు లింకులు లేవు:',
'withoutinterwiki-legend'  => 'ఆదిపదం',
'withoutinterwiki-submit'  => 'చూపించు',

'fewestrevisions' => 'అతి తక్కువ కూర్పులు కలిగిన వ్యాసాలు',

# Miscellaneous special pages
'nbytes'                  => '$1 {{PLURAL:$1|బైటు|బైట్లు}}',
'ncategories'             => '$1 {{PLURAL:$1|వర్గం|వర్గాలు}}',
'nlinks'                  => '$1 {{PLURAL:$1|లింకు|లింకులు}}',
'nmembers'                => '{{PLURAL:$1|ఒక ఉపవర్గం/పేజీ/ఫైలు|$1 ఉపవర్గాలు/పేజీలు/ఫైళ్లు}}',
'nrevisions'              => '{{PLURAL:$1|ఒక సంచిక|$1 సంచికలు}}',
'nviews'                  => '$1 {{PLURAL:$1|దర్శనము|దర్శనలు}}',
'specialpage-empty'       => 'ఈ పేజీ ఖాళీగా ఉంది.',
'lonelypages'             => 'అనాధ పేజీలు',
'lonelypagestext'         => 'కింది పేజీలకు ఈ వికీలోని ఏ ఇతర పేజీ నుండి కూడా లింకులు లేవు.',
'uncategorizedpages'      => 'వర్గీకరించని పేజీలు',
'uncategorizedcategories' => 'వర్గీకరించని వర్గములు',
'uncategorizedimages'     => 'వర్గీకరించని బొమ్మలు',
'uncategorizedtemplates'  => 'వర్గీకరించని మూసలు',
'unusedcategories'        => 'ఉపయోగించని వర్గాలు',
'unusedimages'            => 'ఉపయోగించబడని ఫైళ్ళు',
'popularpages'            => 'ప్రజాదరణ పొందిన పేజీలు',
'wantedcategories'        => 'కోరిన వర్గాలు',
'wantedpages'             => 'కోరిన పేజీలు',
'missingfiles'            => 'తప్పిపోయిన ఫైళ్ళు',
'mostlinked'              => 'అధిక లింకులు చూపే పేజీలు',
'mostlinkedcategories'    => 'అధిక లింకులు చూపే వర్గాలు',
'mostlinkedtemplates'     => 'ఎక్కువగా ఉపయోగించిన మూసలు',
'mostcategories'          => 'అధిక వర్గాలలో చేరిన వ్యాసాలు',
'mostimages'              => 'అధిక లింకులు గల బొమ్మలు',
'mostrevisions'           => 'అధిక సంచికలు గల వ్యాసాలు',
'prefixindex'             => 'ఆదిపదం సూచిక',
'shortpages'              => 'చిన్న పేజీలు',
'longpages'               => 'పొడవు పేజీలు',
'deadendpages'            => 'అగాధ (డెడ్ఎండ్) పేజీలు',
'deadendpagestext'        => 'కింది పేజీల నుండి ఈ వికీ లోని ఏ ఇతర పేజీకీ లింకులు లేవు.',
'protectedpages'          => 'సంరక్షిత పేజీలు',
'protectedpages-indef'    => 'అనంత సంరక్షణ మాత్రమే',
'protectedpagestext'      => 'కింది పేజీలను తరలించకుండా, దిద్దుబాటు చెయ్యకుండా సంరక్షించాము',
'protectedpagesempty'     => 'ఈ పరామితులతో ప్రస్తుతం ఏ పేజీలు కూడా సంరక్షించబడి లేవు.',
'protectedtitles'         => 'సంరక్షిత శీర్షికలు',
'protectedtitlestext'     => 'కింది శీర్షికలతో పేజీలు సృష్టించకుండా సంరక్షించబడ్డాయి',
'protectedtitlesempty'    => 'ఈ పరామితులతో ప్రస్తుతం శీర్షికలేమీ సరక్షించబడి లేవు.',
'listusers'               => 'వాడుకరుల జాబితా',
'newpages'                => 'కొత్త పేజీలు',
'newpages-username'       => 'సభ్యనామం:',
'ancientpages'            => 'పాత పేజీలు',
'move'                    => 'తరలించు',
'movethispage'            => 'ఈ పేజీని తరలించు',
'unusedimagestext'        => 'ఇతర వెబ్ సైట్లు సూటి URL ద్వారా ఇక్కడి ఫైళ్ళకు లింకు ఇవ్వవచ్చు. క్రియాశీలంగా వాడుకలో ఉన్నప్పటికీ అటువంటివి ఈ జాబితాలో చేరి ఉండవచ్చునని గమనించండి.',
'unusedcategoriestext'    => 'కింది వర్గాలకు పేజీలైతే ఉన్నాయి గానీ, వీటిని వ్యాసాలు గానీ, ఇతర వర్గాలు గానీ ఉపయోగించడం లేదు.',
'notargettitle'           => 'గమ్యం లేదు',
'notargettext'            => 'ఈ పని ఏ పేజీ లేదా సభ్యునిపై జరగాలనే గమ్యాన్ని మీరు సూచించలేదు.',
'nopagetitle'             => 'అలాంటి పేజీ లేదు',
'nopagetext'              => 'మీరు అడిగిన పేజీ లేదు',
'pager-newer-n'           => '{{PLURAL:$1|1 కొత్తది|$1 కొత్తవి}}',
'pager-older-n'           => '{{PLURAL:$1|1 పాతది|$1 పాతవి}}',
'suppress'                => 'పరాకు',

# Book sources
'booksources'               => 'పుస్తక మూలాలు',
'booksources-search-legend' => 'పుస్తక మూలాల కోసం వెతుకు',
'booksources-go'            => 'వెళ్ళు',
'booksources-text'          => 'కొత్త, పాత పుస్తకాలు అమ్మే ఇతర సైట్లకు లింకులు కింద ఇచ్చాం. మీరు వెతికే పుస్తకాలకు సంబంధించిన మరింత సమాచారం కూడా అక్కడ దొరకొచ్చు:',

# Special:Log
'specialloguserlabel'  => 'వాడుకరి:',
'speciallogtitlelabel' => 'పేరు:',
'log'                  => 'చిట్టాలు',
'all-logs-page'        => 'అన్ని లాగ్‌లు',
'log-search-legend'    => 'లాగ్‌ల కొరకు వెతుకు',
'log-search-submit'    => 'వెళ్ళు',
'alllogstext'          => 'అప్‌లోడు, తొలగింపు, సంరక్షణ, నిరోధం, నిర్వహణల లాగ్ ఇది. ప్రత్యేకించి ఒక లాగ్ రకాన్ని గానీ, ఓ సభ్యుని పేరు గానీ, ఓ పేజీని గాని ఎంచుకుని సంబంధిత లాగ్‌ను మాత్రమే చూడవచ్చు కూడా.',
'logempty'             => 'దినచర్యలో సరిపోలిన అంశాలు లేవు.',
'log-title-wildcard'   => 'ఈ పాఠ్యంతో మొదలయ్యే పుస్తకాల కొరకు వెతుకు',

# Special:AllPages
'allpages'          => 'అన్ని పేజీలు',
'alphaindexline'    => '$1 నుండి $2',
'nextpage'          => 'తరువాతి పేజీ ($1)',
'prevpage'          => 'మునుపటి పేజీ ($1)',
'allpagesfrom'      => 'ఇక్కడ మొదలు పెట్టి పేజీలు చూపించు:',
'allarticles'       => 'అన్ని వ్యాసములు',
'allinnamespace'    => 'అన్ని పేజీలు ($1 namespace)',
'allnotinnamespace' => 'అన్ని పేజీలు ($1 నేంస్పేస్ లేనివి)',
'allpagesprev'      => 'పూర్వపు',
'allpagesnext'      => 'తర్వాతి',
'allpagessubmit'    => 'వెళ్లు',
'allpagesprefix'    => 'ఈ ఆదిపదం కలిగిన పేజీలను చూపించు:',
'allpagesbadtitle'  => 'మీరిచ్చిన పేజీ పేరు సరైనది కాకపోయి ఉండాలి లేదా దానికి భాషాంతర లేదా అంతర్వికీ ఆదిపదమైనా ఉండి ఉండాలి. పేర్లలో వాడకూడని కారెక్టర్లు ఆ పేరులో ఉండి ఉండవచ్చు.',
'allpages-bad-ns'   => '{{SITENAME}} లో "$1" అనే నేమ్&zwnj;స్పేస్ లేదు.',

# Special:Categories
'categories'                    => 'వర్గాలు',
'categoriespagetext'            => 'ఈ క్రింది వర్గాలు పేజీలను లేదా మాధ్యమాలను కలిగివున్నాయి.
[[Special:UnusedCategories|వాడుకలో లేని వర్గాలని]] ఇక్కడ చూపించలేదు.
[[Special:WantedCategories|కోరుతున్న వర్గాలను]] కూడా చూడండి.',
'categoriesfrom'                => 'ఇక్కడనుండి మొదలుకొని వర్గాలు చూపించు:',
'special-categories-sort-count' => 'సంఖ్యల ప్రకారం క్రమపరచు',
'special-categories-sort-abc'   => 'అకారాది క్రమంలో అమర్చు',

# Special:ListUsers
'listusersfrom'      => 'ఇక్కడ మొదలుపెట్టి సభ్యులను చూపించు:',
'listusers-submit'   => 'చూపించు',
'listusers-noresult' => 'వాడుకరి దొరకలేదు.',

# Special:ListGroupRights
'listgrouprights'          => 'వాడుకరి గుంపుల హక్కులు',
'listgrouprights-summary'  => 'కింది జాబితాలో ఈ వికీలో నిర్వచించిన వాడుకరి గుంపులు, వాటికి సంబంధించిన హక్కులు ఉన్నాయి. 
విడివిడిగా హక్కులకు సంబంధించిన మరింత సమాచారం [[{{MediaWiki:Listgrouprights-helppage}}]] వద్ద లభించవచ్చు.',
'listgrouprights-group'    => 'గుంపు',
'listgrouprights-rights'   => 'హక్కులు',
'listgrouprights-helppage' => 'Help:గుంపు హక్కులు',
'listgrouprights-members'  => '(సభ్యుల జాబితా)',

# E-mail user
'mailnologin'     => 'పంపించవలసిన చిరునామా లేదు',
'mailnologintext' => 'ఇతరులకు ఈ-మెయిలు పంపించాలంటే, మీరు [[Special:UserLogin|లాగిన్‌]] అయి ఉండాలి, మరియు మీ [[Special:Preferences|అభిరుచుల]]లో సరైన ఈ-మెయిలు చిరునామా ఇచ్చి ఉండాలి.',
'emailuser'       => 'ఈ సభ్యునికి ఈ-మెయిలు పంపు',
'emailpage'       => 'సభ్యునికి ఈ-మెయిలు పంపు',
'emailpagetext'   => 'ఈ వాడుకరి తన అభిరుచులలో సరైన ఈ-మెయిలు చిరునామా ఇచ్చి ఉంటే, కింది ఫారం మీ సందేశాన్ని పంపిస్తుంది. [[Special:Preferences|మీ వాడుకరి అభిరుచుల]]లో మీరిచ్చిన ఈ-మెయిలు చిరునామా "నుండి" ఆ సందేశం వచ్చినట్లుగా ఉంటుంది, కనుక వేగుని అందుకునేవారు నేరుగా మీకు జవాబివ్వగలుగుతారు.',
'usermailererror' => 'మెయిలు ఆబ్జెక్టు ఈ లోపాన్ని చూపింది:',
'defemailsubject' => '{{SITENAME}} ఈ-మెయిలు',
'noemailtitle'    => 'ఈ-మెయిలు చిరునామా లేదు',
'noemailtext'     => 'ఈ వాడుకరి సరైన ఈ-మెయిలు చిరునామా ఇవ్వలేదు, లేదా ఇతరుల నుండి ఈ-మెయిల్లను అందుకోవడానికి సుముఖంగా లేరు.',
'emailfrom'       => 'ఎవరు:',
'emailto'         => 'ఎవరికి:',
'emailsubject'    => 'విషయం:',
'emailmessage'    => 'సందేశం:',
'emailsend'       => 'పంపించు',
'emailccme'       => 'సందేశపు ఒక ప్రతిని నాకు ఈమెయిలు పంపు.',
'emailccsubject'  => '$1 కు మీరు పంపిన సందేశపు ప్రతి: $2',
'emailsent'       => 'ఈ-మెయిలు పంపించాం',
'emailsenttext'   => 'మీ ఈ-మెయిలు సందేశం పంపబడింది.',
'emailuserfooter' => 'ఈ ఈ-మెయిలుని $2 కి {{SITENAME}} లోని "వాడుకరికి ఈమెయిలు" అనే సౌలభ్యం ద్వారా $1 పంపించారు.',

# Watchlist
'watchlist'            => 'నా వీక్షణ జాబితా',
'mywatchlist'          => 'నా వీక్షణ జాబితా',
'watchlistfor'         => "('''$1''' కొరకు)",
'nowatchlist'          => 'మీ వీక్షణ జాబితా ఖాళీగా ఉంది.',
'watchlistanontext'    => 'మీ వీక్షణ జాబితా లోని అంశాలను చూసేందుకు, మార్చేందుకు $1 చెయ్యండి.',
'watchnologin'         => 'లాగిన్‌ అయిలేరు',
'watchnologintext'     => 'మీ వీక్షణ జాబితాను మార్చడానికి మీరు [[Special:UserLogin|లాగిన్‌]] అయి ఉండాలి.',
'addedwatch'           => 'వీక్షణ జాబితాలో చేరింది',
'addedwatchtext'       => "\"<nowiki>\$1</nowiki>\" పేజీ మీ [[Special:Watchlist|వీక్షణ జాబితా]]కు చేరింది. ఇకముందు ఈ పేజీలోను, దీని చర్చా పేజీలోను జరిగే మార్పుచేర్పులన్నీ అక్కడ చేరతాయి. సులభంగా గుర్తించడానికై [[Special:RecentChanges|ఇటీవలి మార్పుల జాబితా]]లో ఈ పేజీ పేరు '''బొద్దుగా''' కనపడుతుంది.

వీక్షణ జాబితా నుండి ఈ పేజీ తొలగించాలంటే, \"వీక్షించ వద్దు\"ను నొక్కండి.",
'removedwatch'         => 'వీక్షణ జాబితా నుండి తొలగించబడినది',
'removedwatchtext'     => '"[[:$1]]" పేజీ మీ వీక్షణ జాబితా నుండి తొలగించబడినది.',
'watch'                => 'వీక్షించు',
'watchthispage'        => 'ఈ పేజీ మీద కన్నేసి ఉంచు',
'unwatch'              => 'వీక్షించ వద్దు',
'unwatchthispage'      => 'వీక్షణను ఆపు',
'notanarticle'         => 'వ్యాసం పేజీ కాదు',
'notvisiblerev'        => 'ఈ కూర్పును తొలగించాం',
'watchnochange'        => 'మీ వీక్షణ జాబితాలోని ఏ పేజీలోనూ ఈ కాల అవధిలో మార్పులు జరగలేదు.',
'watchlist-details'    => 'మీ వీక్షణ జాబితాలో {{PLURAL:$1|ఒక పేజీ ఉంది|$1 పేజీలు ఉన్నాయి}}, చర్చా పేజీలని వదిలేసి.',
'wlheader-enotif'      => '* ఈ-మెయిలు ప్రకటనలు పంపబడతాయి.',
'wlheader-showupdated' => "* మీ గత సందర్శన తరువాత మారిన పేజీలు '''బొద్దు'''గా చూపించబడ్డాయి.",
'watchmethod-recent'   => 'వీక్షణ జాబితాలోని పేజీల కొరకు ఇటీవలి మార్పులు పరిశీలించబడుతున్నాయి',
'watchmethod-list'     => 'ఇటీవలి మార్పుల కొరకు వీక్షణ జాబితాలోని పేజీలు పరిశీలించబడుతున్నాయి',
'watchlistcontains'    => 'మీ వీక్షణ జాబితాలో {{PLURAL:$1|ఒక పేజీ ఉంది|$1 పేజీలు ఉన్నాయి}}.',
'iteminvalidname'      => "'$1' తో ఇబ్బంది, సరైన పేరు కాదు...",
'wlnote'               => "గత {{PLURAL:$2|గంట సేపటిలో|'''$2''' గంటలలో}} జరిగిన చివరి {{PLURAL:$1|ఒక్క మార్పూ కింద ఉంది|'''$1''' మార్పులూ కింద ఉన్నాయి}}.",
'wlshowlast'           => 'గత $1 గంటలు $2 రోజులు $3 చూపించు',
'watchlist-show-bots'  => 'బాట్ దిద్దుబాట్లను చూపించు',
'watchlist-hide-bots'  => 'బాట్ దిద్దుబాట్లను దాచు',
'watchlist-show-own'   => 'నా దిద్దుబాట్లను చూపించు',
'watchlist-hide-own'   => 'నా దిద్దుబాట్లను దాచు',
'watchlist-show-minor' => 'చిన్న దిద్దుబాట్లను చూపించు',
'watchlist-hide-minor' => 'చిన్న మార్పులను దాచు',

# Displayed when you click the "watch" button and it is in the process of watching
'watching'   => 'గమనిస్తున్నాం...',
'unwatching' => 'వీక్షణ్ నుండీ తొలగిస్తున్నా...',

'enotif_mailer'                => '{{SITENAME}} ప్రకటన మెయిలు పంపునది',
'enotif_reset'                 => 'అన్ని పేజీలను చూసినట్లుగా గుర్తించు',
'enotif_newpagetext'           => 'ఇది ఒక కొత్త పేజీ.',
'enotif_impersonal_salutation' => '{{SITENAME}} వాడుకరి',
'changed'                      => 'మార్చబడింది',
'created'                      => 'సృష్టించబడింది',
'enotif_subject'               => '{{SITENAME}} పేజీ $PAGETITLE ను $PAGEEDITOR, $CHANGEDORCREATED',
'enotif_lastvisited'           => 'మీ గత సందర్శన తరువాత జరిగిన మార్పుల కొరకు $1 చూడండి.',
'enotif_lastdiff'              => 'ఈ మార్పు చూసేందుకు  $1 కు వెళ్ళండి.',
'enotif_anon_editor'           => 'అజ్ఞాత వాడుకరి $1',
'enotif_body'                  => 'ప్రియమైన $WATCHINGUSERNAME,


{{SITENAME}} పేజీ, $PAGETITLE ని $PAGEEDITDATE తేదీన $PAGEEDITOR గారు $CHANGEDORCREATED. ప్రస్తుత కూర్పు కొరకు $PAGETITLE_URL చూడండి.

$NEWPAGE

రచయిత సారాంశం: $PAGESUMMARY $PAGEMINOREDIT

రచయితను సంప్రదించండి:
మెయిలు: $PAGEEDITOR_EMAIL
వికీ: $PAGEEDITOR_WIKI

మీరు ఈ పేజీకి వెళ్తే తప్ప ఇక ముందు ఈ పేజీకి జరిగే మార్పుల గురించిన వార్తలు మీకు పంపించం. మీ వీక్షణ జాబితాలోని పేజీలకు ఉన్న వార్తాహరి జండాను రీసెట్ చేసుకోవచ్చు.

             మీ {{SITENAME}} వార్తాహర వ్యవస్థ

--
మీ వీక్షణ జాబితా సెట్టింగులను మార్చేందుకు చూడండి:
{{fullurl:{{ns:special}}:Watchlist/edit}}

మీ అభిప్రయాలు చెప్పేందుకు, మరింత సహాయానికై:
{{fullurl:{{MediaWiki:helppage}}}}',

# Delete/protect/revert
'deletepage'                  => 'పేజీని తుడిచివేయి',
'confirm'                     => 'ధృవీకరించు',
'excontent'                   => "ఇదివరకు విషయ సంగ్రహం: '$1'",
'excontentauthor'             => "ఇదివరకు విషయ సంగ్రహం: '$1' (మరియు దీని ఒకేఒక్క రచయిత '$2')",
'exbeforeblank'               => "ఖాళీ చెయ్యకముందు పేజీలో ఉన్న విషయ సంగ్రహం: '$1'",
'exblank'                     => 'పేజీ ఖాళీగా ఉంది',
'delete-confirm'              => '"$1"ని తొలగించు',
'delete-legend'               => 'తొలగించు',
'historywarning'              => 'హెచ్చరిక: మీరు తొలగించబోయే పేజీకి చరిత్ర ఉంది:',
'confirmdeletetext'           => 'మీరో పేజీనో, బొమ్మనో దాని చరిత్రతోపాటుగా శాశ్వతంగా డేటాబేసు నుండి తీసెయ్యబోతున్నారు. మీరు చెయ్యదలచింది ఇదేననీ, దీని పర్యవసానాలు మీకు తెలుసనీ, దీన్ని [[{{MediaWiki:Policy-url}}|నిభందనల]] ప్రకారమే చేస్తున్నారనీ నిర్ధారించుకోండి.',
'actioncomplete'              => 'పని పూర్తయింది',
'deletedtext'                 => '"<nowiki>$1</nowiki>" తుడిచివేయబడింది. ఇటీవలి తుడిచివేతలకు సంబంధించిన నివేదిక కొరకు $2 చూడండి.',
'deletedarticle'              => '"$1" తుడిచివేయబడినది',
'suppressedarticle'           => '"[[$1]]" ను అణచి ఉంచాం',
'dellogpage'                  => 'తొలగింపుల చిట్టా',
'dellogpagetext'              => 'ఇది ఇటీవలి తుడిచివేతల జాబితా.',
'deletionlog'                 => 'తొలగింపుల చిట్టా',
'reverted'                    => 'పాత కూర్పుకు తీసుకువెళ్ళాం.',
'deletecomment'               => 'తుడిచివేతకు కారణము',
'deleteotherreason'           => 'ఇతర/అదనపు కారణం:',
'deletereasonotherlist'       => 'ఇతర కారణాలు',
'deletereason-dropdown'       => '* మామూలు తొలగింపు కారణాలు
** కొత్త సభ్యుని ప్రయోగం
** చెత్తరాతలతో వికీపేజీలను సృష్టించే ప్రయత్నం
** కాపీహక్కు ఉల్లంఘన
** వికీపీడియా నిర్వాహణ కొరకు
** ఇప్పటికే తొలగించిన కృతి నుండీ సృష్టించిన కృతి
** రచయిత కోరికపై
** చర్చాపేజీకి వ్యాసం పేజీ లేదు
** అనవసరపు ప్రకటనలు
** ఇతరులను నొప్పించడానికి సృష్టించిన పేజీ
* వ్యాసాలు
** వ్యాసంలోని సమాచారానికి వ్యాసం పేరుకు ఎటువంటి సంబందం లేదు
** ఎటువంటి సమాచారం లేదు
* ఇతర మామూలు కారణాలు
** ఖాళీ మరియూ వర్గీకరించని వర్గం
** సభ్యుని కోరికపై, సభ్యుని ఉపపేజీ తొలగింపు
** ఏ సభ్యునికీ చెందని సభ్యపేజీ
** లేని వ్యాసానికి దారిమార్పు',
'delete-edit-reasonlist'      => 'తొలగింపు కారణాలని మార్చండి',
'delete-toobig'               => 'ఈ పేజీకి $1 {{PLURAL:$1|కూర్పుకు|కూర్పులకు}} మించిన, చాలా పెద్ద దిద్దుబాటు చరితం ఉంది. {{SITENAME}}కు అడ్డంకులు కలగడాన్ని నివారించేందుకు గాను, అలాంటి పెద్ద పేజీల తొలగింపును నియంత్రించాం.',
'delete-warning-toobig'       => 'ఈ పేజీకి $1 {{PLURAL:$1|కూర్పుకు|కూర్పులకు}} మించిన, చాలా పెద్ద దిద్దుబాటు చరితం ఉంది. దాన్ని తొలగిస్తే {{SITENAME}}కి చెందిన డేటాబేసు కార్యాలకు ఆటంకం కలగొచ్చు; అప్రమత్తతో ముందుకుసాగండి.',
'rollback'                    => 'దిద్దుబాట్లను వెనక్కుతిప్పు',
'rollback_short'              => 'వెనక్కుతిప్పు',
'rollbacklink'                => 'రద్దుచేయి',
'rollbackfailed'              => 'రోల్‌బ్యాక్ విఫలమైంది',
'cantrollback'                => 'రచనను వెనక్కి తీసుకువెళ్ళలేము; ఈ పేజీకి ఇదొక్కటే రచన.',
'alreadyrolled'               => '[[$1]]లో [[User:$2|$2]] ([[User talk:$2|చర్చ]]) చేసిన చివరి మార్పును రోల్‌బాక్ చెయ్యలేము;
మరెవరో ఆ పేజీని రోల్‌బాక్ చేసారు, లేదా మార్చారు.

చివరి మార్పులు చేసినవారు: [[User:$3|$3]] ([[User talk:$3|చర్చ]]).',
'editcomment'                 => 'దిద్దుబాటు వ్యాఖ్య: "<i>$1</i>".', # only shown if there is an edit comment
'revertpage'                  => '[[Special:Contributions/$2|$2]] ([[User talk:$2|చర్చ]]) చేసిన మార్పులను [[User:$1|$1]] యొక్క చివరి కూర్పు వరకు తిప్పికొట్టారు.', # Additional available: $3: revid of the revision reverted to, $4: timestamp of the revision reverted to, $5: revid of the revision reverted from, $6: timestamp of the revision reverted from
'rollback-success'            => '$1 చేసిన దిద్దుబాట్లను వెనక్కు తీసుకెళ్ళాం; తిరిగి $2 చేసిన చివరి కూర్పుకు మార్చాం.',
'sessionfailure'              => 'మీ లాగిన్ సెషనుతో ఏదో సమస్య ఉన్నట్లుంది;
సెషను హైజాకు కాకుండా ఈ చర్యను రద్దు చేసాం.
"back" కొట్టి, ఎక్కడి నుండి వచ్చారో ఆ పేజీని మళ్ళీ లోడు చేసి, మళ్ళీ ప్రయత్నించండి.',
'protectlogpage'              => 'సంరక్షణల చిట్టా',
'protectlogtext'              => 'పేజీ సంరక్షణ గురించిన వివరాల జాబితా క్రింద వున్నది.',
'protectedarticle'            => '"[[$1]]" సంరక్షించబడింది.',
'modifiedarticleprotection'   => '"[[$1]]" సరక్షణ స్థాయిని మార్చాం',
'unprotectedarticle'          => '"[[$1]]" ను సంరక్షణ నుండి తీసేసాం',
'protect-title'               => '"$1" కు సంరక్షణ స్థాయిని సెట్ చేస్తున్నాం',
'protect-legend'              => 'సంరక్షణను నిర్ధారించు',
'protectcomment'              => 'సంరక్షించడానికి కారణం',
'protectexpiry'               => 'గడువు:',
'protect_expiry_invalid'      => 'గడువు సమయాన్ని సరిగ్గా ఇవ్వలేదు.',
'protect_expiry_old'          => 'మీరిచ్చిన గడువు ప్రస్తుత సమయం కంటే ముందు ఉంది.',
'protect-unchain'             => 'తరలింపు హక్కులపై రక్షణను తీసేయి',
'protect-text'                => 'ఈ పెజీ <strong><nowiki>$1</nowiki></strong> ఎంత సంరక్షణలొ వుందో మీరు ఇక్కడ చూడవచ్చు, మార్చవచ్చు.',
'protect-locked-blocked'      => 'నిరోధించబడి ఉండగా మీరు సంరక్షణ స్థాయిని మార్చలేరు. ప్రస్తుతం <strong>$1</strong> పేజీకి ఉన్న సెట్టింగులివి:',
'protect-locked-dblock'       => 'ప్రస్తుతం అమల్లో ఉన్న డేటాబేసు లాకు కారణంగా సంరక్షణ స్థాయిని సెట్ చెయ్యడం కుదరదు. ప్రస్తుతం <strong>$1</strong> పేజీకి ఉన్న సెట్టింగులివి:',
'protect-locked-access'       => 'మీ ఖాతకు పేజీ రక్షన స్థాయిని మార్చే హక్కులు లేవు.
<strong>$1</strong> అనే పేరున్న ఈ పేజీకి ప్రస్తుతం ఈ రక్షణ ఉంది:',
'protect-cascadeon'           => 'ఈ పేజీ కాస్కేడింగు రక్షణలో ఉన్న ఈ కింది {{PLURAL:$1|పేజీకి|పేజీలకు}} జతచేయటం వలన, ప్రస్తుతం రక్షణలో ఉంది.  మీరు ఈ పేజీ యొక్క రక్షణ స్థాయిన మార్చవచ్చు, దాని వలన కాస్కేడింగు రక్షణకు ఎటువంటి సమస్య ఉండదు.',
'protect-default'             => '(డీఫాల్టు)',
'protect-fallback'            => '"$1" అనుమతి అవసరం',
'protect-level-autoconfirmed' => 'అజ్ఞాత సభ్యులను నిరోధించు',
'protect-level-sysop'         => 'నిర్వాహకులు మాత్రమే',
'protect-summary-cascade'     => 'కాస్కేడింగు',
'protect-expiring'            => '$1 (UTC)న కాలంచెల్లుతుంది',
'protect-cascade'             => 'ఈ పేజీకి జతపరిచిన పేజీలను కూడా రక్షించు (కాస్కేడింగు రక్షణ)',
'protect-cantedit'            => 'ఈ పేజీ యొక్క సంరక్షణా స్థాయిని మీరు మార్చలేరు, ఎందుకంటే దాన్ని మార్చే అనుమతి మీకు లేదు.',
'restriction-type'            => 'అనుమతి:',
'restriction-level'           => 'నిరోధ స్థాయి:',
'minimum-size'                => 'కనీస పరిమాణం',
'maximum-size'                => 'గరిష్ఠ పరిమాణం',
'pagesize'                    => '(బైట్లు)',

# Restrictions (nouns)
'restriction-edit'   => 'మార్చు',
'restriction-move'   => 'తరలించు',
'restriction-create' => 'సృష్టించు',
'restriction-upload' => 'అప్‌లోడు చెయ్యి',

# Restriction levels
'restriction-level-sysop'         => 'పూర్తి సంరక్షణ',
'restriction-level-autoconfirmed' => 'అర్థ సంరక్షణ',
'restriction-level-all'           => 'ఏ స్థాయి అయినా',

# Undelete
'undelete'                     => 'తుడిచివేయబడ్డ పేజీలను చూపించు',
'undeletepage'                 => 'తుడిచివేయబడిన పేజీలను చూపించు, పునఃస్థాపించు',
'undeletepagetitle'            => "'''క్రింద చూపిస్తున్నవి [[:$1]] యొక్క తొలగించిన మార్పులు'''.",
'viewdeletedpage'              => 'తొలగించిన పేజీలను చూడండి',
'undeletepagetext'             => 'కీంది పేజీలు తుడిచివేయబడినవి, కానీ పునఃస్థాపనకు వీలుగా సంగ్రహంలో ఉన్నాయి. సంగ్రహం నిర్ణీత వ్యవధులలో పూర్తిగా ఖాళీ చేయబడుతుంటుంది.',
'undelete-fieldset-title'      => 'కూర్పులను పునఃస్థాపించండి',
'undeleteextrahelp'            => "పేజీ మొత్తాన్ని పునస్థాపించేందుకు, చెక్ బాక్సులన్నిటినీ ఖాళీగా ఉంచి, '''''పునస్థాపించు''''' నొక్కండి. కొన్ని కూర్పులను మాత్రమే పుసస్థాపించ దలిస్తే, సదరు కూర్పులకు ఎదురుగా ఉన్న చెక్ బాక్సులలో టిక్కు పెట్టి, '''''పునస్థాపించు''''' నొక్కండి. '''''మునుపటి వలె''''' ను నొక్కినపుడు, చెక్ బాక్సులను, వ్యాఖ్య పెట్టెను ఖాళీ చేసిపెడుతుంది.",
'undeleterevisions'            => '$1 {{PLURAL:$1|కూర్పును|కూర్పులను}} భాండారానికి చేర్చాం',
'undeletehistory'              => 'పేజీని పునఃస్థాపిస్తే, అన్ని సంచికలూ పేజీచరిత్ర దినచర్యలోకి పునఃస్థాపించబడతాయి.
తుడిచివేయబడిన తరువాత, అదే పేరుతో వేరే పేజీ సృష్టించబడి ఉంటే, పునఃస్థాపించిన సంచికలు ముందరి చరిత్రలోకి వెళ్తాయి.
అంతే కాదు పేజీ పైన ఇంతకు ముందు ఉన్న రక్షణలన్నీ పోతాయాని గమనించండి.',
'undeleterevdel'               => 'తొలగింపును రద్దు చేస్తున్నప్పుడు, అన్నిటికంటే పైనున్న కూర్పు పాక్షికంగా తొలగింపబడే పక్షంలో తొలగింపు-రద్దు జరగదు. అటువంటి సందర్భాల్లో, తొలగించిన కూర్పులలో కొత్తవాటిని ఎంచుకోకుండా ఉండాలి, లేదా దాపు నుండి తీసెయ్యాలి.',
'undeletehistorynoadmin'       => 'ఈ వ్యాసం తుడిచివేయబడినది. తుడిచివేయడానికి కారణము, పేజీలో మార్పులు చేసిన సభ్యులతో సహా కింద సారాంశంలో చూపబడింది. తుడిచివేయబడిన సంచికలలోని విషయ సంగ్రహం నిర్వాహకులకు మాత్రమే అందుబాటులో ఉంది.',
'undelete-revision'            => '$1 యొక్క తొలగించబడిన కూర్పు ($2 నాటిది). చివరి దిద్దుబాటు చేసినది - $3:',
'undeleterevision-missing'     => 'తప్పుడు లేదా తప్పిపోయిన కూర్పు. మీరు నొక్కింది తప్పుడు లింకు కావచ్చు, లేదా భాండాగారం నుండి కూర్పు పునఃస్థాపించబడి లేదా తొలగించబడి ఉండవచ్చు.',
'undelete-nodiff'              => 'గత కూర్పులేమీ లేవు.',
'undeletebtn'                  => 'పునఃస్థాపించు',
'undeletelink'                 => 'పునస్థాపించు',
'undeletereset'                => 'మునుపటి వలె',
'undeletecomment'              => 'వ్యాఖ్య:',
'undeletedarticle'             => '"[[$1]]" పునఃస్థాపన జరిగింది',
'undeletedrevisions'           => '{{PLURAL:$1|ఒక సంచిక|$1 సంచికల}} పునఃస్థాపన జరిగింది',
'undeletedrevisions-files'     => '{{PLURAL:$1|ఒక కూర్పు|$1 కూర్పులు}} మరియు {{PLURAL:$2|ఒక ఫైలు|$2 ఫైళ్ళ}}ను పునస్థాపించాం',
'undeletedfiles'               => '{{PLURAL:$1|ఒక ఫైలును|$1 ఫైళ్లను}} పునఃస్థాపించాం',
'cannotundelete'               => 'తొలగింపు రద్దు విఫలమైంది; ఆ పేజీ తొలగింపును వేరెవరైనా రద్దు చేసి ఉండవచ్చు.',
'undeletedpage'                => "<big>'''$1 ను పునస్థాపించాం'''</big>

ఇటీవల జరిగిన తొలగింపులు, పునస్థాపనల కొరకు [[Special:Log/delete|తొలగింపు లాగ్]] చూడండి.",
'undelete-header'              => 'ఇటీవల తొలగించిన పేజీల కొరకు [[Special:Log/delete|తొలగింపు లాగ్]] చూడండి.',
'undelete-search-box'          => 'తొలగించిన పేజీలను వెతుకు',
'undelete-search-prefix'       => 'దీనితో మొదలయ్యే పేజీలు చూపించు:',
'undelete-search-submit'       => 'వెతుకు',
'undelete-no-results'          => 'తొలగింపు సంగ్రహాల్లో దీనిని పోలిన పేజీలు లేవు.',
'undelete-filename-mismatch'   => '$1 టైమ్‌స్టాంపు కలిగిన ఫైలుకూర్పు తొలగింపును రద్దు చెయ్యలేకపోయాం: ఫైలుపేరు సరిపోలలేదు',
'undelete-bad-store-key'       => '$1 టైమ్‌స్టాంపు కలిగిన ఫైలు తొలగింపును రద్దు చెయ్యలేకున్నాం: తొలగింపుకు ముందే ఫైలు కనబడటం లేదు.',
'undelete-cleanup-error'       => 'వాడని భాండారం ఫైలు "$1" తొలగింపును రద్దు చెయ్యడంలో లోపం దొర్లింది.',
'undelete-missing-filearchive' => 'ID $1 కలిగిన భాండారం ఫైలు డేటాబేసులో లేకపోవడం చేత దాన్ని పునస్థాపించలేకున్నాం. దాని తొలగింపును ఇప్పటికే రద్దుపరచి ఉండవచ్చు.',
'undelete-error-short'         => 'ఫైలు $1 తొలగింపును రద్దు పరచడంలో లోపం దొర్లింది',
'undelete-error-long'          => 'ఫైలు $1 తొలగింపును రద్దు పరచడంలో లోపాలు దొర్లాయి',

# Namespace form on various pages
'namespace'      => 'నేంస్పేసు:',
'invert'         => 'ఎంపికను తిరగవెయ్యి',
'blanknamespace' => '(మొదటి)',

# Contributions
'contributions' => 'సభ్యుని రచనలు',
'mycontris'     => 'నా మార్పులు-చేర్పులు',
'contribsub2'   => '$1 ($2) కొరకు',
'nocontribs'    => 'ఈ విధమైన మార్పులేమీ దొరకలేదు.',
'uctop'         => '(పైది)',
'month'         => 'ఈ నెల నుండి (దాని ముందువి కూడా):',
'year'          => 'ఈ సంవత్సరం నుండి (దాని ముందువి కూడా):',

'sp-contributions-newbies'     => 'కొత్త సభ్యులు చేసిన రచనలు మాత్రమే చూపించు',
'sp-contributions-newbies-sub' => 'కొత్తవారి కోసం',
'sp-contributions-blocklog'    => 'నిరోధాల చిట్టా',
'sp-contributions-search'      => 'రచనల కోసం అన్వేషణ',
'sp-contributions-username'    => 'ఐ.పి.అడ్రసు లేదా సభ్యనామం:',
'sp-contributions-submit'      => 'వెతుకు',

# What links here
'whatlinkshere'            => 'ఇక్కడికి లింకు చేస్తున్న పేజీలు',
'whatlinkshere-title'      => '"$1"కి లింకున్న పేజీలు',
'whatlinkshere-page'       => 'పేజీ:',
'linklistsub'              => '(లింకుల జాబితా)',
'linkshere'                => "కిందనున్న పేజీల నుండి '''[[:$1]]'''కు లింకులు ఉన్నాయి:",
'nolinkshere'              => "'''[[:$1]]'''కు ఏ పేజీ నుండీ లింకు లేదు.",
'nolinkshere-ns'           => "'''[[:$1]]''' పేజీకి లింకయ్యే పేజీలు ఎంచుకున్న నేంస్పేసులో లేవు.",
'isredirect'               => 'దారిమార్పు పేజీ',
'istemplate'               => 'పేజీకి జతపరిచారు',
'isimage'                  => 'బొమ్మ లింకు',
'whatlinkshere-prev'       => '{{PLURAL:$1|మునుపటిది|మునుపటి $1}}',
'whatlinkshere-next'       => '{{PLURAL:$1|తరువాతది|తరువాతి $1}}',
'whatlinkshere-links'      => '← లింకులు',
'whatlinkshere-hideredirs' => 'దారిమార్పులను $1',
'whatlinkshere-hidetrans'  => '$1 ట్రాన్స్‌క్లూజన్లు',
'whatlinkshere-hidelinks'  => 'లింకులను $1',
'whatlinkshere-hideimages' => '$1 బొమ్మల లింకులు',
'whatlinkshere-filters'    => 'వడపోతలు',

# Block/unblock
'blockip'                         => 'సభ్యుని నిరోధించు',
'blockip-legend'                  => 'వాడుకరి నిరోధం',
'blockiptext'                     => 'ఏదైనా ఐపీ అడ్రసునో, సభ్యనామాన్నో రచనలు చెయ్యకుండా నిరోధించాలంటే కింది ఫారాన్ని వాడండి. దుశ్చర్యల నివారణ కోసం మాత్రమే - కేవలం అందుకే - దీన్ని వాడాలి, అదికూడా వికీ విధానాన్ని అనుసరించి మాత్రమే. స్పష్టమైన కారణాన్ని కింద రాయండి (ఉదాహరణకు, దుశ్చర్యలకు పాల్పడిన పేజీలను ఉదహరించండి)',
'ipaddress'                       => 'ఐపీ చిరునామా:',
'ipadressorusername'              => 'ఐ.పి. చిరునామా లేదా సభ్యనామం',
'ipbexpiry'                       => 'అంతమయ్యే గడువు',
'ipbreason'                       => 'కారణం',
'ipbreasonotherlist'              => 'ఇతర కారణం',
'ipbreason-dropdown'              => '*సాధారణ నిరోధ కారణాలు
** అదుపు తప్పిన బాటు
** తప్పు సమాచారాన్ని చొప్పించడం
** పేజీల్లోని సమాచారాన్ని తీసెయ్యడం
** బయటి సైట్లకు లింకులు పెట్టి స్పాము చెయ్యడం
** పేజీల్లోకి చెత్తను ఎక్కించడం
** బెదిరింపు ప్రవర్తన/వేధింపు
** అనేక ఎకౌంట్లు సృష్టించి దుశ్చర్యకు పాలపడడం
** అనుచితమైన సభ్యనామం',
'ipbanononly'                     => 'అజ్ఞాత సభ్యులను మాత్రమే నిరోధించు',
'ipbcreateaccount'                => 'ఎకౌంటు సృష్టించకుండా నివారించు',
'ipbemailban'                     => 'వాడుకరిని ఈ-మెయిల్ చెయ్యకుండా నివారించు',
'ipbenableautoblock'              => 'ఈ వాడుకరి వాడిన చివరి ఐపీ అడ్రసును, అలాగే ఆ తరువాత వాడే అడ్రసులను కూడా ఆటోమాటిగ్గా నిరోధించు',
'ipbsubmit'                       => 'ఈ సభ్యుని నిరోధించు',
'ipbother'                        => 'వేరే గడువు',
'ipboptions'                      => '2 గంటలు:2 hours,1 రోజు:1 day,3 రోజులు:3 days,1 వారం:1 week,2 వారాలు:2 weeks,1 నెల:1 month,3 నెలలు:3 months,6 నెలలు:6 months,1 సంవత్సరం:1 year,ఎప్పటికీ:infinite', # display1:time1,display2:time2,...
'ipbotheroption'                  => 'వేరే',
'ipbotherreason'                  => 'ఇతర/అదనపు కారణం',
'ipbhidename'                     => 'నిరోధపు చిట్టా నుండి, క్రియాశీల నిరోధపు జాబితా నుండి  మరియు వాడుకరుల జాబితాల నుండి ఈ వాడుకరిపేరుని దాచు',
'ipbwatchuser'                    => 'ఈ సభ్యుని సభ్యుని పేజీ, చర్చాపేజీలను వీక్షణలో ఉంచు',
'badipaddress'                    => 'సరైన ఐ.పి. అడ్రసు కాదు',
'blockipsuccesssub'               => 'నిరోధం విజయవంతం అయింది',
'blockipsuccesstext'              => '[[Special:Contributions/$1|$1]] నిరోధించబడింది.
<br />నిరోధాల సమీక్ష కొరకు [[Special:IPBlockList|ఐ.పి. నిరొధాల జాబితా]] చూడండి.',
'ipb-edit-dropdown'               => 'నిరోధపు కారణాలను మార్చండి',
'ipb-unblock-addr'                => '$1 పై ఉన్న నిరోధాన్ని తొలగించండి',
'ipb-unblock'                     => 'సభ్యనామం లేక ఐపీ అడ్రసుపై ఉన్న నిరోధాన్ని తొలగించండి',
'ipb-blocklist-addr'              => '$1 పై అమల్లో ఉన్న నిరోధాలను చూపించు',
'ipb-blocklist'                   => 'అమల్లో ఉన్న నిరోధాలను చూపించు',
'unblockip'                       => 'సభ్యునిపై నిరోధాన్ని తొలగించు',
'unblockiptext'                   => 'కింది ఫారం ఉపయోగించి, నిరోధించబడిన ఐ.పీ. చిరునామా లేదా సభ్యునికి తిరిగి రచనలు చేసే అధికారం ఇవ్వవచ్చు.',
'ipusubmit'                       => 'ఈ చిరునామాపై నిరోధం తొలగించు',
'unblocked'                       => '[[User:$1|$1]]పై నిరోధం తొలగించబడింది',
'unblocked-id'                    => '$1 అనే నిరోధాన్ని తొలగించాం',
'ipblocklist'                     => 'నిరోధించబడిన ఐ.పీ. చిరునామాలు మరియు వాడుకరుల పేర్లు',
'ipblocklist-legend'              => 'నిరోధించబడిన సభ్యుని వెతకండి',
'ipblocklist-username'            => 'సభ్యనామం లేదా IP అడ్రసు:',
'ipblocklist-submit'              => 'వెతుకు',
'blocklistline'                   => '$1, $2లు $3 ($4)ను నిరోధించారు.',
'infiniteblock'                   => 'అనంతం',
'expiringblock'                   => '$1తో కాలం చెల్లుతుంది',
'anononlyblock'                   => 'అజ్ఞాతవ్యక్తులు మాత్రమే',
'noautoblockblock'                => 'ఆటోమాటిక్ నిరోధాన్ని అశక్తం చేసాం',
'createaccountblock'              => 'ఖాతా తెరవడాన్ని నిరోధించాము',
'emailblock'                      => 'ఈ-మెయిలుని నిరోధించాం',
'ipblocklist-empty'               => 'నిరోధపు జాబితా ఖాళీగా ఉంది.',
'ipblocklist-no-results'          => 'మీరడిగిన ఐపీ అడ్రసు లేదా సభ్యనామాన్ని నిరోధించలేదు.',
'blocklink'                       => 'నిరోధించు',
'unblocklink'                     => 'నిరోధం తొలగించు',
'contribslink'                    => 'రచనలు',
'autoblocker'                     => 'మీ ఐ.పీ. అడ్రసును "[[User:$1|$1]]" ఇటీవల వాడుట చేత, అది ఆటోమాటిక్‌గా నిరోధించబడినది. $1ను నిరోధించడానికి కారణం: "\'\'\'$2\'\'\'"',
'blocklogpage'                    => 'నిరోధాల చిట్టా',
'blocklogentry'                   => '"[[$1]]" పై నిరోధం అమలయింది. నిరోధ కాలం $2 $3',
'blocklogtext'                    => 'వాడుకరుల నిరోధాలు, పునస్థాపనల చిట్టా ఇది. ఆటోమాటిక్‌గా నిరోధానికి గురైన ఐ.పి. చిరునామాలు ఈ జాబితాలో ఉండవు. ప్రస్తుతం అమల్లో ఉన్న నిరోధాలు, నిషేధాల కొరకు [[Special:IPBlockList|ఐ.పి. నిరోధాల జాబితా]]ను చూడండి.',
'unblocklogentry'                 => '$1పై నిరోధం తొలగించబడింది',
'block-log-flags-anononly'        => 'అజ్ఞాత వాడుకర్లు మాత్రమే',
'block-log-flags-nocreate'        => 'ఖాతా సృష్టించడాన్ని అశక్తం చేసాం',
'block-log-flags-noautoblock'     => 'ఆటోమాటిక్ నిరోధాన్ని అశక్తం చేసాం',
'block-log-flags-noemail'         => 'ఈ-మెయిలుని నిరోధించాం',
'block-log-flags-angry-autoblock' => 'మరింత ధృడమైన స్వయంనిరోధకం సచేతనం చేయబడింది',
'range_block_disabled'            => 'శ్రేణి(రేంజి) నిరోధం చెయ్యగల నిర్వాహక అనుమతిని అశక్తం చేసాం.',
'ipb_expiry_invalid'              => 'అంతమయ్యే గడువు సరైనది కాదు.',
'ipb_expiry_temp'                 => 'దాచిన వాడుకరిపేరు నిరోధాలు శాశ్వతంగా ఉండాలి.',
'ipb_already_blocked'             => '"$1" ను ఇప్పటికే నిరోధించాం',
'ipb_cant_unblock'                => 'లోపం: నిరోధించిన ఐడీ $1 దొరకలేదు. దానిపై ఉన్న నిరోధాన్ని ఈసరికే తొలగించి ఉండవచ్చు.',
'ipb_blocked_as_range'            => 'లోపం: ఐపీ $1 ను నేరుగా నిరోధించలేదు, అంచేత నిరోధాన్ని రద్దుపరచలేము.  అయితే, అది $2 శ్రేణిలో భాగంగా నిరోధానికి గురైంది, ఈ శ్రేణిపై ఉన్న నిరోధాన్ని రద్దుపరచవచ్చు.',
'ip_range_invalid'                => 'సరైన ఐపీ శ్రేణి కాదు.',
'blockme'                         => 'నన్ను నిరోధించు',
'proxyblocker'                    => 'ప్రాక్సీ నిరోధకం',
'proxyblocker-disabled'           => 'ఈ ఫంక్షన్ను అశక్తం చేసాం.',
'proxyblockreason'                => 'మీ ఐపీ అడ్రసు ఒక ఓపెన్ ప్రాక్సీ కాబట్టి దాన్ని నిరోధించాం. మీ ఇంటర్నెట్ సేవాదారుని గానీ, సాంకేతిక సహాయకుని గానీ సంప్రదించి తీవ్రమైన ఈ భద్రతా వైఫల్యాన్ని గురించి తెలపండి.',
'proxyblocksuccess'               => 'పనయింది.',
'sorbsreason'                     => '{{SITENAME}} వాడే DNSBLలో మీ ఐపీ అడ్రసు ఒక ఓపెన్ ప్రాక్సీగా నమోదై ఉంది.',
'sorbs_create_account_reason'     => 'మీ ఐపీ అడ్రసు DNSBL లో ఓపెను ప్రాక్సీగా నమోదయి ఉంది. మీరు ఎకౌంటును సృష్టించజాలరు.',

# Developer tools
'lockdb'              => 'డాటాబేసును లాక్‌ చెయ్యి',
'unlockdb'            => 'డాటాబేసుకి తాళంతియ్యి',
'lockdbtext'          => 'డాటాబేసును లాక్‌ చెయ్యడం వలన సభ్యులు పేజీలు మార్చడం, అభిరుచులు మార్చడం, వీక్షణ జాబితాను మార్చడం వంటి డాటాబేసు ఆధారిత పనులు చెయ్యలేరు. మీరు చెయ్యదలచినది ఇదేనని, మీ పని కాగానే తిరిగి డాటాబేసును ప్రారంభిస్తాననీ ధృవీకరించండి.',
'unlockdbtext'        => 'డేటాబేసుకు తాళం తీసేసిన తరువాత, వాడుకరులందరూ పేజీలను మార్చటం మొదలు పెట్టగలరు,
తమ అభిరుచులను మార్చుకోగలరు, వీక్షణా జాబితాకు పేజీలను కలుపుకోగలరు తీసివేయనూగలరు,
అంతేకాక డేటాబేసులో మార్పులు చేయగలిగే ఇంకొన్ని పనులు కూడా చేయవచ్చు.
మీరు చేయదలుచుకుంది ఇదేనాకాదా అని ఒకసారి నిర్ధారించండి.',
'lockconfirm'         => 'అవును, డేటాబేసును లాకు చెయ్యాలని నిజంగానే అనుకుంటున్నాను.',
'unlockconfirm'       => 'అవును, నేను నిజంగానే డాటాబేసుకి తాళం తియ్యాలనుకుంటున్నాను.',
'lockbtn'             => 'డాటాబేసును లాక్‌ చెయ్యి',
'unlockbtn'           => 'డాటాబేసు తాళంతియ్యి',
'locknoconfirm'       => 'మీరు ధృవీకరణ పెట్టెలో టిక్కు పెట్టలేదు.',
'lockdbsuccesssub'    => 'డాటాబేసు లాకు విజయవంతం అయ్యింది.',
'unlockdbsuccesssub'  => 'డాటాబేసుకు తాళం తీసేసాం',
'lockdbsuccesstext'   => 'డాటాబేసు లాకయింది.<br />పని పూర్తి కాగానే లాకు తియ్యడం మర్చిపోకండి.',
'unlockdbsuccesstext' => 'డాటాబేసుకి తాళం తీసాం.',
'lockfilenotwritable' => 'డేటాబేసుకు తాళంవేయగల ఫైలులో రాయలేకపోతున్నాను.  డేటాబేసుకు తాళంవేయటానికిగానీ లేదా తీసేయటానికిగానీ, వెబ్‌సర్వరులో ఉన్న ఈ ఫైలులో రాయగలగాలి.',
'databasenotlocked'   => 'డేటాబేసు లాకవలేదు.',

# Move page
'move-page'               => '$1 తరలింపు',
'move-page-legend'        => 'పేజీని తరలించు',
'movepagetext'            => "కింది ఫారం ఉపయోగించి, ఓ పేజీ పేరు మార్చవచ్చు. దాంతో పాటు దాని చరిత్ర అంతా కొత్త పేజీ చరిత్రగా మారుతుంది.
పాత పేజీ కొత్త దానికి దారిమార్పు పేజీ అవుతుంది.
పాత పేజీకి ఉన్న దారిమార్పు పేజీలను ఆటోమెటిగ్గా సరిచేయవచ్చు.
ఆలా చేయవద్దనుకుంటే, [[Special:DoubleRedirects|ద్వంద]] లేదా [[Special:BrokenRedirects|పనిచేయని]] దారిమార్పుల పేజీలలో సరిచూసుకోండి.
లింకులన్నీ అనుకున్నట్లుగా చేరవలసిన చోటికే చేరుతున్నాయని నిర్ధారించుకోవలసిన బాధ్యత మీదే.

ఒకవేళ కొత్త పేరుతో ఇప్పటికే ఒక పేజీ ఉండి ఉంటే (అది గత మార్పుల చరిత్ర లేని ఖాళీ పేజీనో లేదా దారిమార్పు పేజీనో కాకపోతే) తరలింపు '''జరగదు'''.

అంటే మీరు పొరపాటు చేస్తే కొత్త పేరును మార్చి తిరిగి పాత పేరుకు తీసుకురాగలరు కానీ ఇప్పటికే వున్న పేజీని తుడిచివేయలేరు.

'''హెచ్చరిక!'''
ఈ మార్పు బాగా జనరంజకమైన పేజీలకు అనూహ్యం కావచ్చు; 
దాని పరిణామాలను అర్ధం చేసుకుని ముందుకుసాగండి.",
'movepagetalktext'        => "దానితో పాటు సంబంధిత చర్చా పేజీ కూడా ఆటోమాటిక్‌‌గా తరలించబడుతుంది, '''కింది సందర్భాలలో తప్ప:'''
*ఒక నేంస్పేసు నుండి ఇంకోదానికి తరలించేటపుడు,
*కొత్త పేరుతో ఇప్పటికే ఒక చర్చా పేజీ ఉంటే,
*కింది చెక్‌బాక్సులో టిక్కు పెట్టకపోతే.

ఆ సందర్భాలలో, మీరు చర్చా పేజీని కూడా పనిగట్టుకుని తరలించవలసి ఉంటుంది, లేదా ఏకీకృత పరచవలసి ఉంటుంది.",
'movearticle'             => 'పేజీని తరలించు',
'movenotallowed'          => '{{SITENAME}}లో పేజీలను తరలించడానికి మీకు అనుమతి లేదు.',
'newtitle'                => 'కొత్త పేరుకి',
'move-watch'              => 'ఈ పేజీని గమనించు',
'movepagebtn'             => 'పేజీని తరలించు',
'pagemovedsub'            => 'తరలింపు విజయవంతమైనది',
'movepage-moved'          => '<big>\'\'\'"$1"ని "$2"కి తరలించాం\'\'\'</big>', # The two titles are passed in plain text as $3 and $4 to allow additional goodies in the message.
'articleexists'           => 'ఆ పేరుతో ఇప్పటికే ఒక పేజీ ఉంది, లేదా మీరు ఎంచుకున్న పేరు సరైనది కాదు. వేరే పేరు ఎంచుకోండి.',
'cantmove-titleprotected' => 'ఈ పేరుతోఉన్న పేజీని సృష్టించనివ్వకుండా సంరక్షిస్తున్నారు, అందుకని ఈ ప్రదేశంలోకి పేజీని తరలించలేను',
'talkexists'              => "'''పేజీని జయప్రదంగా తరలించాము, కానీ చర్చా పేజీని తరలించలేక పోయాము. కొత్త పేరుతో చర్చ పేజీ ఇప్పటికే ఉంది, ఆ రెంటినీ మీరే ఏకీకృతం చెయ్యండి.'''",
'movedto'                 => 'తరలింపు',
'movetalk'                => 'కూడా వున్న చర్చ పేజీని తరలించు',
'move-subpages'           => 'అన్ని ఉపపేజీలను కూడా తరలించు, వర్తిస్తే',
'move-talk-subpages'      => 'వర్తిస్తే, చర్చా పేజీ యొక్క అన్ని ఉపపేజీలను తరలించు',
'movepage-page-exists'    => '$1 అనే పేజీ ఈపాటికే ఉంది మరియు దాన్ని ఆటోమెటిగ్గా ఈ పేజీతో మార్చివేయలేరు.',
'movepage-page-moved'     => '$1 అనే పేజీని $2 కి తరలించాం.',
'movepage-page-unmoved'   => '$1 అనే పేజీని $2 కి తరలించలేకపోయాము.',
'movepage-max-pages'      => '$1 యొక్క గరిష్ఠ పరిమితి {{PLURAL:$1|పేజీ|పేజీలు}} వరకు తరలించడమైనది. ఇక ఆటోమాటిగ్గా తరలించము.',
'1movedto2'               => '$1, $2కు తరలించబడింది',
'1movedto2_redir'         => '[[$1]] ను దారిమార్పు ద్వారా [[$2]] కు తరలించాం',
'movelogpage'             => 'తరలింపుల చిట్టా',
'movelogpagetext'         => 'కింద తరలించిన పేజీల జాబితా ఉన్నది.',
'movereason'              => 'కారణము',
'revertmove'              => 'తరలింపును రద్దుచేయి',
'delete_and_move'         => 'తొలగించి, తరలించు',
'delete_and_move_text'    => '==తొలగింపు అవసరం==

ఉద్దేశించిన వ్యాసం "[[:$1]]" ఇప్పటికే ఉనికిలో ఉంది. ప్రస్తుత తరలింపుకు వీలుగా దాన్ని తొలగించేయమంటారా?',
'delete_and_move_confirm' => 'అవును, పేజీని తొలగించు',
'delete_and_move_reason'  => 'తరలింపుకు వీలుగా తొలగించబడింది',
'selfmove'                => 'మూలం, గమ్యం పేర్లు ఒకటే; పేజీని దాని పైకే తరలించడం కుదరదు.',
'immobile_namespace'      => 'మీరు తరలించబోతున్న పేజీ లేదా గమ్యస్థానంలో ఉన్న పేజీ ఒక ప్రత్యేక పేజీ; ఆ నేంస్పేసులోకి లేదా ఆ నేంస్పేసు నుండి తరలించటం కుదరదు.',
'imagenocrossnamespace'   => 'ఫైలును, ఫైలుకు చెందని నేమ్‌స్పేసుకు తరలించలేం',
'imagetypemismatch'       => 'ఈ కొత్త ఫైలు ఎక్స్&zwnj;టెన్షన్ ఫైలు రకానికి సరిపోలేదు',
'imageinvalidfilename'    => 'టార్గెట్ ఫైలు పేరు సరిగాలేదు',
'fix-double-redirects'    => 'పాత పేజీని సూచిస్తున్న దారిమార్పులను తాజాకరించు',

# Export
'export'            => 'ఎగుమతి పేజీలు',
'exporttext'        => 'ఎంచుకున్న పేజీ లేదా పేజీలలోని వ్యాసం మరియు పేజీ చరితం లను XML లో ఎగుమతి చేసుకోవచ్చు. MediaWiki ని ఉపయోగించి Special:Import page ద్వారా దీన్ని వేరే వికీ లోకి దిగుమతి చేసుకోవచ్చు.

పేజీలను ఎగుమతి చేసందుకు, కింద ఇచ్చిన టెక్స్టు బాక్సులో పేజీ పేర్లను లైనుకో పేరు చొప్పున ఇవ్వండి. ప్రస్తుత కూర్పుతో పాటు పాత కూర్పులు కూడా కావాలా, లేక ప్రస్తుత కూర్పు మాత్రమే చాలా అనే విషయం కూడా ఇవ్వవచ్చు.

రెండో పద్ధతిలో అయితే, పేజీ యొక్క లింకును కూడా వాడవచ్చు. ఉదాహరణకు, "[[{{MediaWiki:Mainpage}}]]" కోసమైతే [[{{ns:special}}:Export/{{MediaWiki:Mainpage}}]] అని ఇవ్వవచ్చు.',
'exportcuronly'     => 'ప్రస్తుత కూర్పు మాత్రమే, పూర్తి చరితం వద్దు',
'exportnohistory'   => "----
'''గమనిక:''' ఈ ఫారాన్ని ఉపయోగించి పేజీలయొక్క పూర్తి చరిత్రను ఎగుమతి చేయడాన్ని సర్వరుపై వత్తిడి పెరిగిన కారణంగా ప్రస్తుతం నిలిపివేశారు.",
'export-submit'     => 'ఎగుమతి చెయ్యి',
'export-addcattext' => 'ఈ వర్గంలోని పేజీలను చేర్చు:',
'export-addcat'     => 'చేర్చు',
'export-download'   => 'ఫైలుగా భద్రపరచు',
'export-templates'  => 'మూసలను కలుపు',

# Namespace 8 related
'allmessages'               => 'అన్ని సిస్టం సందేశాలు',
'allmessagesname'           => 'పేరు',
'allmessagesdefault'        => 'డీఫాల్టు పాఠ్యం',
'allmessagescurrent'        => 'ప్రస్తుత పాఠ్యం',
'allmessagestext'           => 'మీడియావికీ నేంస్పేసులో ఉన్న అన్ని సిస్టం సందేశాల జాబితా ఇది.
మీరు అన్ని వికీపీడియాలకూ కలిపి ఒకేసారి అనువదించాలని అనుకుంటే, దయచేసి [http://www.mediawiki.org/wiki/Localisation మీడియావికీ అనువాదం] మరియూ [http://translatewiki.net బేటావికీ] సైట్లను చూడండి.',
'allmessagesnotsupportedDB' => "'''\$wgUseDatabaseMessages''' అన్నది అచేతనం చేసి ఉన్నందువల్ల ఈ పేజీని వాడలేరు.",
'allmessagesfilter'         => 'సమాచారం పేరుపై ఫిల్టరు:',
'allmessagesmodified'       => 'మార్చినవాటినే చూపించు',

# Thumbnails
'thumbnail-more'           => 'పెద్దది చెయ్యి',
'filemissing'              => 'ఫైలు కనపడుటలేదు',
'thumbnail_error'          => '$1: నఖచిత్రం తయారుచెయ్యడంలో లోపం జరిగింది',
'djvu_page_error'          => 'DjVu పేజీ రేంజి దాటిపోయింది',
'djvu_no_xml'              => 'DjVu ఫైలు కోసం XMLను తీసుకుని రాలేకపోయాను',
'thumbnail_invalid_params' => 'నఖచిత్రాలకు సరయిన పారామీటర్లు లేవు',
'thumbnail_dest_directory' => 'గమ్యస్థానంలో డైరెక్టరీని సృష్టించలేకపోయాం',

# Special:Import
'import'                     => 'పేజీలను దిగుమతి చేసుకోండి',
'importinterwiki'            => 'ఇంకోవికీ నుండి దిగుమతి',
'import-interwiki-text'      => 'దిగుమతి చేసుకోవడానికి ఒక వికీని మరియు అందులోని పేజీని ఎంచుకోండి.
కూర్పుల తేదీలు మరియు మార్పులు చేసిన వారి పేర్లు భద్రపరచబడతాయి.
ఇతర వికీలనుండి చేస్తున్న దిగుమతుల చర్యలన్నీ [[Special:Log/import|దిగుమతుల చిట్టా]]లో నమోదవుతాయి.',
'import-interwiki-history'   => 'ఈ పేజీ యొక్క అన్ని చారిత్రక కూర్పులను కాపీ చెయ్యి',
'import-interwiki-submit'    => 'దిగుమతించు',
'import-interwiki-namespace' => 'ఈ నేంస్పేసులోకి పేజీలను పంపించు:',
'importtext'                 => '
మూలవికీ నుండి ప్రత్యేక:Export అనే ఉపయుక్తమైన ప్రోగ్రామును ఉపయోగించి ఫైలును ఎగుమతి చేసి మీ హార్డుడిస్కులో బధ్రపరచుకుని, ఆ తరువాత ఇక్కడ అప్లోడు చేయండి.',
'importstart'                => 'పేజీలను దిగుమతి చేస్తున్నాం...',
'import-revision-count'      => '$1 {{PLURAL:$1|కూర్పు|కూర్పులు}}',
'importnopages'              => 'దిగుమతి చెయ్యడానికి పేజీలేమీ లేవు.',
'importfailed'               => 'దిగుమతి కాలేదు: $1',
'importunknownsource'        => 'దిగుమతి చేసుకుంటున్న దాని మాతృక రకం తెలియదు',
'importcantopen'             => 'దిగుమతి చేయబోతున్న ఫైలును తెరవలేకపోతున్నాను',
'importbadinterwiki'         => 'చెడు అంతర్వికీ లింకు',
'importnotext'               => 'ఖాళీ లేదా పాఠ్యం లేదు',
'importsuccess'              => 'దిగుమతి పూర్తయ్యింది!',
'importhistoryconflict'      => 'కూర్పుల చరిత్రలో ఘర్షణ తలెత్తింది (ఈ పేజీని ఇంతకు ముందే దిగుమతి చేసుంటారు)',
'importnosources'            => 'No transwiki import sources have been defined and direct history uploads are disabled.
ఎటువంటి అంతర్వికీ దిగుమతి మూలాలను పేర్కొనకపోవటం వలన, ప్రత్యక్ష చరిత్ర అప్లోడులను నిలిపివేశాం.',
'importnofile'               => 'ఎటువంటి దిగుమతి ఫైలునూ అప్లోడుచేయలేదు.',
'importuploaderrorsize'      => 'దిగుమతి ఫైలు అప్లోడు ఫలించలేదు. ఈ ఫైలు అప్లోడు ఫైలుకు నిర్దేశించిన పరిమాణం కంటే పెద్దా ఉంది.',
'importuploaderrorpartial'   => 'దిగుమతి ఫైలు అప్లోడు ఫలించలేదు. ఈ ఫైలులో కొంత భాగాన్ని మాత్రమే అప్లోడు చేయగలిగం.',
'importuploaderrortemp'      => 'దిగుమతి ఫైలు అప్లోడు ఫలించలేదు. ఒక తాత్కాలిక ఫోల్డరు కనిపించటం లేదు.',
'import-parse-failure'       => 'దిగుమతి చేసుకుంటున్న XML విశ్లేషణ ఫలించలేదు',
'import-noarticle'           => 'దిగుమతి చెయ్యాల్సిన పేజీ లేదు!',
'import-nonewrevisions'      => 'అన్ని కూర్పులూ గతంలోనే దిగుమతయ్యాయి.',
'xml-error-string'           => '$1 $2వ లైనులో, వరుస $3 ($4వ బైటు): $5',
'import-upload'              => 'XML డేటాను అప్‌లోడు చెయ్యి',

# Import log
'importlogpage'                    => 'దిగుమతి లాగ్',
'importlogpagetext'                => 'ఇతర వికీల నుండీ మార్పుల చరిత్రతోసహా తెచ్చిన నిర్వహణా దిగుమతులు.',
'import-logentry-upload'           => '[[$1]]ను ఫైలు అప్లోడు ద్వారా దిగుమతి చేసాం',
'import-logentry-upload-detail'    => '$1 {{PLURAL:$1|కూర్పు|కూర్పులు}}',
'import-logentry-interwiki'        => 'ఇతర వికీల నుండి $1',
'import-logentry-interwiki-detail' => '$2 నుండి {{PLURAL:$1|ఒక కూర్పు|$1 కూర్పులు}}',

# Tooltip help for the actions
'tooltip-pt-userpage'             => 'నా వాడుకరి పేజీ',
'tooltip-pt-anonuserpage'         => 'మీ ఐపీ చిరునామాకి సంబంధించిన వాడుకరి పేజీ',
'tooltip-pt-mytalk'               => 'నా చర్చా పేజీ',
'tooltip-pt-anontalk'             => 'ఈ ఐపీ చిరునామా నుండి చేసిన మార్పుల గురించి చర్చ',
'tooltip-pt-preferences'          => 'నా అభిరుచులు',
'tooltip-pt-watchlist'            => 'మీరు మార్పుల కొరకు గమనిస్తున్న పేజీల జాబితా',
'tooltip-pt-mycontris'            => 'నా మార్పు-చేర్పుల జాబితా',
'tooltip-pt-login'                => 'మీరు లగిన్ అయ్యి మార్పులు చేస్తే బాగుంతుంది, అలాగని మార్పులు చేయటానికి లాగిన్ అవ్వటం తప్పని సరి కాదు.',
'tooltip-pt-anonlogin'            => 'మీరు ప్రవేశించడాన్ని (లాగిన్) ప్రోత్సహిస్తాం, కానీ అది తప్పనిసరి కాదు.',
'tooltip-pt-logout'               => 'నిష్క్రమించండి',
'tooltip-ca-talk'                 => 'విషయపు పేజీ గురించి చర్చ',
'tooltip-ca-edit'                 => 'ఈ పేజీని మీరు సరిదిద్దవచ్చు. భద్రపరిచేముందు మునుజూపు బొత్తాన్ని వాడండి.',
'tooltip-ca-addsection'           => 'ఈ చర్చకు మీ వ్యాఖ్యను చేర్చండి.',
'tooltip-ca-viewsource'           => 'ఈ పేజీ సంరంక్షించబడింది. దీని మూలం చూడవచ్చు.',
'tooltip-ca-history'              => 'ఈ పేజీ యొక్క గత కూర్పులు.',
'tooltip-ca-protect'              => 'ఈ పేజీని సంరక్షించండి',
'tooltip-ca-delete'               => 'ఈ పేజీని తొలగించండి',
'tooltip-ca-undelete'             => 'ఈ పేజీని తొలగించడానికి ముందు చేసిన మార్పులను పునఃస్థాపించు',
'tooltip-ca-move'                 => 'ఈ పేజీని తరలించండి',
'tooltip-ca-watch'                => 'ఈ పేజీని మీ విక్షణా జాబితాకి చేర్చుకోండి',
'tooltip-ca-unwatch'              => 'ఈ పేజీని మీ విక్షణా జాబితా నుండి తొలగించండి',
'tooltip-search'                  => '{{SITENAME}} లో వెతకండి',
'tooltip-search-go'               => 'ఇదే పేరుతో పేజీ ఉంటే అక్కడికి తీసుకెళ్ళు',
'tooltip-search-fulltext'         => 'పేజీలలో ఈ పాఠ్యం కొరకు వెతుకు',
'tooltip-p-logo'                  => 'మొదటి పేజీ',
'tooltip-n-mainpage'              => 'మొదటి పేజీని దర్శించండి',
'tooltip-n-portal'                => 'ప్రాజెక్టు గురించి, మీరేం చేయవచ్చు, సమాచారం ఎక్కడ దొరుకుతుంది',
'tooltip-n-currentevents'         => 'వర్తమాన ఘటనలకు సంబంధించిన సమాచారాన్ని పొందండి.',
'tooltip-n-recentchanges'         => 'వికీలో ఇటీవల జరిగిన మార్పుల జాబితా.',
'tooltip-n-randompage'            => 'ఓ యాదృచ్చిక పేజీని చూడండి',
'tooltip-n-help'                  => 'తెలుసుకోడానికి ఓ మంచి ప్రదేశం.',
'tooltip-t-whatlinkshere'         => 'ఇక్కడికి లింకయి ఉన్న అన్ని వికీ పేజీలు',
'tooltip-t-recentchangeslinked'   => 'ఈ పేజీనుండి లింకున్న పేజీలకు జరిగిన ఇటీవలి మార్పులు',
'tooltip-feed-rss'                => 'ఈ పేజీకి RSS ఫీడు',
'tooltip-feed-atom'               => 'ఈ పేజీకి Atom ఫీడు',
'tooltip-t-contributions'         => 'ఈ వాడుకరి యొక్క రచనల జాబితా చూడండి',
'tooltip-t-emailuser'             => 'ఈ వాడుకరికి ఓ ఈమెయిలు పంపండి',
'tooltip-t-upload'                => 'ఫైళ్లను ఎగుమతించండి',
'tooltip-t-specialpages'          => 'అన్ని ప్రత్యేక పేజీల జాబితా',
'tooltip-t-print'                 => 'ఈ పేజీ యొక్క ముద్రణా కూర్పు',
'tooltip-t-permalink'             => 'పేజీ యొక్క ఈ కూర్పుకి శాశ్వత లింకు',
'tooltip-ca-nstab-main'           => 'విషయపు పేజీ చూడండి',
'tooltip-ca-nstab-user'           => 'వాడుకరి పేజీ చూడండి',
'tooltip-ca-nstab-media'          => 'మీడియా పేజీని చూడండి',
'tooltip-ca-nstab-special'        => 'ఇది ఓ ప్రత్యేక పేజీ, దీన్ని మీరు సరిదిద్దలేదు.',
'tooltip-ca-nstab-project'        => 'ప్రాజెక్టు పేజీని చూడండి',
'tooltip-ca-nstab-image'          => 'ఫైలు పేజీని చూడండి',
'tooltip-ca-nstab-mediawiki'      => 'వ్యవస్థా సందేశం చూడండి',
'tooltip-ca-nstab-template'       => 'మూసని చూడండి',
'tooltip-ca-nstab-help'           => 'సహాయపు పేజీ చూడండి',
'tooltip-ca-nstab-category'       => 'వర్గపు పేజీ చూడండి',
'tooltip-minoredit'               => 'దీన్ని చిన్న మార్పుగా గుర్తించు',
'tooltip-save'                    => 'మీ మార్పులను భద్రపరచండి',
'tooltip-preview'                 => 'మీ మార్పులను మునుజూడండి, భద్రపరిచేముందు ఇది వాడండి!',
'tooltip-diff'                    => 'పాఠానికి మీరు చేసిన మార్పులను చూపుంచు. [alt-v]',
'tooltip-compareselectedversions' => 'ఈ పేజీలో ఎంచుకున్న రెండు కూర్పులకు మధ్య తేడాలను చూడండి. [alt-v]',
'tooltip-watch'                   => 'ఈ పేజీని మీ విక్షణా జాబితాకు చేర్చండి',
'tooltip-recreate'                => 'పేజీ తుడిచివేయబడ్డాకానీ మళ్ళీ సృష్టించు',
'tooltip-upload'                  => 'ఎగుమతి మొదలుపెట్టు',

# Metadata
'nodublincore'      => 'డబ్లిన్ కోర్ RDF మెటాడేటాను ఈ సర్వరుకు అశక్తం చేసాం.',
'nocreativecommons' => 'క్రియేటివ్ కామన్స్ RDF మెటాడేటాను ఈ సర్వరుకు అశక్తం చేసాం.',
'notacceptable'     => 'ఈ వికీ సర్వరు మీ క్లయంటు చదవగలిగే రీతిలో డేటాను ఇవ్వలేదు.',

# Attribution
'anonymous'        => '{{SITENAME}} యొక్క అజ్ఞాత సభ్యులు',
'siteuser'         => '{{SITENAME}} వాడుకరి $1',
'lastmodifiedatby' => 'ఈ పేజీకి $3 $2, $1న చివరి మార్పు చేసారు.', # $1 date, $2 time, $3 user
'othercontribs'    => '$1 యొక్క కృతిపై ఆధారితం.',
'others'           => 'ఇతరాలు',
'siteusers'        => '{{SITENAME}} సభ్యులు $1',
'creditspage'      => 'పేజీ క్రెడిట్లు',
'nocredits'        => 'ఈ పేజీకి క్రెడిట్ల సమాచారం అందుబాటులో లేదు.',

# Spam protection
'spamprotectiontitle' => 'స్పాం సంరక్షణ ఫిల్టరు',
'spamprotectiontext'  => 'మీరు భద్రపరచదలచిన పేజీని మా స్పాం ఫిల్టరు నిరోధించింది. బహుశా ఇది ఏదైనా బయటి సైటుకు ఇచ్చిన లింకు కారణంగా జరిగి ఉండవచ్చు.',
'spamprotectionmatch' => 'మా స్పాం ఫిల్టరును ప్రేరేపించిన రచన భాగం ఇది: $1',
'spambot_username'    => 'మీడియావికీ స్పాము శుద్ధి',
'spam_reverting'      => '$1 కు లింకులు లేని గత కూర్పుకు తిరిగి తీసుకెళ్తున్నాం',
'spam_blanking'       => '$1 కు లింకులు ఉన్న కూర్పులన్నిటినీ ఖాళీ చేస్తున్నాం',

# Info page
'infosubtitle'   => 'పేజీ గురించి సమాచారం',
'numedits'       => 'మార్పుల సంఖ్య (వ్యాసం): $1',
'numtalkedits'   => 'మార్పుల సంఖ్య (చర్చా పేజీ): $1',
'numwatchers'    => 'వీక్షకుల సంఖ్య: $1',
'numauthors'     => 'భిన్నమైన రచయితల సంఖ్య (వ్యాసం): $1',
'numtalkauthors' => 'భిన్నమైన రచయితల సంఖ్య (చర్చా పేజీ): $1',

# Math options
'mw_math_png'    => 'ఎల్లప్పుడూ PNGగా చూపించు',
'mw_math_simple' => 'తేలికగా ఉంటే HTML లేకపోతే PNG',
'mw_math_html'   => 'వీలైతే ఎచ్‌టీఎంఎల్ లేకపోతే పింగ్',
'mw_math_source' => 'టెక్ గానే ఉండనివ్వు (టెక్స్ట్‌ బ్రౌజర్ల కొరకు)',
'mw_math_modern' => 'ఆధునిక విహారిణులకు ఉద్దేశించినది',
'mw_math_mathml' => 'వీలయితే MathML (ప్రయోగాత్మకం)',

# Patrolling
'markaspatrolleddiff'                 => 'పరీక్షించినట్లుగా గుర్తు పెట్టు',
'markaspatrolledtext'                 => 'ఈ వ్యాసాన్ని పరీక్షించినట్లుగా గుర్తు పెట్టు',
'markedaspatrolled'                   => 'పరీక్షింపబడినట్లు గుర్తింపబడింది',
'markedaspatrolledtext'               => 'ఎంచుకున్న సంచిక పరీక్షించబడినట్లుగా గుర్తింపబడింది.',
'rcpatroldisabled'                    => 'ఇటీవలి మార్పుల నిఘాను అశక్తం చేసాం',
'rcpatroldisabledtext'                => 'ఇటీవలి మార్పుల నిఘాను ప్రస్తుతానికి అశక్తం చేసాం',
'markedaspatrollederror'              => 'నిఘాలో ఉన్నట్లుగా గుర్తించలేకున్నాం',
'markedaspatrollederrortext'          => 'నిఘాలో ఉన్నట్లు గుర్తించేందుకుగాను, కూర్పును చూపించాలి.',
'markedaspatrollederror-noautopatrol' => 'మీరు చేసిన మార్పులను మీరే నిఘాలో పెట్టలేరు.',

# Patrol log
'patrol-log-page' => 'నిఘా లాగ్‌',
'patrol-log-line' => 'మొత్తం $1లోని $2లను $3గా పెట్రోలు చేసినట్లుగా గుర్తించాము',
'patrol-log-auto' => '(దావంత అదే)',

# Image deletion
'deletedrevision'                 => 'పాత సంచిక $1 తొలగించబడినది.',
'filedeleteerror-short'           => 'ఫైలు తొలగించడంలో పొరపాటు: $1',
'filedeleteerror-long'            => 'ఫైలుని తొలగించడంలో పొరపాట్లు జరిగాయి:

$1',
'filedelete-missing'              => '"$1" అన్న ఫైలు ఉనికిలో లేనందున, దాన్ని తొలగించలేం.',
'filedelete-old-unregistered'     => 'మీరు చెప్పిన ఫైలు కూర్పు "$1" డాటాబేసులో లేదు.',
'filedelete-current-unregistered' => 'మీరు చెప్పిన ఫైలు "$1" డాటాబేసులో లేదు.',
'filedelete-archive-read-only'    => '"$1" భాండార డైరెక్టరీలో వెబ్‌సర్వరు రాయలేకున్నది.',

# Browsing diffs
'previousdiff' => '← మునుపటి మార్పు',
'nextdiff'     => 'తరువాతి మార్పు →',

# Media information
'mediawarning'         => "'''హెచ్చరిక''': ఈ ఫైలులో హానికరమైన కోడ్‌ ఉండవచ్చు, దానిని పనిచేయిస్తే మీ సిస్టము దెబ్బతినవచ్చు.<hr />",
'imagemaxsize'         => 'బొమ్మ వివరణ పేజీలో బొమ్మ ఉండవలసిన సైజు:',
'thumbsize'            => 'నఖచిత్రం వైశాల్యం:',
'widthheightpage'      => '$1×$2, $3 {{PLURAL:$3|పేజీ|పేజీలు}}',
'file-info'            => '(ఫైలు పరిమాణం: $1, MIME రకం: $2)',
'file-info-size'       => '($1 × $2 పిక్సెళ్ళు, ఫైలు పరిమాణం: $3, MIME రకం: $4)',
'file-nohires'         => '<small>మరింత స్పష్టమైన బొమ్మ లేదు.</small>',
'svg-long-desc'        => '(SVG ఫైలు, నామమాత్రంగా $1 × $2 పిక్సెళ్ళు, ఫైలు పరిమాణం: $3)',
'show-big-image'       => 'అసలు పరిమాణం',
'show-big-image-thumb' => '<small>ఈ మునుజూపు సైజు: $1 × $2 pixels</small>',

# Special:NewImages
'newimages'             => 'కొత్త ఫైళ్ళ కొలువు',
'imagelisttext'         => "ఇది $2 వారీగా పేర్చిన  '''$1''' {{PLURAL:$1|పైలు|ఫైళ్ళ}} జాబితా.",
'newimages-summary'     => 'ఇటీవలే ఎగుమతైన ఫైళ్ళను ఈ ప్రత్యేక పేజీ చూపిస్తుంది.',
'showhidebots'          => '($1 బాట్లు)',
'noimages'              => 'చూసేందుకు ఏమీ లేదు.',
'ilsubmit'              => 'వెతుకు',
'bydate'                => 'తేదీ వారీగ',
'sp-newimages-showfrom' => '$2, $1 నుండి మొదలుపెట్టి కొత్త ఫైళ్ళను చూపించు',

# Bad image list
'bad_image_list' => 'కింద తెలిపిన తీరులో కలపాలి:

జాబితాలో ఉన్నవాటినే (* గుర్తుతో మొదలయ్యే వాక్యాలు) పరిగణలోకి తీసుకుంటారు. వ్యాక్యంలో ఉన్న మొదటి లింకు ఒక చెడిపోయిన బొమ్మకు లింకు అయ్యుండాలి.
అదే వాక్యంలో ఈ లింకు తరువాత వచ్చే లింకులను పట్టించుకోదు, ఆ పేజీలలో బొమ్మలు సరిగ్గా చేర్చారని భావిస్తుంది.',

# Metadata
'metadata'          => 'మెటాడేటా',
'metadata-help'     => 'ఈ ఫైలులో అదనపు సమాచారం ఉంది, బహుశా దీన్ని సృష్టించడానికి లేదా సాంఖ్యీకరించడానికి వాడిన డిజిటల్ కేమెరా లేదా స్కానర్ ఆ సమాచారాన్ని చేర్చివుంవచ్చు. ఈ ఫైలుని అసలు స్థితి నుండి మారిస్తే, కొన్ని వివరాలు ఆ మారిన ఫైలులో పూర్తిగా ప్రతిఫలించకపోవచ్చు.',
'metadata-expand'   => 'వివరాలు చూపించు',
'metadata-collapse' => 'వివరాలు దాచు',
'metadata-fields'   => 'కింద జాబితాలో ఉన్న వివరాలను బొమ్మ పేజీలో, బొమ్మ మేటాడేటాలో మూసుకు పోయినప్పుడు కూడా చూపిస్తారు.
మిగిలిన వివరాలు దాచేసి ఉంటాయి. ఇక్కడ మీరు బొమ్మలో చూపించాలని అనుకుంటున్న వివరాల
మీడియావికీ పేర్లను చేరిస్తేగనక, వాటిని బొమ్మ పేజీలో చూపిస్తుంది.
* make
* model
* datetimeoriginal
* exposuretime
* fnumber
* focallength', # Do not translate list items

# EXIF tags
'exif-imagewidth'                  => 'వెడల్పు',
'exif-imagelength'                 => 'ఎత్తు',
'exif-bitspersample'               => 'ఒక్కో కాంపొనెంటుకు బిట్లు',
'exif-compression'                 => 'కుదింపు పద్ధతి (కంప్రెషను స్కీము)',
'exif-photometricinterpretation'   => 'పిక్సెళ్ళ అమరిక',
'exif-orientation'                 => 'దిశ',
'exif-samplesperpixel'             => 'కాంపొనెంట్ల సంఖ్య',
'exif-planarconfiguration'         => 'డాటా అమరిక',
'exif-ycbcrsubsampling'            => 'Y, C ల ఉప నమూనా నిష్పత్తి',
'exif-ycbcrpositioning'            => 'Y మరియు C స్థానాలు',
'exif-xresolution'                 => 'క్షితిజసమాంతర స్పష్టత',
'exif-yresolution'                 => 'లంబ స్పష్టత',
'exif-resolutionunit'              => 'X, Y స్పష్టతల కొలమానం',
'exif-stripoffsets'                => 'బొమ్మ డేటా ఉన్న స్థలం',
'exif-rowsperstrip'                => 'ఒక్కో పట్టికి ఉన్న అడ్డువరుసలు',
'exif-stripbytecounts'             => 'ఒక్కో కుదించిన పట్టీలో ఉన్న బైట్లు',
'exif-jpeginterchangeformat'       => 'JPEG SOI కి ఆఫ్‌సెట్',
'exif-jpeginterchangeformatlength' => 'JPEG డాటా యొక్క బైట్లు',
'exif-transferfunction'            => 'బదిలీ ఫంక్షన్',
'exif-whitepoint'                  => 'శ్వేతబిందు వర్ణోగ్రత (క్రొమాటిసిటీ)',
'exif-primarychromaticities'       => 'ప్రైమారిటీల వర్ణోగ్రతలు',
'exif-ycbcrcoefficients'           => 'వర్ణస్థల మార్పు మాత్రిక స్థానసూచికలు',
'exif-referenceblackwhite'         => 'నలుపు మరియు తెలుపు సూచీ విలువల యొక్క జత',
'exif-datetime'                    => 'ఫైలు మార్చిన తేదీ మరియు సమయం',
'exif-imagedescription'            => 'బొమ్మ శీర్షిక',
'exif-make'                        => 'కేమెరా తయారీదారు',
'exif-model'                       => 'కేమెరా మోడల్',
'exif-software'                    => 'ఉపయోగించిన సాఫ్ట్&zwnj;వేర్',
'exif-artist'                      => 'కృతికర్త',
'exif-copyright'                   => 'కాపీ హక్కుదారు',
'exif-exifversion'                 => 'ఎక్సిఫ్ వెర్షన్',
'exif-flashpixversion'             => 'అనుమతించే Flashpix కూర్పు',
'exif-colorspace'                  => 'వర్ణస్థలం',
'exif-componentsconfiguration'     => 'ప్రతీ అంగం యొక్క అర్థం',
'exif-compressedbitsperpixel'      => 'బొమ్మ కుదింపు పద్ధతి',
'exif-pixelydimension'             => 'సరైన బొమ్మ వెడల్పు',
'exif-pixelxdimension'             => 'బొమ్మ సరైన ఎత్తు',
'exif-makernote'                   => 'తయారీదారు గమనికలు',
'exif-usercomment'                 => 'వాడుకరి వ్యాఖ్యలు',
'exif-relatedsoundfile'            => 'సంబంధిత శబ్ద ఫైలు',
'exif-datetimeoriginal'            => 'డేటా తయారైన తేదీ, సమయం',
'exif-datetimedigitized'           => 'డిజిటైజు చేసిన తేదీ, సమయం',
'exif-subsectime'                  => 'తేదీసమయం ఉపక్షణాలు',
'exif-subsectimeoriginal'          => 'DateTimeOriginal ఉపసెకండ్లు',
'exif-subsectimedigitized'         => 'DateTimeDigitized ఉపసెకండ్లు',
'exif-exposuretime'                => 'ఎక్స్పోజరు సమయం',
'exif-exposuretime-format'         => '$1 క్షణ ($2)',
'exif-fnumber'                     => 'F సంఖ్య',
'exif-exposureprogram'             => 'ఎక్స్పోజరు ప్రోగ్రాము',
'exif-spectralsensitivity'         => 'వర్ణపట సున్నితత్వం',
'exif-isospeedratings'             => 'ISO స్పీడు రేటింగు',
'exif-oecf'                        => 'ఆప్టోఎలెక్ట్రానిక్ మార్పు గుణకం',
'exif-shutterspeedvalue'           => 'షట్టరు వేగం',
'exif-aperturevalue'               => 'ఎపర్చరు',
'exif-brightnessvalue'             => 'దీప్తి',
'exif-exposurebiasvalue'           => 'ఎక్స్పోజరు బయాస్',
'exif-maxaperturevalue'            => 'గరిష్ఠ లాండు ఎపర్చరు',
'exif-subjectdistance'             => 'వస్తువు దూరం',
'exif-meteringmode'                => 'మీటరింగు మోడ్',
'exif-lightsource'                 => 'కాంతి మూలం',
'exif-flash'                       => 'ఫ్లాష్',
'exif-focallength'                 => 'కటకపు నాభ్యంతరం',
'exif-subjectarea'                 => 'వస్తువు ప్రదేశం',
'exif-flashenergy'                 => 'ఫ్లాష్ శక్తి',
'exif-spatialfrequencyresponse'    => 'స్పేషియల్ పౌనఃపున్య స్పందన',
'exif-focalplanexresolution'       => 'X నాభి తలపు స్పష్టత',
'exif-focalplaneyresolution'       => 'Y నాభి తలపు స్పష్టత',
'exif-focalplaneresolutionunit'    => 'నాభితలపు స్పష్టత కొలమానం',
'exif-subjectlocation'             => 'వస్తువు యొక్క ప్రాంతం',
'exif-exposureindex'               => 'ఎక్స్పోజరు సూచిక',
'exif-sensingmethod'               => 'గ్రహించే పద్ధతి',
'exif-filesource'                  => 'ఫైలు మూలం',
'exif-scenetype'                   => 'దృశ్యపు రకం',
'exif-cfapattern'                  => 'CFA క్రమం',
'exif-customrendered'              => 'కస్టమ్ బొమ్మ ప్రాసెసింగు',
'exif-exposuremode'                => 'ఎక్స్పోజరు పద్ధతి',
'exif-whitebalance'                => 'తెలుపు సంతులనం',
'exif-digitalzoomratio'            => 'డిజిటల్ జూమ్ నిష్పత్తి',
'exif-focallengthin35mmfilm'       => '35 మి.మీ. ఫిల్ములో నాభ్యంతరం',
'exif-scenecapturetype'            => 'దృశ్య సంగ్రహ పద్ధతి',
'exif-gaincontrol'                 => 'దృశ్య నియంత్రణ',
'exif-contrast'                    => 'కాంట్రాస్టు',
'exif-saturation'                  => 'సంతృప్తి',
'exif-sharpness'                   => 'పదును',
'exif-devicesettingdescription'    => 'డివైసు సెట్టుంగుల వివరణ',
'exif-subjectdistancerange'        => 'వస్తు దూరపు శ్రేణి',
'exif-imageuniqueid'               => 'విలక్షణమైన బొమ్మ ఐడీ',
'exif-gpsversionid'                => 'GPS ట్యాగు కూర్పు',
'exif-gpslatituderef'              => 'ఉత్తర లేదా దక్షిణ అక్షాంశం',
'exif-gpslatitude'                 => 'అక్షాంశం',
'exif-gpslongituderef'             => 'తూర్పు లేదా పశ్చిమ రేఖాంశం',
'exif-gpslongitude'                => 'రేఖాంశం',
'exif-gpsaltituderef'              => 'ఎత్తుకు మూలం',
'exif-gpsaltitude'                 => 'సముద్ర మట్టం',
'exif-gpstimestamp'                => 'GPS సమయం (అణు గడియారం)',
'exif-gpssatellites'               => 'కొలిచేందుకు వాడిన ఉపగ్రహాలు',
'exif-gpsstatus'                   => 'రిసీవర్ స్థితి',
'exif-gpsmeasuremode'              => 'కొలత పద్ధతి',
'exif-gpsdop'                      => 'కొలత ఖచ్చితత్వం',
'exif-gpsspeedref'                 => 'వేగపు కొలమానం',
'exif-gpsspeed'                    => 'GPS రిసీవరు వేగం',
'exif-gpstrackref'                 => 'కదలిక దిశ కోసం మూలం',
'exif-gpstrack'                    => 'కదలిక యొక్క దిశ',
'exif-gpsimgdirectionref'          => 'బొమ్మ దిశ కోసం మూలం',
'exif-gpsimgdirection'             => 'బొమ్మ యొక్క దిశ',
'exif-gpsmapdatum'                 => 'వాడిన జియోడెటిక్ సర్వే డేటా',
'exif-gpsdestlatituderef'          => 'గమ్యస్థాన రేఖాంశం కోసం మూలం',
'exif-gpsdestlatitude'             => 'గమ్యస్థానం యొక్క అక్షాంశం',
'exif-gpsdestlongituderef'         => 'గమ్యస్థాన అక్షాంశం కోసం మూలం',
'exif-gpsdestlongitude'            => 'గమ్యస్థానం యొక్క రేఖాంశం',
'exif-gpsdestbearingref'           => 'గమ్యస్థాన బేరింగు కోసం మూలం',
'exif-gpsdestbearing'              => 'గమ్యస్థానం బేరింగు',
'exif-gpsdestdistanceref'          => 'గమ్యస్థానానీ ఉన్న దూరం కోసం మూలం',
'exif-gpsdestdistance'             => 'గమ్యస్థానానికి దూరం',
'exif-gpsprocessingmethod'         => 'GPS ప్రాసెసింగు పద్ధతి పేరు',
'exif-gpsareainformation'          => 'GPS ప్రదేశం యొక్క పేరు',
'exif-gpsdatestamp'                => 'GPS తేదీ',
'exif-gpsdifferential'             => 'GPS తేడా సవరణ',

# EXIF attributes
'exif-compression-1' => 'కుదించని',

'exif-unknowndate' => 'అజ్ఞాత తేదీ',

'exif-orientation-1' => 'సాధారణ', # 0th row: top; 0th column: left
'exif-orientation-2' => 'క్షితిజ సమాంతరంగా తిరగేసాం', # 0th row: top; 0th column: right
'exif-orientation-3' => '180° తిప్పాం', # 0th row: bottom; 0th column: right
'exif-orientation-4' => 'నిలువుగా తిరగేసాం', # 0th row: bottom; 0th column: left
'exif-orientation-5' => 'అపసవ్య దిశలో 90° తిప్పి, నిలువుగా తిరగేసాం', # 0th row: left; 0th column: top
'exif-orientation-6' => 'సవ్యదిశలో 90° తిప్పాం', # 0th row: right; 0th column: top
'exif-orientation-7' => 'సవ్యదిశలో 90° తిప్పి, నిలువుగా తిరగేసాం', # 0th row: right; 0th column: bottom
'exif-orientation-8' => 'అపసవ్యదిశలో 90° తిప్పాం', # 0th row: left; 0th column: bottom

'exif-planarconfiguration-1' => 'స్థూల ఆకృతి',
'exif-planarconfiguration-2' => 'సమతల ఆకృతి',

'exif-componentsconfiguration-0' => 'లేదు',

'exif-exposureprogram-0' => 'అనిర్వచితం',
'exif-exposureprogram-1' => 'చేతితో',
'exif-exposureprogram-2' => 'మామూలు ప్రోగ్రాము',
'exif-exposureprogram-3' => 'ఎపర్చరు ప్రాముఖ్యత',
'exif-exposureprogram-4' => 'షట్టరు ప్రాముఖ్యత',
'exif-exposureprogram-5' => 'సృజనాత్మక ప్రోగ్రాము (క్షేత్రపు లోతువైపు మొగ్గుతో)',
'exif-exposureprogram-6' => 'చర్య ప్రోగ్రాము (షట్టర్ వేగం వైపు మొగ్గుతో)',
'exif-exposureprogram-7' => 'పోర్ట్రైటు పద్ధతి (నేపథ్యం దృశ్యంలోకి రాకుండా క్లోజప్ ఫోటోలు)',
'exif-exposureprogram-8' => 'విస్తృత పద్ధతి (నేపథ్యం దృశ్యంలోకి వస్తూ ఉండే విస్తృత ఫోటోలు)',

'exif-subjectdistance-value' => '$1 మీటర్లు',

'exif-meteringmode-0'   => 'అజ్ఞాతం',
'exif-meteringmode-1'   => 'సగటు',
'exif-meteringmode-2'   => 'CenterWeightedAverage',
'exif-meteringmode-3'   => 'స్థలం',
'exif-meteringmode-4'   => 'బహుళస్థలం',
'exif-meteringmode-5'   => 'సరళి',
'exif-meteringmode-6'   => 'పాక్షికం',
'exif-meteringmode-255' => 'ఇతర',

'exif-lightsource-0'   => 'తెలియదు',
'exif-lightsource-1'   => 'సూర్యకాంతి',
'exif-lightsource-2'   => 'ఫ్లోరోసెంట్',
'exif-lightsource-3'   => 'టంగ్‌స్టన్ (మామూలు బల్బు)',
'exif-lightsource-4'   => 'ఫ్లాష్',
'exif-lightsource-9'   => 'ఆహ్లాద వాతావరణం',
'exif-lightsource-10'  => 'మేఘావృతం',
'exif-lightsource-11'  => 'నీడ',
'exif-lightsource-12'  => 'పగటి వెలుగు ఫ్లోరోసెంట్ (D 5700 – 7100K)',
'exif-lightsource-13'  => 'పగటి తెలుపు ఫ్లోరోసెంట్ (N 4600 – 5400K)',
'exif-lightsource-14'  => 'చల్లని తెలుపు ఫ్లోరోసెంట్ (W 3900 – 4500K)',
'exif-lightsource-15'  => 'తెల్లని ఫ్లోరోసెంట్ (WW 3200 – 3700K)',
'exif-lightsource-17'  => 'ప్రామాణిక కాంతి A',
'exif-lightsource-18'  => 'ప్రామాణిక కాంతి B',
'exif-lightsource-19'  => 'ప్రామాణిక కాంతి C',
'exif-lightsource-24'  => 'ISO స్టూడియోలోని బల్బు వెలుతురు',
'exif-lightsource-255' => 'ఇతర కాంతి మూలం',

'exif-focalplaneresolutionunit-2' => 'అంగుళాలు',

'exif-sensingmethod-1' => 'అనిర్వచితం',
'exif-sensingmethod-2' => 'ఒక-చిప్పున్న రంగును గుర్తించే సెన్సారు',
'exif-sensingmethod-3' => 'రెండు-చిప్పులున్న రంగును గుర్తించే సెన్సారు',
'exif-sensingmethod-4' => 'మూడు-చిప్పులున్న రంగును గుర్తించే సెన్సారు',
'exif-sensingmethod-5' => 'వర్ణ అనుక్రమ సీమ సెన్సర్',
'exif-sensingmethod-7' => 'త్రిసరళరేఖా సెన్సర్',
'exif-sensingmethod-8' => 'వర్ణ అనుక్రమ రేఖా సెన్సర్',

'exif-scenetype-1' => 'ఎటువంటి హంగులూ లేకుండా ఫొటోతీయబడిన బొమ్మ',

'exif-customrendered-0' => 'సాధారణ ప్రక్రియ',
'exif-customrendered-1' => 'ప్రత్యేక ప్రక్రియ',

'exif-exposuremode-0' => 'ఆటోమాటిక్ ఎక్స్పోజరు',
'exif-exposuremode-1' => 'అమర్చిన ఎక్స్పోజరు',
'exif-exposuremode-2' => 'వెలుతురుబట్టి అంచలవారీగా మారింది',

'exif-whitebalance-0' => 'ఆటోమాటిక్ తెలుపు సంతులనం',
'exif-whitebalance-1' => 'అమర్చిన తెలుపు సంతులనం',

'exif-scenecapturetype-0' => 'ప్రామాణిక',
'exif-scenecapturetype-1' => 'ప్రకృతిదృశ్యం',
'exif-scenecapturetype-2' => 'వ్యక్తి చిత్రణ',
'exif-scenecapturetype-3' => 'రాత్రి దృశ్యం',

'exif-gaincontrol-0' => 'ఏదీ కాదు',
'exif-gaincontrol-1' => 'చిన్న గెయిన్ పెంపు',
'exif-gaincontrol-2' => 'పెద్ద గెయిన్ పెంపు',
'exif-gaincontrol-3' => 'చిన్న గెయిన్ తగ్గింపు',
'exif-gaincontrol-4' => 'పెద్ద గెయిన్ తగ్గింపు',

'exif-contrast-0' => 'సాధారణ',
'exif-contrast-1' => 'మృదువు',
'exif-contrast-2' => 'కఠినం',

'exif-saturation-0' => 'సాధారణ',
'exif-saturation-1' => 'రంగులు ముద్దలు ముద్దలుగా తయారవ్వలేదు',
'exif-saturation-2' => 'రంగులు ముద్దలు ముద్దలుగా తయారయ్యాయి',

'exif-sharpness-0' => 'సాధారణ',
'exif-sharpness-1' => 'మృదువు',
'exif-sharpness-2' => 'కఠినం',

'exif-subjectdistancerange-0' => 'అజ్ఞాతం',
'exif-subjectdistancerange-1' => 'మాక్రో',
'exif-subjectdistancerange-2' => 'దగ్గరి దృశ్యం',
'exif-subjectdistancerange-3' => 'దూరపు దృశ్యం',

# Pseudotags used for GPSLatitudeRef and GPSDestLatitudeRef
'exif-gpslatitude-n' => 'ఉత్తర అక్షాంశం',
'exif-gpslatitude-s' => 'దక్షిణ అక్షాంశం',

# Pseudotags used for GPSLongitudeRef and GPSDestLongitudeRef
'exif-gpslongitude-e' => 'తూర్పు రేఖాంశం',
'exif-gpslongitude-w' => 'పశ్చిమ రేఖాంశం',

'exif-gpsstatus-a' => 'కొలత జరుగుతూంది',
'exif-gpsstatus-v' => 'కొలత ఇంటర్‌ఆపరేటబిలిటీ',

'exif-gpsmeasuremode-2' => 'ద్వైమానిక కొలమానం',
'exif-gpsmeasuremode-3' => 'త్రిదిశాత్మక కొలమానం',

# Pseudotags used for GPSSpeedRef and GPSDestDistanceRef
'exif-gpsspeed-k' => 'గంటకి కిలోమీటర్లు',
'exif-gpsspeed-m' => 'గంటకి మైళ్ళు',
'exif-gpsspeed-n' => 'ముడులు',

# Pseudotags used for GPSTrackRef, GPSImgDirectionRef and GPSDestBearingRef
'exif-gpsdirection-t' => 'వాస్తవ దిశ',
'exif-gpsdirection-m' => 'అయస్కాంత దిశ',

# External editor support
'edit-externally'      => 'బయటి అప్లికేషను వాడి ఈ ఫైలును మార్చు',
'edit-externally-help' => 'మరింత సమాచారం కొరకు [http://www.mediawiki.org/wiki/Manual:External_editors సెటప్‌ సూచనలు] చూడండి.',

# 'all' in various places, this might be different for inflected languages
'recentchangesall' => 'అన్నీ',
'imagelistall'     => 'అన్నీ',
'watchlistall2'    => 'అన్నీ',
'namespacesall'    => 'అన్నీ',
'monthsall'        => 'అన్నీ',

# E-mail address confirmation
'confirmemail'             => 'ఈ-మెయిలు చిరునామా ధృవీకరించండి',
'confirmemail_noemail'     => '[[Special:Preferences|మీ అభిరుచులలో]] ఈమెయిలు అడ్రసు పెట్టి లేదు.',
'confirmemail_text'        => '{{SITENAME}}లో ఈ-మెయిలు అంశాల్ని వాడుకునే ముందు మీ ఈ-మెయిలు చిరునామాను నిర్ధారించవలసిన అవసరం ఉంది.
కింది మీటను నొక్కగానే మీరిచ్చిన చిరునామాకు ధృవీకరణ మెయిలు వెళ్తుంది. ఆ మెయిల్లో ఒక సంకేతం కలిగిన ఒక లింకు ఉంటుంది; ఆ లింకును మీ బ్రౌజరులో తెరవండి. ఈ-మెయిలు చిరునామా ధృవీకరణ అయిపోతుంది.',
'confirmemail_pending'     => '<div class="error">
ఒక నిర్ధారణ కోడుని మీకు ఇప్పటికే ఈ-మెయిల్లో పంపించాం; కొద్దిసేపటి క్రితమే మీ ఖాతా సృష్టించి ఉంటే, కొత్త కొడు కోసం అభ్యర్థన పంపేముందు కొద్ది నిమిషాలు వేచిచూడండి.
</div>',
'confirmemail_send'        => 'ఒక ధృవీకరణ సంకేతాన్ని పంపించు',
'confirmemail_sent'        => 'ధృవీకరణ ఈ-మెయిలును పంపబడినది',
'confirmemail_oncreate'    => 'మీ ఈ-మెయిలు అడ్రసుకు ధృవీకరణ కోడును పంపించాం.
లాగిన్ అయ్యేందుకు ఆ కోడు అవసరం లేదు గానీ, వికీలో ఈ-మెయిలు ఆధారిత అంశాలను సచేతనం చేసేముందు దాన్ని ఇవ్వవలసి ఉంటుంది.',
'confirmemail_sendfailed'  => 'ధృవీకరణ మెయిలును పంపలేకపోయాము. చిరునామాలో తప్పులున్నాయేమో చూసుకోండి.

ఆ మెయిలరు ఇలా చెప్పింది: $1',
'confirmemail_invalid'     => 'ధృవీకరణ సంకేతం సరైనది కాదు. దానికి కాలం చెల్లి ఉండవచ్చు.',
'confirmemail_needlogin'   => 'మీ ఈమెయిలు చిరునామాను దృవపరచటానికి $1.',
'confirmemail_success'     => 'మీ ఈ-మెయిలు చిరునామా ధృవీకరణ అయింది. ఇక లాగిన్ అయి, వికీని అస్వాదించండి.',
'confirmemail_loggedin'    => 'మీ ఈ-మెయిలు చిరునామా ఇప్పుడు రూఢి అయింది.',
'confirmemail_error'       => 'మీ ధృవీకరణను భద్రపరచడంలో ఏదో లోపం జరిగింది.',
'confirmemail_subject'     => '{{SITENAME}} ఈ-మెయిలు చిరునామా ధృవీకరణ',
'confirmemail_body'        => 'ఈ ఈ-మెయిలు చిరునామాతో $1 ఐ.పి. అడ్రసు నుండి ఎవరో, బహుశా మీరే, {{SITENAME}}లో "$2" అనే ఎకౌంటును సృష్టించారు.

ఈ ఎకౌంటు నిజంగా మీదేనని ధృవీకరించేందుకు, అలాగే {{SITENAME}}లో 
ఈ-మెయిలు‌ను వాడటం మొదలుపెట్టేందుకు కింది లింకును మీ బ్రౌజరులో తెరవండి:

$3

ఒకవేళ అది మీరు *కాకపోతే*, ఈ-మెయిలు చిరునామా నిర్ధారణని రద్దు చేసేందుకు ఈ క్రింది లింకును అనుసరించండి:

$5

ఈ నిర్ధారణ కోడుకి $4తో కాలం చెల్లుతుంది.',
'confirmemail_invalidated' => 'ఈ-మెయిలు చిరునామా నిర్ధారణని రద్దుచేసాం',
'invalidateemail'          => 'ఈ-మెయిలు నిర్ధారణని రద్దుచేయండి',

# Scary transclusion
'scarytranscludedisabled' => '[ఇతరవికీల మూసలను ఇక్కడ వాడటాన్ని అనుమతించటం లేదు]',
'scarytranscludefailed'   => '[$1 కొరకు మూసను తీసుకురావటం విఫలమైంది]',
'scarytranscludetoolong'  => '[URL మరీ పొడుగ్గా ఉంది]',

# Trackbacks
'trackbackbox'      => '<div id="mw_trackbacks">
ఈ పేజీకి ట్రాక్&zwnj;బాకులు:<br />
$1
</div>',
'trackbackremove'   => ' ([$1 తొలగించు])',
'trackbacklink'     => 'ట్రాక్&zwnj;బాక్',
'trackbackdeleteok' => 'ట్రాక్‌బాక్&zwnj;ని విజయవంతంగా తొలగించాం.',

# Delete conflict
'deletedwhileediting' => "'''హెచ్చరిక''': మీరు మార్పులు చేయటం మొదలుపెట్టాక ఈ పేజీ తొలగించబడింది!",
'confirmrecreate'     => "మీరు పేజీ రాయటం మొదలుపెట్టిన తరువాత [[User:$1|$1]] ([[User talk:$1|చర్చ]]) దానిని తీసివేసారు. దానికి ఈ కారణం ఇచ్చారు: ''$2''
మీరు ఈ పేజీని మళ్ళీ తయారు చేయాలనుకుంటున్నారని ధృవీకరించండి.",
'recreate'            => 'మళ్లీ సృష్టించు',

# HTML dump
'redirectingto' => '[[:$1]]కు మళ్ళించబడుతుంది...',

# action=purge
'confirm_purge'        => 'ఈ పేజీ యొక్క పాత కాపీని తొలగించమంటారా?

$1',
'confirm_purge_button' => 'సరే',

# AJAX search
'searchcontaining' => "''$1'' ను కలిగి ఉన్న వ్యాసాల కోసం వెతుకు.",
'searchnamed'      => "''$1'' పేరుతో ఉన్న వ్యాసాల కోసం వెతుకు.",
'articletitles'    => "''$1''తొ మొదలయ్యే వ్యాసాలు",
'hideresults'      => 'ఫలితాలను దాచు',
'useajaxsearch'    => 'వెతకేటప్పుడు AJAXను ఉపయోగించు',

# Multipage image navigation
'imgmultipageprev' => '← మునుపటి పేజీ',
'imgmultipagenext' => 'తరువాతి పేజీ →',
'imgmultigo'       => 'వెళ్ళు!',
'imgmultigoto'     => '$1వ పేజీకి వెళ్ళు',

# Table pager
'ascending_abbrev'         => 'ఆరోహణ',
'descending_abbrev'        => 'అవరోహణ',
'table_pager_next'         => 'తరువాతి పేజీ',
'table_pager_prev'         => 'ముందరి పేజీ',
'table_pager_first'        => 'మొదటి పేజీ',
'table_pager_last'         => 'చివరి పేజీ',
'table_pager_limit'        => 'పేజీకి $1 ఐటములను చూపించు',
'table_pager_limit_submit' => 'వెళ్ళు',
'table_pager_empty'        => 'ఫలితాలు లేవు',

# Auto-summaries
'autosumm-blank'   => 'పేజీలోని సమాచారాన్నంతటినీ తీసేస్తున్నారు',
'autosumm-replace' => "పేజీని '$1' తో మారుస్తున్నాం",
'autoredircomment' => '[[$1]]కు మళ్ళించబడుతుంది',
'autosumm-new'     => 'కొత్త పేజీ: $1',

# Live preview
'livepreview-loading' => 'లోడవుతుంది…',
'livepreview-ready'   => 'లోడవుతోంది… సిద్ధం!',
'livepreview-failed'  => 'టైపు చేస్తుండగా ప్రీవ్యూ సృష్టించడం కుదరలేదు! మామూలు ప్రీవ్యూను ప్రయత్నించండి.',
'livepreview-error'   => 'అనుసంధానం కుదరలేదు: $1 "$2". మామూలు ప్రీవ్యూ ప్రయత్నించి చూడండి.',

# Friendlier slave lag warnings
'lag-warn-normal' => '$1 {{PLURAL:$1|క్షణం|క్షణాల}} లోపు జరిగిన మార్పులు ఈ జాబితాలో కనిపించకపోవచ్చు.',
'lag-warn-high'   => 'డేటాబేసు సర్వరుపై వత్తిడి బాగా పెరగటం వలన సమాచారం రావటం ఆలస్యం అవుతుంది, $1 సెకండ్లలోపు జరిగిన మార్పులు ఈ జాబితాలో కనిపించకపోవచ్చు.',

# Watchlist editor
'watchlistedit-numitems'       => 'మీ వీక్షణ జాబితాలో చర్చాపేజీలు కాకుండా {{PLURAL:$1|1 శీర్షిక|$1 శీర్షికలు}} ఉన్నాయి.',
'watchlistedit-noitems'        => 'మీ వీక్షణ జాబితాలో శీర్షికలేమీ లేవు.',
'watchlistedit-normal-title'   => 'వీక్షణ జాబితాను మార్చు',
'watchlistedit-normal-legend'  => 'వీక్షణ జాబితా నుండి శీర్షికలను తీసివెయ్యి',
'watchlistedit-normal-explain' => 'మీ వీక్షణ జాబితాలోని పేజీల శీర్షికలను కింద చూపించాం. ఏదైనా శీర్షికను తీసివేసేందుకు దాని పక్కనున్న పెట్టెను చెక్ చేసి, శీర్షికలను తీసివెయ్యి ని నొక్కండి. అంతేకాక, [[ప్రత్యేక:Watchlist/raw|ముడి జాబితాను మార్చవచ్చు]] లేదా [[ప్రత్యేక:Watchlist/clear|మొత్తం అన్ని శీర్షికలను తీసివెయ్యవచ్చు]].',
'watchlistedit-normal-submit'  => 'శీర్షికలను తీసివెయ్యి',
'watchlistedit-normal-done'    => 'మీ వీక్షణ జాబితా నుండి {{PLURAL:$1|1 శీర్షికను|$1 శీర్షికలను}} తీసివేసాం:',
'watchlistedit-raw-title'      => 'ముడి వీక్షణ జాబితాను మార్చు',
'watchlistedit-raw-legend'     => 'ముడి వీక్షణ జాబితాను మార్చు',
'watchlistedit-raw-explain'    => 'మీ వీక్షణ జాబితాలోని శీర్షికలను కింద చూపించాం. ఈ జాబితాలో ఉన్నవాటిని తీసివెయ్యడం గానీ, కొత్తవాటిని చేర్చడం గానీ (వరుసకొకటి చొప్పున) చెయ్యవచ్చు. అయ్యాక, వీక్షణ జాబితాను తాజాకరించు ను నొక్కండి.
	[[ప్రత్యేక:Watchlist/edit|మామూలు ఎడిటరును కూడా వాడవచ్చు]].',
'watchlistedit-raw-titles'     => 'శీర్షికలు:',
'watchlistedit-raw-submit'     => 'వీక్షణ జాబితాను తాజాకరించు',
'watchlistedit-raw-done'       => 'మీ వీక్షణ జాబితాను తాజాకరించాం.',
'watchlistedit-raw-added'      => '{{PLURAL:$1|1 శీర్షికను|$1 శీర్షికలను}} చేర్చాం:',
'watchlistedit-raw-removed'    => '{{PLURAL:$1|1 శీర్షికను|$1 శీర్షికలను}} తీసివేశాం:',

# Watchlist editing tools
'watchlisttools-view' => 'సంబంధిత మార్పులను చూపించు',
'watchlisttools-edit' => 'వీక్షణ జాబితాను చూపించు, మార్చు',
'watchlisttools-raw'  => 'ముడి వీక్షణ జాబితాలో మార్పులు చెయ్యి',

# Core parser functions
'unknown_extension_tag' => '"$1" అనే ట్యాగు ఈ పొడిగింతకు తెలియదు',

# Special:Version
'version'                          => 'సంచిక', # Not used as normal message but as header for the special page itself
'version-extensions'               => 'స్థాపించిన పొడగింతలు',
'version-specialpages'             => 'ప్రత్యేక పేజీలు',
'version-parserhooks'              => 'పార్సరు కొక్కాలు',
'version-variables'                => 'చరరాసులు(వేరియబుల్స్)',
'version-other'                    => 'ఇతర',
'version-mediahandlers'            => 'మీడియాను ఫైళ్లను నడిపించే పొడిగింపులు',
'version-hooks'                    => 'కొక్కాలు',
'version-extension-functions'      => 'పొడిగింపు ఫంక్షనులు',
'version-parser-extensiontags'     => 'పార్సరు పొడిగింపు ట్యాగులు',
'version-parser-function-hooks'    => 'పార్సరుకు కొక్కాలు',
'version-skin-extension-functions' => 'తొడుగును మెరుగుపరిచే ఫంక్షనులు',
'version-hook-name'                => 'కొక్కెం పేరు',
'version-hook-subscribedby'        => 'ఉపయోగిస్తున్నవి',
'version-version'                  => 'సంచిక',
'version-license'                  => 'లైసెన్సు',
'version-software'                 => 'ప్రవేశపెట్టిన సాఫ్టువేర్లు',
'version-software-product'         => 'ప్రోడక్టు',
'version-software-version'         => 'వెర్షను',

# Special:FilePath
'filepath'         => 'పూర్తి చిరునామా',
'filepath-page'    => '{{ns:image}}:',
'filepath-submit'  => 'చిరునామా',
'filepath-summary' => 'ఈ ప్రత్యేక పేజీలో ఫైళ్ల పేర్లు ఇస్తే వాటి పూర్తి చిరునామలు వస్తాయి. బొమ్మలైతే వాటి పూర్తి సైజుతో తెరుచుకుంటాయి, బొమ్మలు కాని ఇతర ఫైళ్లు వాటి అనుబంధ ప్రోగ్రాములతో తెరుచుకుంటాయి.

పేరుకు ముందు "{{ns:image}}:" అని చేర్చవద్దు.',

# Special:FileDuplicateSearch
'fileduplicatesearch'          => 'ఫైళ్ల మారుప్రతుల కోసం వెతుకు',
'fileduplicatesearch-summary'  => 'మారుప్రతుల కోసం ఫైళ్ల హాష్ విలువ ఆధారంగా వెతుకు.
ఫైలు పేరుకు ముందు "{{ns:image}}:"ను చేర్చకుండా ఇవ్వండి.',
'fileduplicatesearch-legend'   => 'మారుప్రతి కొరకు వెతుకు',
'fileduplicatesearch-filename' => 'ఫైలు పేరు:',
'fileduplicatesearch-submit'   => 'వెతుకు',
'fileduplicatesearch-info'     => '$1 × $2 పిక్సెళ్లు<br />ఫైలు సైజు: $3<br />మైము రకం: $4',
'fileduplicatesearch-result-1' => '"$1" అనే పేరుగల ఫైలుకు సరిసమానమైన మారుప్రతులు లేవు.',
'fileduplicatesearch-result-n' => '"$1" అనే పేరుగల ఫైలుకు {{PLURAL:$2|ఒక మారుప్రతి ఉంది|$2 మారుప్రతులున్నాయి}}.',

# Special:SpecialPages
'specialpages'                   => 'ప్రత్యేక పేజీలు',
'specialpages-note'              => '----
* మామూలు ప్రత్యేక పేజీలు.
* <span class="mw-specialpagerestricted">నియంత్రిత ప్రత్యేక పేజీలు.</span>',
'specialpages-group-maintenance' => 'నిర్వహణా నివేదికలు',
'specialpages-group-other'       => 'ఇతర ప్రత్యేక పేజీలు',
'specialpages-group-login'       => 'ప్రవేశించండి / నమోదుచేసుకోండి',
'specialpages-group-changes'     => 'ఇటీవలి మార్పులు మరియు దినచర్యలు',
'specialpages-group-media'       => 'మాధ్యమ నివేదికలు మరియు ఎగుమతులు',
'specialpages-group-users'       => 'వాడుకర్లు మరియు హక్కులు',
'specialpages-group-highuse'     => 'అధిక వాడుక పేజీలు',
'specialpages-group-pages'       => 'పేజీల జాబితా',
'specialpages-group-pagetools'   => 'పేజీ పనిముట్లు',
'specialpages-group-wiki'        => 'వికీ డాటా మరియు పనిముట్లు',
'specialpages-group-redirects'   => 'ప్రత్యేక పేజీల దారిమార్పులు',
'specialpages-group-spam'        => 'స్పామ్ పనిముట్లు',

# Special:BlankPage
'blankpage'              => 'ఖాళీ పేజీ',
'intentionallyblankpage' => 'బెంచిమార్కింగు, మొదలగు వాటికై ఈ పేజీని కావాలనే ఖాళీగా వదిలాము.',

);
