<?php
/** Georgian (ქართული)
 *
 * @ingroup Language
 * @file
 *
 * @author Alsandro
 * @author Malafaya
 * @author Sopho
 * @author ka.wikipedia.org sysops
 * @author לערי ריינהארט
 */

$namespaceNames = array(
	NS_MEDIA            => 'მედია',
	NS_SPECIAL          => 'სპეციალური',
	NS_MAIN             => '',
	NS_TALK             => 'განხილვა',
	NS_USER             => 'მომხმარებელი',
	NS_USER_TALK        => 'მომხმარებელი_განხილვა',
	# NS_PROJECT set by $wgMetaNamespace
	NS_PROJECT_TALK     => '$1_განხილვა',
	NS_IMAGE            => 'სურათი',
	NS_IMAGE_TALK       => 'სურათი_განხილვა',
	NS_MEDIAWIKI        => 'მედიავიკი',
	NS_MEDIAWIKI_TALK   => 'მედიავიკი_განხილვა',
	NS_TEMPLATE         => 'თარგი',
	NS_TEMPLATE_TALK    => 'თარგი_განხილვა',
	NS_HELP             => 'დახმარება',
	NS_HELP_TALK        => 'დახმარება_განხილვა',
	NS_CATEGORY         => 'კატეგორია',
	NS_CATEGORY_TALK    => 'კატეგორია_განხილვა'
);

$linkPrefixExtension = true;

$linkTrail = '/^([a-zაბგდევზთიკლმნოპჟრსტუფქღყშჩცძწჭხჯჰ“»]+)(.*)$/sDu';

# Note to translators:
#   Please include the English words as synonyms.  This allows people
#   from other wikis to contribute more easily.
#
$magicWords = array(
	'redirect' => array( 0   , '#REDIRECT', '#გადამისამართება' ),
);

$messages = array(
# User preference toggles
'tog-underline'               => 'ხაზი გაუსვი ბმულებს:',
'tog-highlightbroken'         => 'აჩვენე არარსებული ბმულები <a href="" class="new">როგორც ეს</a> (ალტერნატივა: როგორც ეს<a href="" class="internal">?</a>).',
'tog-justify'                 => 'გაასწორე პარაგრაფები',
'tog-hideminor'               => 'დამალე მცირე რედაქტირება ბოლო ცვლილებებში',
'tog-extendwatchlist'         => 'განავრცე კონტროლის სია ყველა დაკავშირებული ცვლილების საჩვენებლად',
'tog-usenewrc'                => 'გაზარდე ბოლო ცვლილებების სია (ჯავასკრიპტი)',
'tog-numberheadings'          => 'ავტომატურად დანომრე ქვესათაურები',
'tog-showtoolbar'             => 'რედაქტირების ინსტრუმენტების ჩვენება (ჯავასკრიპტი)',
'tog-editondblclick'          => 'გვერდების რედაქტირება ორმაგი დაწკაპუნებით (ჯავასკრიპტი)',
'tog-editsection'             => 'სექციის რედაქტირების ნებართვა [რედაქტირებული] ბმულების გავლით',
'tog-editsectiononrightclick' => 'სექციის რედაქტირების ნებართვა მარჯვენა ღილაკზე დაჭერით<br />სექციის სათაურებზე (ჯავასკრიპტი)',
'tog-showtoc'                 => 'აჩვენე სარჩევი (სამ ქვესათაურზე მეტის მქონე გვერდებისთვის)',
'tog-rememberpassword'        => 'სესიებს შორის პაროლის დამახსოვრება',
'tog-editwidth'               => 'რედაქტირების დაფას სრული სიგანე აქვს',
'tog-watchcreations'          => 'დაამატე ჩემი კონტროლის სიას ჩემს მიერ შექმნილი გვერდები',
'tog-watchdefault'            => 'დაამატე ჩემი კონტროლის სიას ჩემს მიერ რედაქტირებული გვერდები',
'tog-watchmoves'              => 'ჩასვი გვერდები, რომლებიც მე გადამაქვს, ჩემს კონტროლის სიაში',
'tog-watchdeletion'           => 'ჩასვი გვერდები, რომლებსაც მე ვშლი, ჩემს კონტროლის სიაში',
'tog-minordefault'            => 'ყველა რედაქტირების მონიშვნა, როგორც უმნიშვნელო, უპირობოდ',
'tog-previewontop'            => 'წინასწარი გადახედვის ჩვენება რედაქტირების დაფამდე',
'tog-previewonfirst'          => 'წინასწარი ჩვენება პირველივე რედაქტირებაზე',
'tog-enotifwatchlistpages'    => 'მომწერე ელ. ფოსტით, როცა გვერდი, რომელსაც მე ვაკონტროლებ, შეიცვლება',
'tog-enotifusertalkpages'     => 'მომწერე თუ ჩემი განხილვის გვერდი შეიცვლება',
'tog-enotifminoredits'        => 'მომწერე ასევე გვერდების მცირე რედაქტირებისას',
'tog-enotifrevealaddr'        => 'აჩვენე ჩემი ელ-ფოსტის მისამართი შეტყობინების წერილებში',
'tog-shownumberswatching'     => 'მაკონტროლებელ მომხმარებელთა რიცხვის ჩვენება',
'tog-fancysig'                => 'გამოუყენებელი ხელმოწერები (ავტომატური ბმულის გარეშე)',
'tog-externaleditor'          => 'გამოიყენეთ გარე რედაქტორი სტანდარტული ფორმით (მხოლოდ ექსპერტებისთვის, მოითხოვს სპეციალურ კონფიგურაციას თქვენს კომპიუტერში)',
'tog-showjumplinks'           => 'დამხმარე ბმულების "გადასვლა -კენ" ჩართვა',
'tog-uselivepreview'          => 'გამოიყენეთ ახალი წინასწარი გადახედვა (ჯავასკრიპტი)  (ექსპერიმენტული)',
'tog-forceeditsummary'        => 'გამაფრთხილე ცარიელი რედაქტირების რეზიუმეს შემთხვევაში',
'tog-watchlisthideown'        => 'დამალე ჩემი რედაქტირება კონტროლის სიაში',
'tog-watchlisthidebots'       => 'დამალე რობოტის რედაქტირება კონტროლის სიაში',
'tog-watchlisthideminor'      => 'დამალეთ საკონტროლო სიიდან მცირე რედაქტირებები',
'tog-ccmeonemails'            => 'გამომიგზავნე ელფოსტების ასლები, რომლებსაც მე სხვა მომხმარებლებს ვუგზავნი',
'tog-diffonly'                => 'დამალე გვერდის შიგთავსი ცვლილების ქვევით',
'tog-showhiddencats'          => 'დამალული კატეგორიების ჩვენება',

'underline-always'  => 'მუდამ',
'underline-never'   => 'არასდროს',
'underline-default' => 'ბრაუზერის უპირობო არჩევანი',

'skinpreview' => '(წინასწარი გადახედვა)',

# Dates
'sunday'        => 'კვირა',
'monday'        => 'ორშაბათი',
'tuesday'       => 'სამშაბათი',
'wednesday'     => 'ოთხშაბათი',
'thursday'      => 'ხუთშაბათი',
'friday'        => 'პარასკევი',
'saturday'      => 'შაბათი',
'sun'           => 'კვი',
'mon'           => 'ორშ',
'tue'           => 'სამ',
'wed'           => 'ოთხ',
'thu'           => 'ხუთ',
'fri'           => 'პარ',
'sat'           => 'შაბ',
'january'       => 'იანვარი',
'february'      => 'თებერვალი',
'march'         => 'მარტი',
'april'         => 'აპრილი',
'may_long'      => 'მაისი',
'june'          => 'ივნისი',
'july'          => 'ივლისი',
'august'        => 'აგვისტო',
'september'     => 'სექტემბერი',
'october'       => 'ოქტომბერი',
'november'      => 'ნოემბერი',
'december'      => 'დეკემბერი',
'january-gen'   => 'იანვარი',
'february-gen'  => 'თებერვალი',
'march-gen'     => 'მარტის',
'april-gen'     => 'აპრილი',
'may-gen'       => 'მაისის',
'june-gen'      => 'ივნისის',
'july-gen'      => 'ივლისის',
'august-gen'    => 'აგვისტო',
'september-gen' => 'სექტემბრის',
'october-gen'   => 'ოქტომბრის',
'november-gen'  => 'ნოემბერი',
'december-gen'  => 'დეკემბრის',
'jan'           => 'იან',
'feb'           => 'თებ',
'mar'           => 'მარ',
'apr'           => 'აპრ',
'may'           => 'მაი',
'jun'           => 'ივნ',
'jul'           => 'ივლ',
'aug'           => 'აგვ',
'sep'           => 'სექ',
'oct'           => 'ოქტ',
'nov'           => 'ნოე',
'dec'           => 'დეკ',

# Categories related messages
'pagecategories'           => '{{PLURAL:$1|კატეგორია|კატეგორიები}}',
'category_header'          => 'სტატიები კატეგორიაში "$1"',
'subcategories'            => 'ქვეკატეგორიები',
'category-media-header'    => 'მედია კატეგორიაში "$1"',
'category-empty'           => "''ეს კატეგორია ამჟამად გვერდებს ან მედიას არ შეიცავს.''",
'hidden-categories'        => 'დამალული {{PLURAL:$1|კატეგორია|კატეგორიები}}',
'hidden-category-category' => 'დამალული კატეგორიები', # Name of the category where hidden categories will be listed
'category-subcat-count'    => '{{PLURAL:$2|ეს კატეგორია შეიცავს მხოლოდ შემდეგ ქვეკატეგორიას.|ამ კატეგორიაში მოცემულია $1 ქვეკატეგორია $2-დან.}}',
'listingcontinuesabbrev'   => 'გაგრძ.',

'linkprefix'        => '/^(.*?)(„|«)$/sD',
'mainpagetext'      => "<big>'''მედიავიკი წარმატებით ჩაიტვირთა.'''</big>",
'mainpagedocfooter' => 'ვიკი პროგრამის გამოყენების ინფორმაციისთვის იხილეთ [http://meta.wikimedia.org/wiki/Help:Contents მომხმარებლის მეგზური].

== დაწყება ==

* [http://www.mediawiki.org/wiki/Manual:Configuration_settings კონფიგურაციის მაჩვენებლების სია]
* [http://www.mediawiki.org/wiki/Manual:FAQ MediaWiki FAQ]
* [http://lists.wikimedia.org/mailman/listinfo/mediawiki-announce მედიავიკის გამოცემის დაგზავნის სია]',

'about'          => 'შესახებ',
'article'        => 'სტატია',
'newwindow'      => '(ახალ ფანჯარაში)',
'cancel'         => 'გაუქმება',
'qbfind'         => 'მოძებნე',
'qbbrowse'       => 'გადახედე',
'qbedit'         => 'რედაქტირება',
'qbpageoptions'  => 'ეს გვერდი',
'qbpageinfo'     => 'კონტექსტი',
'qbmyoptions'    => 'ჩემი გვერდები',
'qbspecialpages' => 'სპეციალური გვერდები',
'moredotdotdot'  => 'ვრცლად...',
'mypage'         => 'ჩემი გვერდი',
'mytalk'         => 'ჩემი განხილვა',
'anontalk'       => 'ამ IP-ს განხილვა',
'navigation'     => 'ნავიგაცია',
'and'            => 'და',

# Metadata in edit box
'metadata_help' => 'მეტამონაცემები (იხ. [[Project:მეტამონაცემები|მეტამონაცემები]] განმარტებისთვის):',

'errorpagetitle'    => 'შეცდომა',
'returnto'          => 'დაბრუნდი $1-ზე.',
'tagline'           => '{{SITENAME}} გვერდიდან',
'help'              => 'დახმარება',
'search'            => 'ძიება',
'searchbutton'      => 'ძიება',
'go'                => 'სტატია',
'searcharticle'     => 'სტატია',
'history'           => 'გვერდის ისტორია',
'history_short'     => 'ისტორია',
'updatedmarker'     => 'განახლდა ჩემი ბოლო შემოსვლის შემდეგ',
'info_short'        => 'ინფორმაცია',
'printableversion'  => 'დასაბეჭდი ვერსია',
'permalink'         => 'მუდმივი ბმული',
'print'             => 'ამობეჭდე',
'edit'              => 'რედაქტირება',
'create'            => 'შექმნა',
'editthispage'      => 'გვერდის რედაქტირება',
'create-this-page'  => 'ამ გვერდის შექმნა',
'delete'            => 'წაშლა',
'deletethispage'    => 'გვერდის წაშლა',
'undelete_short'    => 'გააუქმე წაშლა {{PLURAL:$1|ერთი რედაქტირება|$1 რედაქტირება}}',
'protect'           => 'დაბლოკე',
'protect_change'    => 'შეცვალე დაცვა',
'protectthispage'   => 'დაბლოკე ეს გვერდი',
'unprotect'         => 'ბლოკის მოხსნა',
'unprotectthispage' => 'მოხსენი ბლოკი ამ გვერდზე',
'newpage'           => 'ახალი გვერდი',
'talkpage'          => 'მოცემული გვერდის განხილვა',
'talkpagelinktext'  => 'განხილვა',
'specialpage'       => 'სპეციალური გვერდი',
'personaltools'     => 'პირადი ხელსაწყოები',
'postcomment'       => 'კომენტარის გაკეთება',
'articlepage'       => 'სტატიის ნახვა',
'talk'              => 'დისკუსია',
'views'             => 'გადახედვა',
'toolbox'           => 'ინსტრუმენტები',
'userpage'          => 'გადახედე მომხმარებლის გვერდს',
'projectpage'       => 'დაათვალიერე პროექტის გვერდი',
'imagepage'         => 'დაათვალიერე ფაილის გვერდი',
'mediawikipage'     => 'გადახედე შეტყობინების გვერდს',
'templatepage'      => 'გადახედე თარგის გვერდს',
'viewhelppage'      => 'გადახედე დახმარების გვერდს',
'categorypage'      => 'გადახედე კატეგორიის გვერდს',
'viewtalkpage'      => 'იხილე დისკუსია',
'otherlanguages'    => 'სხვა ენებზე',
'redirectedfrom'    => '(გადმომისამართდა $1-დან)',
'redirectpagesub'   => 'გადამისამართება გვერდზე',
'lastmodifiedat'    => 'ეს გვერდი ბოლოს განახლდა $2, $1.', # $1 date, $2 time
'viewcount'         => 'ეს გვერდი შემოწმდა {{PLURAL:$1|ერთხელ|$1-ჯერ}}.',
'protectedpage'     => 'დაბლოკილი გვერდი',
'jumpto'            => 'გადასვლა:',
'jumptonavigation'  => 'ნავიგაცია',
'jumptosearch'      => 'ძიება',

# All link text and link target definitions of links into project namespace that get used by other message strings, with the exception of user group pages (see grouppage) and the disambiguation template definition (see disambiguations).
'aboutsite'            => '{{SITENAME}}-ის შესახებ',
'aboutpage'            => 'Project:შესახებ',
'bugreports'           => 'ანგარიში შეცდომის შესახებ',
'bugreportspage'       => 'Project:ანგარიში შეცდომის შესახებ',
'copyrightpagename'    => 'ვიკიპედია საავტორო უფლებები',
'copyrightpage'        => '{{ns:project}}:საავტორო უფლებები',
'currentevents'        => 'მიმდინარე მოვლენები',
'currentevents-url'    => 'Project:მიმდინარე მოვლენები',
'disclaimers'          => 'პასუხისმგებლობის მოხსნა',
'disclaimerpage'       => 'Project::პასუხისმგებლობის უარყოფა',
'edithelp'             => 'დახმარება',
'edithelppage'         => 'Help:ტექსტის რედაქტირება (მარტივი)',
'faq'                  => 'ხშირი შეკითხვები',
'faqpage'              => 'Project:ხშირი შეკითხვები',
'helppage'             => 'Help:დახმარება',
'mainpage'             => 'მთავარი გვერდი',
'mainpage-description' => 'მთავარი გვერდი',
'policy-url'           => 'Project:პოლიტიკა',
'portal'               => 'საზოგადოების გვერდები',
'portal-url'           => 'Project:საზოგადოების გვერდები',
'privacy'              => 'ანონიმურობის პოლიტიკა',
'privacypage'          => 'Project:ანონიმურობის პოლიტიკა',

'badaccess'        => 'ნებართვის შეცდომა',
'badaccess-group0' => 'თქვენ არ გაქვთ მოთხოვნილი მოქმედების შესრულების უფლება',
'badaccess-group1' => 'მოთხოვნილი მოქმედების შესრულება შეუძლიათ $1 ჯგუფის მომხმარებლებს.',
'badaccess-group2' => 'მოთხოვნილი მოქმედების შესრულება შეუძლიათ $1 ჯგუფებიდან ერთერთში მყოფ მომხმარებლებს.',
'badaccess-groups' => 'მოთხოვნილი მოქმედების შესრულება შეუძლიათ $1 ჯგუფებიდან ერთერთში მყოფ მომხმარებლებს.',

'versionrequired'     => 'საჭიროა მედიავიკის ვერსია $1',
'versionrequiredtext' => 'მოცემული გვერდის გამოსაყენებლად საჭიროა მედიავიკის ვერსია $1. იხილეთ [[Special:Version|სპეციალური:ვერსია]]',

'ok'                      => 'კარგი',
'retrievedfrom'           => 'მოძიებულია "$1"-დან',
'youhavenewmessages'      => 'თქვენ გაქვთ $1 ($2).',
'newmessageslink'         => 'ახალი შეტყობინებები',
'newmessagesdifflink'     => 'განსხვავება წინა ვერსიასთან',
'youhavenewmessagesmulti' => 'თქვენ გაქვთ ახალი შეტყობინება $1-ზე',
'editsection'             => 'რედაქტირება',
'editold'                 => 'რედაქტირება',
'viewsourceold'           => 'წყაროს ჩვენება',
'editsectionhint'         => 'სექციის რედაქტირება: $1',
'toc'                     => 'სარჩევი',
'showtoc'                 => 'ჩვენება',
'hidetoc'                 => 'დამალვა',
'thisisdeleted'           => '$1-ის ჩვენება თუ აღდგენა?',
'viewdeleted'             => 'იხილე $1?',
'restorelink'             => '{{PLURAL:$1|ერთი წაშლილი რედაქტირება|$1 წაშლილი რედაქტირება}}',
'feedlinks'               => 'არხი:',
'site-rss-feed'           => '$1-ის არხი RSS',
'site-atom-feed'          => '$1-ის არხი Atom',
'page-rss-feed'           => '"$1"-ის არხი RSS',
'page-atom-feed'          => '"$1"-ის არხი Atom',

# Short words for each namespace, by default used in the namespace tab in monobook
'nstab-main'      => 'სტატია',
'nstab-user'      => 'მომხმარებლის გვერდი',
'nstab-media'     => 'მედიის გვერდი',
'nstab-special'   => 'სპეციალური',
'nstab-project'   => 'პროექტის გვერდი',
'nstab-image'     => 'ფაილი',
'nstab-mediawiki' => 'შეტყობინება',
'nstab-template'  => 'თარგი',
'nstab-help'      => 'დახმარება',
'nstab-category'  => 'კატეგორია',

# Main script and global functions
'nosuchaction'      => 'მოქმედება არ არსებობს',
'nosuchactiontext'  => 'მოქმედება მითითებული URL-ის მიერ
გაუგებარია ვიკისთვის',
'nosuchspecialpage' => 'სპეციალური გვერდი არ არსებობს',
'nospecialpagetext' => "<big>'''თქვენ არასწორი სპეციალური გვერდი მოითხოვეთ.'''</big>

სწორი სპეციალური გვერდების სია შეგიძლიათ იხილოთ აქ: [[Special:SpecialPages|{{int:specialpages}}]].",

# General errors
'error'                => 'შეცდომა',
'databaseerror'        => 'შეცდომა მონაცემთა ბაზაში',
'dberrortext'          => 'მონაცემთა ბაზის მოთხოვნაში აღმოჩენილია სინტაქსის შეცდომა. შესაძლოა ეს მიუთითებდეს დეფექტზე პროგრამულ უზრუნველყოფაში. მონაცემთა ბაზაში მოთხოვნის ბოლო მცდელობა იყო:
<blockquote><tt>$1</tt></blockquote>
ფუნქციიდან "<tt>$2</tt>".
MySQL-მა დააბრუნა შეცდომა"<tt>$3: $4</tt>".',
'dberrortextcl'        => 'მონაცემთა ბაზის მოთხოვნაში აღმოჩენილია სინტაქსის შეცდომა. მონაცემთა ბაზაში მოთხოვნის ბოლო მცდელობა იყო:
"$1"
ფუნქციიდან "$2".
MySQL-მა დააბრუნა შეცდომა "$3: $4"',
'noconnect'            => 'უკაცრავად! ვიკი გარკვეულ ტექნიკურ სიძნელეებს განიცდის და ვერ უკავშირდება მონაცემთა ბაზის სერვერს. <br />
$1',
'nodb'                 => 'მონაცემათა ბაზის $1 არჩევა ვერ ხერხდება',
'cachederror'          => 'ქვემოთ მოთხოვნილი გვერდის შენახული ვერსიაა და ის შესაძლოა არ იყოს განახლებული.',
'laggedslavemode'      => 'ყურადღება: გვერდი შესაძლოა არ შეიცავდეს ბოლო ცვლილებებს.',
'readonly'             => 'მონაცემთა ბაზა დახურულია',
'enterlockreason'      => 'დაწერეთ ბლოკირების საბაბი, ასევე სავარაუდო ბლოკის მოხსნის თარიღი',
'readonlytext'         => 'მონაცემთა ბაზა ამჟამად დახურული ახალი რედაქტირებისთვის და სხვა ცვლილებებისთვის, სავარაუდოდ პერიოდული ბაზის გამართვის სამუშაოების გამო, რის შემდეგაც ის კვლავ ნორმალურ ფუნქციას დაუბრუნდება.

ადმინისტრატორმა, რომელმაც ის დაბლოკა, შემდეგი მიზეზი მოიყვანა: $1',
'readonly_lag'         => 'მონაცემთა ბაზა ავტომატურად დაიხურა, სანამ შვილობილი ბაზის სერვერები მთავარ ბაზასთან სინქრონიზაციას ახდენს',
'internalerror'        => 'შიდა შეცდომა',
'internalerror_info'   => 'შიდა შეცდომა: $1',
'filecopyerror'        => '"$1" ფაილის "$2"-ზე კოპირება ვერ მოხერხდა.',
'filerenameerror'      => 'ფაილის სახელის შეცვლა "$1"-დან "$2"-ზე ვერ მოხერხდა.',
'filedeleteerror'      => 'ფაილის "$1" წაშლა ვერ მოხერხდა.',
'directorycreateerror' => 'დირექტორიის "$1" შექმნა შეუძლებელია.',
'filenotfound'         => 'ფაილის "$1" მოძიება ვერ მოხერხდა.',
'fileexistserror'      => 'შეუძლებელია ფაილის "$1" ჩაწერა: ფაილი არსებობს',
'unexpected'           => 'გაუთვალისწინებელი სიდიდე: "$1"="$2".',
'formerror'            => 'შეცდომა: ფორმის გაგზავნა ვერ მოხერხდა.',
'badarticleerror'      => 'ეს მოქმედება ვერ შესრულდება ამ გვერდზე.',
'cannotdelete'         => 'აღნიშნული გვერდის ან ფაილის წაშლა შეუძლებელია (შესაძლოა, იგი უკვე წაშალა სხვა ადმინისტრატორმა).',
'badtitle'             => 'არასწორი სათაური',
'badtitletext'         => 'მოთხოვნილი გვერდის სათაური იყო არასწორი, ცარიელი, ან წარმოადგენდა შეცდომით გაკეთებულ ბმულს ენათაშორისი ან ინტერ-ვიკი სათაურიდან.',
'perfdisabled'         => 'უკაცრავად! ეს ფუნქცია დროებით შეჩერებულია, ვინაიდან ის იმდენად ანელებს მონაცემთა ბაზას, რომ ვიკის გამოყენება შეუძლებელი ხდება.',
'wrong_wfQuery_params' => 'არასწორი პარამეტრები ფუნქციისათვის wfQuery()<br />
ფუნქცია: $1<br />
მოთხოვნა: $2',
'viewsource'           => 'იხილე წყარო',
'viewsourcefor'        => '$1-ის',
'protectedpagetext'    => 'ეს გვერდი დაბლოკილია რედაქტირებისთვის.',
'viewsourcetext'       => 'თქვენ შეგიძლიათ ნახოთ ამ გვერდის საწყისი ფაილი და მისი ასლი შექმნათ:',
'protectedinterface'   => 'ეს გვერდი პროგრამის ინტერფეისის ნაწილია და დაცულია ვანდალიზმის აღკვეთის მიზნით.',
'editinginterface'     => "'''ყურადღება:''' თქვენ რედაქტორობთ გვერდს, რომელიც პროგრამის ინტერფეისის ტექსტს შეიცავს. ამ გვერდზე განხორციელებული რედაქტირება გამოიწვევს სხვა მომხმარებელთა სამუშაო ინტერფეისის შეცვლასაც. თარგმანისათვის უმჯობესია გამოიყენოთ [http://translatewiki.net/wiki/Main_Page?setlang=ka Betawiki], მედიავიკის ლოკალიზაციის პროექტი.",
'cascadeprotected'     => 'ეს გვერდი რედაქტირებისგან დაცულია, რადგან იგი ჩართულია შემდეგ {{PLURAL:$1|გვერდში, რომლის |გვერდებში, რომელთა}} დასაცავადაც ჩართულია პარამეტრი "იერარქიული":
$2',
'namespaceprotected'   => "თქვენ არ გაქვთ '''$1''' სახელთა სივრცეში გვერდების რედაქტირების უფლება.",
'customcssjsprotected' => 'თქვენ არ გაქვთ ამ გვერდის რედაქტირების უფლება, ვინაიდან ის სხვა მომხმარებლის პირად კონფიგურაციას შეიცავს.',
'ns-specialprotected'  => 'გვერდების რედაქტირება სახელთა სივრცეში {{ns:special}} შეუძლებელია.',

# Login and logout pages
'logouttitle'                => 'მომხმარებლის სისტემიდან გასვლა',
'logouttext'                 => '<strong>თქვენ ამჟამად სისტემიდან გასული ხართ.</strong><br />
შეგიძლიათ გამოიყენოთ {{SITENAME}} ანონიმურად, ან შეგიძლიათ
შეხვიდეთ ისევ როგორც იგივე ან სხვა მომხმარებელი. შენიშნეთ,
რომ ზოგიერთ გვერდზე შესაძლოა ისევ უჩვენებდეს რომ შესული
ხართ სანამ თქვენი ბრაუზერის მეხსიერებას არ გაწმენდთ.',
'welcomecreation'            => '== მოგესალმებით, $1! ==

თქვენი ანგარიში შექმნილია. არ დაგავიწყდეთ თქვენი {{SITENAME}} კონფიგურაციის შეცვლა.',
'loginpagetitle'             => 'მომხმარებლის რეგისტრაცია',
'yourname'                   => 'მომხმარებელი',
'yourpassword'               => 'პაროლი',
'yourpasswordagain'          => 'ხელმეორედ შეიყვანეთ პაროლი',
'remembermypassword'         => 'დამიმახსოვრე',
'yourdomainname'             => 'თქვენი დომენი',
'loginproblem'               => '<b>თქვენი რეგისტრაცია ვერ მოხერხდა.</b><br />სცადეთ ხელმეორედ!',
'login'                      => 'შესვლა',
'nav-login-createaccount'    => 'შესვლა',
'loginprompt'                => '{{SITENAME}}-ში შესასვლელად საჭიროა კუკის (cookies) გააქტიურება.',
'userlogin'                  => 'შესვლა',
'logout'                     => 'გასვლა',
'userlogout'                 => 'გასვლა',
'notloggedin'                => 'შესული არ ხართ',
'nologin'                    => 'ჯერ არ ხართ რეგისტრირებული? $1.',
'nologinlink'                => 'გახსენით ანგარიში',
'createaccount'              => 'გახსენი ანგარიში',
'gotaccount'                 => 'უკვე რეგისტრირებული ხართ? $1',
'gotaccountlink'             => 'შესვლა',
'createaccountmail'          => 'ელ-ფოსტით',
'badretype'                  => 'თქვენს მიერ შეყვანილი პაროლები ერთმანეთს არ ემთხვევა.',
'userexists'                 => 'შეყვანილი სახელი უკვე გამოყენებულია. გთხოვთ აირჩიოთ სხვა სახელი.',
'youremail'                  => 'ელექტრონული ფოსტა *',
'username'                   => 'მომხმარებლის სახელი:',
'uid'                        => 'მომხმარებლის იდენტიფიკაცია:',
'yourrealname'               => 'ნამდვილი სახელი *',
'yourlanguage'               => 'ენა:',
'yourvariant'                => 'ვარიანტი',
'yournick'                   => 'მეტსახელი:',
'badsig'                     => 'არასწორი ნედლი ხელმოწერა; შეამოწმეთ HTML ჭდეები.',
'badsiglength'               => 'მეტსახელი ძალიან გრძელია.
უნდა იყოს $1 ნიშანზე ნაკლები.',
'email'                      => 'ელ. ფოსტა',
'prefs-help-realname'        => 'ნამდვილი სახელის მითითება აუცილებელი არ არის, მაგრამ თუ მიუთითებთ ის გამოყენებული იქნება თქვენი ნამუშევრის აღსანიშნავად.',
'loginerror'                 => 'შეცდომა შესვლაში',
'prefs-help-email'           => 'ელ. ფოსტის მისამართი არასავალდებულოა, მაგრამ საშუალებას აძლევს სხვა მომხმარებლებს დაგიკავშირდნენ თქვენი მომხმარებლის გვერდის ან განხილვის გვერდის მეშვეობით თქვენი ვინაობის ჩვენების საჭიროების გარეშე.',
'prefs-help-email-required'  => 'თქვენი ელ-ფოსტის მისამართი აუცილებელია.',
'nocookiesnew'               => 'მომხმარებლის ჩანაწერი შექმნილია, მაგრამ თქვენ არ გაგივლიათ რეგისტრაცია. {{SITENAME}} იყენებს cookies, რომლებიც თქვენს ბრაუზერში გათიშულია. გთხოვთ, აამოქმედოთ ისინი და შემდგომ ხელახლა გაიარეთ რეგისტრაცია.',
'nocookieslogin'             => '{{SITENAME}} მომხმარებლების შესვლისთვის იყენებს "ქუქის ჩანაწერს". თქვენ იგი გათიშეთ. გთხოვთ, ჩართოთ ისინი და ხელმეორედ მოსინჯოთ.',
'noname'                     => 'თქვენს მიერ მითითებული მომხმარებლის სახელი ქმედითი არ არის.',
'loginsuccesstitle'          => 'სისტემაში შესვლა განხორციელდა.',
'loginsuccess'               => "'''ამჟამად შესული ხართ {{SITENAME}}-ში როგორც \"\$1\".'''",
'nosuchuser'                 => 'მომხმარებელი სახელით "$1" არ არსებობს. შეამოწმეთ მართლწერა, ან შექმენით ახალი ანგარიში.',
'nosuchusershort'            => 'მომხმარებელი სახელით "<nowiki>$1</nowiki>" არ არსებობს. შეამოწმეთ მართლწერა.',
'nouserspecified'            => 'საჭიროა მომხმარებლის სახელის მითითება.',
'wrongpassword'              => 'პაროლი არასწორად არის შეყვანილი. სცადეთ განმეორებით.',
'wrongpasswordempty'         => 'პაროლი არ არის შეყვანილი. სცადეთ განმეორებით.',
'passwordtooshort'           => 'პაროლი არასწორადაა შერჩეული ან ძალიან მოკლეა.
იგი უნდა შეიცავდეს მინიმუმ $1 სიმბოლოს და უნდა განსხვავდებოდეს მომხმარებლის სახელისგან.',
'mailmypassword'             => 'ახალი პაროლის გამოგზავნა',
'passwordremindertitle'      => 'ახალი დროებითი პაროლი {{SITENAME}}-თვის',
'passwordremindertext'       => "ვიღაცამ (შესაძლოა თქვენ, IP მისამართით $1)
მოითხოვა ახალი პაროლის გაგზავნა {{SITENAME}}-სთვის ($4).
პაროლი მოხმარებლისთვის ''$2'' ამჟამად არის ''$3''.
სასურველია ეხლავე შეხვიდეთ სისტემაში და შეცვალოთ თქვენი პაროლი.

თუ ეს მოთხოვნა სხვამ გააკეთა ან უკვე გაგახსენდათ თქვენი პაროლი და
აღარ გსურთ მისი შეცვლა, შეგიძლიათ იგნორირება გაუკეთოთ ამ შეტყობინებას
და გააგრძელოთ ძველი პაროლის გამოყენება.",
'noemail'                    => 'აქ "$1" მომხმარებლის ელ. ფოსტის მისამართი მითითებული არ არის.',
'passwordsent'               => 'ახალი პაროლი გაიგზავნა ელ-ფოსტით მომხმარებელს "$1".
გთხოვთ შეხვიდეთ სისტემაში მისი მიღების შემდეგ.',
'blocked-mailpassword'       => 'თქვენი IP მისამართი რედაქტირებისთვის დაბლოკილია, ამიტომ არ შეგიძლიათ პაროლის აღდგენის გამოყენება კონფლიქტის გამო.',
'eauthentsent'               => 'დამადასტურებელი შეტყობინება გაიგზავნა თქვენს მიერ მითითებულ ელ. ფოსტის მისამართზე.
სანამ ნებისმიერი სხვა შეტყობინება გაიგზავნებოდეს თქვენს ანგარიშზე, გთხოვთ მიჰყვეთ ელ.
ფოსტაში მითითებულ ინსტრუქციებს, რათა დაადასტუროთ რომ ანგარიში ნამდვილად თქვენია.',
'throttled-mailpassword'     => 'პაროლის შეხსენება უკვე გაგზავნილია ბოლო $1 საათის განმავლობაში.
ბოროტად გამოყენების თავიდან აცილებისთვის, მხოლოდ ერთი შეხსენება იგზავნება ყოველ
$1 საათში.',
'mailerror'                  => 'შეცდომა ფოსტის გაგზავნაში: $1',
'acct_creation_throttle_hit' => 'თქვენ უკვე შექმენით $1 ანგარიში. მეტის შექმნა არ შეგიძლიათ.',
'emailauthenticated'         => 'თქვენი ელ. ფოსტის მისამართი გადამოწმებულია $1-ზე.',
'emailnotauthenticated'      => 'თქვენი ელ. ფოსტის მისამართი ჯერ არ არის გადამოწმებული. შემდეგი ფუნქციები გამორთულია.',
'noemailprefs'               => '<strong>თქვენ არ გაქვთ ელ. ფოსტის მისამართი მითითებული,</strong>აღნიშნული ფუნქციები ამის გამო არ დროისთვის შეუძლებელია.',
'emailconfirmlink'           => 'დაადასტურეთ თქვენი ელ. ფოსტის მისამართი',
'invalidemailaddress'        => 'ელ. ფოსტის მისამართის ფორმატში შეცდომა უნდა იყოს.
გთხვოთ ხელახლა შეიყვანოთ იგი ან წაშალოთ ეს ველი.',
'accountcreated'             => 'ანგარიში შეიქმნა',
'accountcreatedtext'         => 'მომხმარებლის ანგარიში $1-სთვის შექმნილია.',
'createaccount-title'        => 'ანგარიშის შექმნა {{SITENAME}}-თვის',
'createaccount-text'         => 'ვიღაცამ შექმნა ანგარიში სახელით "$2" და პაროლით "$3" თქვენი ელექტრონული ფოსტისთვის {{SITENAME}}-ში ($4). გთხოვთ დარეგისტრირდეთ და შეცვალოთ პაროლი.

შეგიძლიათ ყურადღება არ მიაქციოთ ამ შეტყობინებას, თუ ანგარიში შეცდომით შეიქმნა.',
'loginlanguagelabel'         => 'ენა: $1',

# Password reset dialog
'resetpass'           => 'შეცვალეთ ანგარიშის პაროლი',
'resetpass_announce'  => 'თქვენ შემოხვედით დროებით ელ-ფოსტის კოდით. რეგისტრაციის დასრულებისთვის, უნდა შექმნათ ახალი პაროლი აქ:',
'resetpass_text'      => '<!-- დამატებითი ტექსტი აქ -->',
'resetpass_header'    => 'გაიმეორეთ პაროლი',
'resetpass_submit'    => 'მიუთითეთ პაროლი და დარეგისტრირდით',
'resetpass_success'   => 'თქვენი პაროლი წარმატებით შეიცვალა! ამჟამად რეგისტრირდებით...',
'resetpass_forbidden' => 'პაროლის შეცვლა {{SITENAME}}-ში შეუძლებელია',

# Edit page toolbar
'bold_sample'     => 'მუქი ტექსტი',
'bold_tip'        => 'მუქი ტექსტი',
'italic_sample'   => 'კურსივი',
'italic_tip'      => 'კურსივი',
'link_sample'     => 'ბმულის სათაური',
'link_tip'        => 'შიდა ბმული',
'extlink_sample'  => 'http://www.example.com ბმულის სათაური',
'extlink_tip'     => 'გარე ბმული (გახსოვდეთ http:// პრეფიქსი)',
'headline_sample' => 'სათაურის ტექსტი',
'headline_tip'    => 'ქვესათაური',
'math_sample'     => 'ჩასვით ფორმულა აქ',
'math_tip'        => 'მათემატიკური ფორმულა (LaTeX)',
'nowiki_sample'   => 'ჩასვით დაუფორმატებელი ტექსტი აქ',
'nowiki_tip'      => 'ვიკის ფორმატირების იგნორირება',
'image_sample'    => 'მაგალითი.jpg',
'image_tip'       => 'ჩასმული სურათი',
'media_tip'       => 'ბმული ფაილზე',
'sig_tip'         => 'თქვენი ხელმოწერა და დრო',
'hr_tip'          => 'ჰორიზონტალური ხაზი (ნუ გამოიყენებთ ხშირად)',

# Edit pages
'summary'                   => 'რეზიუმე',
'subject'                   => 'თემა/სათაური',
'minoredit'                 => 'მცირე რედაქტირება',
'watchthis'                 => 'უთვალთვალე ამ გვერდს',
'savearticle'               => 'შენახვა',
'preview'                   => 'წინასწარი გადახედვა',
'showpreview'               => 'წინასწარი გადახედვა',
'showlivepreview'           => 'შავი ნიმუში',
'showdiff'                  => 'ცვლილებების ჩვენება',
'anoneditwarning'           => "'''გაფრთხილება:''' თქვენ არ ხართ რეგისტრირებული. თქვენი IP მისამართი ჩაიწერება ამ გვერდის რედაქტირების ისტორიაში.",
'missingsummary'            => "'''შეხსენება:''' თქვენ არ მიგითითებიათ რედაქტირების რეზიუმე.
თუ ისევ დააწკაპუნებთ შენახვაზე, თქვენი რედაქტირება რეზიუმეს გარეშე დამახსოვრდება.",
'missingcommenttext'        => 'გთხოვთ კომენტარი შეიყვანოთ ქვემოთ.',
'missingcommentheader'      => "'''შეხსენება:''' თქვენ ამ კომენტარისთვის სათაური/თემა არ მიგითითებიათ. თუ შენახვაზე დააწკაპუნებთ, თქვენი ცვლილება მის გარეშე იქნება შენახული.",
'summary-preview'           => 'რეზიუმეს წინასწარი გადახედვა',
'subject-preview'           => 'თემის/სათაურის წინასწარი გადახედვა',
'blockedtitle'              => 'მომხმარებელი ბლოკირებულია',
'blockedtext'               => '<big>\'\'\'თქვენი მომხმარებლის სახელი ან IP მისამართი დაბლოკილ იქნა.\'\'\'</big>

ბლოკირება განახორციელა $1-მ.
მიზეზად დასახელდა შემდეგი: \'\'$2\'\'.

* დაბლოკვის დასაწყისი: $8
* ბლოკის ვადის გასვლის დრო: $6
* დაბლოკილ იქნა: $7

შეგიძლიათ დაუკავშირდეთ $1-ს ან რომელიმე სხვა [[{{MediaWiki:Grouppage-sysop}}|ადმინისტრატორს]] დაბლოკვის განსახილველად.
გაითვალისწინეთ, რომ თქვენ ვერ შეძლებთ გამოიყენოთ ფუნქცია "მომხმარებლისთვის ელ. ფოსტის გაგზავნა", თუ არ გაქვთ მითითებული მოქმედი ელ. ფოსტის მისამართი თქვენი [[Special:Preferences|ანგარიშის კონფიგურაციაში]] ან თუ დაბლოკვის შედეგად გაქვთ ამ ფუნქციის გამოყენების ნებართვა ჩამორთმეული.
თქვენი ამჟამინდელი IP მისამართია $3, ხოლო ბლოკის იდენტიფიკატორი #$5.
გთხოვთ, მიუთითოთ ყველა ზემოთხსენებული მონაცემი თქვენს კორესპონდენციაში.',
'autoblockedtext'           => 'თქვენი IP მისამართი ავტომატურად დაიბლოკა, ვინაიდან მას სხვა მომხმარებელი იყენებდა, რომელიც დაბლოკა $1-მა.
საბაბად მოყვანილი იყო შემდეგი:

:\'\'$2\'\'

* ბლოკის დაწყების თარიღი: $8
* ბლოკის ვადის გასვლა: $6

შეგიძლიათ დაუკავშირდეთ $10ს ან რომელიმე სხვა
[[{{MediaWiki:Grouppage-sysop}}|ადმინისტრატორს]] ამ ბლოკის განსახილველად.

გაითვალისწინეთ, რომ თქვენ ვერ გამოიყენებთ "მისწერეთ ელ-წერილი ამ მომხმარებელს" ფუნქციას თუ თქვენ შემოწმებული ელ-ფოსტის მისამართი
არ გაქვთ მითითებული თქვენს [[Special:Preferences|კონფიგურაციაში]] და არ ხართ დაბლოკილი მისი გამოყენებისთვის.

თქვენი დაბლოკვის საიდენტიფიკაციო ნომერია $5. გთხოვთ მიუთითოთ ეს ნომერი, ნებისმიერ მიმოწერაში.',
'blockednoreason'           => 'საბაბი მითითებული არ არის',
'blockedoriginalsource'     => "'''$1'''-ის წყარო მოყვანილია ქვემოთ:",
'blockededitsource'         => "ქვემოთ მოყვანილია '''$1'''-ში თქვენი რედაქტირების ტექსტი:",
'whitelistedittitle'        => 'რედაქტირება საჭიროებს სისტემაში შესვლას',
'whitelistedittext'         => 'გვერდების რედაქტირებისათვის თქვენ გესაჭიროებათ $1.',
'confirmedittitle'          => 'რედაქტირებისთვის საჭიროა ელფოსტის დამოწმება',
'confirmedittext'           => 'გვერდების დარედაქტირებამდე უნდა დაადასტუროთ თქვენი ელფოსტის მისამართი. გთხოვთ [[Special:Preferences|მომხმარებლის პარამეტრებში]] მიუთითოთ და დაამოწმოთ ელფოსტის მისამართი.',
'nosuchsectiontitle'        => 'სექცია არ არსებობს',
'nosuchsectiontext'         => 'თქვენ სცადეთ არარსებული სექციის რედაქტირება. ვინაიდან სექცია $1 არ არსებობს, არ არის მისი შენახვის ადგილი.',
'loginreqtitle'             => 'რეგისტრაცია აუცილებელია',
'loginreqlink'              => 'შესვლა',
'loginreqpagetext'          => 'თქვენ უნდა $1 სხვა გვერდები აჩვენოთ.',
'accmailtitle'              => 'პაროლი გაგზავნილია.',
'accmailtext'               => "'$1'-ის პაროლი გადაგზავნილია $2-ზე.",
'newarticle'                => '(ახალი)',
'newarticletext'            => 'ბმულის მეშვეობით თქვენ მოხვდით გვერდზე, რომელიც ჯერ არ არსებობს.
გვერდის შესაქმნელად შეიყვანეთ ინფორმაცია ქვემო ფანჯარაში
(იხ. [[{{MediaWiki:Helppage}}|დახმარების გვერდი]] დამატებითი ინფორმაციისთვის).
თუ ამ გვერდზე შეცდომით მოხვდით, დაბრუნდით უკან თქვენი ბრაუზერის მეშვეობით.',
'anontalkpagetext'          => "----''ეს არის ანონიმური მომხმარებლის განხილვის გვერდი, რომელსაც ანგარიში ჯერ არ შეუქმნია ან არ იყენებს მას. შესაბამისად, ჩვენ მისი ციფრული IP მისამართი უნდა გამოვიყენოთ მისი იდენტიფიცირებისთვის. ამგვარი მისამართი შეიძლება რამდენიმე მომხმარებელმა გამოიყენოს. თუ თქვენ ანონიმური მომხმარებელი ხართ და თვლით, რომ სხვისთვის გამიზნული მითითება მიიღეთ, გთხოვთ [[Special:UserLogin|შექმენით ანგარიში ან დარეგისტრირდით]] მომავალში გაუგებრობის თავიდან ასაცილებლად.''",
'noarticletext'             => 'ამჟამად ამ გვერდზე ტექსტი არ არსებობს, თქვენ შგიძლიათ [[Special:Search/{{PAGENAME}}|მოძებნოთ ამ გვერდის სათაური]] სხვა გვერდებზე ან [{{fullurl:{{FULLPAGENAME}}|action=edit}} დაიწყოთ ამ გვერდის რედაქტირება].',
'clearyourcache'            => "'''შენიშვნა:''' შენახვის შემდეგ შესაძლოა დაგჭირდეთ ბრაუზერის ქეშის გაწმენდა ცვლილებების სანახავად. '''Mozilla / Firefox / Safari:''' დააჭირეთ ''Shift'' ''Reload''-ზე დაწკაპებისას, ან დააჭირეთ ''Ctrl-Shift-R'' (''Cmd-Shift-R'' Apple Mac-ზე); '''IE:''' დააჭირეთ ''Ctrl'' ''Refresh''-ზე დაწკაპებისას, ან დააჭირეთ ''Ctrl-F5''; '''Konqueror:''': მხოლოდ დააწკაპეთ ''Reload'' ღილაკს, ან დააჭირეთ ''F5''; '''Opera''' შესაძლოა საჭირო გახდეს ქეშის სრულიად გაწმენდა ''Tools→Preferences''-დან.",
'usercssjsyoucanpreview'    => "<strong>რჩევა:</strong> შენახვამდე გამოიყენეთ 'წინასწარი გადახედვის' ღილაკი თქვენი ახალი CSS/JS ტესტირებისთვის.",
'usercsspreview'            => "'''დაიმახსოვრეთ, რომ თქვენ მხოლოდ წინასწარ გადახედვას უყურებთ თქვენს მომხმარებლის CSS-ს, ის ჯერ შენახული არ არის!'''",
'userjspreview'             => "'''გახსოვდეთ, რომ თქვენ მხოლოდ ტესტირებას უკეთებთ ან აკვირდებით წინასწარ ხედს თქვენი მომხმარებლის ჯავასკრიპტს - ის ჯერ არ არის დამახსოვრებული!'''",
'updated'                   => '(განახლდა)',
'note'                      => '<strong>შენიშვნა:</strong>',
'previewnote'               => '<strong>ეს მხოლოდ ნიმუშია; ცვლილებები ჯერ არ შენახულა!</strong>',
'previewconflict'           => 'შავი ნიმუში უჩვენებს ტექსტს ზედა რედაქტირების ფანჯარაში, როგორც ის გამოჩნდება თუ თქვენ მას შეინახავთ.',
'session_fail_preview'      => '<strong>უკაცრავად! ვერ შევძელით თქვენი რედაქტირების შენახვა სესიის მონაცემთა დაკარგვის გამო.
გთხოვთ ისევ სცადოთ.
თუ პრობლემა განმეორდა, სცადეთ [[Special:UserLogout|სისტემიდან გასვლა]] და ხელახლა შემოსვლა.</strong>',
'session_fail_preview_html' => "<strong>ბოდიში! ჩვენ ვერ განვახორციელეთ თქვენი რედაქტირება სესიის მონაცემთა დაკარგვის გამო.</strong>

''რადგანაც ამ ვიკის აქვს დაუმუშავებელი HTML ჩართული, წინასწარი გადახედვა დამალულია ჯავასკრიპტის შეტევის საწინააღმდეგოდ სიფრთხილის მიზნით.''

<strong>თუ ეს მიღებული რედაქტირების მცდელობა იყო, გთხოვთ ისევ სცადოთ. თუ იგი კვლავ არ მუშაობს, სცადეთ თავიდან დარეგისტრირება (შესვლა)</strong>",
'editing'                   => 'რედაქტირება - $1',
'editingsection'            => 'რედაქტირება - $1 (სექცია)',
'editingcomment'            => 'რედაქტირება: $1 (კომენტარი)',
'editconflict'              => 'რედაქტირების კონფლიქტი: $1',
'explainconflict'           => 'სხვა მომხმარებელმა შეცვალა ეს გვერდი მას შემდეგ რაც თქვენ დაიწყეთ მისი რედატირება. ზედა ტექსტური ველი შეიცავს გვერდის შიგთავსს მისი ამჟამინდელი სახით. თქვენი ცვლილებები ნაჩვენებია ქვედა ტექსტურ ველში. თქვენ მოგიწევთ თქვენი ცვლილებების შერწყმა არსებულ ტექსტთან. <b>მხოლოდ</b> ზედა ველში არსებული ტექსტი იქნება შენახული, როდესაც "გვერდის შენახვას" დააჭერთ.<br />',
'yourtext'                  => 'თქვენი ტექსტი',
'storedversion'             => 'შენახული ვერსია',
'nonunicodebrowser'         => '<strong>გაფრთხილება: თქვენი ბრაუზერი უნიკოდთან თავსებადი არ არის. ჩვენ ვცდილობთ ამ პრობლემის გადაჭრას, რათა თქვენ შეძლოთ უსაფრთხოდ შეიტანოთ ცვლილებები გვერდებზე: არა-ASCII ნიშნები რედაქტირების ფანჯარაში გამოჩნდება როგორც ჰექსადეციმალური კოდები.</strong>',
'editingold'                => '<strong>ყურადღება: თქვენ ამუშავებთ ამ გვერდის მოძველებულ ვერსიას. გვერდის შენახვის შემდეგ მომდევნო ვერსიებში გაკეთებული ცვლილებები დაიკარგება.</strong>',
'yourdiff'                  => 'განსხვავებები',
'copyrightwarning'          => 'ყურადღება მიაქციეთ: ნებისმიერი წვლილი გვერდზე {{SITENAME}} $2 ლიცენზიას ექვემდებარება (იხ. $1 დეტალებისთვის). თუ არ გსურთ თქვენი ნამუშევარი თავისუფლად გავრცელდეს და მისი დაუნდობელი რედაქტირება მოხდეს, მაშინ ნუ შეიყვანთ მას აქ.<br />
თქვენ ასევე პირობას დებთ, რომ ეს თქვენი დაწერილია, ან გადმოღებულია საზოგადოებრივი დომენიდან, ან მსგავსი თავისუფალი წყაროდან.
<strong>ნუ შემოიტანთ საავტორო უფლებებით დაცულ ნაშრომს ავტორის თანხმობის გარეშე!</strong>',
'copyrightwarning2'         => '*გაითვალისწინეთ, რომ ნებისმიერი წვლილი {{SITENAME}}-ში შეიძლება ჩასწორდეს, შეიცვალოს ან წაიშალოს სხვა რედაქტორების მიერ.
*თუ არ გსურთ, რომ თქვენი ნამუშევარი შეუზღუდავად იქნეს რედაქტირებული, მას აქ ნუ განათავსებთ.<br />
*თქვენ აგრეთვე პირობას დებთ, რომ თქვენს მიერ განთავსებული ტექსტი თქვენი დაწერილია, ან გადმოწერილია საზოგადოებრივი დომენიდან ან მსგავსი თავისუფალი წყაროდან. (იხ. $1 დეტალებისთვის).
*<strong>ნუ შემოიტანთ საავტორო უფლებებით დაცულ ნაშრომს ავტორის ნებართვის გარეშე!</strong>',
'longpagewarning'           => '<strong>გაფრთხილება: ეს გვერდი $1 კილობაიტია; ზოგიერთ ბრაუზერს უჭირს გვერდების რედაქტირება, რომელთა ზომა აღემატება 32 კბ-ს. გთხოვთ იქონიოთ მხედეველობაში შედარებით მცირე სექციებად გვერდის გაყოფა.</strong>',
'longpageerror'             => '<strong>შეცდომა: თქვენს მიერ შემოტანილი ტექსტი $1 კილობაიტია, რაც აღემატება მაქსიმალურად დასაშვებ $2 კბ-ს. მისი შენახვა შეუძლებელია.</strong>',
'readonlywarning'           => '<strong>გაფრთხილება: მონაცემთა ბაზა დახურულია პერიოდული შემოწმებისთვის, შესაბამისად თქვენ ვერ შეძლებთ რედაქტირებას ამ მომენტში.
სასურველია ტექსტის ასლი შეინახოთ ტექსტურ რედაქტორში და მოგვიანებით შემოიტანოთ.</strong>',
'protectedpagewarning'      => '<strong>გაფრთხილება:  ეს გვერდი დაბლოკილია და მისი რედაქტირება შეუძლიათ მხოლოდ მომხმარებლებს sysop პრივილეგიებით.</strong>',
'semiprotectedpagewarning'  => "'''შენიშვნა:''' ეს გვერდი დაბლოკილია და მისი რედაქტირება მხოლოდ რეგისტრირებულ მომხმარებლებს შეუძლიათ.",
'cascadeprotectedwarning'   => "'''გაფრთხილება:''' ეს გვერდი ჩაკეტილია ისე რომ მისი რედაქტირება მხოლოდ ადმინისტრატორებს შეუძლია, რადგან იგი ეკუთვნის შემდეგ კასკადურად დაცვის {{PLURAL:$1|გვერდს|გვერდებს}}:",
'templatesused'             => 'ამ გვერდზე გამოყენებული თარგები:',
'templatesusedpreview'      => 'თარგები, რომლებიც წინასწარ გადახედვის გვერდზეა გამოყენებული:',
'templatesusedsection'      => 'ამ სექციაში გამოყენებული თარგები:',
'template-protected'        => '(დაცული)',
'template-semiprotected'    => '(ნახევრად დაცული)',
'nocreatetitle'             => 'გვერდის შექმნა ლიმიტირებულია',
'nocreatetext'              => 'ამ გვერდზე შეუძლებელია ახალი გვერდის შექმნა არსებული აკრძალვის გამო. თქვენ შეგიძლიათ უკან დაბრუნება და არსებული გვერდის რედაქტირება ან [[სპეციალური:Userlogin|შესვლა და ანგარიშის შექმნა]]',
'nocreate-loggedin'         => 'თქვენ არ გაქვთ {{SITENAME}}-ში ახალი გვერდების შექმნის უფლება.',
'permissionserrorstext'     => 'თქვენ არ გაქვთ ამის გაკეთების უფლება, შემდეგი {{PLURAL:$1|მიზეზის|მიზეზების}} გამო:',
'recreate-deleted-warn'     => "'''გაფრთხილება: თქვენ ხელახლა ქმნით გვერდს, რომელიც ადრე წაშლილ იქნა.'''

გთხოვთ დაფიქრდეთ, მისაღები არის თუ არა ამ გვერდის რედაქტირების გაგრძელება.
ინფორმაციისთვის ქვემოთ მოყვანილია ამ გვერდის წაშლის ისტორია:",

# "Undo" feature
'undo-success' => 'რედაქტირების გაუქმება შესაძლებელია. გთხოვთ შეამოწმოთ განსხვავება ქვევით, რათა დარწმუნდეთ, რომ ეს ის არის რაც თქვენ გსურთ, შემდეგ კი შეინახეთ ცვლილებები რათა დაასრულოთ რედაქტირების გაუქმება.',
'undo-failure' => 'რედაქტირების გაუქმება შეუძლებელია კონფლიქტური შუალედური რედაქტირებების გამო.',
'undo-summary' => '$1 ცვლილების გაუქმება [[Special:Contributions/$2|$2]]-ის მიერ ([[User talk:$2|განხილვა]])',

# Account creation failure
'cantcreateaccounttitle' => 'ანგარიშის შექმნა ვერ ხერხდება',

# History pages
'viewpagelogs'        => 'ამ გვერდისთვის სარეგისტრაციო ჟურნალების ჩვენება',
'nohistory'           => 'ამ გვერდს განხილვის გვერდი ცარიელი აქვს.',
'revnotfound'         => 'ცვლილება ვერ ვიპოვეთ',
'currentrev'          => 'მიმდინარე შესწორება',
'revisionasof'        => '$1-ის ვერსია',
'revision-info'       => '$1-ის ვერსია, შეტანილი $2-ის მიერ',
'previousrevision'    => '←წინა ვერსია',
'nextrevision'        => 'შემდეგი ვერსია→',
'currentrevisionlink' => 'მიმდინარე ვერსია',
'cur'                 => 'მიმდ.',
'next'                => 'შემდეგი',
'last'                => 'ბოლო',
'page_first'          => 'პირველი',
'page_last'           => 'ბოლო',
'histlegend'          => '<div style="font-size:95%">
*ვერსიის დათვალიერება: დააწკაპუნეთ სასურველი ვერსიის თარიღზე მის დასათვალიერებლად.
*ვერსიების შედარება: აირჩიეთ სასურველი ვერსიები რადიო-რგოლების მონიშვნით და დააწკაპუნეთ შედარების ღილაკზე.
*შემოკლებები: (მიმდ.) = სხვაობა მიმდინარე ვერსიასთან, (ბოლო) = სხვაობა წინა ვერსიასთან, მ = მცირე შესწორება.</div>',
'deletedrev'          => '[წაშლილია]',
'histfirst'           => 'პირველი',
'histlast'            => 'უკანასკნელი',
'historysize'         => '($1 ბაიტი)',
'historyempty'        => '(ცარიელი)',

# Revision feed
'history-feed-title'          => 'რედაქტირების ისტორია',
'history-feed-description'    => 'ამ გვერდის შესწორებათა ისტორია ვიკიში',
'history-feed-item-nocomment' => '$1  $2-ზე', # user at time
'history-feed-empty'          => 'თქვენს მიერ მოძიებული გვერდი არ არსებობს.
შესაძლოა იგი წაშლილ იქნა ვიკიდან, ან მისი სათაური შეიცვალა.
სცადეთ [[Special:Search|searching on the wiki]] მსგავსი გვერდების სანახავად.',

# Revision deletion
'rev-deleted-comment'    => '(კომენტარი წაიშალა)',
'rev-deleted-user'       => '(მომხმარებლის სახელი წაიშალა)',
'rev-deleted-event'      => '(ჟურნალის ჩანაწერი წაშლილია)',
'rev-delundel'           => 'ჩვენება/დამალვა',
'revisiondelete'         => 'ცვლილებების წაშლა/დაბრუნება',
'revdelete-selected'     => '[[:$1]]-ის {{PLURAL:$2|მონიშნული ცვლილება|მონიშნული ცვლილებები}}:',
'revdelete-hide-text'    => 'შეცვლილი ტექსტის დამალვა',
'revdelete-hide-comment' => 'რედაქტირების კომენტარის დამალვა',
'revdelete-hide-user'    => 'რედაქტორის მომხ. სახელის/IP-ს დამალვა',
'revdelete-hide-image'   => 'ფაილის შინაარსის დამალვა',
'revdelete-log'          => 'ჟურნალის კომენტარი:',
'pagehist'               => 'გვერდის ისტორია',
'deletedhist'            => 'წაშლილი ისტორია',
'revdelete-content'      => 'შინაარსი',

# History merging
'mergehistory'                => 'გვერდების ისტორიის შერწყმა',
'mergehistory-submit'         => 'ცვლილებების შერწყმა',
'mergehistory-empty'          => 'რაიმე ცვლილების შერწყმა შეუძლებელია.',
'mergehistory-no-destination' => 'დანიშნულების გვერდი $1 არ არსებობს.',
'mergehistory-autocomment'    => '[[:$1]] შეერთდა [[:$2]]-სთან',

# Diffs
'history-title'           => '"$1" ცვლილებათა ისტორია',
'difference'              => '(სხვაობა ვერსიებს შორის)',
'lineno'                  => 'ხაზი $1:',
'compareselectedversions' => 'არჩეული ვერსიების შედარება',
'editundo'                => 'გაუქმება',
'diff-multi'              => '({{PLURAL:$1|ერთი|$1}} შუა ვერსია არ არის ნაჩვენები.)',

# Search results
'searchresults'         => 'ძიების შედეგები',
'searchresulttext'      => 'მეტი ინფორმაციისათვის ვიკიპედიის საძიებლის შესახებ გთხოვთ ნახოთ [[{{ns:project}}:ძიება|ძიება {{SITENAME}}]].',
'searchsubtitle'        => "თქვენ მოიძიეთ '''[[:$1]]'''",
'searchsubtitleinvalid' => "თქვენ მოიძიეთ '''$1'''",
'noexactmatch'          => "'''გვერდი ამ სათაურით \"\$1\" არ არსებობს.''' თქვენ შეგიძლიათ [[:\$1|შექმნათ ეს გვერდი]].",
'noexactmatch-nocreate' => "'''გვერდი ამ სათაურით \"\$1\" არ არსებობს.'''",
'titlematches'          => 'სტატიის სათაური შეესაბამება',
'notitlematches'        => 'არ შეესაბამება არცერთი გვერდის სათაური',
'textmatches'           => 'გვერდის ტექსტი შესაბამისია',
'notextmatches'         => 'არ შეესაბამება არცერთი გვერდის ტექსტი',
'prevn'                 => 'წინა $1',
'nextn'                 => 'შემდეგი $1',
'viewprevnext'          => 'იხილე  ($1) ($2) ($3).',
'search-result-size'    => '$1 ($2 სიტყვა)',
'searchall'             => 'ყველა',
'showingresults'        => 'ქვემოთ იხილეთ <b>$1</b>-მდე შედეგი დაწყებული #<b>$2</b>-იდან.',
'showingresultsnum'     => 'ქვემოთ იხილეთ <b>$3</b> შედეგი დაწყებული #<b>$2</b>-იდან.',
'nonefound'             => "'''შენიშვნა''':წარუმატებელი ძებნა შეიძლება გამოწვეული იყო საერთო სიტყვების ცდით, რომლებიც ინდექსირებას არ ექვემდებარება.",
'powersearch'           => 'ძიება',
'searchdisabled'        => '{{SITENAME}}ში ძებნა გაუქმებულია. თქვენ შეგიძლიათ დროის შუალედით Google-ით ძებნა. მიაქციეთ ყურადღება, რომ {{SITENAME}}ში შესაძლებელია მათი ინდექსები აქტუალური არ არის.',

# Preferences page
'preferences'              => 'კონფიგურაცია',
'mypreferences'            => 'ჩემი კონფიგურაცია',
'prefs-edits'              => 'რედაქციების რაოდენობა:',
'prefsnologin'             => 'შესული არ ხართ',
'prefsnologintext'         => 'თქვენ [[Special:UserLogin|რეგისტრირებული უნდა იყოთ]] მომხმარებლის კონფიგურაციის შესაცვლელად.',
'qbsettings'               => 'სწრაფი ზოლი',
'qbsettings-none'          => 'არაფერი',
'qbsettings-fixedleft'     => 'ფიქსირებული მარცხნივ',
'qbsettings-fixedright'    => 'ფიქსირებული მარჯვნივ',
'qbsettings-floatingleft'  => 'მარცხნივ მცურავი',
'qbsettings-floatingright' => 'მარჯვნივ მცურავი',
'changepassword'           => 'პაროლის შეცვლა',
'skin'                     => 'გარეკანი',
'math'                     => 'მათემატიკა',
'dateformat'               => 'თარიღის ფორმატი',
'datedefault'              => 'წყარო მითითებული არაა',
'datetime'                 => 'თარიღი და დრო',
'math_unknown_error'       => 'უცნობი შეცდომა',
'math_unknown_function'    => 'უცნობი ფუნქცია',
'math_syntax_error'        => 'სინტაქსი არასწორია',
'prefs-personal'           => 'მომხმარებლის მონაცემები',
'prefs-rc'                 => 'ბოლო ცვლილებები',
'prefs-watchlist'          => 'კონტროლის სია',
'prefs-watchlist-days'     => 'კონტროლის სიაში საჩვენებელი დღეები:',
'prefs-watchlist-edits'    => 'ცვლილებების მაქსიმალური რაოდენობის ჩვენება ვრცელ კონტროლის სიაში:',
'prefs-misc'               => 'სხვადასხვა',
'saveprefs'                => 'შენახვა',
'resetprefs'               => 'გადატვირთვა',
'oldpassword'              => 'ძველი პაროლი:',
'newpassword'              => 'ახალი პაროლი:',
'retypenew'                => 'ახალი პაროლი განმეორებით:',
'textboxsize'              => 'რედაქტირება',
'rows'                     => 'რიგები:',
'columns'                  => 'სვეტები',
'searchresultshead'        => 'ძიება',
'resultsperpage'           => 'შედეგები გვერდის მიხედვით:',
'contextlines'             => 'სტრიქონები შედეგის მიხედვით',
'contextchars'             => 'კონტექსტი სტრიქონების მიხედვით',
'recentchangesdays'        => 'დღეების ჩვენება ბოლო ცვლილებებში:',
'recentchangescount'       => 'რედაქციების რაოდენობა ბოლო ცვლილებებში, ისტორიაში და ჟურნალებში საჩვენებლად:',
'savedprefs'               => 'თქვენს მიერ შერჩეული პარამეტრები დამახსოვრებულია.',
'timezonelegend'           => 'დროის ზონა',
'timezonetext'             => 'საათების რაოდენობა, რომლითაც თქვენი ადგილობრივი დრო განსხვავდება სერვერის დროისაგან (UTC).',
'localtime'                => 'ადგილობრივი დრო',
'timezoneoffset'           => 'ოფსეტი¹',
'servertime'               => 'სერვერის დრო',
'guesstimezone'            => 'ბრაუზერიდან შევსება',
'allowemail'               => 'სხვა მომხმარებლებისგან ელ. ფოსტის მიღების ნებართვა',
'defaultns'                => 'სტანდარტული ძიება ამ სახელთა სივრცეებში:',
'default'                  => 'სტანდარტული',
'files'                    => 'ფაილები',

# User rights
'userrights'                  => 'მომხმარებელთა უფლებების მართვა', # Not used as normal message but as header for the special page itself
'userrights-lookup-user'      => 'მომხმარებელთა ჯგუფების მართვა',
'userrights-user-editname'    => 'მომხმარებლის სახელის შეტანა:',
'editusergroup'               => 'მომხმარებელთა ჯგუფების რედაქტირება',
'editinguser'                 => "მომხმარებლის '''[[User:$1|$1]]''' ([[User talk:$1|{{int:talkpagelinktext}}]] | [[Special:Contributions/$1|{{int:contribslink}}]]) უფლებების შეცვლა",
'userrights-editusergroup'    => 'რედაქტირება გაუკეთეთ მომხმარებელთა ჯგუფებს',
'saveusergroups'              => 'მომხმარებელთა ჯგუფების შენახვა',
'userrights-groupsmember'     => 'ჯგუფის წევრი:',
'userrights-reason'           => 'შეცვლის საბაბი:',
'userrights-no-interwiki'     => 'თქვენ არ გაქვთ მომხმარებლის უფლებების რედაქტირების უფლება სხვა ვიკი-ებში.',
'userrights-changeable-col'   => 'ჯგუფები, რომლებიც შეგიძლიათ შეცვალოთ',
'userrights-unchangeable-col' => 'ჯგუფები, რომლებიც არ შეგიძლიათ შეცვალოთ',

# Groups
'group'               => 'ჯგუფი:',
'group-user'          => 'მომხმარებლები',
'group-autoconfirmed' => 'ავტომატურად დადასტურებული მომხმარებლები',
'group-bot'           => 'რობოტები',
'group-sysop'         => 'ადმინისტრატორები',
'group-bureaucrat'    => 'ბიუროკრატები',
'group-all'           => '(ყველა)',

'group-user-member'          => 'მომხმარებელი',
'group-autoconfirmed-member' => 'ავტომატურად დადასტურებული მომხმარებელი',
'group-bot-member'           => 'რობოტი',
'group-sysop-member'         => 'ადმინისტრატორი',
'group-bureaucrat-member'    => 'ბიუროკრატი',

'grouppage-user'       => '{{ns:project}}:მომხმარებელი',
'grouppage-bot'        => '{{ns:project}}:რობოტები',
'grouppage-sysop'      => '{{ns:project}}:ადმინისტრატორები',
'grouppage-bureaucrat' => '{{ns:project}}:ბიუროკრატები',

# Rights
'right-read'          => 'გვერდების წაკითხვა',
'right-edit'          => 'გვერდების რედაქტირება',
'right-createpage'    => 'გვერდების შექმნა (არა განხილვის გვერდებისა)',
'right-createtalk'    => 'განხილვის გვერდების შექმნა',
'right-minoredit'     => 'ცვლილებების მითითება, როგორც "მცირე რედაქტირება"',
'right-move'          => 'გვერდების გადატანა',
'right-upload'        => 'ფაილების ატვირთვა',
'right-delete'        => 'გვერდების წაშლა',
'right-browsearchive' => 'წაშლილი გვერდების ძიება',
'right-undelete'      => 'გვერდის აღდგენა',
'right-editprotected' => 'დაცული გვერდების რედაქტირება (იერარქიული დაცვის გარეშე)',

# User rights log
'rightslog'  => 'მომხმარებლის უფლებების ჟურნალი',
'rightsnone' => '(არცერთი)',

# Recent changes
'nchanges'                          => '$1 ცვლილება',
'recentchanges'                     => 'ბოლო ცვლილებები',
'recentchangestext'                 => 'უთვალთვალეთ ვიკიში ბოლო ცვლილებებს ამ გვერდზე.',
'recentchanges-feed-description'    => 'ვიკის უახლესი ცვლილებების მეთვალყურეობა ამ არხში.',
'rcnote'                            => "ქვემოთ იხილეთ ბოლო '''$1''' ცვლილება უკანასკნელი '''$2''' დღის მანძილზე, $5, $4 მდგომარეობით.",
'rcnotefrom'                        => "ქვემოთ მოყვანილია ცვლილებები '''$2'''-დან (ნაჩვენებია '''$1''').",
'rclistfrom'                        => 'ახალი ცვლილებების ჩვენება დაწყებული $1-დან',
'rcshowhideminor'                   => 'მცირე რედაქტირების $1',
'rcshowhidebots'                    => 'რობოტების  $1',
'rcshowhideliu'                     => 'რეგისტრირებული მომხმარებლების $1',
'rcshowhideanons'                   => 'ანონიმური მომხმარებლების $1',
'rcshowhidepatr'                    => 'გაკონტროლებული ცვლილებების $1',
'rcshowhidemine'                    => 'ჩემი რედაქტირების $1',
'rclinks'                           => 'ბოლო $1 ცვლილების ჩვენება უკანასკნელი $2 დღის მანძილზე<br />$3',
'diff'                              => 'განსხ.',
'hist'                              => 'ისტ.',
'hide'                              => 'დამალვა',
'show'                              => 'ჩვენება',
'minoreditletter'                   => 'მ',
'newpageletter'                     => 'ა',
'boteditletter'                     => 'რ',
'number_of_watching_users_pageview' => '[$1 მომხმარებლის/ები კონტროლი]',
'rc_categories'                     => 'მხოლოდ კატეგორიებიდან (განაცალკევეთ "|"-ის მიხედვით)',
'rc_categories_any'                 => 'ნებისმიერი',
'newsectionsummary'                 => '/* $1 */ ახალი სექცია',

# Recent changes linked
'recentchangeslinked'          => 'დაკავშირებული ცვლილებები',
'recentchangeslinked-title'    => '"$1"-თან დაკავშირებული ცვლილებები',
'recentchangeslinked-noresult' => 'მითითებულ პერიოდში ცვლილებები დაკავშირებულ გვერდებზე არ მომხდარა.',

# Upload
'upload'                      => 'ფაილის დამატება',
'uploadbtn'                   => 'ფაილის დამატება',
'reupload'                    => 'ხელმეორედ ატვირთვა',
'reuploaddesc'                => 'გააუქმეთ ატვირთვა და დაუბრუნდით ატვირთვის ფორმას.',
'uploadnologin'               => 'რეგისტრაცია არ გაქვთ გავლილი',
'uploadnologintext'           => 'ფაილის ატვირთვისთვის თქვენ უნდა [[Special:UserLogin|შეხვიდეთ]].',
'upload_directory_read_only'  => 'ვებსერვერი ვერ იწერს ატვირთვის დირექტორიაში ($1).',
'uploaderror'                 => 'ატვირთვის შეცდომა',
'uploadtext'                  => "<div style=\"border: 1px solid grey; background: #ddf; padding: 10px 30px; margin: 0 auto;\">
<big>'''შენიშვნა''': თქვენი ფაილი <span style=\"color: red; font-weight: bold\">წაიშლება</span> თუ არ მიუთითებთ დეტალურ ინფორმაციას:</big>
#ფაილის '''წყაროს''' შესახებ:
#*ახსენეთ თუ თქვენი პირადი ნამუშევარია.
#*თუ ფაილი ინტერნეტში არსებობს, მიუთითეთ '''ბმული'''.
#საავტორო უფლებების მფლობელსა და ფაილის '''ლიცენზიაზე''', რომელიც მოიცავს:
#*[[:en:Wikipedia:Image copyright tag|საავტორო უფლებების თარგს]], რომლის არჩევა შეგიძლიათ სპეციალურ გვერდზე [[ვპ:თ/წყარო]],
#*''განმარტება თუ რატომ თვლით, რომ ეს ფაილი ამგვარ ლიცენზიას ექვემდებარება'', და
#*[[:en:Help:Image page#Fair use rationale|სამართლიანი გამოყენების განმარტება]], თუ ამგვარ დასაბუთებას იყენებთ.
#*თუ თავად ფლობთ ლიცენზიას, მაშინ '''აუცილებლად''' მონიშნეთ იგი როგორც [[:en:Wikipedia:Image copyright tags#For image creators|თავისუფალი ლიცენზიით]] ან გაათავისუფლეთ იგი [[საზოგადოებრივი დომენი|საზოგადოებრივ დომენში]].
ზემოთ ხსენებული პირობების განმეორებადი დარღვევის შემთხვევაში მომხარებელი '''დაიბლოკება'''.",
'upload-preferred'            => 'სასურველი ფაილის ტიპები: $1.',
'upload-prohibited'           => 'აკრძალული ფაილის ტიპები: $1.',
'uploadlog'                   => 'გადმოტვირთვის რეგისტრაცია',
'uploadlogpage'               => 'გადმოტვირთვის რეგისტრაცია',
'uploadlogpagetext'           => 'ქვემოთ არის ყველაზე ბოლოს ატვირთული ფაილების სია.',
'filename'                    => 'ფაილის სახელი',
'filedesc'                    => 'რეზიუმე',
'fileuploadsummary'           => 'რეზიუმე:',
'filestatus'                  => 'საავტორო უფლებების სტატუსი:',
'filesource'                  => 'წყარო:',
'uploadedfiles'               => 'ფაილების დამატება',
'ignorewarning'               => 'გაფრთხილება უგულებელყავი და მაინც შეინახე ფაილი.',
'ignorewarnings'              => 'უგულებელყავი ნებისმიერი გაფრთხილება',
'minlength1'                  => 'ფაილის სახელი უნდა იყოს არანაკლებ ერთი ასო.',
'illegalfilename'             => 'ფაილის სახელი "$1" შეიცავს სიმბოლოებს, რომელთა გამოყენებაც არ არის ნებადართული სათაურებში. გთხოვთ, შეცვალოთ ფაილის სახელი და სცადოთ მისი ხელმეორედ ჩატვირთვა.',
'badfilename'                 => 'ფაილის დასახელება შეცვლილია "$1"-ით.',
'filetype-banned-type'        => "'''\".\$1\"''' მიუღებელი ფაილის ტიპია.
მიღებული ფაილის {{PLURAL:\$3|ტიპია|ტიპებია}} \$2.",
'filetype-missing'            => 'ფაილს არ აქვს გაფართოება (მაგ.: ".jpg").',
'large-file'                  => 'სასურველია ფაილი არ აღემატებოდეს $1-ს; ეს ფაილია $2.',
'largefileserver'             => 'ეს ფაილი სერვერის მიერ დაშვებულ ზომას აღემატება.',
'emptyfile'                   => 'თქვენს მიერ ჩატვირთული ფაილი ცარიელია. შესაძლოა, შეცდომა მოხდა ფაილის სახელის აკრეფის დროს. გთხოვთ შეამოწმოთ ნამდვილად გსურთ თუ არა ამ ფაილის ჩატვირთვა.',
'fileexists'                  => 'ფაილი ამ სახელით უკვე არსებობს, გთხოვთ შეამოწმოთ <strong><tt>$1</tt></strong> თუ არა ხართ დარწმუნებული, რომ მისი შეცვლა ნამდვილად გსურთ.',
'fileexists-extension'        => 'ფაილი მსგავსი სახელით არსებობს:<br />
ასატვირთი ფაილის სახელი: <strong><tt>$1</tt></strong><br />
არსებული ფაილის სახელი: <strong><tt>$2</tt></strong><br />
გთხოვთ განსხვავებული სახელი აირჩიოთ.',
'fileexists-thumb'            => "'''<center>არსებული სურათი</center>'''",
'fileexists-forbidden'        => 'ფაილი ამ სახელით უკვე არსებობს; გთხოვთ დაბრუნდეთ უკან და ატვირთოთ ფაილი ახალი სახელით. [[სურათი:$1|thumb|center|$1]]',
'fileexists-shared-forbidden' => 'ფაილი ამ სახელწოდებით უკვე არსებობს ფაილების საერთო საცავში. თუ შეიძლება, უკან დაბრუნდით და ჩატვირთეთ ფაილი სხვა სახელწოდებით. [[Image:$1|thumb|center|$1]]',
'successfulupload'            => 'წარმატებული გადატვირთვა',
'uploadwarning'               => 'გადატვირთვის შეხსენება',
'savefile'                    => 'ფაილის შენახვა',
'uploadedimage'               => 'დამატება "[[$1]]"',
'overwroteimage'              => 'ატვირთულია "[[$1]]"-ის ახალი ვერსია',
'uploaddisabled'              => 'ატვირთვა შეუძლებელია',
'uploaddisabledtext'          => 'ამ ვიკიზე ფაილების ატვირთვა შეუძლებელია.',
'uploadcorrupt'               => 'ფაილი დაზიანებულია ან არასწორი გაფართოვება აქვს. გთხოვთ შეამოწმოთ ფაილი და განმეორებით ატვირთეთ.',
'uploadvirus'                 => 'ფაილი ვირუსს შეიცავს! დეტალები: $1',
'sourcefilename'              => 'წყარო:',
'destfilename'                => 'საბოლოო სახელი:',
'watchthisupload'             => 'უთვალთვალე ამ გვერდს',
'filewasdeleted'              => 'ამ სახელწოდების ფაილი უკვე არსებობდა, მაგრამ წაშლილ იქნა. ხელმეორედ ჩატვირთვამდე იხილეთ $1.',
'upload-wasdeleted'           => "'''გაფრთხილეა: თქვენ ტვირთავთ ფაილს, რომელიც წინათ წაიშალა.'''

გთხოვთ დაფიქრდეთ რამდენად მიზანშეწონილია ამ ფაილის აქ ატვირთვა.
ინფორმაციისთვის ქვემოთ ამ ფაილის წაშლის ისტორია:",

'upload-proto-error'     => 'არასწორი პროტოკოლი',
'upload-file-error'      => 'შიდა შეცდომა',
'upload-misc-error'      => 'უცნობია ატვირთვის შეცდომა',
'upload-misc-error-text' => 'ატვირთვისას უცნობი სახის შეცდომა გაიპარა.
გთხოვთ შეამოწმოთ თუ URL სწორია და ხელმისაწვდომია და ისევ სცადოთ.
თუ პრობლემა ვერ გადაიჭრა, მიმართეთ [[Special:ListUsers/sysop|ადმინისტრატორს]].',

# Some likely curl errors. More could be added from <http://curl.haxx.se/libcurl/c/libcurl-errors.html>
'upload-curl-error6' => 'URL მიუწვდომელია',

'license'            => 'ლიცენზია:',
'nolicense'          => 'არაფერი არის მონიშნული',
'upload_source_file' => ' (ფაილი შენს კომპიუტერზე)',

# Special:ImageList
'imagelist_search_for'  => 'ძიება სურათის სახელის მიხედვით:',
'imgfile'               => 'ფაილი',
'imagelist'             => 'სურათების სია',
'imagelist_date'        => 'თარიღი',
'imagelist_name'        => 'სახელი',
'imagelist_user'        => 'მომხმარებელი',
'imagelist_size'        => 'ზომა (ბაიტები)',
'imagelist_description' => 'აღწერილობა',

# Image description page
'filehist'                       => 'ფაილის ისტორია',
'filehist-help'                  => 'დააწკაპუნეთ თარიღზე/დროზე, რათა იხილოთ ფაილი, როგორც ის მაშინ გამოიყურებოდა.',
'filehist-deleteall'             => 'წაშალე ყველა',
'filehist-deleteone'             => 'წაშლა',
'filehist-revert'                => 'დააბრუნე',
'filehist-current'               => 'მიმდინარე',
'filehist-datetime'              => 'თარიღი/დრო',
'filehist-user'                  => 'მომხმარებელი',
'filehist-dimensions'            => 'განზომილებები',
'filehist-filesize'              => 'ფაილის ზომა',
'filehist-comment'               => 'კომენტარი',
'imagelinks'                     => 'ბმულები',
'linkstoimage'                   => 'მომდევნო {{PLURAL:$1|გვერდი|გვერდები}} ებმის ამ ფაილს:',
'nolinkstoimage'                 => 'არ არსებობს ამ ფაილთან დაკავშირებული გვერდები.',
'sharedupload'                   => 'ეს ფაილი ჩატვირთულია საერთო სარგებლობისათვის და შეიძლება გამოყენებულ იქნეს სხვა პროექტების მიერ.',
'shareduploadwiki'               => 'გთხოვთ, იხილოთ $1 შემდგომი ინფორმაციის მისაღებად.',
'shareduploadwiki-linktext'      => 'ფაილის აღწერის გვერდი',
'shareduploadduplicate'          => 'ეს ფაილი წარმოადგენს $1 დუბლიკატს საერთო საცავიდან.',
'shareduploadduplicate-linktext' => 'სხვა ფაილის',
'shareduploadconflict'           => 'ამ იგივე სახელწოდება აქვს, რაც $1 საერთო საცავიდან.',
'shareduploadconflict-linktext'  => 'სხვა ფაილს',
'noimage'                        => 'ამ სახელის მქონე ფაილი არ არსებობს, თქვენ შეგიძლიათ $1.',
'noimage-linktext'               => 'ფაილის ატვირთვა',
'uploadnewversion-linktext'      => 'ატვირთეთ ამ ფაილის ახალი ვერსია',
'imagepage-searchdupe'           => 'ფაილების დუბლიკატების ძიება',

# File reversion
'filerevert'         => 'დააბრუნე $1',
'filerevert-legend'  => 'დააბრუნე ფაილი',
'filerevert-comment' => 'კომენტარი:',
'filerevert-submit'  => 'გაუქმება',

# File deletion
'filedelete'                  => '$1 წაშლა',
'filedelete-legend'           => 'ფაილის წაშლა',
'filedelete-intro'            => "თქვენ შლით '''[[Media:$1|$1]]'''.",
'filedelete-comment'          => 'კომენტარი:',
'filedelete-submit'           => 'წაშლა',
'filedelete-success'          => "'''$1''' წაშლილია.",
'filedelete-nofile'           => "'''$1''' არ არსებობს {{SITENAME}}-ში.",
'filedelete-nofile-old'       => "მითითებული ატრიბუტებით '''$1'''-ის არქივირებული ვერსია არ არსებობს.",
'filedelete-iscurrent'        => 'თქვენ ცდილობთ ამ ფაილის ყველაზე ახალი ვერსიის წაშლას. გთხოვთ, ის ჯერ წინა ვერსიაზე გადაიტანოთ.',
'filedelete-otherreason'      => 'სხვა/დამატებითი მიზეზი:',
'filedelete-reason-otherlist' => 'სხვა მიზეზი',
'filedelete-edit-reasonlist'  => 'წაშლის მიზეზების რედაქტირება',

# MIME search
'mimesearch' => 'MIME ძიება',
'mimetype'   => 'MIME ტიპი:',
'download'   => 'გადმოტვირთვა',

# Unwatched pages
'unwatchedpages' => 'არაკონტროლირებადი გვერდები',

# List redirects
'listredirects' => 'გადამისამართებების სია',

# Unused templates
'unusedtemplates'     => 'გამოუყენებელი თარგები',
'unusedtemplatestext' => 'ეს გვერდი თარგების სახელთა სივრცეში მოიცავს ყველა იმ გვერდის ჩამონათვალს, რომელიც არ არის მოთავსებული სხვა გვერდებზე. გახსოვდეთ თარგების  სხვა ბმულებს  სანამ წაშლით შეამოწმეთ.',
'unusedtemplateswlh'  => 'სხვა ბმულები',

# Random page
'randompage'         => 'ნებისმიერი გვერდი',
'randompage-nopages' => 'ამ სახელთა სივრცეში არ არის გვერდები.',

# Random redirect
'randomredirect'         => 'ნებისმიერი გადამისამართება',
'randomredirect-nopages' => 'ამ სახელთა სივრცეში გადამისამართებები არ არის.',

# Statistics
'statistics'             => 'სტატისტიკა',
'sitestats'              => 'საიტის სტატისტიკა',
'userstats'              => 'მომხმარებლის სტატისტიკა',
'sitestatstext'          => "მონაცემთა ბაზაში სულ არის '''$1''' გვერდი. მასში შედის: სტატიების ''განხილვის'' გვერდები, გვერდები {{SITENAME}} შესახებ, გადამისამართების გვერდები, აგრეთვე სხვები, რომლებიც  შესაძლოა არ წარმოადგენს ”ენციკლოპედიურ გვერდებს”. ამის გათვალისწინებით, სრულფასოვნად მიჩნეულია  '''$2''' გვერდი.

ატვირთულია '''$8''' ფაილი.

ვიკის დაარსებიდან დღემდე გვერდები დათვალიერებულ იქნა '''$3'''-ჯერ, ხოლო რედაქტირება განხორციელდა '''$4'''-ჯერ. ეს ნიშნავს, რომ ყოველ გვერდზე საშუალოდ მოდის '''$6''' დათვალიერება და '''$5''' რედაქტირება.

[http://www.mediawiki.org/wiki/Manual:Job_queue დავალებათა რიგის] სიგრძეა '''$7'''.",
'userstatstext'          => "არსებობენ '''$1''' რეგისტრირებული მომხმარებელი, რომელთა შორის '''$2''' (ან '''$4%''') ადმინისტრატორია. (იხილეთ $3).",
'statistics-mostpopular' => 'ყველზე ხშირად ხილვადი გვერდები',

'disambiguations'     => 'მრავალმნიშვნელოვანი გვერდები',
'disambiguationspage' => 'Template:მრავალმნიშვნელოვანი',

'doubleredirects'     => 'ორმაგი გადამისამართება',
'doubleredirectstext' => 'ყოველი მწკრივი შეიცავს ბმულებს პირველ და მეორე გადამისამართებაზე, აგრეთვე მეორე გადამისამართების ტექსტის პირველ სტრიქონს, რომელშიც ჩვეულებრივ მითითებულია რეალური “სამიზნე” გვერდის სათაური. საჭიროა, რომ პირველი გადამისამართებაც უთითებდეს ამ გვერდზე.',

'brokenredirects'        => 'გაწყვეტილი გადამისამართება',
'brokenredirectstext'    => 'შემდეგი გადამისამართება გაკეთებულია არარსებულ გვერდებზე.',
'brokenredirects-edit'   => '(რედაქტირება)',
'brokenredirects-delete' => '(წაშლა)',

'withoutinterwiki'         => 'გვერდები ენის ბმულების გარეშე',
'withoutinterwiki-summary' => 'შემდეგ გვერდებს სხვა ენების ვერსიებზე არ აქვთ ბმულები:',
'withoutinterwiki-submit'  => 'ჩვენება',

'fewestrevisions' => 'ყველაზე ნაკლებად რედაქტირებული სტატიები',

# Miscellaneous special pages
'nbytes'                  => '$1 ბაიტი',
'ncategories'             => '$1 კატეგორია',
'nlinks'                  => '$1 ბმული',
'nmembers'                => '$1 წევრი',
'nrevisions'              => '$1 რედაქტირება',
'nviews'                  => '$1 ჩვენება',
'specialpage-empty'       => 'ეს გვერდი ცარიელია.',
'lonelypages'             => 'ობოლი გვერდები',
'lonelypagestext'         => 'შემდეგ გვერდებზე არ არის ბმულები სხვა გვერდებიდან {{SITENAME}}-ში.',
'uncategorizedpages'      => 'გვერდები კატეგორიის გარეშე',
'uncategorizedcategories' => 'კატეგორიები კატეგორიის გარეშე',
'uncategorizedimages'     => 'სურათები კატეგორიის გარეშე',
'uncategorizedtemplates'  => 'თარგები კატეგორიების გარეშე',
'unusedcategories'        => 'გამოუყენებელი კატეგორიები',
'unusedimages'            => 'გამოუყენებელი სურათები',
'popularpages'            => 'პოპულარული გვერდები',
'wantedcategories'        => 'მოთხოვნილი კატეგორიები',
'wantedpages'             => 'მოთხოვნილი გვერდები',
'mostlinked'              => 'ყველაზე მეტი ბმულების მქონე გვერდები',
'mostlinkedcategories'    => 'ყველაზე მეტი ბმულების მქონე კატეგორიები',
'mostlinkedtemplates'     => 'ყველაზე მეტი ბმულების მქონე თარგები',
'mostcategories'          => 'ყველაზე მეტი კატეგორიის მქონე სტატიები',
'mostimages'              => 'ყველაზე მეტი ბმულების მქონე სურათები',
'mostrevisions'           => 'ყველაზე მეტად რედაქტირებული სტატიები',
'prefixindex'             => 'საძიებელი სიტყვის დასაწყისის მიხედვით',
'shortpages'              => 'მოკლე გვერდები',
'longpages'               => 'გრძელი გვერდები',
'deadendpages'            => 'ჩიხის გვერდები',
'deadendpagestext'        => 'ამ ვიკიში შემდგომ გვერდებს არ აქვთ ბმული სხვა გვერდებთან.',
'protectedpages'          => 'დაცული გვერდები',
'protectedtitles'         => 'დაცული სათაურები',
'listusers'               => 'მომხმარებლების სია',
'newpages'                => 'ახალი გვერდები',
'newpages-username'       => 'მომხმარებლის სახელი:',
'ancientpages'            => 'ხანდაზმული გვერდები',
'move'                    => 'გადატანა',
'movethispage'            => 'ამ გვერდის გადატანა',
'unusedimagestext'        => '<p>გთხოვთ გაითვალისწინოთ, რომ შეიძლება სხვა Wiki ზოგიერთ ამ გამოსახულებას იყენებს.</p>',
'unusedcategoriestext'    => 'შემდეგი კატეგორიები არსებობს, თუმცა მათ სხვა კატეგორიები ან გვერდები არ იყენებს.',
'notargettitle'           => 'სამიზნე არაა',
'notargettext'            => 'თქვენ არ მიუთითეთ სამიზნე გვერდი ან მომხმარებელი
ამ ფუნქციის შესასრულებლად.',

# Book sources
'booksources'               => 'წიგნის წყაროები',
'booksources-search-legend' => 'წიგნის წყაროს ძებნა',
'booksources-go'            => 'გადასვლა',
'booksources-text'          => 'ქვემოთ არის ვებ გვერდების ბმულების სია სადაც იყიდება ახალი და ნახმარი წიგნები, და შესაძლოა შეიცავდნენ დამატებით ინფორმაციას წიგნების შესახებ, რომლებსაც ეძებთ:',

# Special:Log
'specialloguserlabel'  => 'მომხმარებელი:',
'speciallogtitlelabel' => 'სათაური:',
'log'                  => 'ჟურნალები',
'all-logs-page'        => 'ყველა ჟურნალი',
'log-search-submit'    => 'ძიება',
'alllogstext'          => 'ატვირთვის, წაშლის, დაცვის, ბლოკირების და ადმინისტრატორის ჟურნალის კომბინირებული ასახვა. შეგიძლიათ გაფილტროთ ჟურნალის ტიპით, მომხმარებლის სახელით ან სტატიის მიხედვით.',
'logempty'             => 'რეზულტატები არ არის სიაში.',

# Special:AllPages
'allpages'          => 'ყველა გვერდი',
'alphaindexline'    => '$1-დან $2-მდე',
'nextpage'          => 'შემდეგი გვერდი ($1)',
'prevpage'          => 'წინა გვერდი ($1)',
'allpagesfrom'      => 'გვერდების ჩვენება დაწყებული:',
'allarticles'       => 'ყველა სტატია',
'allinnamespace'    => 'ყველა გვერდი ($1 სახელთა სივრცეში)',
'allnotinnamespace' => 'ყველა გვერდი ($1 სახელთა სივრცის გარეშე)',
'allpagesprev'      => 'წინა',
'allpagesnext'      => 'შემდეგი',
'allpagessubmit'    => 'ჩვენება',
'allpagesprefix'    => 'ასახე გვერდები პრეფიქსით:',
'allpagesbadtitle'  => 'მოცემული გვერდის სათაური არასწორია ან აქვს ინტერვიკი ან ნათშორისი პრეფიქსი. იგი შესაძლოა შეიცავდეს ერთ ან მეტ სიმბოლოს, რომელიც არ შეიძლება გამოყენებულ იქნას სათაურში.',
'allpages-bad-ns'   => '{{SITENAME}} "$1" არ აქვს სახელთა სივრცე.',

# Special:Categories
'categories'                  => 'კატეგორიები',
'categoriespagetext'          => 'ვიკიპედიაში შემდეგი კატეგორიებია.',
'special-categories-sort-abc' => 'ანბანზე დალაგება',

# Special:ListUsers
'listusers-submit'   => 'ჩვენება',
'listusers-noresult' => 'მომხმარებელი ვერ ვიპოვეთ.',

# Special:ListGroupRights
'listgrouprights-group'    => 'ჯგუფი',
'listgrouprights-rights'   => 'უფლებები',
'listgrouprights-helppage' => 'Help:ჯგუფების უფლებები',
'listgrouprights-members'  => '(წევრების სია)',

# E-mail user
'emailuser'       => 'გაუგზავნეთ იმეილი ამ მომხმარებელს',
'emailpage'       => 'ელ. ფოსტა მომხმარებელს',
'emailpagetext'   => 'თუ ამ მომხმარებელმა თავის პარამეტრებში ელ. ფოსტის მოქმედი მისამართი მიუთითა, ქვემოთ მოყვანილი ფორმის შევსებისას შეგიძლიათ მისთვის შეტყობინების გაგზავნა. ელ. ფოსტის მისამართი, რომელიც თქვენს პარამეტრებში მიუთითეთ, დაფიქსირდება “გამომგზავნის” ველში, რათა ადრესატმა პასუხის გაცემა შეძლოს.',
'usermailererror' => 'ელ. ფოსტა დაბრუნდა შეცდომის გამო:',
'defemailsubject' => 'ვიკიპედია ელექტრონული ფოსტა',
'noemailtitle'    => 'ელ. ფოსტის მისამართი მითითებული არ არის',
'noemailtext'     => 'მომხმარებელმა არ მიუთითა მოქმედი ელ. ფოსტის მისამართი, ან მისი სურვილისამებრ სხვა მომხმარებლებს არ შეუძლიათ მისთვის წერილების გაგზავნა.',
'emailfrom'       => 'გამომგზავნი',
'emailto'         => 'ადრესატი',
'emailsubject'    => 'თემა:',
'emailmessage'    => 'შეტყობინება',
'emailsend'       => 'გაგზავნა',
'emailccme'       => 'ელ-ფოსტით გამომიგავნეთ ასლი.',
'emailccsubject'  => 'შეტყობინების ასლი გაუგზავნეთ $1: $2',
'emailsent'       => 'ელ. ფოსტა გაგზავნილია',
'emailsenttext'   => 'თქვენი ელ. შეტყობინება გაგზავნილია.',

# Watchlist
'watchlist'            => 'ჩემი კონტროლის სია',
'mywatchlist'          => 'ჩემი კონტროლის სია',
'watchlistfor'         => "('''$1'''-თვის)",
'nowatchlist'          => 'თქვენი კონტროლის სია ცარიელია.',
'watchlistanontext'    => '$1

იხილეთ ან რედაქტირება გაუკეთეთ თქვენი კონტროლის სიაში შეტანილ ერთეულებს.',
'watchnologin'         => 'რეგისტრაცია ვერ შესრულდა',
'watchnologintext'     => 'თქვენ უნდა მოახდინოთ [[Special:UserLogin|რეგისტრაცია]] თქვენი კონტროლის სიის მოდიფიცირებისათვის.',
'addedwatch'           => 'შეტანილია კონტროლის სიაში',
'addedwatchtext'       => "გვერდი \"[[:\$1]]\" დაემატა თქვენი [[Special:Watchlist|კონტროლის სიას]]. მომავალი ცვლილებები ამ გვერდსა და მის განხილვაზე მითითებული იქნება ამ სიაში, ხოლო ბმული ამ გვერდზე [[Special:RecentChanges|უკანასკნელი ცვლილებების სიაში]] გამოჩნდება '''სქლად''' თქვენთვის მათი შემჩნევის გასაადვილებლად.",
'removedwatch'         => 'ამოღებულია კონტროლის სიიდან',
'removedwatchtext'     => 'გვერდი "[[:$1]]" ამოღებულია თქვენი კონტროლის სიიდან.',
'watch'                => 'კონტროლი',
'watchthispage'        => 'ამ გვერდის კონტროლი',
'unwatch'              => 'კონტროლის მოხსნა',
'unwatchthispage'      => 'შეაჩარეთ კონტროლი',
'notanarticle'         => 'შიგთავსის გვერდი არ არის',
'watchnochange'        => 'არც ერთი თქვენი კონტროლის ქვეშ მყოფი ერთეული არ იქნა რედაქტირებული ნაჩვენებ დროში.',
'watchlist-details'    => '$1 გვერდს უთვალთვალებთ განხილვის გვერდების ჩაუთვლელად.',
'wlheader-enotif'      => '* ელ. ფოსტით შეტყობინება ჩართულია.',
'wlheader-showupdated' => '* გვერდები, რომლებშიც შეტანილ იქნა ცვლილებები თქვენი ბოლო ვიზიტის შემდეგ, აღნიშნულია მუქად.',
'watchmethod-recent'   => 'მიმდინარეობს უახლესი შესწორებების შემოწმება კონტროლის ქვეშ მყოფი გვერდების მიხედვით.',
'watchmethod-list'     => 'მიმდინარეობს თქვენი კონტროლის ქვეშ მყოფი გვერდების შემოწმება უახლესი შესწორებების მიხედვით.',
'watchlistcontains'    => 'თქვენი კონტროლის სია შეიცავს $1 გვერდს.',
'iteminvalidname'      => "'$1' - პრობლემა აქვს, სახელი არასწორია...",
'wlnote'               => 'ქვემოთ მოყვანილია ბოლო $1 ცვლილება უკანასკნელი <b>$2</b> საათის განმავლობაში.',
'wlshowlast'           => 'აჩვენე ბოლო $1 საათის $2 დღის $3',
'watchlist-show-bots'  => 'აჩვენე რობოტის ცვლილებები',
'watchlist-hide-bots'  => 'რობოტის ცვლილებების დამალვა',
'watchlist-show-own'   => 'აჩვენე ჩემი ცვლილებები',
'watchlist-hide-own'   => 'ჩემი რედაქტირების დამალვა',
'watchlist-show-minor' => 'აჩვენე მცირე ცვლილებები',
'watchlist-hide-minor' => 'მცირე რედაქტირებების დამალვა',

# Displayed when you click the "watch" button and it is in the process of watching
'watching'   => 'კონტროლებადი...',
'unwatching' => 'არაკონტროლირებადი...',

'enotif_mailer'                => '{{SITENAME}}. ელ. ფოსტით შეტყობინების სამსახური',
'enotif_reset'                 => 'აღნიშნე ყველა გვერდი, როგორც გადასინჯული',
'enotif_newpagetext'           => 'ეს არის ახალი გვერდი.',
'enotif_impersonal_salutation' => 'ვიკიპედიის მომხმარებელი',
'changed'                      => 'შეცვლილი',
'created'                      => 'შექმნილია',
'enotif_subject'               => '{{SITENAME}}: გვერდი $PAGETITLE $CHANGEDORCREATED იქნა მომხმარებლის $PAGEEDITOR მიერ',
'enotif_lastvisited'           => 'იხ. $1 ყველა ცვლილებისთვის თქვენი ბოლო შემოსვლის შემდეგ.',
'enotif_lastdiff'              => 'იხილეთ $1 ამ ცვლილების სანახავად.',
'enotif_anon_editor'           => 'ანონიმური მომხმარებელი $1',
'enotif_body'                  => 'პატივცემულო $WATCHINGUSERNAME,

პროექტის "{{SITENAME}}" გვერდი $PAGETITLE $CHANGEDORCREATED იქნა მომხმარებლის $PAGEEDITOR მიერ შემდეგი თარიღით: $PAGEEDITDATE. ამჟამინდელი ვერსია იხილეთ აქ: $PAGETITLE_URL.

$NEWPAGE

რედაქციის მოკლე შინაარსი: $PAGESUMMARY $PAGEMINOREDIT

დაუკავშირდით რედაქტორს:
ელ. ფოსტა: $PAGEEDITOR_EMAIL
ვიკი: $PAGEEDITOR_WIKI

შემდგომი ცვლილებების შესახებ შეტყობინებების მისაღებად ამ გვერდს კვლავ უნდა ესტუმროთ. აგრეთვე შეგიძლიათ აღადგინოთ შეტყობინებათა პარამეტრები თქვენს კონტროლის სიაში შეტანილი ყველა საკონტროლო გვერდისათვის.

             შეტყობინებათა სისტემა, {{SITENAME}}

--
თქვენი კონტროლის სიის პარამეტრების შესაცვლელად მიმართეთ:
{{SERVER}}{{localurl:Special:Watchlist/edit}}

შემდგომი დახმარება:
{{SERVER}}{{localurl:Help:Contents}}',

# Delete/protect/revert
'deletepage'                  => 'გვერდის წაშლა',
'confirm'                     => 'დადასტურება',
'excontent'                   => "შინაარსი იყო: '$1'",
'excontentauthor'             => "შინაარსი იყო: '$1' (და ერთადერთი ავტორი იყო '$2')",
'exbeforeblank'               => "გვერდის შინაარსი წაშლამდე იყო შემდეგი: '$1'",
'exblank'                     => 'გვერდი ცარიელი იყო',
'delete-confirm'              => '"$1"-ის წაშლა',
'delete-legend'               => 'წაშლა',
'historywarning'              => 'ყურადღება: გვერდს, რომლის წაშლასაც აპირებთ, აქვს ისტორია:',
'confirmdeletetext'           => 'თქვენ აპირებთ გვერდის ან გამოსახულების მისი ისტორიით მონაცემთა ბაზიდან სამუდამოდ წაშლას. გთხოვთ დაადასტუროთ რომ გესმით ამის შედეგები და აკეთებთ ამას [[{{ns:project}}:წესები]] თანახმად.',
'actioncomplete'              => 'მოქმედება შესრულებულია',
'deletedtext'                 => '"<nowiki>$1</nowiki>" წაშლილია. ბოლო წაშლილი გვერდების სია იხილეთ $2-ში.',
'deletedarticle'              => 'წაშლილია "[[$1]]"',
'dellogpage'                  => 'წაშლილთა_სია',
'dellogpagetext'              => 'ქვემოთ იხილეთ ახლად წაშლილთა სია.',
'deletionlog'                 => 'წაშლილთა სია',
'reverted'                    => 'დაბრუნდა წინა ვერსიაზე',
'deletecomment'               => 'წაშლის მიზეზი',
'deleteotherreason'           => 'სხვა/დამატებითი მიზეზი:',
'deletereasonotherlist'       => 'სხვა მიზეზი',
'deletereason-dropdown'       => '* წაშლის ხშირი მიზეზები
** ავტორის თხოვნით
** საავტორო უფლების დარღვევა
** ვანდალიზმი',
'delete-edit-reasonlist'      => 'წაშლის მიზეზების რედაქტირება',
'rollback'                    => 'რედაქტირების გაუქმება',
'rollback_short'              => 'გაუქმება',
'rollbacklink'                => 'გაუქმება',
'cantrollback'                => 'შეუძლებელია უწინდელი რედაქციის აღდგენა; ის, ვინც უკანასკნელი ცვლილებები შეიტანა, ამ სტატიის ერთადერთი ავტორია.',
'alreadyrolled'               => '[[:$1]]-ს უკანასკნელი რედაქტირების უკუქცევა შეუძლებელია [[User:$2|$2]] ([[User talk:$2|Talk]]); ვიღაცამ უკვე დაარედაქტირა ან უკუაქცია გვერდი. უკანასკნელი რედაქტორი [[User:$3|$3]] ([[User talk:$3|Talk]]).',
'editcomment'                 => 'რედაქტირება განმარტებული იყო შემდეგნაირად: "<i>$1</i>".', # only shown if there is an edit comment
'revertpage'                  => '[[Special:Contributions/$2|$2]]-ის რედაქტირება გაუქმდა; აღდგა ბოლოს [[User:$1|$1]]-ის მიერ რედაქტირებული ვერსია', # Additional available: $3: revid of the revision reverted to, $4: timestamp of the revision reverted to, $5: revid of the revision reverted from, $6: timestamp of the revision reverted from
'sessionfailure'              => 'ჩანს, რომ პრობლემაა თქვენი რეგისტრაციის სესიისათვის;
ეს მოქმედება შეჩერდა თქვენი სესიაში შემოჭრის თავიდან ასაცილებლად.
გთხოვთ, დააწკაპუნოთ ღილაკს "უკან" და თავიდან ჩართოთ გვერდი, რომლიდანაც შემოხვედით და სცადოთ განმეორებით.',
'protectlogpage'              => 'დაცვის ისტორია',
'protectedarticle'            => 'დაცულია "[[$1]]"',
'unprotectedarticle'          => 'დაცვა მოხსნილია "[[$1]]"',
'protect-legend'              => 'დაცვის დადასტურება',
'protectcomment'              => 'კომენტარი:',
'protectexpiry'               => 'ვადა',
'protect_expiry_invalid'      => 'ვადის გასვლის დრო არასწორია.',
'protect_expiry_old'          => 'ვადის გასვლის დრო წარსულშია.',
'protect-unchain'             => 'გადატანის ნებართვებზე ბლოკის მოხსნა',
'protect-text'                => 'თქვენ შეგიძლიათ აქ იხილოთ და შეცვალოთ დაცვის დონე გვერდისთვის <strong><nowiki>$1</nowiki></strong>.',
'protect-locked-access'       => 'თქვენს ანგარიშს არ აქვს გვერდის დაცვის დონეების შეცვლის ნებართვა.
იხილეთ ქვემოთ ამჟამინდელი პარამეტრები გვერდისთვის <strong>$1</strong>:',
'protect-cascadeon'           => 'ეს გვერდი ამჟამად დაცულია, ვინაიდან იგი ნაწილია ამ {{PLURAL:$1|გვერდის, რომელსაც|გვერდების, რომელთაც}} კასკადური დაცვა აქვს ჩართული.
თქვენ შეგიძლიათ ამ გვერდის დაცვის დონე შეცვალოთ, თუმცა ეს კასკადურ დაცვაზე გავლენას არ იქონიებს.',
'protect-default'             => '(სტანდარტული)',
'protect-fallback'            => 'საჭიროა "$1"-ის უფლება',
'protect-level-autoconfirmed' => 'არარეგისტრირებული მომხმარებლების დაბლოკვა',
'protect-level-sysop'         => 'მხოლოდ ადმინისტრატორები',
'protect-summary-cascade'     => 'იერარქიული',
'protect-expiring'            => 'ვადა გასდის: $1 (UTC)',
'protect-cascade'             => 'ამ გვერდში ჩართული გვერდების დაცვა (იერარქიული დაცვა)',
'protect-cantedit'            => 'თქვენ არ შეგიძლიათ ამ გვერდის დაცვის დონის შეცვლა, ვინაიდან არ გაქვთ მისი რედაქტირების ნებართვა.',
'restriction-type'            => 'უფლება',
'restriction-level'           => 'შეზღუდვის დონე:',
'minimum-size'                => 'მინ ზომა',
'maximum-size'                => 'მაქს. ზომა',
'pagesize'                    => '(ბაიტი)',

# Restrictions (nouns)
'restriction-edit'   => 'რედაქტირება',
'restriction-move'   => 'გადატანა',
'restriction-create' => 'შექმნა',
'restriction-upload' => 'ატვირთვა',

# Restriction levels
'restriction-level-sysop'         => 'სრული დაცვა',
'restriction-level-autoconfirmed' => 'ნახევრად დაცვა',
'restriction-level-all'           => 'ნებისმიერი დონე',

# Undelete
'undelete'                 => 'აჩვენე წაშლილი გვერდები',
'undeletepage'             => 'იხილეთ და აღადგინეთ წაშლილი გვერდები',
'viewdeletedpage'          => 'იხილეთ წაშლილი გვერდები',
'undeletepagetext'         => 'მომდევნო გვრდები წაშლილია, მაგრამ ჯერ კიდევ არქივშია და შესაძლებელია აღდგენა. არქივი შესაძლებელია პერიოდულად გასუფთავდეს.',
'undeleteextrahelp'        => "ამ მთლიანი გვერდის აღსადგენად, დატოვეთ ყველა მოსანიშნი უჯრა მოუნიშნავად და დააწკაპუნეთ '''აღდგენა'''. იმისათვის, რომ მოახდინოთ შერჩევითი აღდგენა მონიშნეთ უჯრები ჩასატარებელი ვერსიების შესაბამისად და დააწკაპუნეთ '''აღდგენა'''. '''გადატვირთვაზე''' დაწკაპუნებით გაუქმდება ყველა კომენტარის ველი და ყველა მოსანიშნი უჯრა.",
'undeleterevisions'        => '$1 ვერსიები დაარქივებულია',
'undeletehistory'          => 'თუ თქვენ აღადგენთ გვერდს, ყველა ვერსია აღდგება ისტორიაში. თუ ახალი გვერდი იგივე სახელით შეიქმნა მისი წაშლის შემდეგ, აღდგენილი ვერსიები გამოჩნდება წინა ისტორიაში და მიმდინარე ვერსია ავტომატურად არ ჩანაცვლდება.',
'undeletehistorynoadmin'   => 'ეს სტატია წაშლილია. წაშლის მიზეზი ნაჩვენებია მოკლე ანოტაციაში ქვემოთ, იმ მომხმარებელთა დეტალებთან ერთად ვინც რედაქტირება გაუკეთა ამ გვერდს წაშლის წინ. იმ წაშლილი ტექსტების აქტუალური ვერსიები მიღწევადია მხოლოდ ადმინისტრატორებისათვის.',
'undelete-nodiff'          => 'წინა ცვლილება ვერ ვიპოვეთ.',
'undeletebtn'              => 'აღდგენა',
'undeletelink'             => 'აღდგენა',
'undeletereset'            => 'გადატვირთეთ',
'undeletecomment'          => 'კომენტარი:',
'undeletedarticle'         => 'აღდგენილია "[[$1]]"',
'undeletedrevisions'       => '$1 ვერსია აღდგენილია',
'undeletedrevisions-files' => '$1 ვერსია და $2 ფაილი აღდგენილია',
'undeletedfiles'           => '$1 ფაილი აღდგენილია',
'cannotundelete'           => 'წაშლის გაუქმება ვერ განხორციელდა; შესაძლოა თქვენამდე სხვამ უკვე გააუქმა წაშლა.',
'undeletedpage'            => "<big>'''$1 აღდგენილია'''</big>

უკანასკნელი წაშლილთა და აღდგენის სია შეგიძლიათ ნახოთ [[Special:Log/delete|წაშლილთა სიაში]].",
'undelete-search-box'      => 'წაშლილი გვერდების ძიება',
'undelete-search-prefix'   => 'უჩვენეთ გვერდები, რომლებიც იწყება ამგვარად:',
'undelete-search-submit'   => 'ძიება',
'undelete-error-short'     => 'შეცდომა ფაილის წაშლის გაუქმებაში: $1',

# Namespace form on various pages
'namespace'      => 'სახელთა სივრცე:',
'invert'         => 'ყველა, მონიშნულის გარდა',
'blanknamespace' => '(მთავარი)',

# Contributions
'contributions' => 'მომხმარებლის წვლილი',
'mycontris'     => 'ჩემი წვლილი',
'contribsub2'   => '$1 ($2) თვის',
'nocontribs'    => 'ძებნისას მითითებული პარამეტრების შესაბამისი არც ერთი ცვლილება ნაპოვნი არ არის',
'uctop'         => '(თავი)',
'month'         => 'თვე:',
'year'          => 'წელი:',

'sp-contributions-newbies'     => 'მხოლოდ ახალი მომხმარებლების წვლილის ჩვენება',
'sp-contributions-newbies-sub' => 'ახალბედებისთვის',
'sp-contributions-blocklog'    => 'ბლოკირების ისტორია',
'sp-contributions-search'      => 'წვლილის ძიება',
'sp-contributions-username'    => 'IP მისამართი ან მომხმარებლის სახელი:',
'sp-contributions-submit'      => 'ძიება',

# What links here
'whatlinkshere'            => 'სადაა მითითებული ეს გვერდი',
'whatlinkshere-title'      => 'გვერდები, რომლებიც შეიცავენ ბმულებს "$1"-ზე',
'whatlinkshere-page'       => 'გვერდი:',
'linklistsub'              => '(ბმულების სია)',
'linkshere'                => "მომდევნო გვერდები შეიცავენ ბმულებს '''[[:$1]]'''-ზე:",
'nolinkshere'              => "'''[[:$1]]'''-ზე ბმული არ არის.",
'isredirect'               => 'გადამისამართების გვერდი',
'istemplate'               => 'ჩართვა',
'whatlinkshere-prev'       => '{{PLURAL:$1|წინა|წინა $1}}',
'whatlinkshere-next'       => '{{PLURAL:$1|შემდეგი|შემდეგი $1}}',
'whatlinkshere-links'      => '← ბმულები',
'whatlinkshere-hideredirs' => 'გადამისამართების $1',
'whatlinkshere-hidelinks'  => 'ბმულების $1',
'whatlinkshere-filters'    => 'ფილტრები',

# Block/unblock
'blockip'                  => 'მომხმარებლის ან IP მისამართის ბლოკირება',
'blockiptext'              => 'გამოიყენეთ ქვემოთ მოყვანილი ფორმა სპეციფიური IP მისამართის
ან მომხმარებლისთვის რედაქტირების ბლოკირებისთვის.
ამის გაკეთება შეიძლება მხოლოდ ვანდალიზმის ასარიდებლად,
და [[{{MediaWiki:Policy-url}}|პოლიტიკასთან]] თანხმობაში.
ჩაწერეთ სპეციფიური მიზეზი ქვემოთ (მაგ. მიუთითეთ გვერდები,
რომლებზეც ვანდალიზმი განხორციელდა).',
'ipaddress'                => 'IP მისამართი',
'ipadressorusername'       => 'IP მისამართი ან მომხმარებლის სახელი',
'ipbexpiry'                => 'ვადა',
'ipbreason'                => 'მიზეზი:',
'ipbreasonotherlist'       => 'სხვა მიზეზი',
'ipbanononly'              => 'მხოლოდ ანონიმური მომხმარებლების დაბლოკვა',
'ipbcreateaccount'         => 'ანგარიშის შექმნის აკრძალვა',
'ipbsubmit'                => 'მომხმარებლის დაბლოკვა',
'ipbother'                 => 'სხვა დრო',
'ipboptions'               => '2 საათი:2 hours,1 დღე:1 day,3 დღე:3 days,1 კვირა:1 week,2 კვირა:2 weeks,1 თვე:1 month,3 თვე:3 months,6 თვე:6 months,1 წელი:1 year,განუსაზღვრელი ვადით:infinite', # display1:time1,display2:time2,...
'ipbotheroption'           => 'სხვა',
'ipbotherreason'           => 'სხვა/დამატებითი მიზეზი:',
'badipaddress'             => 'არასწორი IP მისამართი',
'blockipsuccesssub'        => 'ბლოკირება შესრულებულია',
'blockipsuccesstext'       => '[[Special:Contributions/$1|$1]] ბლოკირებულ იქნა.<br />
იხილეთ [[Special:IPBlockList|ბლოკირებული IP მისამართების სია]].',
'ipb-edit-dropdown'        => 'დაბლოკვის მიზეზების რედაქტირება',
'ipb-unblock-addr'         => 'ბლოკის მოხსნა $1',
'ipb-unblock'              => 'მომხმარებლის სახელზე ან IP მისამართზე ბლოკის მოხსნა',
'ipb-blocklist'            => 'იხილე არსებული ბლოკირებები',
'unblockip'                => 'მომხმარებელზე ბლოკის მოხსნა',
'unblockiptext'            => 'გამოიყენეთ ქვემოთ მოცემული ფორმულარი, რათა  დაბლოკილი IP მისამართი ან მომხმარებლის სახელი აღადგინოთ.',
'ipusubmit'                => 'მისამართის ბლოკის მოხსნა',
'unblocked'                => '[[მომხმარებელი:$1|$1]] ბლოკი მოხსნილი აქვს',
'unblocked-id'             => 'ბლოკი $1 მოიხსნა',
'ipblocklist'              => 'დაბლოკილი IP მისამართები და მომხმარებლები',
'ipblocklist-legend'       => 'დაბლოკილი მომხმარებლის პოვნა',
'ipblocklist-username'     => 'მომხმარებლის სახელი ან IP მისამართი:',
'ipblocklist-submit'       => 'ძიება',
'blocklistline'            => '$1, $2 დაბლოკა $3 ($4)',
'infiniteblock'            => 'უსასრულო',
'anononlyblock'            => 'მხოლოდ ანონ.',
'createaccountblock'       => 'ანგარიშის გახსნა ბლოკირებულია',
'emailblock'               => 'დაიბლოკა ელ. ფოსტა',
'ipblocklist-empty'        => 'დაბლოკვის სია ცარიელია.',
'blocklink'                => 'ბლოკირება',
'unblocklink'              => 'ბლოკის მოხსნა',
'contribslink'             => 'წვლილი',
'autoblocker'              => 'თქვენ ავტომატურად ბლოკირებული ხართ, ვინაიდან თქვენი IP მისამართი ახლახან იქნა გამოყენებული "[[User:$1|$1]]"–ის მიერ. $1-ის ბლოკირების მიზეზი: "\'\'\'$2\'\'\'"',
'blocklogpage'             => 'დაბლოკილთა აღრიცხვა',
'blocklogentry'            => '"[[$1]]" ბლოკირების ვადის გასვლის თარიღი $2 $3.',
'blocklogtext'             => 'ეს არის მომხმარებლების დაბლოკვის და განბლოკვის ჟურნალი. ავტომატურად დაბლოკილი IP მისამართები არაა ჩამოთვლილი. იხილეთ [[Special:IPBlockList|IP ბლოკირების სია]] მიმდინარე დაბლოკვებისთვის.',
'unblocklogentry'          => 'ბლოკი მოხსნილია $1',
'block-log-flags-anononly' => 'მხოლოდ ანონიმური მომხმარებლები',
'block-log-flags-nocreate' => 'ანგარიშის შექმნა გამორთულია',
'block-log-flags-noemail'  => 'დაიბლოკა ელ. ფოსტა',
'ipb_already_blocked'      => '"$1" უკვე ბლოკირებულია',
'blockme'                  => 'დამბლოკე',
'proxyblocker-disabled'    => 'ეს ფუნქცია გაუქმებულია.',
'proxyblockreason'         => 'თქვენი IP მისამართი დაიბლოკა, ვინაიდან ის ღია პროქსია. გთხოვთ დაუკავშირდეთ თქვენ ინტერნეტ პროვაიდერს ან ტექ. სამსახურს და აცნობოთ მათ ამ სერიოზული უსაფრთხოების პრობლემის შესახებ.',
'proxyblocksuccess'        => 'შესრულებულია.',

# Developer tools
'lockdb'              => 'ჩაკეტე მონაცემთა ბაზა',
'unlockdb'            => 'მოხსენი საკეტი მონაცემთა ბაზაზე',
'unlockdbtext'        => 'მონაცემთა ბაზის განბლოკვა აღადგენს ყველა მომხმარებლის შესაძლებლობას რედაქტირება გაუკეთოს გვერდებს, შეცვალოს მათი პარამეტრები, რედაქტირება გაუკეთოს მათს საკონტროლო სიებს და სხვა მოქმედებებს მონაცემთა ბაზაში საჭირო ცვლილებების გასაკეთებლად. გთხოვთ დაადასტურეთ, რომ თქვენ ამის გაკეთება გსურთ.',
'lockconfirm'         => 'დიახ, ნამდვილად მსურს მონაცემთა ბაზის ჩაკეტვა.',
'unlockconfirm'       => 'დიახ, ნამდვილად მსურს მონაცემთა ბაზაზე საკეტის მოხსნა.',
'lockbtn'             => 'მონაცემთა ბაზის ჩაკეტვა',
'unlockbtn'           => 'მონაცემთა ბაზაზე საკეტის მოხსნა',
'locknoconfirm'       => 'თქვენ არ მოგინიშნავთ დასტურის ყუთი.',
'lockdbsuccesssub'    => 'მონაცემთა ბაზა წარმატებით ჩაიკეტა',
'unlockdbsuccesssub'  => 'მონაცემთა ბაზის ბლოკი მოიხსნა',
'unlockdbsuccesstext' => 'მომაცემთა ბაზაზე ბლოკი მოიხსნა.',
'databasenotlocked'   => 'მონაცემთა ბაზა არაა ჩაკეტილი.',

# Move page
'move-page-legend'        => 'გვერდის გადატანა',
'movepagetext'            => 'ქვემოთ მოცემული ფორმა გვერდს სახელს გადაარქმევს, რაც გადაიტანს მასთან დაკავშირებულ ისტორიასაც ახალ სახელზე. ძველი სათაური გახდება გადამისამართების გვერდი ახალ სათაურზე. ბმულები ძველი გვერდის სათაურზე არ შეიცვლება; შეამოწმეთ ორმაგი ან გამწყდარი გადამისამართებები. თქვენ ხართ პასუხისმგებელი, რომ ბმულები მკითხველს დანიშნულებისამებრ მიიყვანს.

გაითვალისწინეთ, რომ გვერდი არ გადავა, თუ ახალი სათაურით სტატია უკვე არსებობს, გარდა იმ შემთხვევისა, თუ ის ცარიელია ან გადამისამართებაა და არ აქვს გვერდის რედაქტირების ისტორია. ეს ნიშნავს, რომ თქვენ შეგიძლიათ დაუბრუნოთ ძველი სახელი გვერდს, თუ შეცდომა დაუშვით, მაგრამ არ შეგიძლიათ ზემოთ გადააწეროთ არსებულ გვერდს.

<b>გაფრთხილებთ!</b> ამ მოქმედებამ შეიძლება მნიშვნელოვანი და მოულოდნელი ცვლილება გამოიწვის პოპულარულ გვერდზე; სანამ გააგრძელებდეთ, გთხოვთ დარწმუნდეთ, რომ თქვენ გესმით თქვენი ქმედების შედეგები.',
'movepagetalktext'        => "დაკავშირებული განხილვის გვერდი ავტომატურად გადავა მასთან ერთად, '''გარდა იმ შემთხვევისა, თუ''':
*განხილვის გვერდი ახალი სათაურით და გარკვეული შინაარსით უკვე არსებობს, ან
*თქვენ მოხსნით ნიშნულს ქვევით დაფაზე.

ამ შემთხვევებში, თქვენ თავად მოგიწევთ ამ გვერდის გადატანა, სურვილისამებრ.",
'movearticle'             => 'გვერდის გადატანა',
'movenotallowed'          => 'თქვენ არ გაქვთ {{SITENAME}}-ში გვერდების გადატანის უფლება.',
'newtitle'                => 'ახალი სათაური',
'move-watch'              => 'ამ გვერდის კონტროლი',
'movepagebtn'             => 'გვერდის გადატანა',
'pagemovedsub'            => 'გადატანა შესრულებულია',
'movepage-moved'          => '<big>\'\'\'"$1" გადატანილ იქნა "$2"-ზე\'\'\'</big>', # The two titles are passed in plain text as $3 and $4 to allow additional goodies in the message.
'articleexists'           => 'ამ დასახელების გვერდი უკვე არსებობს, ან თქვენს მიერ მითითებული დასახელება არასწორია. თუ შეიძლება, მიუთითეთ სხვა სახელი.',
'talkexists'              => "'''თვით გვერდი წარმატებით გადავიდა, ხოლო განხილვის გვერდი ვერ გადავიდა, ვინაიდან ის უკვე არსებობს ახალი სათაურით. გთხოვთ მანუალურად განაცალკევოთ ისინი.'''",
'movedto'                 => 'გადატანილია',
'movetalk'                => 'დაკავშირებული განხილვის გადატანა',
'1movedto2'               => '[[$1]] გადატანილია გვერდზე [[$2]]',
'1movedto2_redir'         => '[[$1]] გადატანილია [[$2]]-ზე  გადამისამართებულ გვერდში',
'movelogpage'             => 'გადატანის რეგისტრაცია',
'movereason'              => 'მიზეზი:',
'revertmove'              => 'გაუქმება',
'delete_and_move'         => 'წაშლა და გადატანა',
'delete_and_move_text'    => '==საჭიროა წაშლა==

სტატია დასახელებით "[[:$1]]" უკვე არსებობს. გსურთ მისი წაშლა გადატანისთვის ადგილის დასათმობად?',
'delete_and_move_confirm' => 'დიახ, წაშალეთ ეს გვერდი',
'delete_and_move_reason'  => 'წაშლილია გადატანისთვის ადგილის დასათმობად',
'selfmove'                => 'წყარო და დანიშნულების სათაურები მსგავსია; შეუძლებელია გვერდის საკუთარ თავზე გადატანა.',

# Export
'export'            => 'გვერდების ექსპორტი',
'exportcuronly'     => 'მიუთითეთ მხოლოდ მიმდინარე ცვლილება, და არა სრული ისტორია',
'export-submit'     => 'ექსპორტი',
'export-addcattext' => 'გვერდების დამატება კატეგორიიდან:',
'export-addcat'     => 'დამატება',
'export-download'   => 'შეინახე როგორც ფაილი',

# Namespace 8 related
'allmessages'               => 'ყველა სისტემური შეტყობინება',
'allmessagesname'           => 'დასახელება',
'allmessagesdefault'        => 'სტანდარტული ტექსტი',
'allmessagescurrent'        => 'მიმდინარე ტექსტი',
'allmessagestext'           => 'ეს არის სახელთა სივრცე მედიავიკიში არსებული სისტემური შეტყობინებების ჩამონათვალი.',
'allmessagesnotsupportedDB' => '{{ns:special}}:AllMessages-ის უზრუნველყოფა არ ხდება, ვინაიდან wgUseDatabaseMessages გამორთულია.',
'allmessagesfilter'         => 'შეტყობინების სახელის გაფილტვრა:',
'allmessagesmodified'       => 'აჩვენე მხოლოდ შეცვლილი',

# Thumbnails
'thumbnail-more'  => 'გაზარდე',
'filemissing'     => 'ფაილი აკლია',
'thumbnail_error' => 'ესკიზის შექმნის შეცდომა: $1',

# Special:Import
'import'                     => 'გვერდების იმპორტი',
'import-interwiki-submit'    => 'იმპორტირება',
'import-interwiki-namespace' => 'გვერდების გადატანა სახელთა სივრცეში:',
'importstart'                => 'გვერდების იმპორტი...',
'import-revision-count'      => '$1 ცვლილება',
'importnopages'              => 'იმპორტისთვის გვერდები არ არის.',
'importfailed'               => 'იმპორტი ვერ განხორციელდა: $1',
'importunknownsource'        => 'იმპორტის წყაროს ტიპი უცნობია',
'importcantopen'             => 'იმპორტირებული ფაილი არ გაიხსნა',
'importbadinterwiki'         => 'არასწორი ინტერვიკი ბმული',
'importnotext'               => 'ცარიელია',
'importsuccess'              => 'იმპორტი განხორციელდა!',

# Import log
'importlogpage'                    => 'იმპორტის ჟურნალი',
'import-logentry-upload-detail'    => '$1 ცვლილება',
'import-logentry-interwiki-detail' => '$1 ცვლილება $2-დან',

# Tooltip help for the actions
'tooltip-pt-userpage'             => 'ჩემი მომხმარებლის გვერდი',
'tooltip-pt-mytalk'               => 'ჩემი განხილვის გვერდი',
'tooltip-pt-preferences'          => 'ჩემი კონფიგურაცია',
'tooltip-pt-watchlist'            => 'გვერდების სია, რომელთა ცვლილებებს თქვენ უთვალთვალებთ',
'tooltip-pt-mycontris'            => 'ჩემი წვლილის სია',
'tooltip-pt-login'                => 'სასურველია დარეგისტრირდეთ, თუმცა აუცილებელია არაა.',
'tooltip-pt-logout'               => 'გასვლა',
'tooltip-ca-talk'                 => 'შიგთავსის გვერდის განხილვა',
'tooltip-ca-edit'                 => 'თქვენ შეგიძლიათ ამ გვერდის რედაქტირება. გთხოვთ გამოიყენოთ  წინასწარი ხედვის ღილაკი სანამ გვერდს შეინახავთ.',
'tooltip-ca-addsection'           => 'დაამატეთ კომენტარი ამ განხილვას.',
'tooltip-ca-viewsource'           => 'გვერდი დაცულია. შეგიძლიათ იხილოთ მისი წყარო.',
'tooltip-ca-history'              => 'ამ გვერდის ბოლო ვერსიები.',
'tooltip-ca-protect'              => 'გვერდის დაცვა',
'tooltip-ca-delete'               => 'ამ გვერდის წაშლა',
'tooltip-ca-move'                 => 'ამ გვერდის გადატანა',
'tooltip-ca-watch'                => 'დაამატეთ ეს გვერდი თქვენი კონტროლის სიას',
'tooltip-ca-unwatch'              => 'მოხსენით ეს გვერდი თქვენი კონტროლის სიიდან',
'tooltip-search'                  => 'ძიება {{SITENAME}}',
'tooltip-search-go'               => 'მოიძიე გვერდი ზუსტად ამ სახელით',
'tooltip-p-logo'                  => 'მთავარი გვერდი',
'tooltip-n-mainpage'              => 'იხილეთ მთავარი გვერდი',
'tooltip-n-portal'                => 'პროექტის შესახებ, რა შეგიძლიათ გააკეთოთ, სად იპოვოთ',
'tooltip-n-currentevents'         => 'გაიგეთ ვრცელი ინფორმაცია მიმდინარე მოვლენებზე',
'tooltip-n-recentchanges'         => 'ვიკიში ბოლო ცვლილებების სია.',
'tooltip-n-randompage'            => 'შემთხვევითი გვერდის ჩვენება',
'tooltip-n-help'                  => 'გვერდი, სადაც იპოვით.',
'tooltip-t-whatlinkshere'         => 'ყველა ვიკი გვერდის სია, რომლებშიც ეს გვერდია მითითებული',
'tooltip-t-contributions'         => 'იხილეთ ამ მომხმარებლის წვლილის სია',
'tooltip-t-emailuser'             => 'გაუგზავნე ელ. ფოსტა ამ მომხმარებელს',
'tooltip-t-upload'                => 'ჩატვირთეთ მედიაფაილები',
'tooltip-t-specialpages'          => 'ყველა სპეციალური გვერდის სია',
'tooltip-ca-nstab-user'           => 'მომხმარებლის გვერდის ჩვენება',
'tooltip-ca-nstab-project'        => 'იხილეთ პროექტის გვერდი',
'tooltip-ca-nstab-image'          => 'სურათის გვერდის ჩვენება',
'tooltip-ca-nstab-mediawiki'      => 'იხილე სისტემური შეტყობინება',
'tooltip-ca-nstab-template'       => 'თარგის ჩვენება',
'tooltip-ca-nstab-help'           => 'იხილეთ დახმარების გვერდი',
'tooltip-ca-nstab-category'       => 'გვერდის კატეგორიის ჩვენება',
'tooltip-minoredit'               => 'მონიშნე როგორც მცირე რედაქტირება [alt-i]',
'tooltip-save'                    => 'დაამახსოვრე ცვლილებები',
'tooltip-preview'                 => 'წინასწარ გადახედე ცვლილებებს, გთხოვთ გამოიყენოთ ეს შენახვამდე! [alt-p]',
'tooltip-diff'                    => 'ტექსტში შეტანილი ცვლილებების ჩვენება. [alt-v]',
'tooltip-compareselectedversions' => 'იხილეთ ამ გვერდის  ორ შერჩეულ ვერსიას შორის განსხვავებები.',
'tooltip-watch'                   => 'ამ გვერდის დამატება თქვენს საკონტროლოს სიას [alt-w]',
'tooltip-recreate'                => 'აღადგინე ეს გვერდი მიუხედავად იმისა, რომ წაშლილ იქნა',
'tooltip-upload'                  => 'დაიწყეთ ატვირთვა',

# Stylesheets
'common.css'   => '/** აქ ჩასმული CSS ყველა გარეკანზე იმოქმედებს */',
'monobook.css' => '/* აქ ჩასმული CSS გავლენას იქონიებს Monobook ინტერფეისის მომხმარებლებზე */',

# Scripts
'common.js' => '/* აქ ნებისმიერი ჯავასკრიპტი ყველა მომხმარებლისთვის ჩაიტვირთება ყველა გვერდზე. */',

# Metadata
'nodublincore'      => 'Dublin Core RDF მეტამონაცემები ამ სერვერისთვის გათიშულია.',
'nocreativecommons' => 'Creative Commons RDF მეტამონაცემები ამ სერვერისთვის გამორთულია.',

# Attribution
'anonymous'        => 'ვიკიპედიის ანონიმური მომხმარებლები',
'siteuser'         => '{{SITENAME}} მომხმარებელი $1',
'lastmodifiedatby' => 'ეს გვერდი ბოლოს შეიცვალა $2, $1  $3-ით.', # $1 date, $2 time, $3 user
'othercontribs'    => '$1-ს ნამუშევრის მიხედვით.',
'others'           => 'სხვები',
'siteusers'        => '{{SITENAME}} მომხმარებელი $1',
'creditspage'      => 'წვლილი',
'nocredits'        => 'აქ ამ გვერდისთვის ხელმისაწვდომი ინფორმაცია არ არსებობს.',

# Spam protection
'spamprotectionmatch' => 'მომდევნო ტექსტი იყო სპამ-ფილტრის ჩართვის მიზეზი: $1',
'spam_reverting'      => 'დაბრუნება ბოლო ვერსიასთან, რომელიც არ შეიცავს ბმულს $1-თან',

# Info page
'infosubtitle' => 'გვერდის ინფორმაცია',
'numedits'     => 'რედაქტირების რაოდენობა (სტატია): $1',
'numtalkedits' => 'რედაქტირების რაოდენობა (განხილვის გვერდი): $1',

# Math options
'mw_math_png'    => 'მუდამ გამოიყენე PNG',
'mw_math_simple' => 'HTML თუ მარტივია, სხვაგვარად PNG',
'mw_math_html'   => 'HTML თუ შესაძლებელია, სხვაგვარად PNG',
'mw_math_source' => 'დატოვე როგორც TeX (ტექსტური ბრაუზერებისთვის)',
'mw_math_modern' => 'მიზანშეწონილია უფრო თანამედროვე ბრაუზერებისთვის',
'mw_math_mathml' => 'MathML თუ შესაძლებელია (ექსპერიმენტული)',

# Patrolling
'markaspatrolleddiff' => 'მონიშნე როგორც პატროლირებული',
'markaspatrolledtext' => 'მონიშნე ეს სტატია როგორც პატროლირებული',
'markedaspatrolled'   => 'მონიშნულია როგორც პატროლირებული',

# Patrol log
'patrol-log-auto' => '(ავტომატური)',

# Image deletion
'deletedrevision'       => 'წაშლილია ძველი ვერსია $1.',
'filedeleteerror-short' => 'შეცდომა ფაილის $1 წაშლისას',

# Browsing diffs
'previousdiff' => '← წინა ცვლილება',
'nextdiff'     => 'შემდეგი ცვლილება →',

# Media information
'mediawarning'         => "'''ყურადღება''': ეს ფაილი შესაძლოა შეიცავდეს მავნე კოდს, მისმა ჩატვირთვამ შესაძლოა თქვენი სისტემის კომპრომისი გამოიწვიოს.<hr />",
'imagemaxsize'         => 'სურათის მაქსიმალური ზომა აღწერილობის გვერდზე:',
'thumbsize'            => 'შემცირებული ზომა:',
'widthheightpage'      => '$1×$2, $3 გვერდი',
'file-info'            => '(ფაილის ზომა: $1, MIME ტიპი: $2)',
'file-info-size'       => '($1 × $2 პიქსელი, ფაილის ზომა: $3, MIME ტიპი: $4)',
'file-nohires'         => '<small>უფრო მაღალი გარჩევადობა არ არის შესაძლებელი.</small>',
'svg-long-desc'        => '(ფაილი SVG, ნომინალურად $1 × $2 პიქსელი, ფაილის ზომა: $3)',
'show-big-image'       => 'სრული გარჩევადობა',
'show-big-image-thumb' => '<small>ზომა წინასწარი გადახედვისას: $1 × $2 პიქსელი</small>',

# Special:NewImages
'newimages'             => 'ახალი სურათები',
'imagelisttext'         => "ქვემოთ მოცემულია '''$1''' ფაილის სია დახარისხებული მომხმარებლის $2 მიერ.",
'showhidebots'          => '(რობოტების $1)',
'noimages'              => 'გადასახედი არაფერია.',
'ilsubmit'              => 'ძიება',
'bydate'                => 'თარიღით',
'sp-newimages-showfrom' => 'ახალი ფაილების ჩვენება დაწყებული $2, $1-იდან',

# Metadata
'metadata'          => 'მეტამონაცემები',
'metadata-help'     => 'ეს ფაილი შეიცავს დამატებით ინფორმაციას, სავარაუდოდ ციფრული კამერიდან ან სკანერიდან, რომელიც მის შესაქმნელად გამოიყენეს. თუ ფაილის ორიგინალი შეცვლილია, ზოგიერთი დეტალი შესაძლოა სრულად არ ასახავდეს ფაილში შეტანილ ცვლილებებს.',
'metadata-expand'   => 'დეტალების ჩვენება ვრცლად',
'metadata-collapse' => 'დეტალების დამალვა',

# EXIF tags
'exif-imagewidth'                => 'სიგანე',
'exif-imagelength'               => 'სიმაღლე',
'exif-bitspersample'             => 'ფერის კომპონენტთა სიღრმე',
'exif-compression'               => 'შეკუმშვის მეთოდი',
'exif-photometricinterpretation' => 'პიქსელთა შემადგენლობა',
'exif-orientation'               => 'ორიენტაცია',
'exif-samplesperpixel'           => 'კომპონენტთა რიცხვი',
'exif-datetime'                  => 'ფაილის შეცვლის თარიღი და დრო',
'exif-imagedescription'          => 'სურათის ტიტული',
'exif-make'                      => 'კამერის მწარმოებელი',
'exif-model'                     => 'კამერის მოდელი',
'exif-software'                  => 'გამოყენებული პროგრამა',
'exif-artist'                    => 'ავტორი',
'exif-copyright'                 => 'საავტორო უფლებების მფლობელი',
'exif-exifversion'               => 'ვერსია Exif',
'exif-colorspace'                => 'ფერთა სივრცე',
'exif-componentsconfiguration'   => 'ცალკეულ კომპონენტთა კონფიგურაცია',
'exif-compressedbitsperpixel'    => 'სურათის შეკუმშვის რეჟიმი',
'exif-makernote'                 => 'მწარმოებლის შენიშვნები',
'exif-usercomment'               => 'მომხმარებლის კომენტარი',
'exif-relatedsoundfile'          => 'შესაბამისი აუდიო ფაილი',
'exif-datetimeoriginal'          => 'გენერირების თარიღი და დრო',
'exif-datetimedigitized'         => 'ციფრირების თარიღი და დრო',
'exif-exposuretime'              => 'ექსპოზიციის დრო',
'exif-exposuretime-format'       => '$1 წამ ($2)',
'exif-fnumber'                   => 'F ნომერი',
'exif-exposureprogram'           => 'ექსპოზიციის პროგრამა',
'exif-aperturevalue'             => 'დიაფრაგმა',
'exif-brightnessvalue'           => 'სიმკვეთრე',
'exif-exposurebiasvalue'         => 'ექსპოზიციის კომპენსაცია',
'exif-lightsource'               => 'განათების წყარო',
'exif-focallength-format'        => '$1 მმ',
'exif-exposureindex'             => 'ექსპოზიციის ინდექსი',
'exif-filesource'                => 'ფაილის წყარო',
'exif-cfapattern'                => 'CFA შაბლონი',
'exif-customrendered'            => 'სურათის ინდივიდუალური დამუშავება',
'exif-exposuremode'              => 'ექსპოზიციის არჩევის რეჟიმი',
'exif-whitebalance'              => 'თეთრის ბალანსი',
'exif-digitalzoomratio'          => 'ციფრული გადიდების კოეფიციენტი (ციფრული ზუმი)',
'exif-contrast'                  => 'კონტრასტი',
'exif-devicesettingdescription'  => 'მოწყობილობის პარამეტრების აღწერილობა',
'exif-gpslatitude'               => 'განედი',
'exif-gpslongitude'              => 'გრძედი',
'exif-gpsaltitude'               => 'სიმაღლე',
'exif-gpsspeedref'               => 'სიჩქარის ერთეული',
'exif-gpstrack'                  => 'მოძრაობის მიმართულება',
'exif-gpsimgdirection'           => 'სურათზე მიმართულება',
'exif-gpsdestdistance'           => 'მანძილი დანიშნულებამდე',
'exif-gpsdatestamp'              => 'GPS-ის მონაცემი',

# EXIF attributes
'exif-compression-1' => 'შეუკუმშავი',

'exif-unknowndate' => 'უცნობი თარიღი',

'exif-orientation-1' => 'ნორმალური', # 0th row: top; 0th column: left

'exif-componentsconfiguration-0' => 'არ არსებობს',

'exif-exposureprogram-0' => 'უცნობია',
'exif-exposureprogram-1' => 'მანუალური',
'exif-exposureprogram-2' => 'სტანდარტული პროგრამა',
'exif-exposureprogram-3' => 'დიაფრაგმის პრიორიტეტი',
'exif-exposureprogram-4' => 'ჩამკეტის პრიორიტეტი',
'exif-exposureprogram-5' => 'მხატვრული პროგრამა (აქცენტი სიმკვეთრის სიღრმეზე)',
'exif-exposureprogram-6' => 'სპორტული რეჟიმი (ჩამკეტის მაქსიმალური სისწრაფით)',
'exif-exposureprogram-7' => 'პორტრეტის რეჟიმი (მსხვილი პლანებისთვის ფონით ფოკუსის
გარეშე)',
'exif-exposureprogram-8' => 'პეიზაჟის რეჟიმი (პანორამული ფოტოებისთვის ფონით ფოკუსში)',

'exif-subjectdistance-value' => '$1 მეტრი',

'exif-meteringmode-0'   => 'უცნობი',
'exif-meteringmode-1'   => 'საშუალო',
'exif-meteringmode-255' => 'სხვა',

'exif-lightsource-0'   => 'უცნობი',
'exif-lightsource-1'   => 'დღის სინათლე',
'exif-lightsource-9'   => 'კარგი ამინდი',
'exif-lightsource-10'  => 'მოღრუბლული ამინდი',
'exif-lightsource-11'  => 'ჩრდილი',
'exif-lightsource-17'  => 'სტანდარტული განათება A',
'exif-lightsource-18'  => 'სტანდარტული განათება B',
'exif-lightsource-19'  => 'სტანდარტული განათება C',
'exif-lightsource-255' => 'განათების სხვა წყარო',

'exif-focalplaneresolutionunit-2' => 'დიუმი',

'exif-customrendered-0' => 'სტანდარტული დამუშავება',
'exif-customrendered-1' => 'არასტანდარტული დამუშავება',

'exif-exposuremode-0' => 'ავტომატური ექსპოზიცია',
'exif-exposuremode-1' => 'მანუალური ექსპოზიცია',
'exif-exposuremode-2' => 'ფოტოფირის ექსპონირების მწკრივი (ბრეკეტინგი)',

'exif-scenecapturetype-0' => 'სტანდარტული',
'exif-scenecapturetype-1' => 'პეიზაჟი',
'exif-scenecapturetype-2' => 'პორტრეტი',
'exif-scenecapturetype-3' => 'ღამის კადრი',

'exif-gaincontrol-0' => 'არაფერი',

'exif-contrast-0' => 'ნორმალური',
'exif-contrast-1' => 'სუსტი',
'exif-contrast-2' => 'ძლიერი',

'exif-saturation-0' => 'ნორმალური',

'exif-sharpness-0' => 'ნორმალური',

'exif-subjectdistancerange-0' => 'უცნობი',

'exif-gpsmeasuremode-3' => '3-განზომილებიანი გაზომვა',

# Pseudotags used for GPSSpeedRef and GPSDestDistanceRef
'exif-gpsspeed-k' => 'კილომეტრი საათში',
'exif-gpsspeed-m' => 'მილი საათში',
'exif-gpsspeed-n' => 'კვანძები',

# External editor support
'edit-externally'      => 'ამ ფაილის რედაქტირებისას გამოიყენეთ გარე პროგრამა',
'edit-externally-help' => 'დაწვრილებითი ინფორმაციისთვის იხილეთ [http://www.mediawiki.org/wiki/Manual:External_editors ჩადგმის ინსტრუქციები].',

# 'all' in various places, this might be different for inflected languages
'recentchangesall' => 'ყველა',
'imagelistall'     => 'ყველა',
'watchlistall2'    => 'ყველა',
'namespacesall'    => 'ყველა',
'monthsall'        => 'ყველა',

# E-mail address confirmation
'confirmemail'            => 'ელ. ფოსტის მისამართის დადასტურება',
'confirmemail_noemail'    => 'თქვენ არ გაქვს მითითებული მართებული ელმისამართი [[Special:Preferences|მომხმარებლის პარამეტრებში]].',
'confirmemail_text'       => '{{SITENAME}} ითხოვს თქვენი ელ. ფოსტის დადასტურებას, სანამ ელ.
ფოსტის ფუნქციების გამოყენებას შეძლებთ.
გააქტიურეთ ღილაკი ქვემოთ თქვენს მისამართზე დამადასტურებელი შეტყობინების გასაგზავნად.
თქვენს ელ. წერილში მითითებული იქნება ბმული შესაბამის კოდზე;
გახსენით ბმული თქვენს ბრაუზერში თქვენი ელ.
ფოსტის მისამართის გასააქტიურებლად.',
'confirmemail_send'       => 'დადასტურების კოდის გაგზავნა',
'confirmemail_sent'       => 'დამადასტურებელი შეტყობინება გაგზავნილია.',
'confirmemail_sendfailed' => 'შეუძლებელია დამადასტურებელი შეტყობინების გაგზავნა.
გადაამოწმეთ მისამართის შემადგენელი სიმბოლოების სისწორე.

სერვერის პასუხი: $1',
'confirmemail_invalid'    => 'არასწორი კოდი. შესაძლოა კოდი ძალადაკარგული იყოს.',
'confirmemail_needlogin'  => 'თქვენ გჭირდებათ $1 თქვენი ელ-ფოსტის მისამართის დასადასტურებლად.',
'confirmemail_success'    => 'თქვენი ელ. ფოსტის მისამართის დადასტურება მიღებულია. შეგიძლიათ ვიკიში შესვლა.',
'confirmemail_loggedin'   => 'თქვენი ელ. ფოსტის მისამართის დადასტურება მიღებულია.',
'confirmemail_error'      => 'შეცდომა მოხდა თქვენი ელ. ფოსტის მისამართის დადასტურების დროს.',
'confirmemail_subject'    => '{{SITENAME}} ელ. ფოსტის მისამართის დადასტურება',
'confirmemail_body'       => 'ვიღაცამ, შესაძლოა თქვენ, IP მისამართით $1, დაარეგისტრირეთ 
ანგარიში "$2" ამ ელ-ფოსტის მისამართით აქ {{SITENAME}}.

იმის დასადასტურებლად, რომ ეს ანგარიში ნამდვილად თქვენ გეკუთვნით
და ელ-ფოსტის შესაძლებლობების  გადააქტიურებლად {{SITENAME}} გვერდზე,
გახსენით ეს ბმული თქვენს ბრაუზერში:

$3

თუ ეს თქვენ *არ* იყავით, მაშინ ნუ შეხვალთ ამ ბმულზე.
დადასტურების კოდის ვადა ამოიწურება $4-თვის.',

# Scary transclusion
'scarytranscludefailed'  => '[ვწუხვართ, რომ $1-თვის თარგთან კავშირი არ განხორციელდა]',
'scarytranscludetoolong' => '[URL ძალიან გრძელია; უკაცრავად]',

# Trackbacks
'trackbackbox'      => '<div id="mw_trackbacks">
Trackbacks ამ სტატიისთვის:<br />
$1
</div>',
'trackbackremove'   => ' ([$1 წაშალე])',
'trackbackdeleteok' => 'Trackback წარმატებულად წაიშალა',

# Delete conflict
'deletedwhileediting' => 'ყურადღება: ეს გვერდი წაშლილ იქნა მას შემდეგ, რაც თქვენ მისი რედაქტირება დაიწყეთ!',
'confirmrecreate'     => "მომხმარებელმა [[მომხმარებელი:$1|$1]] ([[მომხმარებელი_განხილვა:$1|განხილვა]]) წაშალა ეს გვერდი მას შემდეგ რაც თქვენ დაიწყეთ რედაქტირება შემდეგი მიზეზით:
: ''$2''
გთხოვთ დაადასტუროთ, რომ ნამდვილად გსურთ ამ გვერდის აღდგენა.",
'recreate'            => 'აღადგინე',

# HTML dump
'redirectingto' => 'გადამისამართდება [[:$1]]-ზე...',

# action=purge
'confirm_purge'        => 'გსურთ ამ გვერდის ქეშის წაშლა?

$1',
'confirm_purge_button' => 'კარგი',

# AJAX search
'searchcontaining' => "მოძებნე სტატიები, რომლებიც შეიცავს ''$1''.",
'searchnamed'      => "მოძებნე სტატიები სახელით ''$1''.",
'articletitles'    => "სტატიები, რომლებიც იწყება ''$1''-ით",
'hideresults'      => 'დამალე შედეგები',

# Multipage image navigation
'imgmultipageprev' => '&larr; წინა გვერდი',
'imgmultipagenext' => 'შემდეგი გვერდი &rarr;',

# Table pager
'table_pager_next'         => 'შემდეგი გვერდი',
'table_pager_prev'         => 'წინა გვერდი',
'table_pager_first'        => 'პირველი გვერდი',
'table_pager_last'         => 'ბოლო გვერდი',
'table_pager_limit_submit' => 'აჩვენე',
'table_pager_empty'        => 'შედეგები არაა',

# Auto-summaries
'autosumm-blank'   => 'გვერდი დაცარიელდა',
'autosumm-replace' => "შინაარსი შეიცვალა '$1'-ით",
'autoredircomment' => 'გადამისამართება [[$1]]-ზე',
'autosumm-new'     => 'ახალი გვერდი: $1',

# Size units
'size-bytes'     => '$1 ბ',
'size-kilobytes' => '$1 კბ',
'size-megabytes' => '$1 მბ',
'size-gigabytes' => '$1 გბ',

# Live preview
'livepreview-loading' => 'იტვირთება…',
'livepreview-ready'   => 'იტვირთება… მზადაა!',

# Watchlist editor
'watchlistedit-numitems'      => 'თქვენი კონტროლის სია $1 სათაურს შეიცავს, განხილვის გვერდების გარდა.',
'watchlistedit-noitems'       => 'თქვენი კონტროლის სია ცარიელია.',
'watchlistedit-normal-title'  => 'კონტროლის სიის რედაქტირება',
'watchlistedit-normal-legend' => 'მოხსენით სათაურები კონტროლის სიიდან',
'watchlistedit-normal-done'   => '$1 სათაური მოიხსნა თქვენი კონტროლის სიიდან.',
'watchlistedit-raw-title'     => 'კონტროლის სიის რედაქტირება ტექსტის ფორმატში',
'watchlistedit-raw-legend'    => 'კონტროლის სიის რედაქტირება ტექსტის ფორმატში',
'watchlistedit-raw-titles'    => 'სათაურები:',
'watchlistedit-raw-submit'    => 'კონტროლის სიის განახლება',
'watchlistedit-raw-done'      => 'თქვენი კონტროლის სია განახლდა.',

# Watchlist editing tools
'watchlisttools-view' => 'დაკავშირებული ცვლილებების ხილვა',
'watchlisttools-edit' => 'კონტროლის სიის ხილვა და რედაქტირება',
'watchlisttools-raw'  => 'კონტროლის სიის რედაქტირება ტექსტის ფორმატში',

# Special:Version
'version'                  => 'ვერსია', # Not used as normal message but as header for the special page itself
'version-specialpages'     => 'სპეციალური გვერდები',
'version-other'            => 'სხვა',
'version-version'          => 'ვერსია',
'version-license'          => 'ლიცენზია',
'version-software-product' => 'პროდუქტი',
'version-software-version' => 'ვერსია',

# Special:FilePath
'filepath-page' => 'ფაილი:',

# Special:FileDuplicateSearch
'fileduplicatesearch-submit' => 'ძიება',

# Special:SpecialPages
'specialpages'               => 'სპეციალური გვერდები',
'specialpages-group-other'   => 'სხვა სპეციალური გვერდები',
'specialpages-group-changes' => 'ბოლო ცვლილებები და ჟურნალები',
'specialpages-group-users'   => 'მომხმარებლები და უფლებები',

);
