<?php
/** Crimean Turkish (Cyrillic) (Qırımtatarca (Cyrillic))
 *
 * @ingroup Language
 * @file
 *
 * @author AlefZet
 * @author Alessandro
 */

$fallback = 'ru';

$fallback8bitEncoding = 'windows-1251';

$separatorTransformTable = array(','     => '.', '.'     => ',' );

$linkTrail = '/^([a-zâçğıñöşüа-яё“»]+)(.*)$/sDu';

$namespaceNames = array(
    NS_MEDIA                     => 'Медиа',
    NS_SPECIAL                   => 'Махсус',
    NS_MAIN                      => '',
    NS_TALK                      => 'Музакере',
    NS_USER                      => 'Къулланыджы',
    NS_USER_TALK                 => 'Къулланыджы_музакереси',
    # NS_PROJECT set by $wgMetaNamespace
    NS_PROJECT_TALK              => '$1_музакереси',
    NS_IMAGE                     => 'Ресим',
    NS_IMAGE_TALK                => 'Ресим_музакереси',
    NS_MEDIAWIKI                 => 'МедиаВики',
    NS_MEDIAWIKI_TALK            => 'МедиаВики_музакереси',
    NS_TEMPLATE                  => 'Шаблон',
    NS_TEMPLATE_TALK             => 'Шаблон_музакереси',
    NS_HELP                      => 'Ярдым',
    NS_HELP_TALK                 => 'Ярдым_музакереси',
    NS_CATEGORY                  => 'Категория',
    NS_CATEGORY_TALK             => 'Категория_музакереси',
);

# Aliases to latin namespaces
$namespaceAliases = array(
	"Media"                 => NS_MEDIA,
	"Mahsus"                => NS_SPECIAL,
	"Muzakere"              => NS_TALK,
	"Qullanıcı"             => NS_USER,
	"Qullanıcı_muzakeresi"  => NS_USER_TALK,
	"$1_muzakeresi"         => NS_PROJECT_TALK,
	"Resim"                 => NS_IMAGE,
	"Resim_muzakeresi"      => NS_IMAGE_TALK,
	"MediaViki"             => NS_MEDIAWIKI,
	"MediaViki_muzakeresi"  => NS_MEDIAWIKI_TALK,
	'Şablon'                => NS_TEMPLATE,
	'Şablon_muzakeresi'     => NS_TEMPLATE_TALK,
	'Yardım'                => NS_HELP,
	'Yardım_muzakeresi'     => NS_HELP_TALK,
	'Kategoriya'            => NS_CATEGORY,
	'Kategoriya_muzakeresi' => NS_CATEGORY_TALK,
);

$skinNames = array(
    'standard'    => 'Стандарт',
    'nostalgia'   => 'Ностальгия',
    'cologneblue' => 'Кёльн асретлиги',
    'monobook'    => 'MonoBook',
    'myskin'      => 'Озь ресимлеме',
    'chick'       => 'Чипче',
    'simple'      => 'Адий'
);

$datePreferences = array(
    'default',
    'mdy',
    'dmy',
    'ymd',
    'yyyy-mm-dd',
    'ISO 8601',
);

$defaultDateFormat = 'ymd';

$datePreferenceMigrationMap = array(
    'default',
    'mdy',
    'dmy',
    'ymd'
);

$dateFormats = array(
    'mdy time' => 'H:i',
    'mdy date' => 'F j Y "с."',
    'mdy both' => 'H:i, F j Y "с."',

    'dmy time' => 'H:i',
    'dmy date' => 'j F Y "с."',
    'dmy both' => 'H:i, j F Y "с."',

    'ymd time' => 'H:i',
    'ymd date' => 'Y "с." xg j',
    'ymd both' => 'H:i, Y "с." xg j',

    'yyyy-mm-dd time' => 'xnH:xni:xns',
    'yyyy-mm-dd date' => 'xnY-xnm-xnd',
    'yyyy-mm-dd both' => 'xnH:xni:xns, xnY-xnm-xnd',

    'ISO 8601 time' => 'xnH:xni:xns',
    'ISO 8601 date' => 'xnY.xnm.xnd',
    'ISO 8601 both' => 'xnY.xnm.xnd"T"xnH:xni:xns',
);

$messages = array(
# User preference toggles
'tog-underline'               => 'Багълантыларнынъ алтыны сыз',
'tog-highlightbroken'         => 'Бош багълантыларны <a href="" class="new">бу шекильде</a> (альтернатив: <a href="" class="internal">бу шекильде</a>) косьтер.',
'tog-justify'                 => 'Параграф эки якъкъа яслап тиз',
'tog-hideminor'               => 'Кичик денъишикликлерни "Сонъки денъишикликлер" саифесинде гизле',
'tog-extendwatchlist'         => 'Келишкен козетюв джедвели',
'tog-usenewrc'                => 'Келишкен сонъки денъишикликлер джедвели (JavaScript)',
'tog-numberheadings'          => 'Серлеваларны автоматик номераландыр',
'tog-showtoolbar'             => 'Денъишиклик япкъан вакъытта ярдымджы дёгмелерни косьтер. (JavaScript)',
'tog-editondblclick'          => 'Саифени чифт басып денъиштирмеге башла (JavaScript)',
'tog-editsection'             => 'Болюмлерни [денъиштир] багълантыларны иле денъиштирме акъкъы бер',
'tog-editsectiononrightclick' => 'Болюм серлевасына онъ басып болюмде денъишикликке изин бер. (JavaScript)',
'tog-showtoc'                 => 'Мундеридже джедвели косьтер (3 данеден зияде серлевасы олгъан саифелер ичюн)',
'tog-rememberpassword'        => 'Парольни хатырла',
'tog-editwidth'               => 'Язув пенджереси там кенишликте олсун',
'tog-watchcreations'          => 'Мен яраткъан саифелерни козетюв джедвелиме экле',
'tog-watchdefault'            => 'Мен денъиштирген саифелерни козетюв джедвелиме экле',
'tog-watchmoves'              => 'Меним тарафымдан ады денъиштирильген саифелерни козетюв джедвелиме экле',
'tog-watchdeletion'           => 'Мен ёкъ эткен саифелерни козетюв джедвелиме экле',
'tog-minordefault'            => 'Япкъан денъишикликлеримни кичик денъишиклик оларакъ ишаретле',
'tog-previewontop'            => 'Ог бакъувны язув пенджеренинъ устюнде косьтер',
'tog-previewonfirst'          => 'Денъиштирмеде ог бакъувны косьтер',
'tog-nocache'                 => 'Саифелерни хатырлама',
'tog-enotifwatchlistpages'    => 'Саифе денъишикликлеринде манъа e-mail ёлла',
'tog-enotifusertalkpages'     => 'Къулланыджы саифемде денъишиклик олгъанда манъа e-mail ёлла',
'tog-enotifminoredits'        => 'Саифелерде кичик денъишиклик олгъанда да манъа e-mail ёлла',
'tog-enotifrevealaddr'        => 'Бильдирюв мектюплеринде e-mail адресимни косьтер',
'tog-shownumberswatching'     => 'Козеткен къулланыджы сайысыны косьтер',
'tog-fancysig'                => 'Адий имза (имзанъыз юкъарыда бельгилегенинъиз киби корюнир. Саифенъизге автоматик багъланты яратылмаз)',
'tog-externaleditor'          => 'Денъишикликлерни башкъа эдитор программасы иле яп',
'tog-externaldiff'            => 'Тенъештирмелерни тыш программагъа яптыр.',
'tog-showjumplinks'           => '«Бар» багълантысыны фааллештир',
'tog-uselivepreview'          => 'Джанлы ог бакъув хусусиетини къуллан (JavaScript) (даа денъеме алында)',
'tog-forceeditsummary'        => 'Денъишиклик къыскъа тарифини бош ташлагъанда мени тенбиле',
'tog-watchlisthideown'        => 'Козетюв джедвелимден меним денъишикликлеримни гизле',
'tog-watchlisthidebots'       => 'Козетюв джедвелимден бот денъишикликлерини гизле',
'tog-watchlisthideminor'      => 'Козетюв джедвелимден кичик денъишикликлерни гизле',
'tog-nolangconversion'        => 'Язув системасы вариантлары денъиштирювни ишлетме',
'tog-ccmeonemails'            => 'Дигер къулланыджыларгъа ёллагъан мектюплеримнинъ копияларыны манъа да ёлла',
'tog-diffonly'                => 'Тенъештирме саифелеринде саифенинъ эсас мундериджесини косьтерме',
'tog-showhiddencats'          => 'Гизли категорияларны косьтер',

'underline-always'  => 'Даима',
'underline-never'   => 'Асла',
'underline-default' => 'Браузер къарар берсин',

'skinpreview' => '(Ог бакъув)',

# Dates
'sunday'        => 'Базар',
'monday'        => 'Базарэртеси',
'tuesday'       => 'Салы',
'wednesday'     => 'Чаршенбе',
'thursday'      => 'Джумаакъшамы',
'friday'        => 'Джума',
'saturday'      => 'Джумаэртеси',
'sun'           => 'Базар',
'mon'           => 'Базарэртеси',
'tue'           => 'Салы',
'wed'           => 'Чаршенбе',
'thu'           => 'Джумаакъшамы',
'fri'           => 'Джума',
'sat'           => 'Джумаэртеси',
'january'       => 'январь',
'february'      => 'февраль',
'march'         => 'март',
'april'         => 'апрель',
'may_long'      => 'майыс',
'june'          => 'июнь',
'july'          => 'июль',
'august'        => 'август',
'september'     => 'сентябрь',
'october'       => 'октябрь',
'november'      => 'ноябрь',
'december'      => 'декабрь',
'january-gen'   => 'январьнинъ',
'february-gen'  => 'февральнинъ',
'march-gen'     => 'мартнынъ',
'april-gen'     => 'апрельнинъ',
'may-gen'       => 'майыснынъ',
'june-gen'      => 'июннинъ',
'july-gen'      => 'июльнинъ',
'august-gen'    => 'августнынъ',
'september-gen' => 'сентябрьнинъ',
'october-gen'   => 'октябрьнинъ',
'november-gen'  => 'ноябрьнинъ',
'december-gen'  => 'декабрьнинъ',
'jan'           => 'янв',
'feb'           => 'фев',
'mar'           => 'мар',
'apr'           => 'апр',
'may'           => 'май',
'jun'           => 'июн',
'jul'           => 'июл',
'aug'           => 'авг',
'sep'           => 'сен',
'oct'           => 'окт',
'nov'           => 'ноя',
'dec'           => 'дек',

# Categories related messages
'pagecategories'                 => '{{PLURAL:$1|Саифенинъ категориясы|Саифенинъ категориялары}}',
'category_header'                => '"$1" категориясындаки саифелер',
'subcategories'                  => 'Алт категориялар',
'category-media-header'          => '"$1" категориясындаки медиа файллары',
'category-empty'                 => "''Ишбу категорияда ич бир саифе я да медиа файл ёкъ.''",
'hidden-categories'              => 'Гизли {{PLURAL:$1|категория|категориялар}}',
'hidden-category-category'       => 'Гизли категориялар', # Name of the category where hidden categories will be listed
'category-subcat-count'          => '{{PLURAL:$2|Бу категорияда тек бир ашагъыдаки алт категория бар.|Бу категориядаки топлам $2 алт категориядан ашагъыдаки $1 алт категория косьтерильген.}}',
'category-subcat-count-limited'  => 'Бу категорияда ашагъыдаки $1 алт категория бар.',
'category-article-count'         => '{{PLURAL:$2|Бу категорияда тек бир ашагъыдаки саифе бар.|Бу категориядаки топлам $2 саифеден ашагъыдаки $1 саифе косьтерильген.}}',
'category-article-count-limited' => 'Бу категорияда ашагъыдаки $1 саифе бар.',
'category-file-count'            => '{{PLURAL:$2|Бу категорияда тек бир ашагъыдаки файл бар.|Бу категориядаки топлам $2 файлдан ашагъыдаки $1 файл косьтерильген.}}',
'category-file-count-limited'    => 'Бу категорияда ашагъыдаки $1 файл бар.',
'listingcontinuesabbrev'         => ' (девам)',

'linkprefix'        => '/^(.*?)([a-zâçğıñöşüA-ZÂÇĞİÑÖŞÜa-яёА-ЯЁ«„]+)$/sDu',
'mainpagetext'      => "<big>'''MediaWiki мувафакъиетнен къурулды.'''</big>",
'mainpagedocfooter' => "Бу викининъ ёл-ёругъыны [http://meta.wikimedia.org/wiki/Help:Contents User's Guide къулланыджы къылавузындан] огренип оласынъыз.

== Базы файдалы сайтлар ==
* [http://www.mediawiki.org/wiki/Manual:Configuration_settings Олуджы сазламалар джедвели];
* [http://www.mediawiki.org/wiki/Manual:FAQ MediaWiki боюнджа сыкъ берильген суаллернен джеваплар];
* [http://lists.wikimedia.org/mailman/listinfo/mediawiki-announce MediaWiki-нинъ янъы версияларынынъ чыкъувындан хабер йиберюв].",

'about'          => 'Акъкъында',
'article'        => 'Саифе',
'newwindow'      => '(янъы бир пенджереде ачылыр)',
'cancel'         => 'Лягъу',
'qbfind'         => 'Тап',
'qbbrowse'       => 'Бакъып чыкъ',
'qbedit'         => 'Денъиштир',
'qbpageoptions'  => 'Бу саифе',
'qbpageinfo'     => 'Багълам',
'qbmyoptions'    => 'Саифелерим',
'qbspecialpages' => 'Махсус саифелер',
'moredotdotdot'  => 'Даа...',
'mypage'         => 'Саифем',
'mytalk'         => 'Музакере саифем',
'anontalk'       => 'Бу IP-нинъ музакереси',
'navigation'     => 'Сайтта ёл тапув',
'and'            => 'ве',

# Metadata in edit box
'metadata_help' => 'Мета малюматы:',

'errorpagetitle'    => 'Хата',
'returnto'          => '$1.',
'tagline'           => '{{GRAMMAR:ablative|{{SITENAME}}}}',
'help'              => 'Ярдым',
'search'            => 'Къыдыр',
'searchbutton'      => 'Къыдыр',
'go'                => 'Бар',
'searcharticle'     => 'Бар',
'history'           => 'Саифенинъ кечмиши',
'history_short'     => 'Кечмиш',
'updatedmarker'     => 'сонъки зияретимден сонъ янъаргъан',
'info_short'        => 'Малюмат',
'printableversion'  => 'Басылмагъа уйгъун корюниш',
'permalink'         => 'Сонъки алына багъланты',
'print'             => 'Бастыр',
'edit'              => 'Денъиштир',
'create'            => 'Ярат',
'editthispage'      => 'Саифени денъиштир',
'create-this-page'  => 'Бу саифени ярат',
'delete'            => 'Ёкъ эт',
'deletethispage'    => 'Саифени ёкъ эт',
'undelete_short'    => '{{PLURAL:$1|1|$1}} денъишикликни кери кетир',
'protect'           => 'Къорчалавгъа ал',
'protect_change'    => 'денъиштир',
'protectthispage'   => 'Саифени къорчалав алтына ал',
'unprotect'         => 'Къорчалавны чыкъар',
'unprotectthispage' => 'Саифе къорчалавыны чыкъар',
'newpage'           => 'Янъы саифе',
'talkpage'          => 'Саифени музакере эт',
'talkpagelinktext'  => 'Музакере',
'specialpage'       => 'Махсус Саифе',
'personaltools'     => 'Шахсий алетлер',
'postcomment'       => 'Тефсир экле',
'articlepage'       => 'Саифеге бар',
'talk'              => 'Музакере',
'views'             => 'Корюнишлер',
'toolbox'           => 'Алетлер',
'userpage'          => 'Къулланыджы саифесини косьтер',
'projectpage'       => 'Проект саифесини косьтер',
'imagepage'         => 'Медиа файл саифесини косьтер',
'mediawikipage'     => 'Беянат саифесини косьтер',
'templatepage'      => 'Шаблон саифесини косьтер',
'viewhelppage'      => 'Ярдым саифесини косьтер',
'categorypage'      => 'Категория саифесини косьтер',
'viewtalkpage'      => 'Музакере саифесини косьтер',
'otherlanguages'    => 'Дигер тиллерде',
'redirectedfrom'    => '($1 саифесинден ёлланды)',
'redirectpagesub'   => 'Ёллама саифеси',
'lastmodifiedat'    => 'Бу саифе сонъки оларакъ $2, $1 тарихында янъарды.', # $1 date, $2 time
'viewcount'         => 'Бу саифе {{PLURAL:$1|1|$1}} дефа иришильген.',
'protectedpage'     => 'Къорчалавлы саифе',
'jumpto'            => 'Бунъа бар:',
'jumptonavigation'  => 'къуллан',
'jumptosearch'      => 'къыдыр',

# All link text and link target definitions of links into project namespace that get used by other message strings, with the exception of user group pages (see grouppage) and the disambiguation template definition (see disambiguations).
'aboutsite'            => '{{SITENAME}} акъкъында',
'aboutpage'            => 'Project:Акъкъында',
'bugreports'           => 'Хаталар акъкъында эсабатлар',
'bugreportspage'       => 'Project:Хаталар акъкъында эсабатлар',
'copyright'            => 'Малюмат $1 бинаэн кечилип ола.',
'copyrightpagename'    => '{{SITENAME}} муэллиф акълары',
'copyrightpage'        => '{{ns:project}}:Муэллиф акълары',
'currentevents'        => 'Агъымдаки вакъиалар',
'currentevents-url'    => 'Project:Агъымдаки вакъиалар',
'disclaimers'          => 'Джевапкярлыкъ реди',
'disclaimerpage'       => 'Project:Умумий Малюмат Мукъавелеси',
'edithelp'             => 'Насыл денъиштирилир?',
'edithelppage'         => 'Help:Саифе насыл денъиштирилир',
'faq'                  => 'Сыкъ берильген суаллер',
'faqpage'              => 'Project:Сыкъ берильген суаллер',
'helppage'             => 'Help:Мундеридже',
'mainpage'             => 'Баш Саифе',
'mainpage-description' => 'Баш Саифе',
'policy-url'           => 'Project:Къаиделер',
'portal'               => 'Джемаат порталы',
'portal-url'           => 'Project:Джемаат порталы',
'privacy'              => 'Гизлилик эсасы',
'privacypage'          => 'Project:Гизлилик эсасы',

'badaccess'        => 'Изин хатасы',
'badaccess-group0' => 'Япаджакъ олгъан арекетинъизни япмагъа акъкъынъыз ёкъ.',
'badaccess-group1' => 'Япаджакъ олгъан арекетинъизни тек $1 группасынынъ къулланыджылары япып олалар.',
'badaccess-group2' => 'Япаджакъ олгъан арекетинъизни тек $1 группаларынынъ къулланыджылары япып олалар.',
'badaccess-groups' => 'Япаджакъ олгъан арекетинъизни тек $1 группаларынынъ къулланыджылары япып олалар.',

'versionrequired'     => 'MediaWiki-нинъ $1 версиясы керек',
'versionrequiredtext' => 'Бу саифени къулланмакъ ичюн MediaWiki-нинъ $1 версиясы керек. [[Special:Version|Версия]] саифесине бакъ.',

'ok'                      => 'Ок',
'retrievedfrom'           => 'Менба – "$1"',
'youhavenewmessages'      => 'Янъы $1 бар ($2).',
'newmessageslink'         => 'беянатынъыз',
'newmessagesdifflink'     => 'музакере саифенъизнинъ сонъки денъишиклиги',
'youhavenewmessagesmulti' => '$1 саифесинде янъы беянатынъыз бар.',
'editsection'             => 'денъиштир',
'editold'                 => 'денъиштир',
'viewsourceold'           => 'менбаны корь',
'editsectionhint'         => 'Денъиштирильген болюм: $1',
'toc'                     => 'Мундеридже',
'showtoc'                 => 'косьтер',
'hidetoc'                 => 'гизле',
'thisisdeleted'           => '$1 корьмеге я да кери кетирмеге истейсинъизми?',
'viewdeleted'             => '$1 корь?',
'restorelink'             => 'ёкъ этильген {{PLURAL:$1|1|$1}} денъишиклиги',
'feedlinks'               => 'Бу шекильде:',
'feed-invalid'            => 'Абуне каналынынъ чешити янълыштыр.',
'feed-unavailable'        => 'Синдикация ленталары къулланылып оламай.',
'site-rss-feed'           => '$1 RSS лентасы',
'site-atom-feed'          => '$1 Atom лентасы',
'page-rss-feed'           => '«$1» - RSS лентасы',
'page-atom-feed'          => '«$1» - Atom лентасы',
'red-link-title'          => '$1 (даа язылмагъан)',

# Short words for each namespace, by default used in the namespace tab in monobook
'nstab-main'      => 'Саифе',
'nstab-user'      => 'Къулланыджы саифеси',
'nstab-media'     => 'Медиа',
'nstab-special'   => 'Махсус саифе',
'nstab-project'   => 'Проект саифеси',
'nstab-image'     => 'Файл',
'nstab-mediawiki' => 'Беянат',
'nstab-template'  => 'Шаблон',
'nstab-help'      => 'Ярдым',
'nstab-category'  => 'Категория',

# Main script and global functions
'nosuchaction'      => 'Ойле арекет ёкъ',
'nosuchactiontext'  => 'URL-де бельгиленген арекет вики программасы тарафындан танылмай',
'nosuchspecialpage' => 'Бу исимде бир махсус саифе ёкъ',
'nospecialpagetext' => "'''<big>Тапылмагъан бир махсус саифеге кирдинъиз.</big>'''

Бар олгъан бутюн махсус саифелерни [[Special:SpecialPages|{{int:specialpages}}]] саифесинде корип олурсынъыз.",

# General errors
'error'                => 'Хата',
'databaseerror'        => 'Малюмат базасынынъ хатасы',
'dberrortext'          => 'Малюмат базасына хата олды.
Бу бир ички хатасы ола биле.
"<tt>$2</tt>" функциясындан денъенген сонъки соргъулама:
<blockquote><tt>$1</tt></blockquote>.
MySQL-нинъ эсабат эткени хата "<tt>$3: $4</tt>".',
'dberrortextcl'        => 'Малюмат базасына мураджаат этювде синтаксис хатасы чыкъты.
Малюмат базасына сонъки мураджаат:
«$1»
«$2» функциясындан асыл олды.
MySQL «$3: $4» хатасыны бильдирди.',
'noconnect'            => 'Багъышланъыз! Техникий проблемалар себебинден wiki малюмат базасынынъ серверинен багълынып оламай. <br /> $1',
'nodb'                 => '$1 малюмат базасыны сайламагъа чаре ёкъ',
'cachederror'          => 'Ашагъыда сиз истеген саифенинъ кэширленген копиясыдыр. Бунынъ ичюн о эскирген ола биле.',
'laggedslavemode'      => 'Дикъкъат! Бу саифеде сонъки янъарув олмай биле.',
'readonly'             => 'Малюмат базасы килитленди',
'enterlockreason'      => 'Блок этювнинъ себебини ве тарихыны бельгиленъиз.',
'readonlytext'         => 'План ишлемелеринден себеп малюмат базасы вакътынджа блок этильди. Ишлемелер тамамлангъан сонъ нормальге дёнеджек.

Малюмат базасыны килитлеген администраторнынъ ачыкъламасы: $1',
'missing-article'      => 'Малюмат базасында тапылмасы керек олгъан саифенинъ метини тапылмады, «$1» $2.
 
Адетиндже ёкъ этильген саифенинъ кечмиш саифесине эскирген багълантынен кечип бакъкъанда бу шей олып чыкъа.
 
Меселе бунда олмаса, ихтималы бар ки, программада бир хата тапкъандырсынъыз.
Лютфен, URL язып бундан [[Special:ListUsers/sysop|администраторгъа]] хабер беринъиз.',
'missingarticle-rev'   => '(версия № $1)',
'missingarticle-diff'  => '(фаркъ: $1, $2)',
'readonly_lag'         => 'Малюмат базасынынъ экилемджи сервери бирлемджи серверинен синхронизирленгендже малюмат базасы денъиштирильмемеси ичюн автоматик оларакъ блок этильди.',
'internalerror'        => 'Ички хата',
'internalerror_info'   => 'Ички хата: $1',
'filecopyerror'        => '"$1" файлы "$2" файлына копирленип оламай.',
'filerenameerror'      => 'файлнынъ "$1" деген ады "$2" оларакъ денъиштирилип оламай.',
'filedeleteerror'      => '"$1" файлы ёкъ этилип оламай.',
'directorycreateerror' => '"$1" директориясы яратылып оламай.',
'filenotfound'         => '"$1" файлы тапылып оламай.',
'fileexistserror'      => '"$1" файлы сакъланып оламай. Ойле файл энди мевджут.',
'unexpected'           => 'бекленмеген дегер: "$1"="$2".',
'formerror'            => 'Хата: форманынъ малюматыны ёлламакънынъ ич чареси ёкъ',
'badarticleerror'      => 'Сиз япмагъа истеген ишлев кечерсиздир.',
'cannotdelete'         => 'Бельгиленген саифе я да корюниш ёкъ этилип оламады. (башкъа бир къулланыджы тарафындан ёкъ этильген ола билир).',
'badtitle'             => 'Кечерсиз серлева',
'badtitletext'         => 'Истенильген саифе ады догъру дегиль, бош яхут интервики я да тиллерара ады догъру бельгиленмеген. Ихтималы бар ки, саифе адында ясакълангъан символлар къулланыладыр.',
'perfdisabled'         => 'Афу этинъиз! Бу хусусиет, малюмат базасыны къулланыламайджакъ дереджеде явашлаткъаны ичюн, мувакъкъат къулланымдан чыкъарылды.',
'perfcached'           => 'Малюматлар даа эвельджеден азырлангъан ола билир. Бу себептен эскирген ола билир!',
'perfcachedts'         => 'Ашагъыда кэште сакълангъан малюмат булуна, сонъки янъарув заманы: $1.',
'querypage-no-updates' => 'Бу саифени денъиштирмеге шимди изин ёкъ. Бу малюмат аман янъартылмайджакъ.',
'wrong_wfQuery_params' => 'wfQuery() функциясы ичюн изинсиз параметрлер<br />
Функция: $1<br />
Истинтакъ: $2',
'viewsource'           => 'менба кодуны косьтер',
'viewsourcefor'        => '$1 ичюн',
'actionthrottled'      => 'Арекет токъталды',
'actionthrottledtext'  => 'Спамгъа къаршы куреш себебинден бу арекетни аз вакъыт ичинде чокъ кере текрарлап оламайсынъыз. Мумкюн олгъан къарардан зияде арекет яптынъыз. Бир къач дакъкъадан сонъ текрарлап бакъынъыз.',
'protectedpagetext'    => 'Бу саифени кимсе денъиштирмесин деп о блок этильди.',
'viewsourcetext'       => 'Саифенинъ кодуны козьден кечирип копирлей билесинъиз:',
'protectedinterface'   => 'Бу саифеде система интерфейсининъ метини булунгъаны ичюн мында хата чыкъмасын деп денъишиклик япмакъ ясакъ.',
'editinginterface'     => "'''Тенби''': MediaWiki система беянатылы бир саифени денъиштирмектесинъиз. Бу саифедеки денъишикликлер къулланыджы интерфейс корюнишини дигер къулланыджылар ичюн де денъиштиреджек. Лютфен, терджимелер ичюн [http://translatewiki.net/wiki/Main_Page?setlang=crh Betawiki] сайтыны (MediaWiki ресмий локализация проекти) къулланынъыз.",
'sqlhidden'            => '(SQL истинтагъы сакълы)',
'cascadeprotected'     => 'Бу саифени денъиштирип оламазсынъыз, чюнки каскад къорчалав алтында булунгъан {{PLURAL:$1|саифеге|саифелерге}} менсюптир:
$2',
'namespaceprotected'   => "'''$1''' исим фезасында саифелер денъиштирмеге акъкъынъыз ёкъ.",
'customcssjsprotected' => 'Бу саифеде дигер къулланыджынынъ шахсий сазламалары бар олгъаны ичюн саифени денъиштирип оламазсынъыз.',
'ns-specialprotected'  => '{{ns:special}} исим фезасындаки саифелерни денъиштирмек ясакъ.',
'titleprotected'       => "Бойле серлеванен саифе яратмакъ ясакътыр. Ясакълагъан: [[User:$1|$1]].
Себеп: ''$2''.",

# Login and logout pages
'logouttitle'                => 'Отурымны къапат',
'logouttext'                 => '<strong>Отурымны къапаттынъыз.</strong>

Шимди {{SITENAME}} сайтыны аноним оларакъ къулланып оласынъыз, я да янъыдан [[Special:UserLogin|отурым ачып]] оласынъыз (истер айны къулланыджы адынен, истер башкъа бир къулланыджы адынен). Web браузеринъиз кэшини темизлегендже базы саифелер санки аля даа отурымынъыз ачыкъ экен киби корюнип олур.',
'welcomecreation'            => '== Хош кельдинъиз, $1! ==
Эсабынъыз ачылды.
Бу сайтнынъ [[Special:Preferences|сазламаларыны]] шахсынъызгъа коре денъиштирмеге унутманъыз.',
'loginpagetitle'             => 'Отурым ач',
'yourname'                   => 'Къулланыджы адынъыз',
'yourpassword'               => 'Паролинъиз',
'yourpasswordagain'          => 'Парольни янъыдан яз',
'remembermypassword'         => 'Бу компьютерде мени хатырла',
'yourdomainname'             => 'Домен адынъыз',
'externaldberror'            => 'Отурымынъыз ачылгъанда бир хата олды. Бу тыш эсабынъызгъа денъишиклик япмагъа акъкъынъыз олмаювындан мейдангъа келип ола.',
'loginproblem'               => '<b>Отурымынъыз ачылгъанда проблема чыкъты.</b><br />Бир даа этинъиз!',
'login'                      => 'Отурым ач',
'nav-login-createaccount'    => 'Отурым ач / Къайд ол',
'loginprompt'                => 'Отурым ачмакъ ичюн «cookies»ге изин бермелисинъиз.',
'userlogin'                  => 'Отурым ач / Къайд ол',
'logout'                     => 'Отурымны къапат',
'userlogout'                 => 'Чыкъыш',
'notloggedin'                => 'Отурым ачмадынъыз.',
'nologin'                    => 'Даа эсап ачмадынъызмы? $1.',
'nologinlink'                => 'Къайд ол',
'createaccount'              => 'Янъы эсап ач',
'gotaccount'                 => 'Даа эвель эсап ачкъан эдинъизми? $1.',
'gotaccountlink'             => 'Отурым ачынъыз',
'createaccountmail'          => 'e-mail вастасынен',
'badretype'                  => 'Сиз бельгилеген пароллер бир биринен тенъ дегиль.',
'userexists'                 => 'Бельгилегенинъиз адлы къулланыджы энди бар. Башкъа бир къулланыджы ады бельгиленъиз.',
'youremail'                  => 'E-mail адресинъиз:',
'username'                   => 'Къулланыджы ады:',
'uid'                        => 'Къайд номери:',
'prefs-memberingroups'       => 'Азасы олгъан {{PLURAL:$1|группа|группалар}}:',
'yourrealname'               => 'Керчек адынъыз:',
'yourlanguage'               => 'Интерфейс тили:',
'yourvariant'                => 'Тиль сайлавы:',
'yournick'                   => 'Сизинъ лагъабынъыз (имзаларда косьтериледжек):',
'badsig'                     => 'Янълыш имза. HTML тэглерининъ догърулыгъыны бакъынъыз.',
'badsiglength'               => 'Къарардан зияде узун имзадыр, $1-ден зияде символдан ибарет олмасы мумкюн дегиль.',
'email'                      => 'E-mail',
'prefs-help-realname'        => 'Адынъыз (меджбурий дегильдир): Эгер бельгилесенъиз, саифелердеки денъишикликлерин кимнинъ япкъаныны косьтермек ичюн къулланыладжакъ.',
'loginerror'                 => 'Отурым ачма хатасы',
'prefs-help-email'           => 'E-mail (меджбурий дегильдир). E-mail адреси бельгиленген олса, шимдики паролинъизни унутсанъыз, янъы бир пароль истеп оласынъыз.
Эм де бу викидеки саифенъизден дигер къулланыджыларгъа сизнен багъланмагъа имкян береджек. E-mail адресинъиз башкъа къулланыджыларгъа косьтерильмейджек.',
'prefs-help-email-required'  => 'E-mail адреси лязим.',
'nocookiesnew'               => 'Къулланыджы эсабы ачылгъан, факъат танытылмагъан. {{SITENAME}} къулланыджыларны танытмакъ ичюн «cookies»ни къуллана. Сизде бу функция къапалы вазиеттедир. «Cookies» функциясыны ишлетип текрар янъы адынъыз ве паролинъизнен тырышып бакъыныз.',
'nocookieslogin'             => '{{SITENAME}} «cookies»ни къуллана. Сизде бу функция къапалы вазиеттедир. «Cookies» функциясыны ишлетип текрар тырышып бакъынъыз.',
'noname'                     => 'Къулланыджы адыны бельгилемединъиз.',
'loginsuccesstitle'          => 'Кириш япылды',
'loginsuccess'               => "'''$1 адынен {{SITENAME}} сайтында чалышып оласынъыз.'''",
'nosuchuser'                 => '«$1» адлы къулланыджы ёкъ. Догъру язгъанынъызны тешкеринъиз я да [[Special:Userlogin/signup|янъы къулланыджы эсабыны ачынъыз]].',
'nosuchusershort'            => '«<nowiki>$1</nowiki>» адлы къулланыджы тапыламады. Адынъызны догъру язгъанынъыздан эмин олунъыз.',
'nouserspecified'            => 'Къулланыджы адыны бельгилемек керексинъиз.',
'wrongpassword'              => 'Кирсеткен паролинъиз янълыштыр. Лютфен, текрар этинъиз.',
'wrongpasswordempty'         => 'Бош пароль кирменъиз/бельгилеменъиз.',
'passwordtooshort'           => 'Паролинъиз пек къыскъа. Энъ аз $1 ариф ве я ракъамдан ибарет олмалы.',
'mailmypassword'             => 'Янъы пароль йибер',
'passwordremindertitle'      => '{{grammar:genitive|{{SITENAME}}}} къулланыджынынъ пароль хатырлатувы',
'passwordremindertext'       => 'Бирев (бельки де бу сизсинъиз) $1 IP адресинден {{SITENAME}} сайты ичюн ($4) янъы къулланыджы паролини истеди.
$2 къулланыджысы ичюн янъы пароль будыр <code>$3</code>.

Эгер де янъы пароль талап этмеген олсанъыз я да эски паролинъизни бильсенъиз буны дикъкъаткъа алмайып эски паролинъизни къулланып оласынъыз.',
'noemail'                    => '$1 адлы къулланыджы ичюн e-mail бельгиленмеди.',
'passwordsent'               => 'Янъы пароль e-mail ёлунен къулланыджынынъ бельгилеген $1 адресине йиберильди. Парольни алгъан сонъ текрар кириш япынъыз.',
'blocked-mailpassword'       => 'IP адресинъизден саифелер денъиштирюв ясакълы, пароль хатырлатув функциясы да блок этильди.',
'eauthentsent'               => 'Бельгиленген e-mail адресине адресни денъиштирюв тасдыкъыны сорайджакъ бир мектюп ёлланды. Эм де мектюпте бу e-mail адресине керчектен сиз саипсинъиз деп тасдыкъламакъ ичюн япылмасы керек арекетлер тасвир этильген.',
'throttled-mailpassword'     => 'Пароль хатырлатув функциясы энди сонъки $1 саат девамында ишлетильген эди. $1 саат ичинде тек бир хатырлатув ишлетмек мумкюн.',
'mailerror'                  => 'Почта йиберильгенде бир хата мейдангъа кельди: $1',
'acct_creation_throttle_hit' => '$1 дане къулланыджы эсапны ачтыргъан алдасынъыз. Даа зияде ачтырамазсынъыз.',
'emailauthenticated'         => 'E-mail адресинъиз $1-нен тенъештирильди.',
'emailnotauthenticated'      => 'E-mail адресинъиз тасдыкъланмады, викининъ e-mail иле багълы функциялары чалышмайджакъ.',
'noemailprefs'               => 'E-mail адресинъизни бельгилемегенинъиз ичюн, викининъ e-mail иле багълы функциялары чалышмайджакъ.',
'emailconfirmlink'           => 'E-mail адресинъизни тасдыкъланъыз',
'invalidemailaddress'        => 'Язгъан адресинъиз e-mail стандартларында олмагъаны ичюн къабул этильмеди. Лютфен, догъру адресни язынъыз я да къутуны бош къалдырынъыз.',
'accountcreated'             => 'Эсап ачылды',
'accountcreatedtext'         => '$1 ичюн бир къулланыджы эсабы ачылды.',
'createaccount-title'        => '{{SITENAME}} сайтында янъы бир эсап яратылувы',
'createaccount-text'         => 'Бирев сизинъ e-mail адресини бельгилеп {{SITENAME}} сайтында ($4) "$2" адлы бир эсап яратты. Шу эсап ичюн пароль бойледир: "$3". Сиз отурым ачып паролинъизни шимди денъиштирмек керексинъиз.

Ишбу аккаунт хата оларакъ яратылгъан олса бу беянатны игнор этип оласынъыз.',
'loginlanguagelabel'         => 'Тиль: $1',

# Password reset dialog
'resetpass'               => 'Бу эсапнынъ паролини сыфырла',
'resetpass_announce'      => 'Мувакъкъат код вастасынен кирдинъиз. Киришни тамамламакъ ичюн янъы парольни мында къоюнъыз:',
'resetpass_header'        => 'Парольни сыфырла',
'resetpass_submit'        => 'Пароль къойып кир',
'resetpass_success'       => 'Паролинъиз мувафакъиетнен денъиштирильди! Отурымынъыз ачылмакъта...',
'resetpass_bad_temporary' => 'Мувакъкъат паролинъиз янълыштыр. Ола билир ки, сиз энди паролинъизни мувафакъиетнен денъиштирген я да e-mail-ге янъы бир пароль ёлламагъа риджа эткендирсинъиз.',
'resetpass_forbidden'     => 'Пароль денъиштирмек ясакъ',
'resetpass_missing'       => 'Форма боштыр.',

# Edit page toolbar
'bold_sample'     => 'Къалын язылыш',
'bold_tip'        => 'Къалын язылыш',
'italic_sample'   => 'Италик (курсив) язылыш',
'italic_tip'      => 'Италик (курсив) язылыш',
'link_sample'     => 'Саифенинъ серлевасы',
'link_tip'        => 'Ички багъланты',
'extlink_sample'  => 'http://www.example.com саифенинъ серлевасы',
'extlink_tip'     => 'Тыш багъланты (Адрес огюне http:// къоймагъа унутманъыз)',
'headline_sample' => 'Серлева язысы',
'headline_tip'    => '2-нджи севие серлева',
'math_sample'     => 'Бу ерге формуланы кирсетинъиз',
'math_tip'        => 'Риязий (математик) формула (LaTeX форматында)',
'nowiki_sample'   => 'Сербест формат метининъизни мында язынъыз.',
'nowiki_tip'      => 'вики формат этювини игнор эт',
'image_sample'    => 'Resim.jpg',
'image_tip'       => 'Ресим эклеме',
'media_sample'    => 'Ses.ogg',
'media_tip'       => 'Медиа файлына багъланты',
'sig_tip'         => 'Имзанъыз ве тарих',
'hr_tip'          => 'Горизонталь сызыкъ (пек сыкъ къулланманъыз)',

# Edit pages
'summary'                          => 'Денъишиклик къыскъа тарифи',
'subject'                          => 'Мевзу/серлева',
'minoredit'                        => 'Кичик денъишиклик',
'watchthis'                        => 'Саифени козет',
'savearticle'                      => 'Саифени сакъла',
'preview'                          => 'Ог бакъув',
'showpreview'                      => 'Ог бакъувны косьтер',
'showlivepreview'                  => 'Тез ог бакъув',
'showdiff'                         => 'Денъишикликлерни косьтер',
'anoneditwarning'                  => "'''Дикъкъат''': Отурым ачмагъанынъыздан себеп сизинъ IP адресинъиз денъишиклик тарихына язылыр.",
'missingsummary'                   => "'''Хатырлатма.''' Денъиштирмелеринъизни къыскъадан тариф этмединъиз. «Саифени сакъла» дёгмесине текрар басув иле денъиштирмелеринъиз тефсирсиз сакъланаджакълар.",
'missingcommenttext'               => 'Лютфен, ашагъыда тефсир язынъыз.',
'missingcommentheader'             => "'''Хатырлатув:''' Тефсир серлевасыны бельгилемединъиз. «Саифени сакъла» дёгмесине текрар баскъан сонъ тефсиринъиз серлевасыз сакъланыр.",
'summary-preview'                  => 'Ог бакъув тарифи',
'subject-preview'                  => 'Ог бакъув серлевасы',
'blockedtitle'                     => 'Къулланыджы блок этильди.',
'blockedtext'                      => "<big>'''Эсабынъыз я да IP адресинъиз блок этильди.'''</big>

Блок япкъан администратор: $1 .
Блок себеби: ''«$2»''.

* Блокнынъ башы: $8
* Блокнынъ сонъу: $6
* Блок этильген: $7

Блок этювни музакере этмек ичюн $1 къулланыджысына я да башкъа эр анги [[{{MediaWiki:Grouppage-sysop}}|администраторгъа]] мектюп ёллап оласынъыз.
Дикъкъат этинъиз ки, къайд олунмагъан ве e-mail адресинъизни [[Special:Preferences|шахсий сазламаларда]] тасдыкъламагъан алда, эм де блок этильгенде сизге мектюп ёлламакъ ясакъ этильген олса, администраторгъа мектюп ёллап оламазсынъыз.
Шимдики IP адресинъиз — $3, блок этюв идентификаторы — #$5. Лютфен, администраторларгъа мектюплеринъизде бу малюматны бельгиленъиз.",
'autoblockedtext'                  => 'IP адресинъиз эвельде блок этильген къулланыджылардан бири тарафындан къулланылгъаны ичюн автоматик оларакъ блок этильди. Оны блок эткен администратор ($1) бойле себепни бельгиледи:

:«$2»

* Блокнынъ башы: $8
* Блокнынъ сонъу: $6
* Блок этильген: $7

Блок этювни музакере этмек ичюн $1 къулланыджыгъа я да башкъа эр анги [[{{MediaWiki:Grouppage-sysop}}|администраторгъа]] мектюп ёллап оласынъыз.

Дикъкъат этинъиз ки, къайд олунмагъан ве e-mail адресинъизни [[Special:Preferences|шахсий сазламаларда]] тасдыкъламагъан алда, эм де блок этильгенде сизге мектюп ёлламакъ ясакъ этильген олса, администраторгъа мектюп ёллап оламазсынъыз.
Шимдики IP адресинъиз — $3, блок этюв идентификаторы — #$5. Лютфен, администраторларгъа мектюплеринъизде оны бельгиленъиз.',
'blockednoreason'                  => 'себеп бельгиленмеди',
'blockedoriginalsource'            => 'Ашагъыда «$1» саифесининъ метини булуна.',
'blockededitsource'                => "Ашагъыда «$1» саифесиндеки '''япкъан денъиштирмелеринъизнинъ''' метини булуна.",
'whitelistedittitle'               => 'Денъиштирмек ичюн отурым ачмалысынъыз',
'whitelistedittext'                => 'Саифени денъиштирмек ичюн $1 керексинъиз.',
'confirmedittitle'                 => 'E-mail адресини тасдыкъламакъ лязимдир',
'confirmedittext'                  => 'Саифени денъиштирмеден эвель e-mail адресинъизни тасдыкъламалысынъыз. Лютфен, [[Special:Preferences|сазламалар саифесинде]] e-mail адресинъизни экленъиз ве тасдыкъланъыз.',
'nosuchsectiontitle'               => 'Ойле болюм ёкъ',
'nosuchsectiontext'                => 'Мевджут олмагъан болюмни денъиштирип бакътынъыз. $1 болюми ёкъ олгъаны ичюн метнинъиз сакъланаджакъ ери ёкъ.',
'loginreqtitle'                    => 'Отурым ачмалысынъыз',
'loginreqlink'                     => 'отурым ач',
'loginreqpagetext'                 => 'Башкъа саифелерни бакъмакъ ичюн $1 борджлусынъыз.',
'accmailtitle'                     => 'Пароль ёлланды',
'accmailtext'                      => '$1 ичюн пароль мында ёлланды: $2.',
'newarticle'                       => '(Янъы)',
'newarticletext'                   => "Сиз бу багълантынен шимдилик ёкъ олгъан саифеге авуштынъыз. Янъы бир саифе яратмакъ ичюн ашагъыда булунгъан пенджереге метин язынъыз (тафсилятлы малюмат алмакъ ичюн [[{{MediaWiki:Helppage}}|ярдым саифесине]] бакъынъыз). Бу саифеге тесадюфен авушкъан олсанъыз, браузеринъиздеки '''кери''' дёгмесине басынъыз.",
'anontalkpagetext'                 => "----''Бу музакере саифеси шимдилик къайд олунмагъан я да отурымыны ачмагъан адсыз (аноним) къулланыджыгъа менсюптир. Идентификация ичюн IP адрес ишлетиле. Бир IP адресинден бир къач къулланыджы файдаланып ола.
Эгер сиз аноним къулланыджы олсанъыз ве сизге кельген беянатларны янълыштан кельгенини беллесенъиз, лютфен, артыкъ бунынъ киби къарышыкълыкъ олмасын деп [[Special:UserLogin|отурым ачынъыз]].''",
'noarticletext'                    => 'Бу саифе боштыр. Бу серлеваны башкъа саифелерде [[Special:Search/{{PAGENAME}}|къыдырып оласынъыз]] я да бу саифени озюнъиз [{{fullurl:{{FULLPAGENAME}}|action=edit}} язып оласынъыз].',
'userpage-userdoesnotexist'        => '"$1" адлы къулланыджы ёкътыр. Тамам бу саифени денъиштирмеге истегенинъизни тешкеринъиз.',
'clearyourcache'                   => "'''Ихтар:''' Сазламаларынъызны сакълагъандан сонъ денъишикликлерни корьмек ичюн браузеринъизнинъ кэшини темизлемек керексинъиз.
'''Mozilla / Firefox / Safari:''' ''Shift'' басылы экенде саифени янъыдан юклеп я да ''Ctrl-Shift-R'' япып (Macintosh ичюн ''Command-R'');
'''Konqueror:''' саифени янъыдан юкле дёгмесине я да F5 басып;
'''Opera:''' ''Tools → Preferences'' менюсинде кэшни темизлеп;
'''Internet Explorer:''' ''Ctrl'' басылы экенде саифени янъыдан юклеп я да ''Ctrl-F5'' басып.",
'usercssjsyoucanpreview'           => "<strong>Тевсие:</strong> Саифени сакъламаздан эвель '''ог бакъувны косьтер''' дёгмесине басып япкъан янъы саифенъизни козьден кечиринъиз.",
'usercsspreview'                   => "'''Сиз шимди тек ог бакъув коресинъиз - къулланыджы CSS файлынъыз аля даа сакъланмады!'''",
'userjspreview'                    => "'''Тек тест этесинъиз я да ог бакъув коресинъиз - къулланыджы JavaScript'и шимдилик сакъланмады.'''",
'userinvalidcssjstitle'            => "''Ихтар:''' \"\$1\" адынен бир тема ёкътыр. тема-ады.css ве .js файлларынынъ адлары кичик афир иле язмакъ керек, яни {{ns:user}}:Темель/'''M'''onobook.css дегиль, {{ns:user}}:Темель/'''m'''onobook.css.",
'updated'                          => '(Янъарды)',
'note'                             => '<strong>Ихтар:</strong>',
'previewnote'                      => '<strong>Бу ог бакъувдыр, метин аля даа сакъланмагъан!</strong>',
'previewconflict'                  => 'Бу ог бакъув юкъары тарир пенджересиндеки метиннинъ сакъланувдан сонъ оладжакъ корюнишини акс эте.',
'session_fail_preview'             => '<strong> Сервер сиз япкъан денъиштирмелерни сессия идентификаторы джоюлгъаны себебинден сакълап оламады.
Бу вакътынджа проблемадыр. Лютфен, текрар сакълап бакъынъыз. 
Бундан да сонъ олып чыкъмаса, малюмат локаль файлгъа сакъланъыз да браузеринъизни бир къапатып ачынъыз.</strong>',
'session_fail_preview_html'        => '<strong>Афу этинъиз! HTML сессиянынъ малюматлары гъайып олгъаны себебинден сизинъ денъиштирмелеринъизни къабул этмеге имкян ёкътыр.</strong>',
'token_suffix_mismatch'            => '<strong>Сизинъ программанъыз тарир пенджересинде пунктуация ишаретлерини догъру ишлемегени ичюн япкъан денъишиклигинъиз къабул олунмады. Денъишиклик саифенинъ метни корюнишининъ бозулмамасы ичюн лягъу этильди.
Бунынъ киби проблемалар анонимизирлеген хаталы web-проксилер къулланувдан чыкъып олалар.</strong>',
'editing'                          => '"$1" саифесини денъиштирмектесинъиз',
'editingsection'                   => '"$1" саифесинде болюм денъиштирмектесинъиз',
'editingcomment'                   => '$1 саифесине беянат эклемектесинъиз.',
'editconflict'                     => 'Денъишиклик зыт кетюви: $1',
'explainconflict'                  => "Сиз саифени денъиштирген вакъытта башкъа бири де денъишиклик япты.
Юкъарыдаки язы саифенинъ шимдики алыны косьтере.
Сизинъ денъишикликлеринъиз алткъа косьтерильди.
Сонъки денъишиклеринъизни язынынъ ичине эклемек керек оладжакъсынъыз.
\"Саифени сакъла\"гъа баскъанда '''тек''' юкъарыдаки язы сакъланаджакъ.",
'yourtext'                         => 'Сизинъ метнинъиз',
'storedversion'                    => 'Сакълангъан метин',
'nonunicodebrowser'                => '<strong>ТЕНБИ: Браузеринъизде Unicode кодировкасы танылмаз. Саифелер денъиштиргенде бутюн ASCII олмагъан символларнынъ ерине оларнынъ оналтылыкъ коду язылыр.</strong>',
'editingold'                       => '<strong>ДИКЪКЪАТ: Саифенинъ эски бир версиясында денъишиклик япмакътасынъыз.
Сакълагъанынъызда бу тарихлы версиядан кунюмизге къадар олгъан денъишикликлер ёкъ оладжакъ.</strong>',
'yourdiff'                         => 'Къаршылаштырма',
'copyrightwarning'                 => '<strong>Лютфен, дикъкъат:</strong> {{SITENAME}} сайтына къошулгъан бутюн исселер <i>$2</i> мукъавелеси даиресиндедир (тафсилят ичюн $1 саифесине бакъынъыз).
Къошкъан иссенъизнинъ башкъа инсанлар тарафындан аджымасызджа денъиштирильмесини я да азат тарзда ве сынъырсызджа башкъа ерлерге дагъытылмасыны истемесенъиз, иссе къошманъыз.<br />
Айрыджа, мында иссе къошып, бу иссенинъ озюнъиз тарафындан язылгъанына, я да джемааткъа ачыкъ бир менбадан я да башкъа бир азат менбадан копирленгенине гарантия берген оласынъыз.<br />
<strong><center>МУЭЛЛИФ АКЪКЪЫ ИЛЕ КЪОРЧАЛАНГЪАН ИЧ БИР МЕТИННИ МЫНДА ЭКЛЕМЕНЪИЗ!</center></strong>',
'copyrightwarning2'                => '<strong>Лютфен, дикъкъат:</strong> {{SITENAME}} сайтына сиз къошкъан бутюн исселер башкъа бир къулланыджы тарафындан денъиштирилип я да ёкъ этилип олур. Къошкъан иссенъизнинъ башкъа инсанлар тарафындан аджымасызджа денъиштирильмесини я да азат тарзда ве сынъырсызджа башкъа ерлерге дагъытылмасыны истемесенъиз, иссе къошманъыз.<br />
Айрыджа, мында иссе къошып, бу иссенинъ озюнъиз тарафындан язылгъанына, я да джемааткъа ачыкъ бир менбадан я да башкъа бир азат менбадан копирленгенине гарантия берген оласынъыз ($1 бакъынъыз).<br />
<strong>МУЭЛЛИФ АКЪКЪЫ ИЛЕ КЪОРЧАЛАНГЪАН ИЧ БИР МЕТИННИ МЫНДА ЭКЛЕМЕНЪИЗ!</strong>',
'longpagewarning'                  => '<strong>ТЕНБИ: Бу саифе $1 килобайт буюклигиндедир; базы браузерлер денъишиклик япкъан вакъытта 32kb ве устю буюкликлерде проблемалар яшап олур. Саифени болюмлерге айырмагъа тырышынъыз.</strong>',
'longpageerror'                    => '<strong>ТЕНБИ: Бу саифе $1 килобайт буюклигиндедир. Максимум изинли буюклик исе $2 килобайт. Бу саифе сакъланып оламаз.</strong>',
'readonlywarning'                  => '<strong>ДИКЪКЪАТ: Бакъым себеби иле малюмат базасы ал-азырда килитлидир. Бу себептен денъишикликлеринъиз шимди сакъланамамакъта. Язгъанларынъызны башкъа бир эдитор программасына алып сакълап олур ве даа сонъ текрар мында кетирип сакълап олурсынъыз</strong>',
'protectedpagewarning'             => '<strong>ТЕНБИ: Бу саифе къорчалав алтына алынгъан ве ялынъыз администраторлар тарафындан денъиштирилип олур.</strong>',
'semiprotectedpagewarning'         => "'''Тенби''': Бу саифе тек къайдлы къулланыджылар тарафындан денъиштирилип олур.",
'cascadeprotectedwarning'          => "'''Тенби:''' Бу саифени тек «Администраторлар» группасына кирген къулланыджылар денъиштирип олалар, чюнки о каскад къорчалав алтында булунгъан {{PLURAL:$1|саифеге|саифелерге}} менсюптир:",
'titleprotectedwarning'            => '<strong>ТЕНБИ: Бу саифе къорчалав алтындадыр, тек еткили къулланыджылар оны яратып олалар.</strong>',
'templatesused'                    => 'Бу саифеде къулланылгъан шаблонлар:',
'templatesusedpreview'             => 'Бу ог бакъувда къулланылгъан шаблонлар:',
'templatesusedsection'             => 'Бу болюмде къулланылгъан шаблонлар:',
'template-protected'               => '(къорчалав алтында)',
'template-semiprotected'           => '(къысмен къорчалав алтында)',
'hiddencategories'                 => 'Бу саифе $1 гизли категориягъа менсюптир:',
'nocreatetitle'                    => 'Саифе яратув сынъырлыдыр',
'nocreatetext'                     => '{{SITENAME}} сайтында янъы саифе яратув сынъырлыдыр.
Кери къайтып мевджут олгъан саифени денъиштире, [[Special:UserLogin|отурым ача я да янъы бир эсап яратып оласынъыз]].',
'nocreate-loggedin'                => 'Янъы саифелер яратмагъа изининъиз ёкътыр.',
'permissionserrors'                => 'Иришим акъларынынъ хаталары',
'permissionserrorstext'            => 'Буны япмагъа изининъиз ёкътыр. {{PLURAL:$1|Себеп|Себеплер}}:',
'permissionserrorstext-withaction' => 'Ашагъыдаки {{PLURAL:$1|себептен|себеплерден}} $2 ишлемини япмагъа еткинъиз ёкъ:',
'recreate-deleted-warn'            => "'''Дикъкъат: эвельдже ёкъ этильген саифени янъыдан яратмагъа тырышасынъыз.'''

Бу саифени керчектен де янъыдан яратмагъа истейсинъизми? Ашагъыда ёкъ этилюв журналы булуна.",

# "Undo" feature
'undo-success' => 'Денъишиклик лягъу этилип ола. Лютфен, айны бу денъишикликлер мени меракъландыра деп эмин олмакъ ичюн версиялар тенъештирилювини козьден кечирип денъишикликлерни тамамен япмакъ ичюн «Саифени сакъла» дёгмесине басынъыз.',
'undo-failure' => 'Арадаки денъишикликлер бири-бирине келишикли олмагъаны ичюн денъишиклик лягъу этилип оламай.',
'undo-summary' => '[[Special:Contributions/$2|$2]] ([[User talk:$2|музакере]]) къулланыджысынынъ $1 номералы денъишиклигини лягъу этюв.',

# Account creation failure
'cantcreateaccounttitle' => 'Эсап яратмакънынъ ич чареси ёкъ.',
'cantcreateaccount-text' => "Бу IP адресинден ('''$1''') эсап яратув [[User:$3|$3 къулланыджы]] тарафындан блок этильди.

$3 мына бойле бир себеп бельгиледи: ''$2''",

# History pages
'viewpagelogs'        => 'Бу саифенинъ журналларыны косьтер',
'nohistory'           => 'Бу саифенинъ кечмиш версиясы ёкъ.',
'revnotfound'         => 'Версия тапылмады',
'revnotfoundtext'     => 'Саифенинъ эски версиясы тапылмады. Лютфен, бу саифеге кирмек ичюн къуллангъан багълантынъызнынъ догърулыгъыны тешкеринъиз.',
'currentrev'          => 'Ал-азырки версия',
'revisionasof'        => 'Саифенинъ $1 тарихындаки алы',
'revision-info'       => 'Саифенинъ $2 тарафындан олуштырылгъан $1 тарихындаки алы',
'previousrevision'    => '← Эвельки алы',
'nextrevision'        => 'Сонъраки алы →',
'currentrevisionlink' => 'энъ янъы алыны косьтер',
'cur'                 => 'фаркъ',
'next'                => 'сонъраки',
'last'                => 'сонъки',
'page_first'          => 'ильк',
'page_last'           => 'сонъки',
'histlegend'          => "(фаркъ) = ал-азырки версия иле арадаки фаркъ,
(сонъки) = эвельки версия иле арадаки фаркъ, '''к''' = кичик денъишиклик",
'deletedrev'          => '[ёкъ этильди]',
'histfirst'           => 'Энъ эски',
'histlast'            => 'Энъ янъы',
'historysize'         => '({{PLURAL:$1|1 байт|$1 байт}})',
'historyempty'        => '(бош)',

# Revision feed
'history-feed-title'          => 'Денъишикликлер тарихы',
'history-feed-description'    => 'Викиде бу саифенинъ денъишикликлер тарихы',
'history-feed-item-nocomment' => '$2 устюнде $1', # user at time
'history-feed-empty'          => 'Истенильген саифе мевджут дегиль.
О ёкъ эильген я да ады денъиштирильген ола биле.
Викиде бу саифеге ошагъан саифелерни [[Special:Search|тапып бакъынъыз]].',

# Revision deletion
'rev-deleted-comment'       => '(тефсир ёкъ этильди)',
'rev-deleted-user'          => '(къулланыджы ады ёкъ этильди)',
'rev-deleted-event'         => '(къайд ёкъ этильди)',
'rev-delundel'              => 'косьтер/гизле',
'revisiondelete'            => 'Версияларны ёкъ эт/кери кетир',
'revdelete-hide-comment'    => 'Къыскъа тарифни косьтерме',
'revdelete-hide-user'       => 'Денъишикликни япкъан къулланыджы адыны/IP-ни гизле',
'revdelete-hide-restricted' => 'Бу сынъырлавларны администраторлар ве къулланыджылар ичюн ишлет',
'revdelete-submit'          => 'Сайлангъан версиягъа ишлет',

# Diffs
'history-title'           => '$1 саифесининъ денъишиклик тарихы',
'difference'              => '(Версиялар арасы фаркълар)',
'lineno'                  => '$1 сатыр:',
'compareselectedversions' => 'Сайлангъан версияларны къаршылаштыр',
'editundo'                => 'лягъу эт',
'diff-multi'              => '({{PLURAL:$1|1 арадаки версия|$1 арадаки версия}} косьтерильмеди.)',

# Search results
'searchresults'         => 'Къыдырув нетиджелери',
'searchresulttext'      => '{{SITENAME}} ичинде къыдырув япмакъ хусусында малюмат алмакъ ичюн [[{{MediaWiki:Helppage}}|{{int:help}}]] саифесине бакъып оласынъыз.',
'searchsubtitle'        => 'Къыдырылгъан: "[[:$1]]" ([[Special:Prefixindex/$1|"$1" иле башлангъан бутюн саифелер]] | [[Special:WhatLinksHere/$1|"$1" саифесине багъланты олгъан бутюн саифелер]])',
'searchsubtitleinvalid' => "Сиз буны къыдырдынъыз '''$1'''",
'noexactmatch'          => "'''\"\$1\" серлевалы бир саифе тапыламады.''' Бу саифенинъ язылмасыны сиз [[:\$1|башлатып оласынъыз]].",
'noexactmatch-nocreate' => "'''«$1» адлы саифе ёкъ.'''",
'titlematches'          => 'Макъале ады бир келе',
'notitlematches'        => 'Ич бир серлевада тапыламады',
'textmatches'           => 'Саифе метни бир келе',
'notextmatches'         => 'Ич бир саифеде тапыламады',
'prevn'                 => 'эвельки $1',
'nextn'                 => 'сонъраки $1',
'viewprevnext'          => '($1) ($2) ($3).',
'searchrelated'         => 'багълы',
'searchall'             => 'эписи',
'showingresults'        => "Ашагъыда №&nbsp;<strong>$2</strong>ден башлап {{PLURAL:$1|'''1''' нетидже|'''$1''' нетидже}} булуна.",
'showingresultsnum'     => "Ашагъыда №&nbsp;'''$2'''ден башлап {{PLURAL:$3|'''1''' нетидже|'''$3''' нетидже}} булуна.",
'nonefound'             => "'''Ихтар.''' Адийджесине къыдырув бутюн исим фезаларында япылмай. Бутюн исим фезаларында (бу джумледен къулланыджылар субетлери, шаблонлар ве иляхре) къыдырмакъ ичюн ''all:'' языны къулланынъыз я да керекли исим фезасыны бельгиленъиз.",
'powersearch'           => 'Къыдыр',
'searchdisabled'        => '{{SITENAME}} сайтында къыдырув япма вакътынджа токътатылды. Бу арада Google къулланып {{SITENAME}} ичинде къыдырув япып оласынъыз. Къыдырув сайтларында индекслемелерининъ бираз эски къалгъан ола биледжегини козь огюне алынъыз.',

# Preferences page
'preferences'           => 'Сазламалар',
'mypreferences'         => 'Сазламаларым',
'prefs-edits'           => 'Япкъан денъишиклик сайысы:',
'prefsnologin'          => 'Отурым ачмадынъыз',
'prefsnologintext'      => 'Шахсий сазламаларынъызны денъиштирмек ичюн <span class="plainlinks">[{{fullurl:Special:Userlogin|returnto=$1}} отурым ачмакъ]</span> керексинъиз.',
'prefsreset'            => 'Сазламалар ильк алына кетирильди.',
'qbsettings'            => 'Вызлы иришим сутун сазламалары',
'changepassword'        => 'Пароль денъиштир',
'skin'                  => 'Ресимлеме',
'math'                  => 'Риязий (математик) символлар',
'dateformat'            => 'Тарих косьтерими',
'datedefault'           => 'Стандарт',
'datetime'              => 'Тарих ве саат',
'math_unknown_error'    => 'билинмеген хата',
'math_unknown_function' => 'бельгисиз функция',
'math_lexing_error'     => 'лексик хата',
'math_syntax_error'     => 'синтаксис хатасы',
'prefs-personal'        => 'Къулланыджы малюматы',
'prefs-rc'              => 'Сонъки денъишикликлер',
'prefs-watchlist'       => 'Козетюв джедвели',
'prefs-watchlist-days'  => 'Козетюв джедвелинде косьтериледжек кунь сайысы:',
'prefs-watchlist-edits' => 'Кенишлетилген козетюв джедвелинде косьтериледжек денъишиклик сайысы:',
'prefs-misc'            => 'Дигер сазламалар',
'saveprefs'             => 'Денъишикликлерни сакъла',
'resetprefs'            => 'Сакъланмагъан сазламаларны ильк алына кетир',
'oldpassword'           => 'Эски пароль',
'newpassword'           => 'Янъы пароль',
'retypenew'             => 'Янъы парольнен текрар киринъиз',
'textboxsize'           => 'Саифе язув пенджереси',
'rows'                  => 'Сатыр',
'columns'               => 'Сутун',
'searchresultshead'     => 'Къыдырув',
'resultsperpage'        => 'Саифеде косьтериледжек тапылгъан саифе сайысы',
'contextlines'          => 'Тапылгъан саифе ичюн айрылгъан сатыр сайысы',
'contextchars'          => 'Сатырдаки ариф сайысы',
'recentchangesdays'     => 'Сонъки денъишикликлер саифесинде косьтериледжек кунь сайысы:',
'recentchangescount'    => 'Чешит-тюрлю джедвель ве журналларда косьтерильген денъишикликлер сайысы:',
'savedprefs'            => 'Сазламаларынъыз сакъланды.',
'timezonelegend'        => 'Саат къушагъы',
'timezonetext'          => 'Вики сервери (UTC/GMT) иле аранъыздаки саат фаркъы. (Украина ве Тюркие ичюн +02:00)',
'localtime'             => 'Сизинъ ерли вакътынъыз',
'timezoneoffset'        => 'Саат фаркъы',
'servertime'            => 'Вики серверинде шимдики саат',
'guesstimezone'         => 'Браузеринъиз сизинъ еринъизге толдурсын',
'allowemail'            => 'Дигер къулланыджылар сизге e-mail мектюплери ёллап олсун',
'prefs-searchoptions'   => 'Къыдырув сазламалары',
'prefs-namespaces'      => 'Исим фезалары',
'defaultns'             => 'Къыдырувны ашагъыда сайлангъан исим фезаларында яп.',
'default'               => 'оригинал',
'files'                 => 'Файллар',

# User rights
'userrights'               => 'Къулланыджы акъларыны идаре этюв.', # Not used as normal message but as header for the special page itself
'userrights-lookup-user'   => 'Къулланыджы группаларныны идаре эт',
'userrights-user-editname' => 'Озь къулланыджы адынъызнен киринъиз:',
'editusergroup'            => 'Къулланыджы группалары низамла',
'editinguser'              => "'''[[User:$1|$1]]''' къулланыджысынынъ ([[User talk:$1|{{int:talkpagelinktext}}]] | [[Special:Contributions/$1|{{int:contribslink}}]]) изинлери денъиштирмектесинъиз",
'userrights-editusergroup' => 'Къулланыджы группалары низамла',
'userrights-groupsmember'  => 'Азасы олгъан группаларынъыз:',

# Groups
'group'            => 'Группа:',
'group-bot'        => 'Ботлар',
'group-sysop'      => 'Администраторлар',
'group-bureaucrat' => 'Бюрократлар',
'group-all'        => '(эпси)',

'group-sysop-member'      => 'Администратор',
'group-bureaucrat-member' => 'Бюрократ',

'grouppage-bot'        => '{{ns:project}}:Ботлар',
'grouppage-sysop'      => '{{ns:project}}:Администраторлар',
'grouppage-bureaucrat' => '{{ns:project}}:Бюрократлар',

# User rights log
'rightslog' => 'Къулланыджынынъ акълары журналы',

# Recent changes
'nchanges'                          => '$1 {{PLURAL:$1|денъишиклик|денъишиклик}}',
'recentchanges'                     => 'Сонъки денъишикликлер',
'recentchangestext'                 => 'Япылгъан энъ сонъки денъишикликлерни бу саифеде корип оласынъыз.',
'recentchanges-feed-description'    => 'Бу лента вастасынен викиде сонъки денъишикликлерни козет.',
'rcnote'                            => "$4 $5 тарихында сонъки {{PLURAL:$2|куньде|'''$2''' куньде}} япылгъан '''{{PLURAL:$1|1|$1}}''' денъишиклик:",
'rcnotefrom'                        => "'''$2''' тарихындан итибарен япылгъан денъишикликлер ашагъыдадыр (энъ фазла '''$1''' дане саифе косьтериле).",
'rclistfrom'                        => '$1 тарихындан берли япылгъан денъишикликлерни косьтер',
'rcshowhideminor'                   => 'кичик денъишикликлерни $1',
'rcshowhidebots'                    => 'ботларны $1',
'rcshowhideliu'                     => 'къайдлы къулланыджыларны $1',
'rcshowhideanons'                   => 'аноним къулланыджыларны $1',
'rcshowhidepatr'                    => 'козетильген денъишикликлерни $1',
'rcshowhidemine'                    => 'меним денъишиклеримни $1',
'rclinks'                           => 'Сонъки $2 куньде япылгъан сонъки $1 денъишикликни косьтер;<br /> $3',
'diff'                              => 'фаркъ',
'hist'                              => 'кечмиш',
'hide'                              => 'гизле',
'show'                              => 'косьтер',
'minoreditletter'                   => 'к',
'newpageletter'                     => 'Я',
'boteditletter'                     => 'б',
'number_of_watching_users_pageview' => '[$1 {{PLURAL:$1|къулланыджы|къулланыджы}} козете]',
'rc_categories'                     => 'Тек категориялардан («|» иле айырыла)',
'rc_categories_any'                 => 'Эр анги',
'newsectionsummary'                 => '/* $1 */ янъы болюм',

# Recent changes linked
'recentchangeslinked'          => 'Багълы денъишикликлер',
'recentchangeslinked-title'    => '"$1" иле багълы денъишикликлер',
'recentchangeslinked-noresult' => 'Сайлангъан вакъытта багълы саифелерде ич денъишиклик ёкъ эди.',
'recentchangeslinked-summary'  => "Бу махсус саифеде багълы саифелерде сонъки япкъан денъишикликлер джедвели мевджут. [[Special:Watchlist|Козетюв джедвелинъиз]]деки саифелер '''къалын''' оларакъ косьтериле.",

# Upload
'upload'                      => 'Файл юкле',
'uploadbtn'                   => 'Файл юкле',
'reupload'                    => 'Янъыдан юкле',
'reuploaddesc'                => 'Юклеме формасына кери къайт.',
'uploadnologin'               => 'Отурым ачмадынъыз',
'uploadnologintext'           => 'Файл юклеп олмакъ ичюн [[Special:UserLogin|отурым ачмакъ]] керексинъиз.',
'upload_directory_missing'    => 'Юклемелер ичюн директория ($1) мевджут дегиль ве веб-сервер тарафындан япылып оламай.',
'upload_directory_read_only'  => 'Web серверининъ ($1) джузьданына файллар сакъламагъа акълары ёкътыр.',
'uploaderror'                 => 'Юклеме хатасы',
'uploadtext'                  => "Файллар юклемек ичюн ашагъыдаки форманы къулланынъыз.
Эвельдже юкленген ресим тапмакъ я да бакъмакъ ичюн [[Special:ImageList|юкленген файллар джедвелине]] кечинъиз, бундан гъайры файл юкленюв ве ёкъ этилюв къайдларыны [[Special:Log/upload|юкленюв журналында]] ве [[Special:Log/delete|ёкъ этилюв журналында]] тапып оласынъыз.

Саифеде ресим къулланмакъ ичюн бойле шекилли багълантылар къулланынъыз: 
* '''<tt><nowiki>[[</nowiki>{{ns:image}}<nowiki>:File.jpg]]</nowiki></tt>''' файлнынъ там версиясыны къулланмакъ ичюн,
* '''<tt><nowiki>[[</nowiki>{{ns:image}}<nowiki>:File.png|200px|thumb|left|tarif]]</nowiki></tt>''' бир тариф иле 200 пиксель бир ресим къулланмакъ ичюн,
* '''<tt><nowiki>[[</nowiki>{{ns:media}}<nowiki>:File.ogg]]</nowiki></tt>''' файлгъа вастасыз багъланты ичюн.",
'upload-permitted'            => 'Изинли файл чешитлери: $1.',
'upload-preferred'            => 'Истенильген файл чешитлери: $1.',
'upload-prohibited'           => 'Ясакълы файл чешитлери: $1.',
'uploadlog'                   => 'юклеме журналы',
'uploadlogpage'               => 'Файл юклеме журналы',
'uploadlogpagetext'           => 'Ашагъыда энъ сонъки экленген файлларнынъ джедвели булуна.
Даа корьгезмели корюниш ичюн [[Special:NewImages|янъы файллар галереясына]] бакъынъыз.',
'filename'                    => 'Файл',
'filedesc'                    => 'Файлгъа аит къыскъа тариф',
'fileuploadsummary'           => 'Къыскъа тариф:',
'filestatus'                  => 'Даркъатув шартлары:',
'filesource'                  => 'Менба:',
'uploadedfiles'               => 'Юкленген файллар',
'ignorewarning'               => 'Тенбини игнор этип файлны юкле.',
'ignorewarnings'              => 'Тенбини игнор эт',
'minlength1'                  => 'Файлнынъ ады энъ аздан бир арифтен ибарет олмалы.',
'illegalfilename'             => '"$1" файлынынъ адында серлева ичюн ясакълы ишаретлер мевджут. Лютфен, файл адыны денъиштирип янъыдан юклеп бакъынъыз.',
'badfilename'                 => 'Файл ады $1 оларакъ денъиштирильди.',
'filetype-badmime'            => '"$1" MIME чешитиндеки файллар юклеме ясакълыдыр.',
'filetype-unwanted-type'      => "'''\".\$1\"''' — истенильмеген файл чешити. 
Истенильген {{PLURAL:\$3|файл чешити|файл чешитлери}}: \$2.",
'filetype-banned-type'        => "'''\".\$1\"''' — ясакълы файл чешити.
Истенильген {{PLURAL:\$3|файл чешити|файл чешитлери}}: \$2.",
'filetype-missing'            => 'Файлнынъ ич бир узантысы ёкъ (меселя «.jpg», «.gif» ве илх.).',
'large-file'                  => 'Буюклиги $1 байттан зияде ибарет олмагъан ресимлер къулланув тевсие этиле (бу файлнынъ буюклиги $2 байт).',
'largefileserver'             => 'Бу файлнынъ узунлыгъы серверде изин берильгенден буюкчедир.',
'emptyfile'                   => 'Ихтимал ки, юкленген файл бош.
Ихтималлы себеп - файл адландырув хатасыдыр.
Лютфен, тамам бу файлны юклемеге истейджек экенинъизни тешкеринъиз.',
'fileexists'                  => 'Бу исимде бир файл мевджуттир. Лютфен, эгер сиз денъиштирмектен эмин олмасанъыз башта <strong><tt>$1</tt></strong> файлына козь ташланъыз.',
'filepageexists'              => 'Бу файл ичюн тасвир саифеси энди япылгъан (<strong><tt>$1</tt></strong>), лякин бу адда бир файл ёкътыр. Язылгъан тасвир ресим тасвир саифесинде косьтерильмейджек. Янъы бир тасвир эклемек ичюн оны къолнен денъиштирмеге меджбурсынъыз.',
'fileexists-extension'        => 'Бунъа ошагъан адда бир файл мевджуттир:<br />
Юкленген файлнынъ ады: <strong><tt>$1</tt></strong><br />
Мевджут олгъан файлнынъ ады: <strong><tt>$2</tt></strong><br />
Лютфен, башкъа бир ад сайлап язынъыз.',
'fileexists-thumb'            => "<center>'''Мевджут файл'''</center>",
'fileexists-thumbnail-yes'    => 'Бельки де бу файл бир кучюльген копиядыр (thumbnail). Лютфен, <strong><tt>$1</tt></strong> файлыны тешкеринъиз.<br />
Эгер бельгиленген файл айны шу ресим олса, онынъ кучюльген копиясыны айры оларакъ юклемек аджети ёкътыр.',
'file-thumbnail-no'           => 'Файлнынъ ады <strong><tt>$1</tt></strong>нен башлана. Бельки де бу ресимнинъ уфакълаштырылгъан бир копиясыдыр <i>(thumbnail)</i>.
Эгер сизде бу ресим там буюклигинде бар олса, лютфен, оны юкленъинъиз я да файлнынъ адыны денъиштиринъиз.',
'fileexists-forbidden'        => 'Бу исимде бир файл мевджуттир.
Лютфен, кери къайтынъыз, файл исмини денъиштирип янъыдан юкленъиз.
[[Image:$1|thumb|center|$1]]',
'fileexists-shared-forbidden' => 'Файллар умумий тутулгъан еринде бу исимде бир файл мевджуттир.
Эгер бу файлны эп бир юклемеге истесенъиз, кери къайтынъыз ве файл исмини денъиштирип янъыдан юкленъиз.
[[Image:$1|thumb|center|$1]]',
'file-exists-duplicate'       => 'Бу файл ашагъыдаки {{PLURAL:$1|файлнынъ|файлларнынъ}} дубликаты ола:',
'successfulupload'            => 'Юкленюв беджерильди',
'uploadwarning'               => 'Тенби',
'savefile'                    => 'Файлны сакъла',
'uploadedimage'               => 'Юкленген: "[[$1]]"',
'overwroteimage'              => '"[[$1]]" янъы версиясы юкленди',
'uploaddisabled'              => 'Юклеме ясакълыдыр.',
'uploaddisabledtext'          => 'Файл юклеме ясакълыдыр.',
'uploadscripted'              => 'Бу файлда браузер тарафындан янълышнен ишленип олур HTML коду я да скрипт мевджут.',
'uploadcorrupt'               => 'Бу файл я зарарланды, я да янълыш узантылы. Лютфен, файлны тешкерип янъыдан юклеп бакъынъыз.',
'uploadvirus'                 => 'Бу файл вируслыдыр! $1 бакъынъыз',
'sourcefilename'              => 'Юклемеге истегенинъиз файл:',
'destfilename'                => 'Файлнынъ истенильген ады:',
'upload-maxfilesize'          => 'Максималь файл буюклиги: $1',
'watchthisupload'             => 'Бу файлны козетюв джедвелине кирсет',
'filewasdeleted'              => 'Бу исимде бир файл мевджут эди, амма ёкъ этильген эди. Лютфен, текрар юклемеден эвель $1 тешкеринъиз.',
'upload-wasdeleted'           => "'''Дикъкъат: Эвельде ёкъ этильген файлны юклемектесинъиз.'''

Эр алда бу файлны юклемеге девам этмеге истейсинъизми?
Бу файл ичюн ёкъ этювнинъ журналыны мында бакъып оласынъыз:",
'filename-bad-prefix'         => 'Сиз юклеген файл <strong>"$1"</strong>-нен башлай. Бу, адетиндже, ракъамлы фотоаппаратлардан файл адына язылгъан манасыз символлардыр. Лютфен, бу файл ичюн анълыджа бир ад сайлап язынъыз.',

'upload-proto-error'      => 'Янълыш протокол',
'upload-proto-error-text' => 'Интернеттен бир ресим файлы юклемеге истесенъиз адрес <code>http://</code> я да <code>ftp://</code>нен башламалы.',
'upload-file-error'       => 'Ички хата',
'upload-file-error-text'  => 'Серверде мувакъкъат файл яратылгъан вакъытта ички хата чыкъты. Лютфен, [[Special:ListUsers/sysop|администраторгъа]] мураджаат этинъиз.',
'upload-misc-error'       => 'Бельгисиз юкленюв хатасы',
'upload-misc-error-text'  => 'Бельгисиз юкленюв хатасы. Лютфен, адреснинъ догъру олгъаныны тешкерип текрарланъыз. Проблема девам этсе, [[Special:ListUsers/sysop|администраторгъа]] мураджаат этинъиз.',

# Some likely curl errors. More could be added from <http://curl.haxx.se/libcurl/c/libcurl-errors.html>
'upload-curl-error6'       => 'Бельгиленген URL адресине иришилип оламады.',
'upload-curl-error6-text'  => 'Бельгиленген URL адресине иришилип оламады. Лютфен, адреснинъ догъру ве сайткъа иришмекнинъ чареси олгъаныны тешкерип текрарланъыз.',
'upload-curl-error28'      => 'Юкленюв вакъты толды',
'upload-curl-error28-text' => 'Сайт чокътан джевап къайтармай. Лютфен, сайтнынъ догъру чалышкъаныны тешкерип бираздан сонъ текрарланъыз. Бельки де истеген арекетинъизни сонъ, сайт бошча олгъанда, этмек керектир.',

'license'            => 'Лицензирлеме:',
'nolicense'          => 'Ёкъ',
'license-nopreview'  => '(Ог бакъув иришильмез)',
'upload_source_url'  => ' (догъру, публик тарзда кирмеге мусаадели интернет адрес)',
'upload_source_file' => ' (компьютеринъиздеки файл)',

# Special:ImageList
'imagelist-summary'     => 'Бу махсус саифе бутюн юкленген файлларны косьтере.
Якъынларда юкленген файллар джедвельнинъ юкъарысында косьтериле.
Сутун серлевасына бир басув сортирлеменинъ тертибини денъиштирир.',
'imagelist_search_for'  => 'Файл ады къыдырув:',
'imgfile'               => 'файл',
'imagelist'             => 'Ресим джедвели',
'imagelist_date'        => 'Тарих',
'imagelist_name'        => 'Файл ады',
'imagelist_user'        => 'Къулланыджы',
'imagelist_size'        => 'Буюклик',
'imagelist_description' => 'Тасвир',

# Image description page
'filehist'                  => 'Файлнынъ кечмиши',
'filehist-help'             => 'Файлнынъ керекли аньки алыны корьмек ичюн тарихкъа/сааткъа басынъыз.',
'filehist-deleteall'        => 'эписини ёкъ эт',
'filehist-deleteone'        => 'ёкъ эт',
'filehist-revert'           => 'кери ал',
'filehist-current'          => 'ал-азырки',
'filehist-datetime'         => 'Тарих ве саат',
'filehist-user'             => 'Къулланыджы',
'filehist-dimensions'       => 'Эн × бой',
'filehist-filesize'         => 'Файл буюклиги',
'filehist-comment'          => 'Изаат',
'imagelinks'                => 'Къулланылгъаны саифелер',
'linkstoimage'              => 'Бу файлгъа багъланты олгъан $1 саифе:',
'nolinkstoimage'            => 'Бу файлгъа багълангъан саифе ёкъ.',
'sharedupload'              => 'Бу файл ортакъ фезагъа юкленген ве дигер проектлерде де къулланылгъан бир файл ола билир.',
'shareduploadwiki'          => 'Тафсилятны $1 саифесинде тапмакъ мумкюн.',
'shareduploadwiki-linktext' => 'файл малюмат саифеси',
'noimage'                   => 'Бу исимде файл ёкъ, амма сиз $1.',
'noimage-linktext'          => 'оны юклеп оласынъыз',
'uploadnewversion-linktext' => 'Файлнынъ янъысыны юкленъиз',

# File reversion
'filerevert'                => 'Эски версиягъа кери къайт $1',
'filerevert-legend'         => 'Эски версиягъа кери къайт',
'filerevert-comment'        => 'Изаат:',
'filerevert-defaultcomment' => '$2 тарихында $1 къулланыджысы тарафындан япылгъан версиягъа кери къайт',

# MIME search
'mimesearch' => 'MIME къыдырувы',
'mimetype'   => 'MIME чешити:',
'download'   => 'юкле',

# Unwatched pages
'unwatchedpages' => 'Козетильмеген саифелер',

# List redirects
'listredirects' => 'Ёлламаларны джедвельге чек',

# Unused templates
'unusedtemplates'     => 'Къулланылмагъан шаблонлар',
'unusedtemplatestext' => 'Бу саифе "шаблон" исим фезасында булунгъан ве дигер саифелерге экленмеген шаблонларны косьтере. Шаблонларгъа олгъан дигер багълантыларны да тешкермеден ёкъ этменъиз.',
'unusedtemplateswlh'  => 'дигер багълантылар',

# Random page
'randompage'         => 'Тесадюфий саифе',
'randompage-nopages' => 'Бу исим фезасында ич бир саифе ёкъ.',

# Random redirect
'randomredirect'         => 'Тесадюфий ёллама саифеси',
'randomredirect-nopages' => 'Бу исим фезасында ич бир ёллама саифеси ёкъ.',

# Statistics
'statistics'             => 'Статистика',
'sitestats'              => '{{SITENAME}} статистикасы',
'userstats'              => 'Къулланыджы статистикасы',
'sitestatstext'          => "{{SITENAME}} сайтында ал-азырда '''{{PLURAL:\$2|1 кечерли саифе|\$2 кечерли саифе}}''' мевджуттир.

Бу джумледен; \"ёллама\", \"музакере\", \"ресим\", \"къулланыджы\", \"ярдым\", \"{{SITENAME}}\", \"шаблон\" исим фезаларындакилер ве ички багълантысыз саифелер кирсетильмеди. Кечерли саифе сайысына бу саифелернинъ сайысы экленгенде исе топлам '''\$1''' саифе мевджуттир.

\$8 дане файл юкленди.

Сайт къурулгъанындан бу куньге къадар топлам '''\$4''' саифе денъишиклиги ве саифе башына тахминен '''\$5''' иссе къошулды.

Топлам саифе косьтерильме сайысы '''\$3''', денъишиклик башына косьтерме сайысы '''\$6''' олды.

Шимдики [http://www.mediawiki.org/wiki/Manual:Job_queue иш сырасы] сайысы '''\$7'''.",
'userstatstext'          => "Ал-азырда '''{{PLURAL:$1|1|$1}}''' къайдлы къулланыджымыз бар. Булардан '''{{PLURAL:$2|1|$2}}''' (я да '''$4%''') данеси - $5.",
'statistics-mostpopular' => 'Энъ сыкъ бакъылгъан саифелер',

'disambiguations'      => 'Чокъ маналы терминлер саифелери',
'disambiguationspage'  => 'Template:disambig',
'disambiguations-text' => "Ашагъыдыки саифелер '''чокъ маналы саифелер'''ге багъланты ола.
Бельки де олар бир конкрет саифеге багъланты олмалы.<br />
Эгер саифеде, [[MediaWiki:Disambiguationspage]] саифесинде ады кечкен шаблон ерлештирильген олса, о саифе чокъ маналыдыр.",

'doubleredirects'     => 'Ёлламагъа олгъан ёлламалар',
'doubleredirectstext' => 'Эр сатырда, экинджи ёллама метнининъ ильк сатырынынъ (умумен экинджи ёлламанынъ да ишарет этмек керек олгъаны "асыл" макъсатнынъ) янында ильк ве экинджи ёлламагъа багълантылар бар.',

'brokenredirects'        => 'Бар олмагъан саифеге япылгъан ёлламалар',
'brokenredirectstext'    => 'Ашагъыдки ёллама, мевджут олмагъан бир саифеге ишарет эте.',
'brokenredirects-edit'   => '(денъиштир)',
'brokenredirects-delete' => '(ёкъ эт)',

'withoutinterwiki'         => 'Дигер тиллердеки версияларгъа багълантылары олмагъан саифелер',
'withoutinterwiki-summary' => 'Бу саифелерде дигер тиллердеки версияларгъа багълантылар ёкъ:',

'fewestrevisions' => 'Энъ аз денъиштирме япылгъан саифелер',

# Miscellaneous special pages
'nbytes'                  => '{{PLURAL:$1|1 байт|$1 байт}}',
'ncategories'             => '{{PLURAL:$1|1 категория|$1 категория}}',
'nlinks'                  => '{{PLURAL:$1|1 багъланты|$1 багъланты}}',
'nmembers'                => '{{PLURAL:$1|1 аза|$1 аза}}',
'nrevisions'              => '{{PLURAL:$1|1 версия|$1 версия}}',
'nviews'                  => '{{PLURAL:$1|1 корюнюв|$1 корюнюв}}',
'lonelypages'             => 'Озюне ич багъланты олмагъан саифелер',
'lonelypagestext'         => 'Илеридеки саифелерге {{SITENAME}} сайтынынъ дигер саифелеринден багъланты ёкътыр.',
'uncategorizedpages'      => 'Эр анги бир категорияда олмагъан саифелер',
'uncategorizedcategories' => 'Эр анги бир категорияда олмагъан категориялар',
'uncategorizedimages'     => 'Эр анги бир категорияда олмагъан ресимлер',
'uncategorizedtemplates'  => 'Эр анги бир категорияда олмагъан шаблонлар',
'unusedcategories'        => 'Къулланылмагъан категориялар',
'unusedimages'            => 'Къулланылмагъан ресимлер',
'popularpages'            => 'Популяр саифелер',
'wantedcategories'        => 'Истенильген категориялар',
'wantedpages'             => 'Истенильген саифелер',
'mostlinked'              => 'Озюне энъ зияде багъланты берильген саифелер',
'mostlinkedcategories'    => 'Энъ чокъ саифеге саип категориялар',
'mostlinkedtemplates'     => 'Озюне энъ зияде багъланты берильген шаблонлар',
'mostcategories'          => 'Энъ зияде категориягъа багълангъан саифелер',
'mostimages'              => 'Энъ чокъ къулланылгъан ресимлер',
'mostrevisions'           => 'Энъ чокъ денъишикликке огърагъан саифелер',
'prefixindex'             => 'Префикс джедвели',
'shortpages'              => 'Къыскъа саифелер',
'longpages'               => 'Узун саифелер',
'deadendpages'            => 'Башкъа саифелерге багълантысы олмагъан саифелер',
'deadendpagestext'        => 'Бу {{SITENAME}} башкъа саифелерине багълантысы олмагъан саифелердир.',
'protectedpages'          => 'Къорчалангъан саифелер',
'protectedpagestext'      => 'Бу саифелернинъ денъиштирювге къаршы къорчалавы бар',
'protectedtitles'         => 'Ясакълангъан серлевалар',
'listusers'               => 'Къулланыджылар джедвели',
'newpages'                => 'Янъы саифелер',
'newpages-username'       => 'Къулланыджы ады:',
'ancientpages'            => 'Энъ эски саифелер',
'move'                    => 'Адыны денъиштир',
'movethispage'            => 'Саифенинъ адыны денъиштир',
'pager-newer-n'           => '{{PLURAL:$1|1 даа янъыджа|$1 даа янъыджа}}',
'pager-older-n'           => '{{PLURAL:$1|1 даа эскидже|$1 даа эскидже}}',

# Book sources
'booksources'               => 'Китаплар менбасы',
'booksources-search-legend' => 'Китаплар менбасыны къыдырув',
'booksources-go'            => 'Къыдыр',

# Special:Log
'specialloguserlabel'  => 'Къулланыджы:',
'speciallogtitlelabel' => 'Серлева:',
'log'                  => 'Журналлар',
'all-logs-page'        => 'Бутюн журналлар',
'log-search-legend'    => 'Журнал къыдырув',
'log-search-submit'    => 'Къыдыр',
'logempty'             => 'Журналда бир кельген малюмат ёкъ.',
'log-title-wildcard'   => 'Бу символлардан башлангъан серлеваларны къыдыр',

# Special:AllPages
'allpages'          => 'Бутюн саифелер',
'alphaindexline'    => '$1-ден $2-ге',
'nextpage'          => 'Сонъраки саифе ($1)',
'prevpage'          => 'Эвельки саифе ($1)',
'allpagesfrom'      => 'Джедвельге чекмеге башланыладжакъ арифлер:',
'allarticles'       => 'Бутюн саифелер',
'allinnamespace'    => 'Бутюн саифелер ($1 саифелери)',
'allnotinnamespace' => 'Бутюн саифелер ($1 исим фезасында олмагъанлар)',
'allpagesprev'      => 'Эвельки',
'allpagesnext'      => 'Сонъраки',
'allpagessubmit'    => 'Косьтер',
'allpagesprefix'    => 'Язгъан арифлернен башлагъан саифелерни косьтер:',
'allpagesbadtitle'  => 'Саифенинъ ады кечерли дегиль. Серлевада тиллер арасы префикси я да викилер арасы багъланты я да башкъа къулланылувы ясакъ олгъан символлар бардыр.',
'allpages-bad-ns'   => '{{SITENAME}} сайтында «$1» исим фезасы ёкътыр.',

# Special:Categories
'categories'                    => 'Саифе категориялары',
'categoriespagetext'            => 'Ашагъыдаки категорияларда саифелер я да медиа-файллар бар.
Мында [[Special:UnusedCategories|къулланылмагъан категориялар]] косьтерильмеген.
[[Special:WantedCategories|Талап этильген категорияларнынъ джедвелини]] де бакъынъыз.',
'special-categories-sort-count' => 'сайыларына коре сырала',
'special-categories-sort-abc'   => 'элифбе сырасынен сырала',

# Special:ListUsers
'listusers-submit'   => 'Косьтер',
'listusers-noresult' => 'Ич бир къулланыджы тапылмады.',

# E-mail user
'mailnologin'     => 'Мектюп ёлланаджакъ адреси ёкътыр',
'mailnologintext' => 'Дигер къулланыджыларгъа электрон мектюплер ёллап олмакъ ичюн [[Special:UserLogin|отурым ачмалысынъыз]] ве [[Special:Preferences|сазламаларынъызда]] мевджут олгъан e-mail адресининъ саиби олмалысынъыз.',
'emailuser'       => 'Къулланыджыгъа мектюп',
'emailpage'       => 'Къулланыджыгъа электрон мектюп ёлла',
'emailpagetext'   => 'Бу къулланыджы озь сазламаларында мевджут олгъан электрон почта адресини язгъан олса, ашагъыдаки форманы толдурып онъа мектюп ёллап олурсынъыз.
[[Special:Preferences|Озь сазламаларынъызда]] язгъан электрон адресинъиз мектюпнинъ «Кимден» сатырында языладжакъ, бунынъ ичюн мектюп алыджы догърудан-догъру сизинъ адресинъизге джевап ёллап олур.',
'usermailererror' => 'E-mail беянаты ёллангъан вакъытта хата олып чыкъты',
'defemailsubject' => '{{SITENAME}} e-mail',
'noemailtitle'    => 'E-mail адреси ёкътыр',
'noemailtext'     => 'Бу къулланыджы я мевджут олгъан электрон почта адресини язмагъан, я да башкъа къулланыджылардан мектюп алувдан вазгечкен.',
'emailfrom'       => 'Кимден:',
'emailto'         => 'Кимге:',
'emailsubject'    => 'Мектюп мевзусы:',
'emailmessage'    => 'Мектюп:',
'emailsend'       => 'Ёлла',
'emailccme'       => 'Мектюбимнинъ бир копиясыны манъа да ёлла.',
'emailccsubject'  => '$1 къулланыджысына ёллангъан мектюбинъизнинъ копиясы: $2',
'emailsent'       => 'Мектюп ёлланды',
'emailsenttext'   => 'Сизинъ e-mail беянатынъыз ёлланды',

# Watchlist
'watchlist'            => 'Козетюв джедвели',
'mywatchlist'          => 'Козетюв джедвелим',
'watchlistfor'         => "('''$1''' ичюн)",
'nowatchlist'          => 'Сизинъ козетюв джедвелинъиз боштыр.',
'watchlistanontext'    => 'Козетюв джедвелини бакъмакъ я да денъиштирмек ичюн $1 борджлусынъыз.',
'watchnologin'         => 'Отурым ачмакъ керек',
'watchnologintext'     => 'Озь козетюв джедвелинъизни денъиштирмек ичюн [[Special:UserLogin|отурым ачынъыз]]',
'addedwatch'           => 'Козетюв джедвелине кирсетмек',
'addedwatchtext'       => '"[[:$1]]" саифеси [[Special:Watchlist|козетюв джевделинъизге]] кирсетильди.
Бу саифедеки ве онынънен багълы саифелердеки оладжакъ денъишикликлер бу джедвельде бельгиленеджек, эм де олар козьге чарпмасы ичюн [[Special:RecentChanges|янъы денъишиклик джедвели]] булунгъан саифеде къалын оларакъ косьтерилир.
Бираздан сонъ козетюв джедвелинъизден бир де бир саифени ёкъ этмеге истесенъиз де, саифенинъ юкъарысындаки сол тарафта "козетме" дёгмесине басынъыз.',
'removedwatch'         => 'Козетюв джедвелинден ёкъ эт',
'removedwatchtext'     => '"[[:$1]]" саифеси козетюв джедвелинъизден ёкъ этильди.',
'watch'                => 'Козет',
'watchthispage'        => 'Бу саифени козет',
'unwatch'              => 'Козетме',
'unwatchthispage'      => 'Бу саифени козетме',
'notanarticle'         => 'Малюмат саифеси дегиль',
'watchnochange'        => 'Косьтерильген заман аралыгъында козетюв джедвелинъиздеки саифелернинъ ич бири денъиштирильмеген.',
'watchlist-details'    => 'Музакере саифелерини эсапкъа алмайып, козетюв джедвелинъизде {{PLURAL:$1|1|$1}} саифе бар.',
'wlheader-enotif'      => '* E-mail иле хабер берюв ачылды.',
'wlheader-showupdated' => "* Сонъки зияретинъизден сонъраки саифе денъишикликлери '''къалын''' оларакъ косьтерильди.",
'watchmethod-recent'   => 'сонъки денъишикликлер арасында козеткен саифелеринъиз къыдырыла',
'watchmethod-list'     => 'козетюв джедвелиндеки саифелер тешкериле',
'watchlistcontains'    => 'Сизинъ козетюв джедвелинъизде {{PLURAL:$1|1|$1}} саифе мевджуттир.',
'iteminvalidname'      => '"$1" саифеси мунасебетинен проблема олып чыкъты, эльверишли олмагъан исимдир…',
'wlnote'               => "Ашагъыда сонъки {{PLURAL:$2|саат|'''$2''' саат}} ичинде япылгъан сонъки {{PLURAL:$1|денъишиклик|'''$1''' денъишиклик}} косьтериле.",
'wlshowlast'           => 'Сонъки $2 кунь $1 саат ичюн $3 косьтер',
'watchlist-show-bots'  => 'Ботлар денъишикликлерини косьтер',
'watchlist-hide-bots'  => 'Ботлар денъишикликлерини гизле',
'watchlist-show-own'   => 'Меним денъишикликлеримни косьтер',
'watchlist-hide-own'   => 'Меним денъишикликлеримни гизле',
'watchlist-show-minor' => 'Кичик денъишикликлерни косьтер',
'watchlist-hide-minor' => 'Кичик денъишикликлерни гизле',

# Displayed when you click the "watch" button and it is in the process of watching
'watching'   => 'Козетюв джедвелине экленмекте...',
'unwatching' => 'Козетюв джедвелинден ёкъ этильмекте...',

'enotif_mailer'                => '{{SITENAME}} почта вастасынен хабер берген хызмет',
'enotif_reset'                 => 'Джумле саифелерни бакъылгъан оларакъ ишаретле',
'enotif_newpagetext'           => 'Бу янъы бир саифедир.',
'enotif_impersonal_salutation' => '{{SITENAME}} къулланыджысы',
'changed'                      => 'денъиштирильди',
'created'                      => 'яратылды',
'enotif_subject'               => '«{{SITENAME}}» $PAGETITLE саифеси $PAGEEDITOR къулланыджы тарафындан $CHANGEDORCREATED',
'enotif_lastvisited'           => 'Сонъки зияретинъизден берли япылгъан денъишикликлерни бильмек ичюн $1 бакъынъыз.',
'enotif_anon_editor'           => 'адсыз (аноним) къулланыджы $1',
'enotif_body'                  => 'Сайгъылы $WATCHINGUSERNAME,


{{SITENAME}} сайтындаки $PAGETITLE серлевалы саифе $PAGEEDITDATE тарихында $PAGEEDITOR тарафындан $CHANGEDORCREATED. Кечерли версиягъа $PAGETITLE_URL адресинден етишип оласынъыз.

$NEWPAGE

Ачыкъламасы: $PAGESUMMARY $PAGEMINOREDIT

Саифени денъиштирген къулланыджынынъ иришим малюматы:
e-mail: $PAGEEDITOR_EMAIL
Вики: $PAGEEDITOR_WIKI

Бахсы кечкен саифени сиз зиярет этмеген муддет ичинде саифенен багълы башкъа денъишиклик тенбиси ёлланмайджакъ. Тенби сазламаларыны козетюв джедвелинъиздеки бутюн саифелер ичюн денъиштирип олурсынъыз.

{{SITENAME}} тенби системасы.

--
Сазламаларны денъиштирмек ичюн:
{{fullurl:Special:Watchlist/edit}}

Ярдым ве теклифлер ичюн:
{{fullurl:Help:Contents}}',

# Delete/protect/revert
'deletepage'                  => 'Саифени ёкъ эт',
'confirm'                     => 'Тасдыкъла',
'excontent'                   => "эски метин: '$1'",
'excontentauthor'             => "эски метин: '$1' ('$2' иссе къошкъан тек бир къулланыджы)",
'exbeforeblank'               => "Ёкъ этильмеген эвельки метин: '$1'",
'exblank'                     => 'саифе метини бош',
'historywarning'              => 'Тенби: Сиз ёкъ этмек узьре олгъан саифенинъ кечмиши бардыр:',
'confirmdeletetext'           => 'Бир саифени я да ресимни бутюн кечмиши иле бирликте малюмат базасындан къалыджы оларакъ ёкъ этмек узьресинъиз.
Лютфен, нетиджелерини анълагъанынъызны ве [[{{MediaWiki:Policy-url}}|ёкъ этюв политикасына]] уйгъунлыгъыны дикъкъаткъа алып, буны япмагъа истегенинъизни тасдыкъланъыз.',
'actioncomplete'              => 'Ишлем тамамланды.',
'deletedtext'                 => '"<nowiki>$1</nowiki>" ёкъ этильди.
якъын заманда ёкъ этильгенлерни корьмек ичюн: $2.',
'deletedarticle'              => '"[[$1]]" ёкъ этильди',
'dellogpage'                  => 'Ёкъ этюв журналы',
'dellogpagetext'              => 'Ашагъыдаки джедвель сонъки ёкъ этюв журналыдыр.',
'deletionlog'                 => 'ёкъ этюв журналы',
'reverted'                    => 'Эвельки версия кери кетирильди',
'deletecomment'               => 'Ёкъ этюв себеби',
'deleteotherreason'           => 'Дигер/илявели себеп:',
'deletereasonotherlist'       => 'Дигер себеп',
'rollback'                    => 'денъишикликлерни кери ал',
'rollback_short'              => 'кери ал',
'rollbacklink'                => 'эски алына кетир',
'rollbackfailed'              => 'кери алув ишлеми мувафакъиетсиз',
'cantrollback'                => 'Денъишикликлер кери алынамай, сонъки денъиштирген киши саифенинъ тек бир муэллифидир',
'editcomment'                 => 'Денъиштирме изааты: "<i>$1</i>" эди.', # only shown if there is an edit comment
'revertpage'                  => '[[Special:Contributions/$2|$2]] ([[User talk:$2|музакере]]) тарафындан япылгъан денъишикликлер кери алынып, [[User:$1|$1]] тарафындан денъиштирильген эвельки версия кери кетирильди.', # Additional available: $3: revid of the revision reverted to, $4: timestamp of the revision reverted to, $5: revid of the revision reverted from, $6: timestamp of the revision reverted from
'protectlogpage'              => 'Къорчалав журналы',
'protectlogtext'              => 'Къорчалавгъа алув/чыкъарув иле багълы денъишикликлер журналыны корьмектесинъиз.
Къорчалав алтына алынгъан саифелер там джедвели [[Special:ProtectedPages|бу саифеде]] корип оласынъыз.',
'protectedarticle'            => '"[[$1]]" къорчалав алтына алынды',
'unprotectedarticle'          => 'къорчалав чыкъарлыды: "[[$1]]"',
'protect-legend'              => 'Къорчалавны тасдыкъла',
'protectcomment'              => 'Къорчалав алтына алув себеби',
'protectexpiry'               => 'Битиш тарихы:',
'protect_expiry_invalid'      => 'Битиш тарихы кечерсиз.',
'protect_expiry_old'          => 'Битиш заманы кечмиштедир.',
'protect-unchain'             => 'Саифе ады денъиштирюв килитини чыкъар',
'protect-text'                => '<strong>[[<nowiki>$1</nowiki>]]</strong> саифесининъ къорчалав севиесини мындан корип олур ве денъиштирип оласынъыз.',
'protect-locked-access'       => 'Къулланыджы эсабынъыз саифенинъ къорчалав севиелерини денъиштирме еткисине саип дегиль. <strong>$1</strong> саифесининъ кечерли сазламалары шуларыдыр:',
'protect-cascadeon'           => 'Бу саифе шимди къорчалав алтындадыр, чюнки ашагъыда джедвелленген ве каскадлы къорчалав алтындаки $1 саифеде къулланыла.
Бу саифенинъ къорчалав севиесини денъиштирип оласынъыз, амма каскадлы къорчалав тесир этильмейджек.',
'protect-default'             => '(стандарт)',
'protect-fallback'            => '«$1» изни керектир',
'protect-level-autoconfirmed' => 'къайд олунмагъан денъиштирмесин',
'protect-level-sysop'         => 'тек администраторлар',
'protect-summary-cascade'     => 'каскадлы',
'protect-expiring'            => 'бите: $1 (UTC)',
'protect-cascade'             => 'Бу саифеде къулланылгъан бутюн саифелерни къорчалавгъа ал (каскадлы къорчалав)',
'protect-cantedit'            => 'Бу саифенинъ къорчалав севиесини денъиштирип оламазсынъыз, чюнки буны япмагъа еткинъиз ёкъ.',
'restriction-type'            => 'Рухсети:',
'restriction-level'           => 'Рухсет севиеси:',
'minimum-size'                => 'Минималь буюклик',
'maximum-size'                => 'Максималь буюклик',
'pagesize'                    => '(байт)',

# Restrictions (nouns)
'restriction-edit' => 'Денъиштир',
'restriction-move' => 'Адыны денъиштир',

# Restriction levels
'restriction-level-sysop'         => 'къорчалав алтында',
'restriction-level-autoconfirmed' => 'къысмен къорчалав алтында',

# Undelete
'undelete'           => 'Ёкъ этильген саифелерни косьтер',
'undeletepage'       => 'Саифенинъ ёкъ этильген версияларына козь ат ве кери кетир.',
'viewdeletedpage'    => 'Ёкъ этильген саифелерге бакъ',
'undeletebtn'        => 'Кери кетир!',
'undeletereset'      => 'Вазгеч',
'undeletecomment'    => 'Изаат:',
'undeletedarticle'   => '"[[$1]]" кери кетирильди.',
'undeletedrevisions' => 'Топлам {{PLURAL:$1|1 къайд|$1 къайд}} кери кетирильди.',

# Namespace form on various pages
'namespace'      => 'Исим фезасы:',
'invert'         => 'Сайлангъан тышындакилерни сайла',
'blanknamespace' => '(Эсас)',

# Contributions
'contributions' => 'Къулланыджынынъ исселери',
'mycontris'     => 'Исселерим',
'contribsub2'   => '$1 ($2)',
'nocontribs'    => 'Бу критерийлерге уйгъан денъишиклик тапыламады',
'uctop'         => '(сонъки)',
'month'         => 'Бу ай (ве ондан эрте):',
'year'          => 'Бу сене (ве ондан эрте):',

'sp-contributions-newbies'     => 'Тек янъы къулланыджыларнынъ исселерини косьтер',
'sp-contributions-newbies-sub' => 'Янъы къулланыджылар ичюн',
'sp-contributions-blocklog'    => 'Блок этюв журналы',
'sp-contributions-search'      => 'Исселер къыдырув',
'sp-contributions-username'    => 'IP адреси я да къулланыджы ады:',
'sp-contributions-submit'      => 'Къыдыр',

# What links here
'whatlinkshere'       => 'Саифеге багълантылар',
'whatlinkshere-title' => '$1 саифесине багъланты олгъан саифелер',
'whatlinkshere-page'  => 'Саифе:',
'linklistsub'         => '(Багъланты джедвели)',
'linkshere'           => "Бу саифелер '''[[:$1]]''' саифесине багълантысы олгъан:",
'nolinkshere'         => "'''[[:$1]]''' саифесине багълангъан саифе ёкъ.",
'nolinkshere-ns'      => "Сайлангъан исим фезасында '''[[:$1]]''' саифесине багълангъан саифе ёкътыр.",
'isredirect'          => 'Ёллама саифеси',
'istemplate'          => 'эклеме',
'whatlinkshere-prev'  => '{{PLURAL:$1|эвельки|эвельки $1}}',
'whatlinkshere-next'  => '{{PLURAL:$1|сонъраки|сонъраки $1}}',
'whatlinkshere-links' => '← багълантылар',

# Block/unblock
'blockip'                 => 'Бу IP адресинден иришимни бан эт',
'blockiptext'             => 'Ашагъыдаки форманы къулланып белли бир IP адресининъ я да къулланыджынынъ иришимини бан этип оласынъыз. Бу тек вандализмни бан этмек ичюн ве [[{{MediaWiki:Policy-url}}|къаиделерге]] уйгъун оларакъ япылмалы. Ашагъыгъа мытлакъа бан этюв иле багълы бир ачыкълама язынъыз. (меселя: Шу саифелерде вандализм япты).',
'ipaddress'               => 'IP адреси',
'ipadressorusername'      => 'IP адреси я да къулланыджы ады',
'ipbexpiry'               => 'Битиш муддети',
'ipbreason'               => 'Себеп',
'ipbsubmit'               => 'Бу къулланыджыны бан эт',
'ipbother'                => 'Фаркълы заман',
'ipboptions'              => '2 саат:2 hours,1 кунь:1 day,3 кунь:3 days,1 афта:1 week,2 афта:2 weeks,1 ай:1 month,3 ай:3 months,6 ай:6 months,1 йыл:1 year,муддетсиз:infinite', # display1:time1,display2:time2,...
'ipbotheroption'          => 'фаркълы',
'ipbotherreason'          => 'Дигер/илявели себеп:',
'badipaddress'            => 'Кечерсиз IP адреси',
'blockipsuccesssub'       => 'IP адресни бан этюв ишлеви мувафакъиетли олды',
'blockipsuccesstext'      => '"$1" бан этильди.
<br />[[Special:IPBlockList|IP адреси бан этильгенлер]] джедвелине бакъынъыз .',
'unblockip'               => 'Къулланыджынынъ бан этювини чыкъар',
'ipusubmit'               => 'Бу адреснинъ бан этювини чыкъар',
'ipblocklist'             => 'Блок этильген къулланыджылар ве IP адреслери',
'blocklistline'           => '$1, $2 блок этти: $3 ($4)',
'infiniteblock'           => 'муддетсиз',
'expiringblock'           => '$1 тарихында битеджек',
'blocklink'               => 'бан эт',
'unblocklink'             => 'бан этювни чыкъар',
'contribslink'            => 'Исселер',
'autoblocker'             => 'Автоматик оларакъ бан эттинъиз чюнки якъын заманда IP адресинъиз "[[User:$1|$1]]" къулланыджысы тарафындан къулланылды. $1 адлы къулланыджынынъ бан этилюви ичюн берильген себеп: "\'\'\'$2\'\'\'"',
'blocklogpage'            => 'Иришим бан этюв журналы',
'blocklogentry'           => '"[[$1]]" иришими $2 $3 токътатылды. Себеп',
'blocklogtext'            => 'Мында къулланыджы иришимине ёнелик бан этюв ве бан чыкъарув журналы джедвеллене. Автоматик IP адреси бан этювлери джедвельге кирсетильмеди. Ал-азырда иришими токътатылгъан къулланыджыларны [[Special:IPBlockList|IP бан этюв джедвели]] саифесинден корип оласынъыз.',
'unblocklogentry'         => '$1 къулланыджынынъ бан этюви чыкъарылды',
'block-log-flags-noemail' => 'e-mail блок этильди',
'ipb_expiry_invalid'      => 'Кечерсиз битиш заманы.',
'ipb_already_blocked'     => '"$1" энди блок этильди',
'ip_range_invalid'        => 'Кечерсиз IP аралыгъы.',

# Developer tools
'lockdb'  => 'Малюмат базасы килитли',
'lockbtn' => 'Малюмат базасы килитли',

# Move page
'move-page-legend'        => 'Ад денъишиклиги',
'movepagetext'            => "Ашагъыдаки форманы къулланып саифенинъ адыны денъиштирилир. Бунынънен берабер денъишиклик журналы да янъы адгъа авуштырылыр.
Эски ад янъы адгъа ёллама олур. Эски серлевагъа ёллама саифелерни автоматик оларакъ янъартып оласынъыз. Бу ишлеми автоматик япмагъа истемесенъиз, бутюн [[Special:DoubleRedirects|чифт]] ве [[Special:BrokenRedirects|кечерсиз]] ёллама саифелерини озюнъиз тюзетмеге меджбур олурсынъыз. Багълантылар эндиден берли догъру чалышмасындан эмин олмалысынъыз.

Янъы адда бир ад затен мевджут олса, ад денъишиклиги '''япылмайджакъ''', анджакъ мевджут олгъан саифе ёллама я да бош олса ад денъишиклиги мумкюн оладжакъ. Бу демек ки, саифе адыны янълыштан денъиштирген олсанъыз деминки адыны кери къайтарып оласынъыз, амма мевджут олгъан саифени тесадюфен ёкъ эталмайсынъыз.

'''ТЕНБИ!'''
Ад денъиштирюв популяр саифелер ичюн буюк денъишмелерге себеп ола билир. Лютфен, денъишикликни япмадан эвель ола биледжеклерни козь огюне алынъыз.",
'movepagetalktext'        => "Къошулгъан музакере саифесининъ де (мевджут олса)
ады автоматик тарзда денъиштириледжек. '''Мустесналар:'''

* Айны бу адда бош олмагъан бир музакере саифеси энди мевджуттир;
* Ашагъыдаки бошлукъкъа ишарет къоймадынъыз.

Бойле алларда, керек олса, саифелерни къолнен ташымагъа я да бирлештирмеге меджбур олурсынъыз.",
'movearticle'             => 'Эски ад',
'movenotallowed'          => 'Саифелер адларыны денъиштирмеге изининъиз ёкъ.',
'newtitle'                => 'Янъы ад',
'move-watch'              => 'Бу саифени козет',
'movepagebtn'             => 'Адыны денъиштир',
'pagemovedsub'            => 'Ад денъишиклиги тамамланды',
'movepage-moved'          => "<big>'''«$1» саифесининъ ады «$2» оларакъ денъиштирильди'''</big>", # The two titles are passed in plain text as $3 and $4 to allow additional goodies in the message.
'articleexists'           => 'Бу адда бир саифе энди мевджут я да сиз язгъан ад ясакълы.
Лютфен, башкъа бир ад сайлап язынъыз.',
'cantmove-titleprotected' => 'Сиз язгъан янъы ад ясакълыдыр, бунынъ ичюн саифе адыны денъиштирмекнинъ чареси ёкъ.',
'talkexists'              => "'''Саифенинъ ады денъиштирильди, амма музакере саифесининъ адыны денъиштирмеге мумкюнлик ёкътыр, чюнки айны бу адда бир саифе энди мевджуттир. Лютфен, буларны къолнен бирлештиринъиз.'''",
'movedto'                 => 'ады денъиштирильди:',
'movetalk'                => 'Музакере саифесининъ адыны денъиштир.',
'1movedto2'               => '"[[$1]]" саифесининъ ады "[[$2]]" оларакъ денъиштирильди',
'1movedto2_redir'         => '[[$1]] серлевасы [[$2]] саифесине ёлланды',
'movelogpage'             => 'Ад денъишиклиги журналы',
'movelogpagetext'         => 'Ашагъыда булунгъан джедвель ады денъиштирильген саифелерни косьтере',
'movereason'              => 'Себеп',
'revertmove'              => 'Кериге ал',
'delete_and_move'         => 'Ёкъ эт ве адыны денъиштир',
'delete_and_move_text'    => '==Ёкъ этмек лязимдир==

«[[:$1]]» саифеси энди мевджут. Адыны денъиштирип олмакъ ичюн оны ёкъ этмеге истейсинъизми?',
'delete_and_move_confirm' => 'Эбет, бу саифени ёкъ эт',
'delete_and_move_reason'  => 'Исим денъиштирип олмакъ ичюн ёкъ этильди',
'selfmove'                => 'Бу саифенинъ адыны денъиштирмеге имкян ёкътыр, чюнки асыл иле янъы адлары бир келе.',
'immobile_namespace'      => 'Бу саифенинъ адыны денъиштирмеге имкян ёкътыр, чюнки янъы я да экси адында резерв этильген ярдымджы сёз бардыр.',

# Export
'export' => 'Саифелерни экспорт эт',

# Namespace 8 related
'allmessages'         => 'Система беянатлары',
'allmessagesname'     => 'Исим',
'allmessagesdefault'  => 'Оригиналь метин',
'allmessagescurrent'  => 'Къулланымдаки метин',
'allmessagestext'     => 'Ишбу джедвель MediaWiki-де мевджут олгъан бутюн система беянатларынынъ джедвелидир.
MediaWiki интерфейсининъ чешит тиллерге терджиме этювде иштирак этмеге истесенъиз [http://www.mediawiki.org/wiki/Localisation MediaWiki Localisation] ве [http://translatewiki.net Betawiki] саифелерине зиярет этинъиз.',
'allmessagesfilter'   => 'Метин айрыштырыджы фильтры:',
'allmessagesmodified' => 'Тек денъиштирильгенлерни косьтер',

# Thumbnails
'thumbnail-more'           => 'Буют',
'filemissing'              => 'Файл тапылмады',
'thumbnail_error'          => 'Кичик ресим (thumbnail) яратылгъанда бир хата чыкъты: $1',
'thumbnail_invalid_params' => 'Янълыш thumbnail параметри',
'thumbnail_dest_directory' => 'Истенильген директорияны яратмакънынъ ич чареси ёкъ',

# Import log
'importlogpage' => 'Импорт журналы',

# Tooltip help for the actions
'tooltip-pt-userpage'             => 'Шахсий саифем',
'tooltip-pt-anonuserpage'         => 'IP адресим ичюн къулланыджы саифеси',
'tooltip-pt-mytalk'               => 'Музакере саифем',
'tooltip-pt-anontalk'             => 'Бу IP адресинден япылгъан денъишикликлерни музакере эт',
'tooltip-pt-preferences'          => 'Сазламаларым (настройкаларым)',
'tooltip-pt-watchlist'            => 'Мен козетювге алгъан саифелер',
'tooltip-pt-mycontris'            => 'Къошкъан исселеримнинъ джедвели',
'tooltip-pt-login'                => 'Отурым ачманъыз тевсие олуныр амма меджбур дегильсинъиз.',
'tooltip-pt-anonlogin'            => 'Отурым ачманъыз тевсие олуныр амма меджбур дегильсинъиз.',
'tooltip-pt-logout'               => 'Отурымны къапат',
'tooltip-ca-talk'                 => 'Саифедеки малюмат иле багълы зан бельгиле',
'tooltip-ca-edit'                 => 'Бу саифени денъиштирип оласынъыз. Сакъламаздан эвель ог бакъув япмагъа унутманъыз.',
'tooltip-ca-addsection'           => 'Бу музакереге тефсир экленъиз.',
'tooltip-ca-viewsource'           => 'Бу саифе къорчалав алтында. Менба кодуны тек корип оласынъыз, денъиштирип оламайсынъыз.',
'tooltip-ca-history'              => 'Бу саифенинъ кечмиш версиялары.',
'tooltip-ca-protect'              => 'Бу саифени къорчала',
'tooltip-ca-delete'               => 'Саифени ёкъ эт',
'tooltip-ca-undelete'             => 'Саифени ёкъ этильмезден эвельки алына кери кетиринъиз',
'tooltip-ca-move'                 => 'Саифенинъ адыны денъиштир',
'tooltip-ca-watch'                => 'Бу саифени козетювге ал',
'tooltip-ca-unwatch'              => 'Бу саифени козетмекни ташла',
'tooltip-search'                  => '{{SITENAME}} сайтында къыдырув яп',
'tooltip-search-go'               => 'Бу адда саифе мевджут олса, онъа бар',
'tooltip-search-fulltext'         => 'Бу метини олгъан саифелер къыдыр',
'tooltip-p-logo'                  => 'Баш саифе',
'tooltip-n-mainpage'              => 'Башлангъыч саифесине къайтынъыз',
'tooltip-n-portal'                => 'Проект узерине, не къайдадыр, нени япып оласынъыз',
'tooltip-n-currentevents'         => 'Агъымдаки вакъиаларнен багълы сонъки малюматлар',
'tooltip-n-recentchanges'         => 'Викиде япылгъан сонъки денъишикликлернинъ джедвели.',
'tooltip-n-randompage'            => 'Тесадюфий бир саифеге барынъыз',
'tooltip-n-help'                  => 'Ярдым алмакъ ичюн.',
'tooltip-t-whatlinkshere'         => 'Бу саифеге багъланты берген дигер вики саифелерининъ джедвели',
'tooltip-t-recentchangeslinked'   => 'Бу саифеге багъланты берген саифелердеки сонъки денъишикликлер',
'tooltip-feed-rss'                => 'Бу саифе ичюн RSS трансляциясы',
'tooltip-feed-atom'               => 'Бу саифе ичюн atom трансляциясы',
'tooltip-t-contributions'         => 'Къулланыджынынъ иссе джедвелини корь',
'tooltip-t-emailuser'             => 'Къулланыджыгъа e-mail мектюбини ёлла',
'tooltip-t-upload'                => 'Системагъа ресим я да медиа файлларны юкленъиз',
'tooltip-t-specialpages'          => 'Бутюн махсус саифелернинъ джедвелини косьтер',
'tooltip-t-print'                 => 'Бу саифенинъ басылмагъа уйгъун корюниши',
'tooltip-t-permalink'             => 'Бу саифенинъ версиясына даимий багъланты',
'tooltip-ca-nstab-main'           => 'Саифени косьтер',
'tooltip-ca-nstab-user'           => 'Къулланыджы саифесини косьтер',
'tooltip-ca-nstab-media'          => 'Медиа саифесини косьтер',
'tooltip-ca-nstab-special'        => 'Бу махсус саифе олгъаны ичюн денъишиклик япамазсынъыз.',
'tooltip-ca-nstab-project'        => 'Проект саифесини косьтер',
'tooltip-ca-nstab-image'          => 'Ресим саифесини косьтер',
'tooltip-ca-nstab-mediawiki'      => 'Система беянатыны косьтер',
'tooltip-ca-nstab-template'       => 'Шаблонны косьтер',
'tooltip-ca-nstab-help'           => 'Ярдым саифесини корьмек ичюн басынъыз',
'tooltip-ca-nstab-category'       => 'Категория саифесини косьтер',
'tooltip-minoredit'               => 'Кичик денъишиклик оларакъ ишаретле',
'tooltip-save'                    => 'Денъишикликлерни сакъла',
'tooltip-preview'                 => 'Ог бакъув; сакъламаздан эвель бу хусусиетни къулланып денъишикликлеринъизни козьден кечиринъиз!',
'tooltip-diff'                    => 'Метинге сиз япкъан денъишикликлерни косьтерир.',
'tooltip-compareselectedversions' => 'Сайлангъан эки версия арасындаки фаркъларны косьтер.',
'tooltip-watch'                   => 'Саифени козетюв джедвелине экле',
'tooltip-recreate'                => 'Ёкъ этильген олмасына бакъмадан саифени янъыдан янъарт',
'tooltip-upload'                  => 'Юкленип башла',

# Stylesheets
'monobook.css' => '/* monobook темасынынъ аярларыны (настройкаларыны) денъиштирмек ичюн бу ерини денъиштиринъиз. Бутюн сайтта тесирли олур. */',

# Metadata
'nodublincore'      => 'Dublin Core RDF мета малюматы бу сервер ичюн ясакълы.',
'nocreativecommons' => 'Creative Commons RDF мета малюматы бу сервер ичюн ясакълы.',
'notacceptable'     => 'Вики-сервер браузеринъиз окъуп оладжакъ форматында малюмат бералмай.',

# Attribution
'anonymous'        => '{{SITENAME}} сайтынынъ адсыз (аноним) къулланыджылары',
'siteuser'         => '{{SITENAME}} къулланыджы $1',
'lastmodifiedatby' => 'Саифе энъ сонъки $3 тарафындан $2, $1 тарихында денъиштирильди.', # $1 date, $2 time, $3 user
'othercontribs'    => '$1 менбасына бинаэн.',
'others'           => 'дигерлери',
'siteusers'        => '{{SITENAME}} къулланыджылар $1',
'creditspage'      => 'Тешеккюрлер',
'nocredits'        => 'Бу саифе ичюн къулланыджылар джедвели ёкъ.',

# Spam protection
'spamprotectiontitle' => 'Спам къаршы къорчалав фильтри',
'spamprotectiontext'  => 'Сакъламагъа истеген саифенъиз спам фильтри тарафындан блок этильди. Буюк ихтималлы ки, саифеде къара джедвельдеки бир тыш сайткъа багъланты бар.',
'spamprotectionmatch' => 'Спам-фильтрден ишбу беянат кельди: $1',
'spambot_username'    => 'Спамдан темизлев',
'spam_reverting'      => '$1 сайтына багълантысы олмагъан сонъки версиягъа кери кетирюв',
'spam_blanking'       => 'Бар олгъан версияларда $1 сайтына багълантылар бар, темизлев',

# Info page
'infosubtitle'   => 'Саифе акъкъында малюмат',
'numedits'       => 'Денъишиклик сайысы (саифе): $1',
'numtalkedits'   => 'Денъишиклик сайысы (музакере саифеси): $1',
'numwatchers'    => 'Козетиджи сайысы: $1',
'numauthors'     => 'Муэллиф сайысы (саифе): $1',
'numtalkauthors' => 'Муэллиф сайысы (музакере саифеси): $1',

# Math options
'mw_math_png'    => 'Даима PNG ресим форматына чевир',
'mw_math_simple' => 'Пек басит олса HTML, ёкъса PNG',
'mw_math_html'   => 'Мумкюн олса HTML, ёкъса PNG',
'mw_math_source' => 'Денъиштирмеден TeX оларакъ ташла  (метин темелли браузерлер ичюн)',
'mw_math_modern' => 'Земаневий браузерлер ичюн тевсие этильген',
'mw_math_mathml' => 'Мумкюн олса MathML (даа денъеме алында)',

# Image deletion
'deletedrevision'                 => '$1 сайылы эски версия ёкъ этильди.',
'filedeleteerror-short'           => 'Файл ёкъ эткенде хата чыкъты: $1',
'filedelete-missing'              => '"$1" адлы файл ёкъ этилип оламай, чюнки ойле бир файл ёкъ.',
'filedelete-old-unregistered'     => 'Малюмат базасында сайлангъан «$1» файл версиясы ёкъ.',
'filedelete-current-unregistered' => 'Малюмат базасында сайлангъан «$1» адлы файл ёкъ.',

# Browsing diffs
'previousdiff' => '← Эвельки денъишиклик',
'nextdiff'     => 'Сонъраки денъишиклик →',

# Media information
'mediawarning'         => "'''ДИКЪКЪАТ!''': Бу файлда яман макъсатлы (вирус киби) къысым булунып ола ве операцион системанъызгъа зарар кетирип олур.
<hr />",
'imagemaxsize'         => 'Ресимлернинъ малюмат саифелериндеки ресимнинъ максималь буюклиги:',
'thumbsize'            => 'Кичик буюклик:',
'widthheightpage'      => '$1 × $2, $3 саифе',
'file-info'            => '(файл буюклиги: $1, MIME чешити: $2)',
'file-info-size'       => '($1 × $2 пиксель, файл буюклиги: $3, MIME чешити: $4)',
'file-nohires'         => '<small>Даа юксек чезинирликке саип версия ёкъ.</small>',
'svg-long-desc'        => '(SVG файлы, номиналь $1 × $2 пиксель, файл буюклиги: $3)',
'show-big-image'       => 'Там чезинирлик',
'show-big-image-thumb' => '<small>Ог бакъувда ресим буюклиги: $1 × $2 пиксель</small>',

# Special:NewImages
'newimages'             => 'Янъы ресимлер',
'imagelisttext'         => "Ашагъыдаки джедвельде $2 коре тизильген {{PLURAL:$1|'''1''' файлдыр|'''$1''' файлдыр}}.",
'showhidebots'          => '(ботларны $1)',
'noimages'              => 'Ресим ёкъ.',
'ilsubmit'              => 'Къыдыр',
'bydate'                => 'хронологик сыранен',
'sp-newimages-showfrom' => '$1, $2 тарихындан башлап янъы файллар косьтер',

# Video information, used by Language::formatTimePeriod() to format lengths in the above messages
'video-dims'     => '$1, $2 × $3',
'seconds-abbrev' => 'сан.',
'minutes-abbrev' => 'дакъ.',
'hours-abbrev'   => 'саат',

# Bad image list
'bad_image_list' => 'Формат бойле олмалы:

Эр сатыр * символынен башламалы. Сатырнынъ биринджи багълантысы эклемеге ясакълангъан файлгъа багъланмалы.
Шу сатырда илеридеки багълантылар истисна олурлар, яни шу саифелерде ишбу файл къулланмакъ мумкюн.',

# Metadata
'metadata'          => 'Ресим деталлери',
'metadata-help'     => 'Файлда (адетиндже ракъамлы камера ве сканерлернен экленген) иляве малюматы бар. Эгер бу файл яратылгъандан сонъ денъиштирильсе эди, бельки де базы параметрлер эскирди.',
'metadata-expand'   => 'Тафсилятны косьтер',
'metadata-collapse' => 'Тафсилятны косьтерме',
'metadata-fields'   => 'Бу джедвельдеки EXIF мета малюматы ресим саифесинде косьтериледжек, башкъалары исе гизленеджек.
* make
* model
* datetimeoriginal
* exposuretime
* fnumber
* focallength', # Do not translate list items

# EXIF tags
'exif-make'                => 'Камера маркасы',
'exif-model'               => 'Камера модели',
'exif-artist'              => 'Яратыджысы',
'exif-colorspace'          => 'Ренк аралыгъы',
'exif-datetimeoriginal'    => 'Оригиналь саат ве тарих',
'exif-exposuretime'        => 'Экспозиция муддети',
'exif-exposuretime-format' => '$1 сание ($2)',
'exif-fnumber'             => 'Диафрагма номерасы',
'exif-spectralsensitivity' => 'Спектраль дуйгъулылыкъ',
'exif-aperturevalue'       => 'Диафрагма',
'exif-brightnessvalue'     => 'парлакълыкъ',
'exif-lightsource'         => 'Ярыкъ турушы',
'exif-exposureindex'       => 'Экспозиция индекси',
'exif-scenetype'           => 'Сцена чешити',
'exif-digitalzoomratio'    => 'Якъынлаштырув коэффициенти',
'exif-contrast'            => 'Контрастлыкъ',
'exif-saturation'          => 'Тойгъунлыкъ',
'exif-sharpness'           => 'Ачыкълыкъ',
'exif-gpslatitude'         => 'Энлик',
'exif-gpslongitude'        => 'Бойлукъ',
'exif-gpsaltitude'         => 'Юксеклик',
'exif-gpstimestamp'        => 'GPS сааты (атом сааты)',
'exif-gpssatellites'       => 'Ольчемек ичюн къуллангъаны спутниклер',

# EXIF attributes
'exif-compression-1' => 'Сыкъыштырылмагъан',

'exif-orientation-3' => '180° айландырылгъан', # 0th row: bottom; 0th column: right

'exif-exposureprogram-1' => 'Эльнен',

'exif-subjectdistance-value' => '$1 метр',

'exif-meteringmode-0'   => 'Билинмей',
'exif-meteringmode-1'   => 'Орта',
'exif-meteringmode-255' => 'Дигер',

'exif-lightsource-0'  => 'Билинмей',
'exif-lightsource-2'  => 'Флуоресцент',
'exif-lightsource-9'  => 'Ачыкъ',
'exif-lightsource-10' => 'Къапалы',
'exif-lightsource-11' => 'Кольге',
'exif-lightsource-15' => 'Беяз флуоресцент (WW 3200 – 3700K)',

'exif-sensingmethod-1' => 'Танытувсыз',

'exif-scenecapturetype-0' => 'Стандарт',
'exif-scenecapturetype-2' => 'Портрет',
'exif-scenecapturetype-3' => 'Гедже съёмкасы',

'exif-subjectdistancerange-0' => 'Билинмей',
'exif-subjectdistancerange-1' => 'Макро',

# External editor support
'edit-externally'      => 'Файл узеринде компьютеринъизде булунгъан программалар иле денъишикликлер япынъыз',
'edit-externally-help' => 'Даа фазла малюмат ичюн [http://www.mediawiki.org/wiki/Manual:External_editors бу саифеге] (Инглиздже) бакъып оласынъыз.',

# 'all' in various places, this might be different for inflected languages
'recentchangesall' => 'эписини',
'imagelistall'     => 'Джумлеси',
'watchlistall2'    => 'эписини',
'namespacesall'    => 'Эпси',
'monthsall'        => 'Эписи',

# E-mail address confirmation
'confirmemail'             => 'E-mail адресини тасдыкъла',
'confirmemail_noemail'     => '[[Special:Preferences|Къулланыджы сазламаларынъызда]] кечерли бир e-mail адресинъиз ёкъ.',
'confirmemail_text'        => '{{SITENAME}} сайтынынъ e-mail функцияларыны къулланмаздан эвель e-mail адресинъизнинъ тасдыкъланмасы керек. Адресинъизге тасдыкъ e-mail мектюбини ёлламакъ ичюн ашагъыдаки дёгмени басынъыз. Ёлланаджакъ беянатта адресинъизни тасдыкъламакъ ичюн браузеринъизнен иришип оладжакъ, тасдыкъ коду олгъан бир багъланты оладжакъ.',
'confirmemail_pending'     => '<div class="error">
Тасдыкъ коду энди сизге ёлланды.
Эгер эсабынъызны кеченлери ачса эдинъиз, бельки де янъны кодны бир даа сорагъанынъызда, бираз беклемек керек олур.
</div>',
'confirmemail_send'        => 'Тасдыкъ кодуны ёлла',
'confirmemail_sent'        => 'Тасдыкъ e-mail мектюбини ёлланды.',
'confirmemail_oncreate'    => 'Бельгилеген e-mail адресинъизге тасдыкъ кодунен мектюп ёлланды.
Ишбу код отурым ачмакъ ичюн лязим дегиль, амма бу проектте электрон почтасынынъ чарелерини къулланмакъ ичюн рухсет берильмезден эвель оны бельгилемелисинъиз.',
'confirmemail_sendfailed'  => '{{SITENAME}} тасдыкъ кодуны ёллап оламай. Лютфен, адресте кечерсиз ариф я да ишарет олмагъаныны тешкеринъиз. 

Сервернинъ джевабы: $1',
'confirmemail_invalid'     => 'Кечерсиз тасдыкъ коду. Тасдыкъ кодунынъ сонъки къулланма тарихы кечкен ола билир.',
'confirmemail_needlogin'   => '$1 япмакъ ичюн башта e-mail адресинъизни тасдыкъламалысынъыз.',
'confirmemail_success'     => 'E-mail адресинъиз тасдыкъланды.',
'confirmemail_loggedin'    => 'E-mail адресинъиз тасдыкъланды.',
'confirmemail_error'       => 'Тасдыкъынъыз билинмеген бир хата себебинден къайд этильмеди.',
'confirmemail_subject'     => '{{SITENAME}} e-mail адрес тасдыкъы.',
'confirmemail_body'        => '$1 IP адресинден япылгъан иришим иле {{SITENAME}} сайтында
бу e-mail адресинен багълангъан $2 къулланыджы эсабы ачылды.  

Бу e-mail адресининъ бахсы кечкен къулланыджы эсабына аит олгъаныны
тасдыкъламакъ ве {{SITENAME}} сайтындаки e-mail функцияларыны актив алгъа
кетирмек ичюн ашагъыдаки багълантыны басынъыз.

$3

Бахсы кечкен къулланыджы эсабы сизге аит олмагъан олса бу багълантына басынъыз:

$5

Бу тасдыкъ коду $4 тарихына къадар кечерли оладжакъ.',
'confirmemail_invalidated' => 'E-mail адресининъ тасдыкъы лягъу этильди',
'invalidateemail'          => 'E-mail адресининъ тасдыкъы лягъу эт',

# Scary transclusion
'scarytranscludedisabled' => '[«Interwiki transcluding» ишлемей]',
'scarytranscludefailed'   => '[$1 шаблонына иришилип оламады]',
'scarytranscludetoolong'  => '[URL адреси чокъ узун]',

# Trackbacks
'trackbackbox'      => '<div id="mw_trackbacks">
Бу саифе ичюн trackback:<br />
$1
</div>',
'trackbackremove'   => ' ([$1 ёкъ эт])',
'trackbacklink'     => 'Trackback',
'trackbackdeleteok' => 'Trackback мувафакъиетнен ёкъ этильди.',

# Delete conflict
'deletedwhileediting' => "'''Тенби''': Бу саифе сиз денъишиклик япмагъа башлагъандан сонъ ёкъ этильди!",
'confirmrecreate'     => "Сиз бу саифени денъиштирген вакъытта [[User:$1|$1]] ([[User talk:$1|музакере]]) къулланыджысы оны ёкъ эткендир, себеби:
:''$2''
Саифени янъыдан яратмагъа истесенъиз, лютфен, буны тасдыкъланъыз.",
'recreate'            => 'Саифени янъыдан ярат',

# HTML dump
'redirectingto' => 'Ёллама [[:$1]]...',

# action=purge
'confirm_purge'        => 'Саифе кэшини темизлесинми?

$1',
'confirm_purge_button' => 'Ок',

# AJAX search
'searchcontaining' => "''$1'' деген сёзлер иле саифелерни къыдырув.",
'searchnamed'      => "''$1'' адлы саифелерни къыдырув.",
'articletitles'    => "''$1'' иле башлагъан саифелерни къыдырув.",
'hideresults'      => 'Нетиджелерни гизле',
'useajaxsearch'    => 'AJAX къыдырувы къуллан',

# Multipage image navigation
'imgmultipageprev' => '← эвельки саифе',
'imgmultipagenext' => 'сонъраки саифе →',
'imgmultigo'       => 'Бар',

# Table pager
'ascending_abbrev'         => 'кичиктен буюкке',
'descending_abbrev'        => 'буюктен кичикке',
'table_pager_next'         => 'Сонъраки саифе',
'table_pager_prev'         => 'Эвельки саифе',
'table_pager_first'        => 'Ильк саифе',
'table_pager_last'         => 'Сонъки саифе',
'table_pager_limit'        => 'Саифе башына $1 дане косьтер',
'table_pager_limit_submit' => 'Бар',
'table_pager_empty'        => 'Ич нетидже ёкъ',

# Auto-summaries
'autosumm-blank'   => 'Саифе бошатылды',
'autosumm-replace' => "Саифедеки малюмат '$1' иле денъиштирильди",
'autoredircomment' => '[[$1]] саифесине ёлланды',
'autosumm-new'     => 'Янъы саифе: $1',

# Live preview
'livepreview-loading' => 'Юкленмекте…',
'livepreview-ready'   => 'Юкленмекте… Азыр!',
'livepreview-failed'  => 'Тез ог бакъув чалышмай! Адий ог бакъувны къулланып бакъынъыз.',
'livepreview-error'   => 'Багъланамады: $1 «$2». Адий ог бакъувны къулланып бакъынъыз.',

# Friendlier slave lag warnings
'lag-warn-normal' => '$1 саниеден эвель ве ондан сонъ япылгъан денъишикликлернинъ бу джедвельде косьтерильмемеси мумкюн.',
'lag-warn-high'   => 'Малюмат базасындаки проблемалар себебинден $1 саниеден эвель ве ондан сонъ япылгъан денъишикликлернинъ бу джедвельде косьтерильмемеси мумкюн.',

# Watchlist editor
'watchlistedit-numitems'       => 'Музакере саифесини эсапкъа алмайып, козетюв джедвелинъизде {{PLURAL:$1|1|$1}} саифе бар.',
'watchlistedit-noitems'        => 'Козетюв джедвелинъизде ич бир саифе ёкъ.',
'watchlistedit-normal-title'   => 'Козетюв джевелинъизни денъиштирмектесинъиз',
'watchlistedit-normal-legend'  => 'Козетюв джедвелинден саифе ёкъ этилюви',
'watchlistedit-normal-explain' => 'Козетюв джедвелинъиздеки саифелер ашагъыда булуна. Саифе козетюв джедвелинден ёкъ этмек ичюн оны бельгилеп «Сайлангъан саифелерни козетюв джедвелинден ёкъ эт» язысына басынъыз. Козетюв джедвелинъизни [[Special:Watchlist/raw|метин оларакъ да денъиштирип]] оласынъыз.',
'watchlistedit-normal-submit'  => 'Сайлангъан саифелерни козетюв джевелинден ёкъ эт',
'watchlistedit-normal-done'    => '{{PLURAL:$1|1 саифе|$1 саифе}} козетюв джедвелинъизден ёкъ этильди:',
'watchlistedit-raw-title'      => 'Козетюв джевелинъизни денъиштирмектесинъиз',
'watchlistedit-raw-legend'     => 'Козетюв джедвелини денъиштирилюви',
'watchlistedit-raw-explain'    => 'Козетюв джедвелинъиздеки саифелер ашагъыда булуна. Джедвельге саифе ады къошып я да ондан ёкъ этип (эр сатырда бирер ад) оны денъиштирип оласынъыз. Битирген сонъ «козетюв джедвелини янъарт» язысына басынъыз. [[Special:Watchlist/edit|Стандарт редакторны да къулланып олурсынъыз]].',
'watchlistedit-raw-titles'     => 'Саифелер:',
'watchlistedit-raw-submit'     => 'Козетюв джедвелини янъарт',
'watchlistedit-raw-done'       => 'Козетюв джедвелинъиз янъарды.',
'watchlistedit-raw-added'      => '{{PLURAL:$1|1 саифе|$1 саифе}} иляве олунды:',
'watchlistedit-raw-removed'    => '{{PLURAL:$1|1 саифе|$1 саифе}} ёкъ этильди:',

# Watchlist editing tools
'watchlisttools-view' => 'Денъишикликлерни косьтер',
'watchlisttools-edit' => 'Козетюв джедвелини корь ве денъиштир',
'watchlisttools-raw'  => 'Козетюв джедвелини адий метин оларакъ денъиштир',

# Special:Version
'version' => 'Версия', # Not used as normal message but as header for the special page itself

# Special:SpecialPages
'specialpages' => 'Махсус саифелер',

# Special:BlankPage
'blankpage'              => 'Бош саифе',
'intentionallyblankpage' => 'Бу саифе аселет бош къалдырылгъан',

);
