<?php
/** Yiddish (ייִדיש)
 *
 * @ingroup Language
 * @file
 *
 * @author Jiddisch
 * @author Teak
 * @author Yidel
 * @author לערי ריינהארט
 * @author פוילישער
 */

$fallback = 'he';

$rtl = true;

$namespaceNames = array(
	NS_MEDIA          => 'מעדיע',
	NS_SPECIAL        => 'באַזונדער',
	NS_MAIN           => '',
	NS_TALK           => 'רעדן',
	NS_USER           => 'באַניצער',
	NS_USER_TALK      => 'באַניצער_רעדן',
	# NS_PROJECT set by $wgMetaNamespace
	NS_PROJECT_TALK   => '$1_רעדן',
	NS_IMAGE          => 'בילד',
	NS_IMAGE_TALK     => 'בילד_רעדן',
	NS_MEDIAWIKI      => 'מעדיעװיקי',
	NS_MEDIAWIKI_TALK => 'מעדיעװיקי_רעדן',
	NS_TEMPLATE       => 'מוסטער',
	NS_TEMPLATE_TALK  => 'מוסטער_רעדן',
	NS_HELP           => 'הילף',
	NS_HELP_TALK      => 'הילף_רעדן',
	NS_CATEGORY       => 'קאַטעגאָריע',
	NS_CATEGORY_TALK  => 'קאַטעגאָריע_רעדן'
);

$namespaceAliases = array(
	'באזונדער' => NS_SPECIAL,
	'באנוצער' => NS_USER,
	'באנוצער_רעדן' => NS_USER_TALK,
	'מעדיעוויקי' => NS_MEDIAWIKI,
	'מעדיעוויקי_רעדן' => NS_MEDIAWIKI_TALK,
	'קאטעגאריע' => NS_CATEGORY,
	'קאטעגאריע_רעדן' => NS_CATEGORY_TALK,
	'באניצער' => NS_USER,
	'באניצער_רעדן' => NS_USER_TALK,
);

$specialPageAliases = array(
	'DoubleRedirects'           => array( 'פארטאפלטע_ווייטערפירונגען' ),
	'BrokenRedirects'           => array( 'צעבראכענע_ווייטערפירונגען' ),
	'Disambiguations'           => array( 'באדייטן' ),
	'Userlogin'                 => array( 'באניצער_איינלאגירן' ),
	'Preferences'               => array( 'פרעפערענצן' ),
	'Watchlist'                 => array( 'אויפֿפאסן_ליסטע', 'מיין_אויפֿפאסן_ליסטע' ),
	'Recentchanges'             => array( 'לעצטע_ענדערונגען' ),
	'Upload'                    => array( 'ארויפלאדן' ),
	'Imagelist'                 => array( 'בילדער' ),
	'Newimages'                 => array( 'נייע_בילדער' ),
	'Listusers'                 => array( 'ליסטע_פון_באניצערס' ),
	'Statistics'                => array( 'סטאטיסטיק' ),
	'Randompage'                => array( 'צופעליג', 'צופעליגער_בלאט' ),
	'Lonelypages'               => array( 'פאר\'יתומ\'טע_בלעטער' ),
	'Uncategorizedpages'        => array( 'בלעטער_אן_קאטעגאריעס' ),
	'Uncategorizedcategories'   => array( 'קאטעגאריעס_אן_קאטעגאריעס' ),
	'Uncategorizedimages'       => array( 'בילדער_אן_קאטעגאריעס' ),
	'Uncategorizedtemplates'    => array( 'מוסטערן_אן_קאטעגאריעס' ),
	'Unusedcategories'          => array( 'אומבאניצטע_קאטעגאריעס' ),
	'Unusedimages'              => array( 'אומבאניצטע_בילדער' ),
	'Wantedpages'               => array( 'געזוכטע_בלעטער' ),
	'Wantedcategories'          => array( 'געזוכטע_קאטעגאריעס' ),
	'Mostlinked'                => array( 'מערסטע_פארבונדענע_בלעטער' ),
	'Mostlinkedcategories'      => array( 'מערסטע_פארבונדענע_קאטעגאריעס' ),
	'Mostlinkedtemplates'       => array( 'מערסטע_פארבונדענע_מוסטערן' ),
	'Mostimages'                => array( 'מערסטע_פארבונדענע_בילדער' ),
	'Shortpages'                => array( 'קורצע_בלעטער' ),
	'Longpages'                 => array( 'לאנגע_בלעטער' ),
	'Newpages'                  => array( 'נייע_בלעטער' ),
	'Ancientpages'              => array( 'אוראלטע_בלעטער' ),
	'Deadendpages'              => array( 'בלעטער_אן_פארבינדונגען' ),
	'Protectedpages'            => array( 'געשיצטע_בלעטער' ),
	'Protectedtitles'           => array( 'געשיצטע_קעפלעך' ),
	'Allpages'                  => array( 'אלע_בלעטער' ),
	'Prefixindex'               => array( 'בלעטער_וואס_הייבן_אין_מיט' ),
	'Specialpages'              => array( 'באזונדערע_בלעטער' ),
	'Emailuser'                 => array( 'שיקן_אן_ע-פאסט_צום_באניצער' ),
	'Confirmemail'              => array( 'באשטעטיגן_ע-פאסט' ),
	'Whatlinkshere'             => array( 'בלעטער_וואס_פארבונדן_אהער' ),
	'Movepage'                  => array( 'באוועגן_בלאט' ),
	'Categories'                => array( 'קאטעגאריעס' ),
	'Version'                   => array( 'ווערזיע' ),
	'Allmessages'               => array( 'סיסטעם_מעלדונגען' ),
	'Blockip'                   => array( 'בלאקירן' ),
	'Unwatchedpages'            => array( 'נישט_אויפגעפאסטע_בלעטער' ),
	'Listredirects'             => array( 'ווייטערפירונגען' ),
	'Mycontributions'           => array( 'מיינע_ביישטייערן' ),
	'Listadmins'                => array( 'ליסטע_פון_סיסאפס' ),
	'Listbots'                  => array( 'ליסטע_פון_באטס' ),
	'Search'                    => array( 'זוכן' ),
	'Withoutinterwiki'          => array( 'בלעטער_אָן_אינטערוויקי' ),
);

$defaultUserOptionOverrides = array(
	# Swap sidebar to right side by default
	'quickbar' => 2,
);

$magicWords = array(
	'redirect'            => array( '0', '#ווייטערפירן', '#REDIRECT' ),
	'toc'                 => array( '0', '__אינהאלט__', '__תוכן__', '__TOC__' ),
	'pagename'            => array( '1', 'בלאטנאמען', 'PAGENAME' ),
	'namespace'           => array( '1', 'נאמענטייל', 'NAMESPACE' ),
	'subst'               => array( '0', 'ס:', 'SUBST:' ),
	'img_thumbnail'       => array( '1', 'קליין', 'ממוזער', 'thumbnail', 'thumb' ),
	'img_manualthumb'     => array( '1', 'קליין=$1', 'ממוזער=$1', 'thumbnail=$1', 'thumb=$1' ),
	'img_right'           => array( '1', 'רעכטס', 'right' ),
	'img_left'            => array( '1', 'לינקס', 'left' ),
	'img_center'          => array( '1', 'צענטער', 'center', 'centre' ),
	'plural'              => array( '0', 'מערצאל:', 'PLURAL:' ),
	'defaultsort'         => array( '1', 'גרונטסארטיר:', 'DEFAULTSORT:' ),
);

$messages = array(
# User preference toggles
'tog-underline'               => 'שטרייכט אונטער לינקס',
'tog-highlightbroken'         => 'צייכן אן צובראכענע לינקען <a href="" class="new">אזוי</a> (אדער: אזוי<a href="" class="internal">?</a>)',
'tog-justify'                 => 'גראד אויס פאראגראפן',
'tog-hideminor'               => 'באהאלט קליינע עדיטס אין לעצטע ענדערונגען',
'tog-extendwatchlist'         => 'פארברייטער אויפפאסן ליסטע צו צייגן אלע פאסענדע ענדערונגען (אנדערשט: בלויז די לעצטע ענדערונג פון יעדן בלאט)',
'tog-usenewrc'                => 'פֿאַרבעסערטע "לעצטע ענדערונגען" (JavaScript)',
'tog-numberheadings'          => 'נומערירן קעפלעך אויטאמאטיש',
'tog-showtoolbar'             => 'צײַג דער רעדאַקטיר־ליניע',
'tog-editondblclick'          => 'ענדערן בלעטער דורך טאפל קליק (JavaScript)',
'tog-editsection'             => 'ערמעגליכט אפטייל ענדערן דורך [ענדערן] לינקס',
'tog-editsectiononrightclick' => 'באמעגליך פאראגראף ענדערונגען דורכן קוועטשן אויפן רעכטן<br />אויף אפטייל קעפל (JavaScript)',
'tog-showtoc'                 => 'ווייז דאס אינהאלט קעסטל<br />(פאר בלעטער מיט מער ווי 3 קעפלעך)',
'tog-rememberpassword'        => 'געדענק מיין לאגירן אין דעם קאמפיוטער',
'tog-editwidth'               => 'ענדערן קעסטל האט פולער ברייט',
'tog-watchcreations'          => 'לייג צו בלעטער וואס איך באשאף צו מיין אכטונג ליסטע',
'tog-watchdefault'            => 'אויפפאסן אױטאָמאַטיש די ארטיקלן װאָס איך באַאַרבעט',
'tog-watchmoves'              => 'לייג צו בלעטער וואס איך באוועג צו מיין אכטונג ליסטע',
'tog-watchdeletion'           => 'צולייגן בלעטער וואס איך מעק אויס צו מיין אויפפאסונג ליסטע',
'tog-minordefault'            => "באגרעניץ אלע עדיט'ס ביי דיפאלט אלס קליין",
'tog-previewontop'            => 'צײַג די "פֿאָרויסיגע װײַזונג" גלײַך בײַ דער ערשטער באַאַרבעטונג',
'tog-previewonfirst'          => 'ווייזט פאראויסדיגע ווייזונג אינעם ערשטען ענדערונג',
'tog-nocache'                 => "ס'זאל זיך נישט קעשן די בלאט",
'tog-enotifwatchlistpages'    => 'שיק מיר א בליצבריוו ווען א בלאט וואס איך פאס אויף ווערט געענדערט',
'tog-enotifusertalkpages'     => 'אימעיל מיך ווען עס ווערט גענדערט מיין באנוצער בלאט',
'tog-enotifminoredits'        => 'אימעיל מיך פאר מינדערע עדיטס צו די בלעטער',
'tog-enotifrevealaddr'        => 'דעק אויף מיין בליצפאסט אדרעס אין פאסט מודעות',
'tog-shownumberswatching'     => 'ווייז די נומער פון די בלאט ליינער',
'tog-fancysig'                => 'רויע אונטערשריפט (אָן אויטאמאטישן לינק)',
'tog-externaleditor'          => 'ניצט א דרויסנדיגן רעדאקטירער גרונטלעך (נאר פֿאר מומחים, דאס פֿאדערט באזונדערע קאמפיוטער שטעלונגען)',
'tog-externaldiff'            => 'ניצט א דרויסנדיגן פֿארגלייכער גרונטלעך (נאר פֿאר מומחים, דאס פֿאדערט באזונדערע קאמפיוטער שטעלונגען)',
'tog-showjumplinks'           => 'באמעגלעך צוטריט לינקס פון "שפרינג צו"',
'tog-uselivepreview'          => 'באנוצט זיך מיט לייוו פאראויסדיגע ווייזונג (JavaScript) (עקספירענמעטל)',
'tog-forceeditsummary'        => 'ווארן מיך ווען איך לייג א ליידיג קורץ ווארט ענדערונג',
'tog-watchlisthideown'        => 'באהאלט מיינע ענדערונגען פון דער אויפפאסן ליסטע',
'tog-watchlisthidebots'       => 'באהאלט באט עדיטס פון אויפפאסן ליסטע',
'tog-watchlisthideminor'      => 'באהאלט קליינע ענדערונגען פון דער אויפפאסן ליסטע',
'tog-nolangconversion'        => 'זיי מבטל פארשידענארטיגקייט אין קאנווערסאציע',
'tog-ccmeonemails'            => 'שיק מיר קאפיס פון אימעילס וואס איך שיק צו אנדערע באנוצער',
'tog-diffonly'                => 'ווייז נישט אינהאלט אונטער די דיפערענץ',
'tog-showhiddencats'          => 'ווײַז באהאלטענע קאטעגאריעס',

'underline-always'  => 'אייביג',
'underline-never'   => 'קיינמאל',
'underline-default' => 'בלעטערער גרונטשטעלונג',

'skinpreview' => '(פארויסדיגע ווייזונג)',

# Dates
'sunday'        => 'זונטאג',
'monday'        => 'מאָנטיג',
'tuesday'       => 'דינסטאג',
'wednesday'     => 'מיטװאָך',
'thursday'      => 'דאָנערשטאג',
'friday'        => 'פרייטיג',
'saturday'      => 'שבת',
'sun'           => "זונ'",
'mon'           => "מאנ'",
'tue'           => "דינ'",
'wed'           => "מיט'",
'thu'           => "דאנ'",
'fri'           => "פריי'",
'sat'           => 'שבת',
'january'       => 'יאַנואַר',
'february'      => 'פֿעברואַר',
'march'         => 'מאַרץ',
'april'         => 'אַפּריל',
'may_long'      => 'מײַ',
'june'          => 'יוני',
'july'          => 'יולי',
'august'        => 'אויגוסט',
'september'     => 'סעפּטעמבער',
'october'       => 'אָקטאָבער',
'november'      => 'נאָװעמבער',
'december'      => 'דעצעמבער',
'january-gen'   => 'יאנואר',
'february-gen'  => 'פעברואר',
'march-gen'     => 'מערץ',
'april-gen'     => 'אפריל',
'may-gen'       => 'מיי',
'june-gen'      => 'יוני',
'july-gen'      => 'יולי',
'august-gen'    => 'אויגוסט',
'september-gen' => 'סעפטעמבער',
'october-gen'   => 'אקטאבער',
'november-gen'  => 'נאוועמבער',
'december-gen'  => 'דעצעמבער',
'jan'           => 'יאַנ׳',
'feb'           => 'פֿעב׳',
'mar'           => 'מאַר׳',
'apr'           => 'אַפּר׳',
'may'           => 'מײַ',
'jun'           => 'יונ׳',
'jul'           => 'יול׳',
'aug'           => 'אויג׳',
'sep'           => 'סעפּ׳',
'oct'           => 'אָקט׳',
'nov'           => 'נאָװ׳',
'dec'           => 'דעץ׳',

# Categories related messages
'pagecategories'                 => '{{PLURAL:$1|קאַטעגאָריע|קאַטעגאָריעס}}',
'category_header'                => 'אַרטיקלען אין קאַטעגאָריע "$1"',
'subcategories'                  => 'אונטערקאַטעגאָריעס',
'category-media-header'          => 'מעדיע אין קאטעגאריע "$1"',
'category-empty'                 => "'''די קאטעגאריע האט נישט קיין בלעטער אדער מעדיע.'''",
'hidden-categories'              => '{{PLURAL:$1|באהאלטענע קאטעגאריע|באהאלטענע קאטעגאריעס}}',
'hidden-category-category'       => 'באהאלטענע קאטעגאריעס', # Name of the category where hidden categories will be listed
'category-subcat-count'          => '{{PLURAL:$2|די קאטעגאריע האט נאר די פֿאלגנדע אונטער-קאטעגאריע|די קאטעגאריע האט די פֿאלגנדע {{PLURAL:$1|אונטער-קאטעגאריע|$1 אונטער-קאטעגאריעס}}, פֿון $2 קאטעגאריעס אינגאנצן}}.',
'category-subcat-count-limited'  => 'די קאטעגאריע האט די פאלגנדע {{PLURAL:$1|אונטערקאטעגאריע|$1 אונטערקאטעגאריעס}}.',
'category-article-count'         => '{{PLURAL:$2|די קאטעגאריע האט נאר דעם פֿאלגנדן בלאט|די קאטעגאריע האט {{PLURAL:$1| דעם פֿאלגנדן בלאט|די פֿאלגנדע $1 בלעטער}}, פֿון $2 אינגאנצן}}.',
'category-article-count-limited' => 'די קאטעגאריע אנטהאלט {{PLURAL:$1|דעם פאלגנדן בלאט|די פאלגנדע $1 בלעטער}}.',
'category-file-count'            => '{{PLURAL:$2|די קאטעגאריע האט נאר די פֿאלגנדע טעקע|די קאטעגאריע האט די פֿאלגנדע {{PLURAL:$1| טעקע|$1 טעקעס}}, פֿון $2 אינגאנצן}}.',
'category-file-count-limited'    => 'די פֿאלגנדע {{PLURAL:$1|טעקע|$1 טעקעס}} זענען אין דער דאזיגע קאטעגאריע.',
'listingcontinuesabbrev'         => '(המשך)',

'mainpagetext'      => "'''מעדיעוויקי אינסטאלירט מיט דערפאלג.'''",
'mainpagedocfooter' => 'געבט זיך אן עצה מיט [http://meta.wikimedia.org/wiki/Help:Contents אנווייזער פאר באנוצער] פאר אינפארמאציע וויאזוי זיך באנוצען מיט וויקי סאפטוועיר.

== נוצליכע לינקס ==
* [http://www.mediawiki.org/wiki/Manual:Configuration_settings רשימת ההגדרות]
* [http://www.mediawiki.org/wiki/Manual:FAQ שאלות נפוצות]
* [http://lists.wikimedia.org/mailman/listinfo/mediawiki-announce מידיעוויקי רעליס מעלינג ליסט]',

'about'          => 'וועגן',
'article'        => 'אינהאלט בלאט',
'newwindow'      => '(עפענט זיך אין נײַעם פענסטער)',
'cancel'         => 'זיי מבטל',
'qbfind'         => 'טרעף',
'qbbrowse'       => 'בלעטערט',
'qbedit'         => 'ענדערן',
'qbpageoptions'  => 'דער בלאט',
'qbpageinfo'     => 'קאנטעקסט',
'qbmyoptions'    => 'מיינע בלעטער',
'qbspecialpages' => 'ספעציעלע בלעטער',
'moredotdotdot'  => 'נאך…',
'mypage'         => 'מיין בלאט',
'mytalk'         => 'מײַן שמועס',
'anontalk'       => 'דאס רעדן פון דעם IP',
'navigation'     => 'נאַװיגאַציע',
'and'            => 'און',

# Metadata in edit box
'metadata_help' => 'מעטא־דאטא:',

'errorpagetitle'    => 'פעלער',
'returnto'          => 'צוריקקערן צו $1.',
'tagline'           => 'פֿון {{SITENAME}}',
'help'              => 'הילף',
'search'            => 'זוכן',
'searchbutton'      => 'זוכן',
'go'                => 'גייט',
'searcharticle'     => 'גיי',
'history'           => 'בלאט היסטאריע',
'history_short'     => 'היסטאריע',
'updatedmarker'     => 'דערהיינטיגט זינט מיין לעצטע וויזיט',
'info_short'        => 'אינפארמאציע',
'printableversion'  => 'ווערסיע פאר פרינטן',
'permalink'         => 'שטענדיגער לינק',
'print'             => 'דרוק',
'edit'              => 'ענדערן',
'create'            => 'שאפֿן',
'editthispage'      => 'ענדערן דעם בלאט',
'create-this-page'  => 'שאף דעם בלאט',
'delete'            => 'אויסמעקן',
'deletethispage'    => 'מעק אויס דעם בלאט',
'undelete_short'    => 'צוריקשטעל {{PLURAL:$1|איין עדיט|$1 עדיטס}}',
'protect'           => 'באשיצן',
'protect_change'    => 'טוישן',
'protectthispage'   => 'באשיץ דעם בלאט',
'unprotect'         => 'באַפֿרײַען',
'unprotectthispage' => 'באפריי דעם בלאט',
'newpage'           => 'נייער בלאַט',
'talkpage'          => 'שמועסט איבער דעם בלאט',
'talkpagelinktext'  => 'שמועס',
'specialpage'       => 'ספעציעלער בלאט',
'personaltools'     => 'פערזענליכע טולס',
'postcomment'       => 'שטעלט צו א קאמענטור',
'articlepage'       => 'זעט אינהאלט בלאט',
'talk'              => 'שמועס',
'views'             => 'קוקן',
'toolbox'           => 'טול באקס',
'userpage'          => 'זעהט באנוצער בלאט',
'projectpage'       => 'זעהט פראיעקט בלאט',
'imagepage'         => 'זעט בילדער בלאט',
'mediawikipage'     => 'זעה מעסעזש בלאט',
'templatepage'      => 'זעט מוסטער בלאט',
'viewhelppage'      => 'זעט הילף בלאט',
'categorypage'      => 'זעהט קאטעגאריע בלאט',
'viewtalkpage'      => 'זעט שמועס',
'otherlanguages'    => 'אין אַנדערע שפראַכן',
'redirectedfrom'    => '(אַריבערגעפֿירט פון $1)',
'redirectpagesub'   => 'ווייטערפירן בלאט',
'lastmodifiedat'    => 'דער בלאט איז לעצט געווארן מאדיפיצירט $2, $1.', # $1 date, $2 time
'viewcount'         => 'דער בלאט איז געווארן געליינט {{PLURAL:$1|איין מאל|$1 מאל}}.',
'protectedpage'     => 'באשיצטער בלאט',
'jumpto'            => 'שפרינג צו:',
'jumptonavigation'  => 'נאוויגאציע',
'jumptosearch'      => 'זוכן',

# All link text and link target definitions of links into project namespace that get used by other message strings, with the exception of user group pages (see grouppage) and the disambiguation template definition (see disambiguations).
'aboutsite'            => 'וועגן {{SITENAME}}',
'aboutpage'            => 'Project:וועגן',
'bugreports'           => 'באג באריכטען',
'bugreportspage'       => 'Project:באג באריכטן',
'copyright'            => 'דער אינהאַלט איז בארעכטיגט אונטער $1.',
'copyrightpagename'    => 'קאפירעכטן פון {{SITENAME}}',
'copyrightpage'        => '{{ns:project}}:קאפירעכטן',
'currentevents'        => 'אקטועלע געשעענישן',
'currentevents-url'    => 'Project:אקטועלע געשענישען',
'disclaimers'          => 'געזעצליכע אויפקלערונג',
'disclaimerpage'       => 'Project:געזעצליכע אויפקלערונג',
'edithelp'             => 'הילף וויאזוי צו ענדערן',
'edithelppage'         => 'Help:ענדערן',
'faq'                  => 'מערסטע געפרעגטע פראגעס',
'faqpage'              => 'Project:מערסטע געפרעגט פראגעס',
'helppage'             => 'Help:אינהאַלט',
'mainpage'             => 'הויפט זייט',
'mainpage-description' => 'הויפט זייט',
'policy-url'           => 'Project:פאליסי',
'portal'               => 'קאַווע שטיבל',
'portal-url'           => 'Project:קאַווע שטיבל',
'privacy'              => 'פריוואטקייט פאליסי',
'privacypage'          => 'Project:פריוואטקייט פאליסי',

'badaccess'        => 'רשות טעות',
'badaccess-group0' => 'איר זענט נישט בארעכטיגט צו טאן די אקציע וואס איר ווילט.',
'badaccess-group1' => 'די אקציע וואס איר האט פארלאנגט צו טאן איז באגרענעצט צו באניצערס אין גרופע $1.',
'badaccess-group2' => 'די אקציע וואס איר האט פארלאנגט צו טאן איז באגרעיניצט צו איינע פון די גרופעס $1.',
'badaccess-groups' => 'די אקציע וואס איר האט פארלאנגט צו טאן איז באגרעניצט צו באנוצער אין איינע פון די גרופעס $1.',

'versionrequired'     => 'ווערסיע $1 פון מעדיעוויקי פארלאנגט זיך',
'versionrequiredtext' => 'ווערסיע $1 פון מעדיעוויקי פארלאנגט זיך צו נוצן דעם בלאט. פאר מער אינפארמאציע זעהט [[Special:Version|ווערסיע בלאט]].',

'ok'                      => 'יאָ',
'retrievedfrom'           => 'גענומען פון "$1"',
'youhavenewmessages'      => 'דו האָסט $1 ($2).',
'newmessageslink'         => 'נייע מעלדונגען',
'newmessagesdifflink'     => 'לעצטע ענדערונג',
'youhavenewmessagesmulti' => 'איר האט נייע מעסעדזשעס אין $1',
'editsection'             => 'ענדערן',
'editold'                 => 'ענדערן',
'viewsourceold'           => 'ווײַזן מקור',
'editsectionhint'         => 'ענדערן אפטיילונג: $1',
'toc'                     => 'אינהאַלט',
'showtoc'                 => 'ווייז',
'hidetoc'                 => 'באַהאַלט',
'thisisdeleted'           => 'זעה אדער שטעל צוריק $1?',
'viewdeleted'             => 'זעה $1?',
'restorelink'             => '{{PLURAL:$1|איין געמעקטע ענדערונג|$1 געמעקטע ענדערונגן}}',
'feedlinks'               => 'פיטערן:',
'feed-invalid'            => 'נישט גוטער סובסקריבשן פיעד טיפ.',
'site-rss-feed'           => 'RSS פאר $1',
'site-atom-feed'          => 'Atom פאר $1',
'feed-atom'               => 'אטאם',
'feed-rss'                => 'אר.עס.עס.',
'red-link-title'          => '$1 (נאך נישט געשריבן)',

# Short words for each namespace, by default used in the namespace tab in monobook
'nstab-main'      => 'אַרטיקל',
'nstab-user'      => 'באַניצער בלאט',
'nstab-media'     => 'מעדיע בלאט',
'nstab-special'   => 'ספעציעל',
'nstab-project'   => 'פראיעקט בלאט',
'nstab-image'     => 'בילד טעקע',
'nstab-mediawiki' => 'מעלדונג',
'nstab-template'  => 'מוסטער',
'nstab-help'      => 'הילף בלאט',
'nstab-category'  => 'קאַטעגאָריע',

# Main script and global functions
'nosuchaction'      => 'נישטא אזא אקציע',
'nosuchactiontext'  => 'די אקציע ספעסיפיזירט דורך די URL איז נישט אנערקענט ביי דעם וויקי',
'nosuchspecialpage' => 'נישטא אזא ספעציעלער בלאט',
'nospecialpagetext' => 'איר האט געבעטן א נישט ריכטיגן סעפעציעלן בלאט. זעהט די [[Special:SpecialPages|{{int:specialpages}}]].',

# General errors
'error'                => 'פעלער',
'databaseerror'        => 'דאטאבאזע פעלער',
'dberrortext'          => '<p><b>א דאטעבאזע זוכונג סינטאקס גרייז האט פאסירט</b>.</p>
<p>דאס טעות קען זיין אלס קאנסעקווענס פון אן אומגעזעצלעכע זוכונג, אדער דאס קען זיין א באג אין דער מעדיעוויקי סיסטעם.</p>
<table class="toccolours">
<tr>
<th colspan="2" style="background-color: #F8F8F8; text-align: center;">מידע על השגיאה</th>
</tr>
<tr>
<td>די לעצטע זוכונג איז געווען:</td>
<td style="direction: ltr;">$1</td>
</tr>
<tr>
<td>די פונקציע וואס האט דאס גערופן איז געווען:</td>
<td style="direction: ltr;">$2</td>
</tr>
<tr>
<td>טעות מעלדונג וואס איז צוריקגעקומען:</td>
<td style="direction: ltr;">$3: $4</td>
</tr>
</table>',
'dberrortextcl'        => '<p><b>עס האט זיך געטראפן א עראר אינעם זיכונג סינטעקס</b>.</p>
<table class="toccolours">
<tr>
<th colspan="2" style="background-color: #F8F8F8; text-align: center;">מידע על השגיאה</th>
</tr>
<tr>
<td>די לעצטע זיכונג וואס איז געווען איז:</td>
<td style="direction: ltr;">$1</td>
</tr>
<tr>
<td>פאנקציע וואס ליינט דאס איז:</td>
<td style="direction: ltr;">$2</td>
</tr>
<tr>
<td>מעלדונג פון זיכונג טעות וואס איז צוריקגעקומען איז:</td>
<td style="direction: ltr;">$3: $4</td>
</tr>
</table>',
'noconnect'            => 'אנטשולדיגט! די וויקי גייט דורך איצט טעכנישע פראבלעמען און קען זיך נישט באהעפטן צו דער דאטנבאזע.<br />$1',
'nodb'                 => 'קען נישט אויסוויילן דאטעבאזע $1',
'cachederror'          => 'ווייטער איז א קאשעיד קאפי (Cache), וואס איז ווארשיינליך נאך נישט אפדעיטעטי, פונעם געבעטענעם בלאט.',
'laggedslavemode'      => 'ווארענונג: בלאט טוט מעגליך נישט אנטהאלטן לעצטיגע דערהײַנטיגונגען.',
'readonly'             => 'דאטעבאזע פארשפארט',
'enterlockreason'      => 'שטעלט א סיבה פארן אפשפאר, אריינגערעכנט א געשאצטער צייט אויף ווען דאס וועט זיך צוריקעפענען די פארשפארונג.',
'readonlytext'         => 'די דאטעבאזע איז איצט פארשפארט צו נייע ענדערונגן און מאדיפאקאציע. ווארשיינליך פאר רוטינע טעכנישע דאטעבאזע אויפהאלטונג, וואס דערנאך וועט דאס צוריק פאנקציאנירן נארמאל.

די אדמיניסטראטור וואס האט דאס פארשפארט האט אנגעבן די סיבה: $1',
'missingarticle-rev'   => '(רעוויזיע נומער: $1)',
'missingarticle-diff'  => '(אונטערשייד: $1, $2)',
'readonly_lag'         => 'די דאטעבאזע איז אטאמטיש געווארן אפגעשפארט כדי צו ערמעגליכן פאר די אונטער דאטע באזע סערווערס צו נעמן די אפדעיטס פון די אויבער סערווער.',
'internalerror'        => 'אינערווייניגער פֿעלער',
'internalerror_info'   => 'אינערווייניגער פֿעלער: $1',
'filecopyerror'        => 'קאפי "$1" צו "$2" איז נישט דורך.',
'filerenameerror'      => 'נאמען טוישן פאר "$1" צו "$2" איז נישט דורך.',
'filedeleteerror'      => 'אויסמעקן "$1" נישט דורך.',
'directorycreateerror' => 'קען נישט באשאפן דירעקטארי "$1".',
'filenotfound'         => 'קען נישט געפינען פייל "$1".',
'fileexistserror'      => 'קען נישט שרײַבן צו טעקע "$1": טעקע עקסיסטירט שוין',
'unexpected'           => 'אומערווארטערטער ווערד: "$1"="$2"',
'formerror'            => 'פעילער: קען נישט שיקן פארעם.',
'badarticleerror'      => 'מען קען נישט טאן די אקציע וואס איר ווילט אויף דעם בלאט.',
'cannotdelete'         => 'אויסמעקן די בלאט אדער בילד האט נישט מצליח געווען. (עס איז מעגליך אז דאס איז שוין געווארן געמעקט דורך אן אנדערן.)',
'badtitle'             => 'שלעכט קעפל',
'badtitletext'         => 'די קעפל פון דעם געזוכטער בלאט איז געווען אומגעזעצליך, ליידיג, אינעווייניגסטער וויקי לינק, אדער ווערטער וואס קענען נישט גענוצט ווערן אלס קעפך.',
'perfdisabled'         => 'ווארענונג! די פיטשער איז געווארן טעמפארארלי דיסעבלד צוליב דעם וואס דאס פארשטייטערט די דאטעבאזע צוטריט צו א פונקט וואס קיינער קען נישט נוצן דעם וויקי',
'perfcached'           => "די פאלגענדע דאטע זענען גענומען פונעם 'קאש' און מעגלעך נישט אקטועל.",
'perfcachedts'         => 'די פאלגענדע דאטע איז קאשעיט, און איז לעצט געווארן אפדעיטעט $1.',
'querypage-no-updates' => 'אפדעיטס פאר דעם בלאט איז איצט דיסעיבלט, דעטע דא וועט נישט דערווייל ווערן ריפרעשט.',
'wrong_wfQuery_params' => 'די פארעמעטערס אריינגפיטער צו wfQuery() איז נישט ריכטיג:<br />
פאנקיציע: $1<br />
פארלאנג: $2',
'viewsource'           => 'זעט מקור',
'viewsourcefor'        => 'פאר $1',
'actionthrottled'      => 'די אַקציע איז באַגרענעצט',
'protectedpagetext'    => 'דער בלאט איז פארשפארט צו אפהאלטן ענדערונגן.',
'viewsourcetext'       => 'איר קענט זעהן און קאפיען די מקור פון דעם בלאט:',
'protectedinterface'   => 'דער בלאט איז שטעלט צו אינטערפעיס טעקסט פאר די סאפטוועיר, און איז פארשפארט פון איר צו קענען ענדערן, בלויז פאר די סיסאפס כדי צו פארמיידן וואנדאליזם.',
'editinginterface'     => "'''ווארענונג:''' איר באארבעט א בלאט וואס איז גענוצט צוצושטעלן אינטערפעיס טעקסט פאר דער ווייכווארג. ענדערונגען אין די בלעטער וועלן טוישן די אויסזען פון סיסטעם מודעות פאר אלע אנדערע באניצערס.",
'sqlhidden'            => '(SQL פארלאנג באהאלטן)',
'cascadeprotected'     => 'דער בלאט איז פארשפארט צום ענדערן וויבאלד ער איז איינגעשלאסן אין איינע פון די פאלגנדע {{PLURAL:$1|בלאט, וואס איז|בלעטער, וואס זענען}} באשיצט מיט דער קאסקייד אפציע:

$2',
'namespaceprotected'   => "איר זענט נישט ערלויבט צו רעדאקטירן בלעטער אינעם '''$1''' נאמענטייל.",
'ns-specialprotected'  => 'מען קען נישט רעדאגירן ספעציעלע בלעטער.',

# Virus scanner
'virus-unknownscanner' => 'אומבאוואוסטער אנטי־ווירוס:',

# Login and logout pages
'logouttitle'                => 'באנוצער ארויסלאגירן',
'logouttext'                 => '<strong>האָסט זיך ארויסלאָגירט מיט הצלחה.</strong>',
'welcomecreation'            => '== ברוך הבא, $1! ==
אייער קאנטע איז באשאפן געווארן. נישט פארגעסן צו ענדערן אייערע [[Special:Preferences|{{SITENAME}} פרעפֿערענצן]].',
'loginpagetitle'             => 'באנוצער לאגירן',
'yourname'                   => 'באַנוצער־נאָמען',
'yourpassword'               => 'פאסווארט',
'yourpasswordagain'          => 'ווידער אריינקלאפן פאסווארט',
'remembermypassword'         => 'געדיינק מיך',
'yourdomainname'             => 'דיין דאמיין:',
'externaldberror'            => 'עס איז אדער פארגעקומען א דערויסענדיגער אטענטיקאציע דאטעבעאזע פעילער אדער איר זענט נישט ערמעגליכט צו אפדעיטן אייער דערויסענידגער אקאונט.',
'loginproblem'               => "'''עס איז געווען א פראבלעם מיט דיין אריינלאגירן.'''<br />פרוביר נאכאמאל!",
'login'                      => 'אַרײַנלאָגירן',
'nav-login-createaccount'    => 'ארײַנלאָגירן / זיך אײַנשרײַבן',
'loginprompt'                => 'איר מוסט ערלויבן קיכלעך ("cookies") אויף צו אַרײַנלאָגירן אינעם {{SITENAME}}.',
'userlogin'                  => 'ארײַנלאָגירן / זיך אײַנשרײַבן',
'logout'                     => 'אַרױסלאָגירן',
'userlogout'                 => 'אַרױסלאָגירן',
'notloggedin'                => 'נישט איינגעשריבן',
'nologin'                    => 'איר האט נישט קיין קאנטע? $1.',
'nologinlink'                => 'באשאפֿט א קאנטע',
'createaccount'              => 'באשאפֿט א נייע קאנטע',
'gotaccount'                 => 'האסט שוין א קאנטע? $1.',
'gotaccountlink'             => 'אריינלאגירן',
'createaccountmail'          => 'דורך אימעיל',
'badretype'                  => 'די פאסווערטער וואס איר האט אריינגעלייגט זענען נישט אייניג.',
'userexists'                 => 'דער באַנוצער נאָמען איז שוין אין באַנוץ. ביטע קלײַב אױס אַן אַנדער נאָמען.',
'youremail'                  => 'אי-מעיל *:',
'username'                   => 'באַנוצער־נאָמען:',
'uid'                        => 'באַנוצער־נומער:',
'prefs-memberingroups'       => 'מיטגליד אין {{PLURAL:$1|גרופע|גרופעס}}:',
'yourrealname'               => 'עכטער נאמען *:',
'yourlanguage'               => 'שפּראַך:',
'yourvariant'                => 'װאַריאַנט',
'yournick'                   => 'חתימה:',
'badsig'                     => 'נישט גוטע מסוגננת אונטערשריפט; ביטע טשעקט די HTML קאוד.',
'badsiglength'               => 'אונטערשריפט צו לאנג; מוז זיין ווינציגער פון {{PLURAL:$1|איין אות|$1 אותיות}}.',
'email'                      => 'אי-מעיל',
'prefs-help-realname'        => '* עכטער נאמען (אפציאנאל): אויב וועט איר אויסוועלן צוצישטעלן דאס, וועט גענוצט ווערן צו געבן אטריביאציע צו אייער ארבייט.',
'loginerror'                 => 'לאגירן פֿעלער',
'prefs-help-email'           => 'ע-פאסט אדרעס איז ברירהדיק, אבער עס דערמעגליכט אז מען קען אייך שיקן א ניי פאסווארט טאמער איר פֿארגעסט דאס אלטע.
איר קענט אויך לאזן אנדערע צו קאנטאקטן אייך דורך אייער באניצער אדער באניצער רעדן בלאט אן ארויסגעבן אייער אידענטיטעט.',
'prefs-help-email-required'  => 'בליצפאסט אדרעס באדארפט.',
'nocookiesnew'               => 'די באניצער קאנטע איז באשאפן, אבער איר זענט נישט אריינלאגירט.
{{SITENAME}} ניצט קוקיס אריינצולאגירן באניצערס. 
איר האט קוקיס נישט-ערמעגלעכט. ביטע ערמעגלעכט זיי, דאן טוט אריינלאגירן מיט אייער באניצער נאמען און פאסווארט.',
'nocookieslogin'             => '{{SITENAME}} נוצט קוקיס צו אריינלאגירן באנוצער. דו האסט אומ-ערמעגליכט דיינע קוקיס. ביטע דערמעגליך זיי און פרובירט נאכאמאל.',
'noname'                     => 'איר האט נישט ספעציסיפירט א געזעצליכער באנוצער נאמען.',
'loginsuccesstitle'          => 'אריינלאגירונג סוסקסעספול',
'loginsuccess'               => "'''דו ביסט יעצט אַרײַנלאָגירט אַלץ \"\$1\" אינעם {{SITENAME}}.'''",
'nosuchuser'                 => 'נישטא קיין באניצער מיטן נאמען  "$1".

קוקט איבער אייער אויסלייג, אדער [[Special:Userlogin/signup|באשאפֿט א נייע קאנטע]].',
'nosuchusershort'            => 'נישטא קיין באנוצער מיטן נאמען "<nowiki>$1</nowiki>". קוק איבער דיין ספעלונג.',
'nouserspecified'            => 'איר ברויכט ספעציפיזירן א באנוצער-נאמען.',
'wrongpassword'              => 'אומריכטיגע פאסווארט אריינגעלייגט, ביטע פרובירט נאכאמאל.',
'wrongpasswordempty'         => 'פאסווארט אריינגעלייגט איז געווען ליידיג, ביטע פרובירט נאכאמאל.',
'mailmypassword'             => 'שיקט מיין נייע פאסווארט',
'passwordremindertitle'      => 'ניי צייטווייליג פאסווארט פאר {{SITENAME}}',
'passwordremindertext'       => 'עמעצער (מסתמא איר, פֿון IP אדרעס $1)
האט געבעטן מיר זאלן אייך שיקן א ניי פאסווארט פֿאר {{SITENAME}} ($4).
דאס פאסווארט פֿאר באניצער  "$2" איז איצט "$3".
איר זאלט אריינלאגירן און טוישן איצט אייער פאסווארט.

אויב איינער אנדערשט האט געמאכט די ביטע, אדער איר האט יא געדענקט אייער פאסווארט און איר טוט מער נישט באגערן דאס צו טוישן, קענט איר איגנארירן דעם מעסעזש און ווייטער ניצן אייער אלטע פאסווארט.',
'noemail'                    => 'ס\'איז נישט רעקארדירט קיין אי-מעיל אדרעס פאר באנוצער  "$1".',
'passwordsent'               => 'א ניי פאסווארט איז געשיקט געווארן צום ע-פאסט אדרעס רעגיסטרירט פאר "$1".
ביטע ווידער אריינלאגירן נאך דעם וואס איר באקומט עס.',
'blocked-mailpassword'       => 'אייער איי פי אדרעס איז געבלאקט צו רעדאקטירן, דערוועגן זענט איר נישט ערלויבט צו באניצן מיטן פאסווארט ווידעראויפלעבונג פֿונקציע כדי צו פארמיידן סיסטעם קרומבאניץ.',
'eauthentsent'               => 'א באשטעטיגונג ע-בריוו איז געשיקט געווארן צו דעם באשטימטן ע-פאסט אדרעס. איידער סיי וואס אנדערע ע-פאסט וועט ווערן געשיקט צו דער קאנטע, וועט איר דארפן פאלגן די אנווייזונגען אין דער מעלדונג כדי צו זיין זיכער אז די קאנטע איז טאקע אייערס.',
'throttled-mailpassword'     => "א פאסווארט דערמאנונג איז שוין געשיקט געווארן, אין {{PLURAL:$1|דער לעצטער שעה|די לעצטע $1 שעה'ן}}. כדי צו פארמײַדן שלעכט באניצן, נאר איין פאסווארט דערמאנונג וועט געשיקט ווערן אין {{PLURAL:$1|א שעה |$1 שעה'ן}}.",
'mailerror'                  => 'פֿעלער שיקנדיג פאסט: $1',
'acct_creation_throttle_hit' => 'צום באַדױערן, איר האָט שױן באַשאַפֿן $1 קאָנטעס. איר קענט נישט מער שאַפֿן נײַע קאָנטעס.',
'emailauthenticated'         => 'דיין אי-מעיל אדרעס איז באשטעטיגט געווארן דורך $1.',
'emailnotauthenticated'      => 'דיין אי-מעיל אדרעס איז נאכנישט באשטעטיגט. קיין אי-מעיל וועט נישט געשיקט ווערן פון קיין איינע פון די פאלגענדע פישטערס.',
'noemailprefs'               => 'ספעציפיר אן אי-מעיל אדרעס פאר די פיטשערס צו ארבייטן.',
'emailconfirmlink'           => 'באשטעטיג דיין אי-מעיל אדרעס',
'invalidemailaddress'        => 'דער ע-פאסט אדרעס קען נישט אקצעפטירט ווערן ווייל ער שיינט צו האבן אן אומגילטיגן פֿארמאט. 
ביטע אריינלייגן א גוט-פארמאטירטן אדרעס אדער ליידיגט אויס די פעלד.',
'accountcreated'             => 'די קאָנטע איז באַשאַפֿן',
'accountcreatedtext'         => 'די באניצער קאנטע פאר $1 איז באַשאַפֿן געווארן.',
'createaccount-title'        => 'קאנטע באשאפֿן אין {{SITENAME}}',
'createaccount-text'         => 'עמעצער האט באשאפֿן א קאנטע פֿאר אייער ע-פאסט אדרעס אין {{SITENAME}} ($4) מיטן נאמען "$2" און  פאסווארט "$3". איר דארפט אצינד איינלאגירן און ענדערן דאס פאסווארט.

איר קענט איגנארירן די מעלדונג, ווען די קאנטע איז באשאפֿן בטעות.',
'loginlanguagelabel'         => 'שפראך: $1',

# Password reset dialog
'resetpass'               => 'ווידערשטעלן קאנטע פאסווארט',
'resetpass_announce'      => 'איר האט אריינלאגירט מיט א פראוויזארישן קאד געשיקט דורכן ע-פאסט. צו פארענדיגן אריינלאגירן, ברויכט איר אנשטעלן א ניי פאסווארט דא:',
'resetpass_text'          => '<!-- לייגט צו טעקסט דא -->',
'resetpass_header'        => 'ווידערשטעלן פאסווארט',
'resetpass_submit'        => 'שטעלן פאסווארט און אריינלאגירן',
'resetpass_success'       => 'אייער פעסווארד איז געטוישט געווארן מיט סוקסעס! איצט טוט מען אייך אריינלאגירן…',
'resetpass_bad_temporary' => 'אומ-ריכטיגע צייט-ווייליגער פעסווארד. איר האט מעגליך שוין סוקסעפול געטוישט אייער פעסווארד אדער געבעטן א נייע צייטווייליגער פעסווארד.',
'resetpass_forbidden'     => 'פאסווערטער קענען נישט ווערן געטוישט אויף {{SITENAME}}',
'resetpass_missing'       => 'נישטא קיין פארעם דאטע.',

# Edit page toolbar
'bold_sample'     => 'טייפּט דאָ אַריין די טעקסט זאל זיין דיק',
'bold_tip'        => "דאס טוישט צו '''בּאָלד (דיק)''' די אויסגעוועלטע ווארט.",
'italic_sample'   => "דאס וועט מאכן ''שיף'' די אויסגעוועלט ווארט.",
'italic_tip'      => "דאס וועט מאכן ''שיף'' די אויסגעוועלט פאנט.",
'link_sample'     => 'שרײַבט דאָ אַרײַן די װערטער װאָס װעט זײַן אַ לינק צו {{SITENAME}} אַרטיקל אין דעם נושא',
'link_tip'        => "מאך דאס א '''לינק''' צו א וויקיפעדיע ארטיקל",
'extlink_sample'  => 'http://www.example.com לינק טיטל',
'extlink_tip'     => 'דערויסענדיגע לינק (געדענק http:// פרעפיקס)',
'headline_sample' => 'לייג דא אריין דעם טעקסט פונעם נייעם קעפּל',
'headline_tip'    => "אַ נײַער קעפּל, 2'טער שטאפל, אײַנצוטײלן דעם אַרטיקל",
'math_sample'     => 'לייגט אריין פארמל דא',
'math_tip'        => 'מאטעמאטישע פארמיולע (LaTeX)',
'nowiki_sample'   => 'אינסערט נישט-פארמארטירטע טעקסט דא',
'nowiki_tip'      => 'דאָס וועט איגנאָרירן די וויקי פֿאָרמאַטינג קאָוד',
'image_sample'    => 'ביישפיל.jpg',
'image_tip'       => 'לייג ארויף א בילד',
'media_sample'    => 'ביישפיל.ogg',
'media_tip'       => 'פארבינדונג צו א מעדיע טעקע',
'sig_tip'         => 'אייער אינטערשריפט, מיט א צייט סטעמפּל ווען איר האט אונטערגעשריבן.',
'hr_tip'          => 'א שטרייך אין די ברייט, (נישט נוצן אפט)',

# Edit pages
'summary'                   => 'קורץ וואָרט',
'subject'                   => 'טעמע/קעפל',
'minoredit'                 => 'דאס איז א מינערדיגע ענדערונג',
'watchthis'                 => 'טוט אױפֿפּאַסן דעם בלאט',
'savearticle'               => 'טוט אױפֿהיטן',
'preview'                   => 'פאראויסדיגע ווייזונג',
'showpreview'               => 'פֿאָרױסדיגע װײַזונג',
'showlivepreview'           => 'לעבעדיגע פאראויסדיגע ווייזונג',
'showdiff'                  => 'ווײַז די ענדערונגען',
'anoneditwarning'           => "'''ווארענונג:''' איר זענט נישט אריינלאגירט אין אייער קאנטע. אייער איי פי אדרעס וועט ווערן דאקומענטירט אין דעם בלאטס היסטאריע פון ענדערונגען. אויב זארגט איר זיך פאר פריוואטקייטן, ביטע טוט זיך אריינלאגירן.",
'missingsummary'            => "'''דערמאנונג:''' איר האט נישט אויסגעפילט דעם קורץ ווארט אויפקלערונג אויף אייער עדיט. אויב וועט איר דרוקן נאכאמאל אויף  \"היט אפ דעם בלאט\", וועט אייער ענדערונג ווערן געהיטן אן דעם.",
'missingcommenttext'        => 'ביטע שטעלט אריין א אנמערקונג פון אונטן.',
'missingcommentheader'      => "'''דערמאנונג:''' איר האט נישט אריינגעשטעלט א טעמע/קעפל פאר דעם אנמערקונג. אויב וועט איר דרוקן נאכאמאל אויפן \"היט-אפ בלאט\", וועט אייער ענדערונג ווערן אפגעהיטן אן דעם.",
'summary-preview'           => 'סך-הכל פאראויסדיגע ווייזונג',
'subject-preview'           => 'טעמע/קעפל פאראויסדיגע ווייזונג',
'blockedtitle'              => 'באנוצער איז בלאקירט',
'blockedtext'               => '<big>\'\'\'אייער באניצער נאמען אדער IP אדרעס איז געווארן בלאקירט.\'\'\'</big>

דעם בלאק האט $1 געמאכט פון וועגן \'\'$2\'\'.

* בלאקירן הייבט אן: $8
* בלאקירן גייט אויס: $6
* בלאק מכוון צו: $7

איר קענט זיך ווענדן צו $1 אדער צו אנדערע [[{{MediaWiki:Grouppage-sysop}}|אדמיניסטראטארן]] אדורכצורעדן דעם בלאק.

גיט אכט אז איר קענט נישט ניצן די "שיקט דעם באניצער א ע-פאסט" אייגנקייט אויב האט איר נישט איינגעשטעלט אין אייערע [[Special:Preferences|קונטע פרעפערענצן]] א גילטיקן בליצפאסט אדרעסדאס אדער איר זענט בלאקירט פון שיקן בליצפאסט.

אייער IP אדרעס איז $3, און דער בלאק האט נומער #$5. ביטע שיקט איינעם פון די צוויי (אדער זיי ביידע) ווען איר ווענדט זיך צו די אדמיניסטראטורן.',
'autoblockedtext'           => 'אײַער [[IP אדרעס|אײַ־פּי־אַדרעס]] איז בלאָקירט געװאָרן אױטאָמאַטיש, צוליב דעם װאָס אַן אַנדער באַניצער װאָס איז בלאָקירט געװאָרן דורך $1 האָט זיך געניצט דעם דאָזיקן אײַ־פּי. 
די אורזאַך פֿון דער בלאָקירונג איז: 

:\'\'\'$2\'\'\' 

* אנהייב פון דער בלאקירונג: $8
* ענדע פון דער בלאָקירונג: $6 
* וועמען בלאקירט: ִ$7

איר קענט זיך פֿאַרבינדן דורכן בליצבריװ מיט $1 אָדער מיט יעדן אַנדערן [[{{MediaWiki:Grouppage-sysop}}|סיסאָפּ]] צו דיסקוטירן װעגן דער בלאָקירונג. 

אױב האָט איר ניט אַרײַנגעקלאַפּט אײַער בליצפּאָסט־אַדרעס אין אײַערע [[Special:Preferences|פּרעפֿערענצן]] אדער איר זענט בלאקירט פון שיקן בליצפאסט, קענט איר זיך \'\'נישט\'\' ניצן די אפציע "שיקט דעם באניצער אן ע-פאסט". 

אייער יעצטיגער IP אדרעס איז $3,און דער בלאָקירונג־נומער איז #$5. 
ביטע צײכנט עס אָן בשעת איר װענדט זיך צו די סיסאָפּן.',
'blockednoreason'           => 'קיין טעם נישט געגעבן',
'blockedoriginalsource'     => "די טעקסט פון מקור פון '''$1''' ווערט געוויזן אונטן:",
'blockededitsource'         => "די טעקסט פון '''אייערע ענדערונגן''' צו '''$1''' ווערט געוויזן אונטן:",
'whitelistedittitle'        => '[[Special:UserLogin|אריינלאגירן פֿארלאנגט]] צו ענדערן',
'whitelistedittext'         => 'איר ברויכט צו $1 צו ענדערן בלעטער.',
'confirmedittitle'          => 'איר דארפט באשטעטיגן אייער בליצפאסט אדרעס כדי צו רעדאקטירן',
'confirmedittext'           => 'אויף אייך ליגט קודם די פליכט צו באשטעטיגן און אריינשטעלן אייער ריכטיגע אימעיל אדרעס באפארן ענדערן בלעטער. ביטע שרייבט און באשטעטיגט אייער אימעיל אדרעס דורך אייערע [[Special:Preferences|באנוצער פרעפערענצן]] .',
'nosuchsectiontitle'        => 'נישטא אזא אפטיילונג',
'nosuchsectiontext'         => 'איר האט פרובירט ענדערן א אפטיילונג וואס עקזעסטירט נישט. וויבאלד עס איז נישט פארהאן אן אפטיילונג וואס הייסט $1, איז נישטא קיין פלאץ ווי צו אפהיטן אייער ענדערונג.',
'loginreqtitle'             => 'אריינלאגירן פארלאנגט זיך',
'loginreqlink'              => 'לאגירט אריין',
'loginreqpagetext'          => 'איר מוזט $1 כדי צו זעהן אנדערע בלעטער.',
'accmailtitle'              => 'פאסווארט געשיקט',
'accmailtext'               => 'דאס פאַסווארט פאר "$1" איז געשיקט געוואָרן צו $2.',
'newarticle'                => '(ניי)',
'newarticletext'            => "'''דער בלאַט עקזיסטירט נאָך נישט!''' איר קענט יעצט שרײַבן אַ נײַעם אַרטיקל אין די אונטערשטע קעסטל. (זעהט דעם [[הילף:ווי צו שרייבן ווערטן|הילף בלאַט]] ווי אַזוי צו שרײַבן אַרטיקלען).",
'anontalkpagetext'          => "----'''דאס איז א רעדן בלאט פון א אן אנאנימען באַניצער וואס האט נאך נישט באַשאַפֿן קיין קאנטע, אדער באניצט זיך נישט דערמיט. דערוועגן, מוזן מיר זיך באניצן מיט זיין IP אדרעס כדי אים צו אידענטיפיצירן. עס קען זיין אז עטלעכע אנדערע ניצן אויך דעם  IP אדרעס. אויב זענט איר אן אנאנימער באַניצער וואס שפירט אז איר האט באקומען מעלדונגען וואס זענען נישט שייך צו אייך, ביטע [[Special:UserLogin/signup|באַשאַפֿט א קאנטע]] אדער [[Special:UserLogin|טוט זיך אריינלאגירן]] כדי צו פארמיידן דאס אין די עתיד זיך פארמישן מיט אנדערע אנאנימע באַניצערס.'''",
'noarticletext'             => 'עס איז דערווייל נישט פארהאן קיין שום טעקסט אין דעם בלאט, איר קענט [[Special:Search/{{PAGENAME}}|זוכן דעם בלאט טיטול]] אין אנדערע בלעטער אדער [{{fullurl:{{FULLPAGENAME}}|action=edit}} ענדערן דעם בלאט].',
'userpage-userdoesnotexist' => 'באניצער קאנטע "$1" איז נישט אײַנגעשריבן. קוקט איבער צי איר ווילט שאפֿן/רעדאקטירן דעם בלאט.',
'clearyourcache'            => "אכטונג:''' נאכן אויפֿהיטן, ברויכט איר אפשר נאך אריבערגיין דער בלעטערס קאש זיכרון (cache) צו זעהן די ענדערונגען

. '''Mozilla/Safari/Konqueror:''' האלט אראפ ''שיפט'' בשעתן דרוקן ''Reload'' (אדער דרוקט ''Ctrl-Shift-R''), '''IE:''' דרוקט ''Ctrl-F5'', '''Opera:''' דרוקט ''F5''.",
'usercssjsyoucanpreview'    => "<strong>טיפ:</strong> נוצט דעם 'ווייז פאראויסדיגע ווייזונג' באטאן צו אויספרובירן אייער  CSS/JS בעפאר אפהיטן.",
'usercsspreview'            => "'''געדענקט אז איר טוט בלויז פאראויס זען אייער באניצער CSS.'''
'''ער איז דערווייל נאכנישט אויפֿגעהיטן!'''",
'userjspreview'             => "'''געדענקט אז איר טוט בלויז טעסטן\\פאראויסזעהן אייער באנוצער JavaScript, עס איז דערווייל נאכנישט אפגעהיטן!'''",
'userinvalidcssjstitle'     => "'''ווארענונג:''' סאיז נישטא קיין סקין \"\$1\". גדענקט אז קאסטעם .css און .js בלעטער נוצען לאוער קעיס טיטול, e.g. {{ns:user}}:Foo/monobook.css ווי אנדערשט צו {{ns:user}}:Foo/Monobook.css.",
'updated'                   => '(דערהיינטיגט)',
'note'                      => '<strong>באמערקונג:</strong>',
'previewnote'               => '<strong>דאס איז נאָר אין אַ פֿאָרויסיקע ווייזונג, דער אַרטיקל איז דערווייל נאָך נישט געהיט!</strong>',
'previewconflict'           => 'די פאראויסדיגע ווייזונג רעפלעקטירט די טעקסט און די אויבערשטע טעקסט ענדערונג אפטיילונג וויאזוי דאס וועט אויסזעהן אויב וועט איר אויסוועילן צו דאס אפהיטן.',
'session_fail_preview'      => "'''אנטשולדיגט! מען האט נישט געקענט פראצעסירן אייער ענדערונג צוליב א פארלוסט פון סעסיע דאטע. ביטע פרובירט נאכאמאל. אויב ס'ארבעט נאך אלס ניט, פרובירט [[Special:UserLogout|ארויסלאגירן]] און זיך צוריק אריינלאגירן.",
'session_fail_preview_html' => "<strong>'''אַנטשולדיקט! מיר קענען נישט פּראָצעסירן אײַער ענדערונג צוליב א פֿאַרלוסט פֿון סעסיע דאַטע.'''</strong>

''װײַל די װיקי האט רױע HTML ערמעגליכט, דער פֿאָרױסיקער װײַזונג איז באַאַלטן אַלס אַ באַװאָרענונג אַנטקעגן JavaScript אַטאַקירונגען.''

<strong>אױב דאַס איז אַ כשרע רעדאַקציע פרוּװ, פּרובירט נאָכאַמאָל. אױב דאָס גײט נאָכאַלץ ניט, פּרובירט [[Special:UserLogout|ארױסלאָגירן]] און װידער אַרײַנלאָגירן. </strong>",
'editing'                   => 'ענדערן $1',
'editingsection'            => 'ענדערט $1 (אפטיילונג)',
'editingcomment'            => 'ענדערט $1 (הערה)',
'editconflict'              => 'ענדערן קאנפליקט: $1',
'explainconflict'           => "איינער אנדערשט האט געטוישט דעם בלאט זינט איר האט אנגעהויבן דאס צו ענדערן.
די אויבערשטער טעקסט אפטייל אנטהאלט די בלאט טעקסט ווי עס טוט איצט עקזעסטירן.
אייערע ענדערונגן איז געוויזן אין די אונטערשטע טעקסט אפטיילונג.
איר וועט דארפן צאמשטעלן אייערע ענדערונגן אינעם עקזעסטירנדן טעקסט.
'''בלויז'''' די טעקסט אינעם אויבערשטען טעקסט אפטיילונג וועט ווערן אפגעהיטן ווען ארי וועט קוועטשן \"היט-אפ בלאט\".",
'yourtext'                  => 'אייער טעקסט',
'storedversion'             => 'אוועגעלייגטע ווערסיע',
'nonunicodebrowser'         => '<strong>ווארענונג: אייער בראוזער איז נישט unicode compliant. א ארום-ארבייט איז אין פלאץ אייך צו ערלויבן צו מיט זיכערקייט ענדערן ארטיקלן: non-ASCII אויתיות וועלן ערשיינען אין די ענדערען קעסטל וויק hexadecimal קאודס.</strong>',
'editingold'                => '<strong>פאָרזיכטיג! באארבעטסט יעצט נישט קיין אקטועלע ווערסיע, אויב דו וועסט היטן דעם באארבעטונג, וועט די לעצטע ענדרענונגען גיין קאַפוט.</strong>',
'yourdiff'                  => 'אינטערשיידן',
'copyrightwarning'          => "<small>ביטע מערקט אויף אז אייערע אלע ביישטייערונגען אינעם '''{{SITENAME}}''' ערשיינען אונטער דעם $2 דערלויבן (מער פרטים זעה $1). אויב איר וויִלט נישט לאזן אנדערע ענדערן אייערע ביישטייערונגען און פארשפרייטן אייער ארבעט - ביטע שרייבט זיי נישט דא.<br />
איר זאגט צו אז איר האט געשריבן אן אייגענעם אינהאַלט, אדער האט איר באקומען ערלויבעניש זיי דא צו שרייבן.</small>",
'copyrightwarning2'         => "<div id=\"editing-warn\">'''אכטונג:''' אנדערע באניצערס קענען מעקן און ענדערן אייערע ביישטייערונגען צו{{grammar:תחילית|{{SITENAME}}}}. אויב ווילט איר נישט אייער ארבעט צו זיין הפקר פאר אנדערע דאס צו באארבעטן – פארשפרייט עס נישט דא. אזוי אויך, זאגט איר צו איז איר האט דאס געשריבן אליין'ס, אדער דאס איבערגעקאפיט פון א מקור מיט פולער רשות דאס מפקיר זיין (זעהט \$1 פאר מער פרטים). '''זיך נישט באנוצן מיט שטאף וואס איז באשיצט מיט קאפירעכטן!'''</div>",
'longpagewarning'           => '<strong>ווארענונג: דער בלאט איז לאנג $1 קילאבייטן; געוויסע בלעטערערס קענען מעגלעך האבן פראבלעמען צו רעדאקטירן בלעטער וואס גרייכן אדער זענען לענגער פֿון 32kb.
ביטע באטראכט איינטיילן דעם בלאט צו קלענערע אפטיילונגען.</strong>',
'longpageerror'             => '<strong>פעילער: די טעקסט וואס איר האט אריינגעשטעלט איז $1 קילאבייטס לאנג, וואס איז לענגער פון די מאקסימום פון $2 קילאבייטס. עס קען נישט ווערן אפגעהיטן.</strong>',
'readonlywarning'           => '<strong>ווארענונג: די דאטעבאזע איז געווארן בלאקירט פאר סייט אויפהאלטונג,
ממילא וועט איר נישט קענען אפהיטן אייערע ענדערונגן צו די איצטיגע צייט. איר זאלט האפן צו דאס קאט-ענד-פעיסט די טעקסט אריין צו א טעקסט פייל און דאס דארטן אפהיטן פאר שפעטער.</strong>',
'protectedpagewarning'      => '<strong>ווארענונג:  די בלאט איז געווארן פארשפארט אז בלויז באנוצער מיט סיסאפ פריוויליגיעס קענען איר ענדערן.</strong>',
'semiprotectedpagewarning'  => "'''באמערקונג:''' די בלאט איז פארשפארט אז בלויז רעגעסטרירטע באנוצער קענען איר ענדערן.",
'cascadeprotectedwarning'   => "'''ווארענונג:''' דער בלאט איז פארשפארט אז בלויז סיסאפן קענען אים ענדערן, וויבאלד ער איז איינגעשלאסן אין {{PLURAL:$1| דעם פאלגנדן בלאט, וואס איז|די פאלגנדע בלעטער, וואס זענען}} קאסקאד באשיצט:",
'titleprotectedwarning'     => '<strong>אזהרה: דער בלאט איז פֿארשלאסן טא קענען נאר געוויסע באניצערס שאפֿן אים.</strong>',
'templatesused'             => 'מוסטערן באנוצט אויף דעם בלאט:',
'templatesusedpreview'      => 'באַנוצטע מוסטערן אין דעם פֿאָראױסדיקע אױסקוק:',
'templatesusedsection'      => 'מוסטערן באנוצט אין דעם אפטיילונג:',
'template-protected'        => '(באשיצט)',
'template-semiprotected'    => '(טיילווייז באשיצט)',
'hiddencategories'          => 'דער דאזיגער בלאט געהערט צו {{PLURAL:$1|איין באהאלטענער קאטעגאריע|$1 באהאלטענע קאטעגאריעס}}:',
'edittools'                 => '<!-- טעקסט דא וועט געוויזן ווערן אונטער ענדערן און ארויפלאדירן פארעמס. -->',
'nocreatetitle'             => 'בלאט באשאפן באגרעניצט',
'nocreatetext'              => 'די סייט האט באגרעניצט די מעגליכקייט צו באשאפן נייע בלעטער.
איר קענט צוריקגיין און ענדערן די עקזיסטירנדע בלאט, אדער [[Special:UserLogin|לאגירט זיך אריין און באשאפט א קאנטע]].',
'permissionserrors'         => 'ערלויבענישן פעילערס',
'recreate-deleted-warn'     => "'''ווארענונג: איר שאפט א נייעם בלאט וואס איז שוין איינמאל געווארן אויסגעמעקט.'''

אנא שיקלו אם יהיה זה נכון להמשיך לערוך את הדף.
יומן המחיקות של הדף מוצג להלן:",

# "Undo" feature
'undo-success' => 'די ענדערונג קען ווערן מבוטל. ביטע נאכקוקן די פארגלייך פון אונטן צו זיין זיכער אז דאס איז וואס איר ווילט טאן, און דערנאך היט-אפ די ענדערונגן פון אונטן צו ענדיגן דאס בטל מאכן די ענדערונג.',
'undo-failure' => 'די ענדערונג קען נישט ווערן אומ-געטאן צוליב קאנפליקטינג אינטערמידיעט ענדערונגן.',
'undo-summary' => 'זיי מבטל רי-ווערסיע $1 פון [[Special:Contributions/$2|$2]] ([[User talk:$2|רעדן]])',

# Account creation failure
'cantcreateaccounttitle' => 'מען קען נישט באשאפֿן קאנטע',
'cantcreateaccount-text' => 'שאפֿן קאנטעס פון דעם IP אדרעס (<b>$1</b>) איז געווארן בלאקירט דורך [[User:$3|$3]]. די סיבה געגעבן פֿון $3 איז "$2".',

# History pages
'viewpagelogs'        => 'זעה לאגס פאר דעם בלאט',
'nohistory'           => 'נישטא קיין ענדערן היסטאריע פאר דעם בלאט.',
'revnotfound'         => 'די גירסה נישט געפינען',
'revnotfoundtext'     => 'די אלטע רעוויזיע איר האט געבעטן קען נישט געפינען ווערן.
ביטע טשעקט די URL וואס ברויכט אריינצוגיין אין דעם בלאט.',
'currentrev'          => 'איצטיגע ווערסיע',
'revisionasof'        => 'רעוויזיע ביי $1',
'revision-info'       => 'רעוויזיע ביי $1 פון $2',
'previousrevision'    => '→ עלטערער ווערסיע',
'nextrevision'        => 'נייע ווערסיע ←',
'currentrevisionlink' => 'איצטיגע ווערסיע',
'cur'                 => 'איצט',
'next'                => 'קומענדיגע',
'last'                => 'לעצטע',
'page_first'          => 'ערשט',
'page_last'           => 'לעצט',
'histlegend'          => 'פֿארגלייכן  אויסקלויב: צייכנט די קנעפלעך פֿון די ווערסיעס צו פֿארגלײַכן, און קלאפט  Enter אדער דאס קנעפל אונטן.<br />
מקרא: (איצט) = אונטערשייד פֿון לויפֿיגער ווערסיע, (לעצט) = אונטערשייד פֿון פֿריערדיגער ווערסיע, מ = מינערדיקע רעדאקטירונג',
'deletedrev'          => '[אויסגעמעקט]',
'histfirst'           => 'ערשטע',
'histlast'            => 'לעצטיגע',
'historysize'         => '({{PLURAL:$1|1 בייט|$1 בייטן}})',
'historyempty'        => '(ליידיג)',

# Revision feed
'history-feed-title'          => 'ווערסיע היסטאריע',
'history-feed-description'    => 'ווערסיע היסטאריע פאר די בלאט אויפן וויקי',
'history-feed-item-nocomment' => '$1 אין $2', # user at time
'history-feed-empty'          => 'דער געבעטענער בלאט עקזעסטירט נישט.
עס איז מעגליך אויסגעמעקט געווארן פון די וויקי, אדער די נאמען געטוישט.
פרובירט [[Special:Search|צו זיכן אין וויקי]] נאך רעלאווענטע נייע בלעטער.',

# Revision deletion
'rev-deleted-comment'         => '(אנמערקונג אראפגענומען)',
'rev-deleted-user'            => '(באנוצער נאמען אראפגענומען)',
'rev-deleted-event'           => '(לאגירן אקציע אראפגענומען)',
'rev-deleted-text-permission' => '<div class="mw-warning plainlinks">
די בלאט רעוויזיע איז געווארן אראפגענומען פון די פובליקע ארכיוון. עס איז מעגלעך דא נאך פרטים אין דעם
[{{fullurl:{{ns:special}}:Log/delete|page={{FULLPAGENAMEE}}}} אויסמעקונג לאג].
</div>',
'rev-deleted-text-view'       => '<div class="mw-warning plainlinks">
די בלאט רעוויזיע איז געווארן אראפגענומען פון די פובליק ארכיוון. אלס סיסאפ פון די סייט קענסטו עס ליינען; עס איז מעגליך דא נאך דעטאלן אין [{{fullurl:{{ns:special}}:Log/delete|page={{FULLPAGENAMEE}}}} אויסמעקונג לאג בוך].
</div>',
'rev-delundel'                => 'ווייז/באהאלט',
'revisiondelete'              => 'אויסמעקן\\צוריקשטעלן רעוויזיעס',
'revdelete-nooldid-title'     => 'ציל ווערסיע נישט גילטיג',
'revdelete-nooldid-text'      => 'איר האט נישט ספעציפירט קיין ציל ווערסיע דורצוכפירן די פונקציע.',
'revdelete-selected'          => '{{PLURAL:$2|אויסדערוויילטע ווערסיע| אויסדערוויילטע ווערסיעס}} פון [[:$1]]:',
'revdelete-legend'            => 'שטעלט ווייזונג באגרענעצונגען',
'revdelete-hide-text'         => 'באהאלט אינהאלט פון ווערסיע',
'revdelete-hide-name'         => 'באהאלט אקציע און ציל',
'revdelete-hide-comment'      => 'באהאלט ענדערן הערה',
'revdelete-hide-user'         => "באהאלט רעדאקטער'ס באנוצער-נאמען/איי.פי.",
'revdelete-hide-image'        => 'באהאלט טעקע אינהאלט',
'pagehist'                    => 'בלאט היסטאריע',
'revdelete-content'           => 'תוכן',
'revdelete-summary'           => 'רעדאקטירונג קיצור',
'revdelete-uname'             => 'באניצער נאמען',
'revdelete-restricted'        => 'באגרעניצונגען פאר סיסאפן',
'revdelete-unrestricted'      => 'אוועקגענומען באגרעניצונגען פאר סיסאפן',
'revdelete-hid'               => 'באהאלטן $1',
'revdelete-unhid'             => 'מבטל געווען באהאלטן $1',
'revdelete-log-message'       => '$1 פֿאר  {{PLURAL:$2|איין רעוויזיע|$2 רעוויזיעס}}',
'logdelete-log-message'       => '$1 פֿאר {{PLURAL:$2|איין פאסירונג|$2 פאסירונגען}}',

# Suppression log
'suppressionlog' => 'באהאלטונגען לאג',

# Diffs
'history-title'           => 'רעוויזיע היסטאריע פֿון $1',
'difference'              => '(אונטערשייד צווישן ווערסיעס)',
'lineno'                  => 'שורה $1:',
'compareselectedversions' => 'פארגלייך סעלעקטירטע ווערסיעס',
'editundo'                => 'טוה-אפ',
'diff-multi'              => '({{PLURAL:$1|איין מיטלסטע ווערסיע |$1 מיטלסטע ווערסיעס}}  נישט געוויזן.)',

# Search results
'searchresults'            => 'זוכן רעזולטאטן',
'searchresulttext'         => 'לערנען מער ווי צו זוכן אינעם {{SITENAME}} [[{{MediaWiki:Helppage}}|{{int:help}}]]',
'searchsubtitle'           => '[[:$1]]',
'searchsubtitleinvalid'    => '$1דו האסט געזוכט פאר',
'noexactmatch'             => 'דערווייל איז נאָך נישטאָ א בלאט מיט דעם טיטל.<br /> איר זײַט געלאדנט [[:$1|אויפשרייבן א נייעם בלאט]], אדער [[Project:בעטן ווערטן|בעטן פון פריינד]] זאלן זיי שרייבן.',
'noexactmatch-nocreate'    => 'נישטא קיין בלאט מיטן קעפל "$1".',
'notitlematches'           => 'קיין שום בלאט האט נישט א צוגעפאסט קעפל',
'prevn'                    => '$1 פריערדיגע',
'nextn'                    => '$1 קומענדיגע',
'viewprevnext'             => 'קוקט אויף ($1) ($2) ($3)',
'search-section'           => '(אפטיילונג $1)',
'search-suggest'           => 'צי האט איר געמיינט: $1',
'search-interwiki-caption' => 'שוועסטער פראיעקטן',
'search-interwiki-default' => '$1 רעזולטאטן:',
'searchall'                => 'אלץ',
'showingresultstotal'      => "ווײַזן {{PLURAL:$3| רעזולטאט '''$1''' פֿון '''$3'''| רעזולטאטן '''$1 - $2''' פֿון '''$3'''}}",
'powersearch'              => 'זוכן',
'powersearch-legend'       => 'ווײַטהאלטן זוכן',
'powersearch-ns'           => 'זוכן אין נאמענטיילן:',
'powersearch-redir'        => 'ווײַז ווײַטערפֿירונג בלעטער',
'powersearch-field'        => 'זוך',

# Preferences page
'preferences'           => 'פרעפערענצן',
'mypreferences'         => 'מיינע פרעפערענצן',
'prefs-edits'           => 'צאל פון ענדערונגן:',
'prefsnologin'          => 'נישט אריינלאגירט',
'prefsnologintext'      => 'איר דארפט זיין  <span class="plainlinks">[{{fullurl:Special:Userlogin|returnto=$1}} אריינלאגירט]</span> כדי צו ענדערן באניצער פרעפֿערענצן.',
'qbsettings-none'       => 'גארנישט',
'qbsettings-fixedleft'  => 'קבוע לינקס',
'qbsettings-fixedright' => 'קבוע רעכטס',
'changepassword'        => 'ענדערט פעסווארד',
'skin'                  => 'סקין',
'math'                  => 'פאָרמאַל',
'dateformat'            => 'דאטום פארמאט',
'datedefault'           => 'נישטא קיין פרעפערענץ',
'datetime'              => 'דאטום און צייט',
'math_unknown_error'    => 'אומבאקאנטער פעילער',
'math_unknown_function' => 'אומבאקאנטער פונקציע',
'math_syntax_error'     => 'סינטאקס גרייז',
'prefs-personal'        => 'באַנוצער פראָפֿיל',
'prefs-rc'              => 'לעצטע ענדערונגען',
'prefs-watchlist'       => 'אויפפאסונג ליסטע',
'prefs-watchlist-days'  => 'טעג צו ווייזן אין דער אויפפאסונג ליסטע:',
'prefs-misc'            => 'באַאַרבעטן',
'saveprefs'             => 'אפהיטן',
'resetprefs'            => 'אוועקנעמען נישט-אויפגעהיטענע ענדערונגען',
'oldpassword'           => 'אַלטע פעסווארד:',
'newpassword'           => 'ניי פּאסוואָרט:',
'retypenew'             => 'ווידער שרײַבן פעסווארד:',
'textboxsize'           => 'באַאַרבעטן',
'rows'                  => 'שורות:',
'columns'               => 'קאלומס:',
'searchresultshead'     => 'זוכן',
'contextlines'          => 'שורות פער רעזולטאט',
'contextchars'          => 'קאנטעקסט פער שורה',
'recentchangesdays'     => 'צאל פון טעג צו ווייזן אין די לעצטע ענדערונגן:',
'recentchangescount'    => 'דער צאָל פון ליניעס אין די לעצטע ענדערונגען:',
'savedprefs'            => 'אייערע פרעפערענצן איז אפגעהיטן געווארן.',
'timezonelegend'        => 'צייט זאונע',
'localtime'             => 'לאקאלער צייט',
'allowemail'            => 'ערלויבן אנדערע צו אײַך שיקן אימעילס',
'prefs-namespaces'      => 'נאמענטיילן',
'defaultns'             => 'זוך אין דעם נעימספעיס ביי דיפאלט:',
'default'               => 'דיפאלט',
'files'                 => 'פיילס',

# User rights
'userrights-user-editname'    => 'לייגט אריין א באנוצער-נאמען:',
'editusergroup'               => 'עדיט באנוצער גרופעס',
'editinguser'                 => "ענדערן באניצער רעכטן פון באניצער user '''[[User:$1|$1]]''' ([[User talk:$1|{{int:talkpagelinktext}}]] | [[Special:Contributions/$1|{{int:contribslink}}]])",
'userrights-groupsmember'     => 'מיטגליד פון:',
'userrights-reason'           => 'סיבה פארן ענדערונג:',
'userrights-changeable-col'   => 'גרופעס איר קענט ענדערן',
'userrights-unchangeable-col' => 'גרופעס איר קענט נישט ענדערן',

# Groups
'group'            => 'גרופע:',
'group-user'       => 'באניצערס',
'group-bot'        => 'באטס',
'group-sysop'      => 'סיסאפס',
'group-bureaucrat' => 'ביוראקראטן',
'group-all'        => '(אלע)',

'group-user-member'       => 'באניצער',
'group-bot-member'        => 'באט',
'group-sysop-member'      => 'סיסאפ',
'group-bureaucrat-member' => 'ביוראקראט',

'grouppage-user'       => '{{ns:project}}:אײַנגעשריבענער באניצער',
'grouppage-bot'        => '{{ns:project}}:באטס',
'grouppage-sysop'      => '{{ns:project}}:אדמיניסטראטורן',
'grouppage-bureaucrat' => '{{ns:project}}:ביראקראט',

# Rights
'right-read'          => 'ליינען בלעטער',
'right-edit'          => 'רעדאקטירן בלעטער',
'right-minoredit'     => 'צייכן רעדאקטירונגען אלס  מינערדיק',
'right-move'          => 'באוועג בלעטער',
'right-upload'        => 'ארויפלאדן טעקעס',
'right-reupload'      => 'איבערשרײַבן עקסיסטירנדע טעקע',
'right-autoconfirmed' => 'רעדאקטירן האלב-געשיצטע בלעטער',
'right-delete'        => 'מעקן בלעטער',

# User rights log
'rightslog'      => 'באַניצער רעכטן לאג',
'rightslogentry' => 'געביטן די מיטגלידערשאַפֿט פֿאַר $1 פֿון $2 אויף $3',
'rightsnone'     => '(גארנישט)',

# Recent changes
'nchanges'                          => '{{PLURAL:$1|ענדערונג|$1 ענדערונגען}}',
'recentchanges'                     => 'לעצטע ענדערונגען',
'rcnote'                            => "אונטן {{PLURAL:$1|איז '''1''' ענדערונג|זײַנען די לעצטע '''$1''' ענדערונגען}} אין {{PLURAL:$2|דעם לעצטן טאג|די לעצטע $2 טעג}}, ביז $5, $4.",
'rcnotefrom'                        => "פֿאלגנד זענען די ענדערונגען זײַט '''$2''' (ביז '''$1''')",
'rclistfrom'                        => 'װײַז נײַע ענדערונגען זינט $1',
'rcshowhideminor'                   => '$1 מינערדיגע ענדערונגען',
'rcshowhidebots'                    => '$1 באטס',
'rcshowhideliu'                     => '$1 אײַנגעשריבינע באַנוצערס',
'rcshowhideanons'                   => '$1 אַנאָנימע באַנוצערס',
'rcshowhidepatr'                    => '$1 פאַטראליטע ענדערונגען',
'rcshowhidemine'                    => '$1 מײַנע רעדאַקטירוננגען',
'rclinks'                           => 'װײַזן די לעצטע $1 ענדערונגען אין די לעצטע $2 טעג.<br />$3',
'diff'                              => 'אונטערשייד',
'hist'                              => 'היסטאריע',
'hide'                              => 'באַהאַלטן',
'show'                              => 'ווייז',
'minoreditletter'                   => 'מ',
'newpageletter'                     => 'נ',
'boteditletter'                     => 'ב',
'number_of_watching_users_pageview' => '[{{PLURAL:$1|איין באַניצער פאַסט|$1 באַניצערס פאַסן}} אויף]',
'newsectionsummary'                 => '/* $1 */ נייע אפטיילונג',

# Recent changes linked
'recentchangeslinked'          => 'פֿאַרבונדענע ענדערונגען',
'recentchangeslinked-title'    => 'ענדערונגען פֿארבונדן מיט $1',
'recentchangeslinked-noresult' => 'נישט געווען קיין ענדערונגען אין פֿארבונדענע בלעטער אין דער תקופה.',
'recentchangeslinked-summary'  => "אט א רשימה פון נייע ענדערונגען צו בלעטער פארבונדן פון א ספעציפישן בלאט (אדער מיטגליד בלעטער פון א ספעציפישער קאטעגאריע).
בלעטער אויף [[Special:Watchlist|אייער אויפפאסונג ליסטע]] זענען געוויזן '''דיק'''.",
'recentchangeslinked-page'     => 'בלאט נאמען:',

# Upload
'upload'          => 'בילדער/טעקעס אַרױפֿלאָדירן',
'uploadbtn'       => 'אַרױפֿלאָדן טעקע',
'uploadnologin'   => 'נישט אריינלאגירט',
'uploaderror'     => 'ארויפלאדירן פעילער',
'uploadlog'       => 'ארויפלאָדירען לאָגבוך',
'uploadlogpage'   => 'ארויפֿלאדן לאג',
'badfilename'     => 'פייל נאמען איז געטוישט צו "$1".',
'emptyfile'       => 'די פייל וואס איר האט ארויפלאדירט איז ליידיג. עס קען זיין אז דער סיבה איז פשוט א טייפא. ביטע מאכט זיכער אז דאס איז די פייל וואס איר ווילט ארויפלאדירן.',
'savefile'        => 'טעקע אױפֿהיטן',
'uploadedimage'   => 'אַרױפֿלאָדירט "[[$1]]"',
'destfilename'    => 'ציל טעקע נאמען:',
'watchthisupload' => 'פאס אויף דעם בלאט',

# Special:ImageList
'imgfile'        => 'טעקע',
'imagelist'      => 'טעקע ליסטע',
'imagelist_name' => 'נאמען',

# Image description page
'filehist'                  => 'היסטאריע פֿון דער טעקע',
'filehist-help'             => 'קליקט אויף א דאטע/צײַט צו זען דאס בילד אזוי ווי עס איז דעמאלסט געווען',
'filehist-deleteall'        => 'אויסמעקן אלץ',
'filehist-deleteone'        => 'אויסמעקן',
'filehist-revert'           => 'צוריקגיין',
'filehist-current'          => 'לויפיק',
'filehist-datetime'         => 'דאטע/צײַט',
'filehist-user'             => 'באניצער',
'filehist-dimensions'       => 'געמעסטן',
'filehist-filesize'         => 'טעקע גרייס',
'filehist-comment'          => 'באמערקונג',
'imagelinks'                => 'פֿארבינדונגען',
'linkstoimage'              => '{{PLURAL:$1|דער פאלגנדער בלאט ניצט|די פאלגנדע בלעטער ניצן}} דאס דאזיגע בילד:',
'nolinkstoimage'            => 'נישטא קיין בלעטער וואס ניצן דאס דאזיגע בילד.',
'sharedupload'              => 'די טעקע איז א בשותפותדיקע טעקע און מען מעג זי ניצן אין אנדערע פראיעקטן.',
'shareduploadwiki'          => 'זעט דעם $1 פֿאר מער אינפֿארמאציע.',
'shareduploadwiki-desc'     => 'די באשרייבונג אין איר $1  ווערט געוויזן אונטן..',
'shareduploadwiki-linktext' => 'טעקע באשרייבונג בלאט',
'noimage'                   => "ס'איז נישטא א טעקע מיט דעם נאמען, איר קענט אבער $1.",
'noimage-linktext'          => 'ארויפלאדן א טעקע',
'uploadnewversion-linktext' => 'ארויפֿלאדן א נײַע ווערסיע פֿוו דער טעקע',

# File reversion
'filerevert-comment' => 'הערה:',

# File deletion
'filedelete'         => 'מעק אויס $1',
'filedelete-legend'  => 'מעק אויס טעקע',
'filedelete-comment' => "פארוואס מ'האט געמעקט:",
'filedelete-submit'  => 'מעק אויס',

# MIME search
'download' => 'אראפלאדירן',

# List redirects
'listredirects' => 'ליסטע פון ווײַטערפֿירונגען',

# Unused templates
'unusedtemplates'     => 'נישט באניצטע מוסטערן',
'unusedtemplatestext' => 'דער בלאט ווײַזט אלע בלעטער אינעם מוסטערן נאמענטייל וואס זענען נישט אײַנגעשלאסן אין אן אנדער בלאט. געדענקט צו באקוקן אנדערע בלעטער פאר לינקען צו די מוסטערן איידער איר מעקט זיי אויס.',

# Random page
'randompage' => 'צופֿעליגער אַרטיקל',

# Statistics
'statistics'    => 'סטאַטיסטיק',
'sitestatstext' => "עס {{PLURAL:\$1|איז פאראן איין בלאט|זענען פאראן אינגאנצן '''\$1''' בלעטער}} אין דער דאטאבאזע.
דאס שליסט איין \"רעדן\" בלעטער, בלעטער וועגן {{SITENAME}}, שטומף בלעטער, ווייטערפירן בלעטער און אנדערע  בלעטער אָן  אינהאלט. אחוץ דעם, עס {{PLURAL:\$2|איז פאראן '''איין''' בלאט וואס האט מסתמא|זענען פאראן '''\$2''' בלעטער וואס האבן מסתמא}} עכטן אינהאלט.

'''\$8''' {{PLURAL:\$8| טעקע איז | טעקעס זענען}} געווארן אויפגעלאדן.

עס זענען געווען סה\"כ '''\$3''' {{PLURAL:\$3|בלאט קוק|בלאט קוקן}}, און  '''\$4''' {{PLURAL:\$4|בלאט באארבעטונגען| בלאט באארבעטונג}} זייט  {{SITENAME}} איז געווארן אויפגעשטעלט.
דאס באטרעפט דורכשניטלעך  '''\$5''' באארבעטונגען א בלאט, און  '''\$6''' קוקן א  באארבעטונג.

די [http://www.mediawiki.org/wiki/Manual:Job_queue ארבעט ריי] האט א לענג פון '''\$7'''.",

'disambiguations'      => 'באדייטן בלעטער',
'disambiguationspage'  => 'Template:באדייטן',
'disambiguations-text' => "די קומענדיגע בלעטער פארבינדען צו א '''באדייטן בלאט'''. זיי ברויכן ווען צו פארבינדן צו דער רעלאווענטער טעמע בלאט אנשטאט.<br />א בלאט ווערט פאררעכענט אלס א באדײַטן בלאט אויב ער באניצט זיך מיטן מוסטער וואס איז פארבינדען פון [[MediaWiki:Disambiguationspage]].",

'doubleredirects'     => 'געטאפלטע ווײַטערפֿירונגען',
'doubleredirectstext' => 'יעדע שורה אנטהאלט א לינק צום ערשטן און צווייטען רידיירעקט, ווי אויך די ערשטע טעקסט שורה פון די צווייטע רידיירעקט, וואס רוב מאל געפינט זיך די ריכטיגע ציל פונעם רידיירעקט, וואס צו איר וויל די ערשטע רידיירעקט ווייזן.',

'brokenredirects'        => 'צעבראָכענע ווײַטערפֿירונגען',
'brokenredirectstext'    => 'די פאלגענדע רידיירעקטס לינקן צו בלעטער וואס עקזיסטירן נאך נישט:',
'brokenredirects-edit'   => '(ענדערן)',
'brokenredirects-delete' => '(אויסמעקן)',

'withoutinterwiki'        => 'בלעטער אן שפראך פֿארבינדונגען',
'withoutinterwiki-submit' => 'ווײַז',

'fewestrevisions' => 'בלעטער מיט די מינדערסטע רעוויזיעס',

# Miscellaneous special pages
'nbytes'                  => '$1 {{PLURAL:$1|בייט|בייטן}}',
'nlinks'                  => '$1 {{PLURAL:$1|לינק|לינקען}}',
'nmembers'                => '$1 {{PLURAL:$1|בלאט|בלעטער}}',
'nrevisions'              => '{{PLURAL:$1|איין רעוויזיע|$1 רעוויזיעס}}',
'nviews'                  => '{{PLURAL:$1|איין קוק|$1 קוקן}}',
'specialpage-empty'       => 'דער בלאט איז ליידיג.',
'lonelypages'             => "פֿאר'יתומ'טע בלעטער",
'uncategorizedpages'      => 'בלעטער אָן קאטעגאריעס',
'uncategorizedcategories' => 'קאטעגאריעס וואס זענען נישט קאטעגאריזירט',
'uncategorizedimages'     => 'אומקאטעגאריזירטע טעקעס',
'uncategorizedtemplates'  => 'אומקאטעגאריזירטע מוסטערן',
'unusedcategories'        => 'נישט געניצטע קאטעגאריעס',
'unusedimages'            => 'נישט געניצטע טעקעס',
'popularpages'            => 'פאפולערע בלעטער',
'wantedcategories'        => 'געזוכטע קאטעגאריעס',
'wantedpages'             => 'געוואונשטע זײטן',
'missingfiles'            => 'פֿעלנדיקע טעקעס',
'mostlinked'              => 'מערסט פֿארבינדענע בלעטער',
'mostlinkedcategories'    => 'מערסט פֿארבינדענע קאטעגאריעס',
'mostlinkedtemplates'     => 'מערסט פֿארבינדענע מוסטערן',
'mostcategories'          => 'אַרטיקלען מיט די מערקסטע קאַטעגאָריעס',
'mostimages'              => 'מערסט פֿארבונדענע טעקעס',
'mostrevisions'           => 'אַרטיקלען מיט די מערסטע באַאַרבעטונגען',
'prefixindex'             => 'פרעפֿיקס אינדעקס',
'shortpages'              => 'קורצע בלעטער',
'longpages'               => 'לאנגע בלעטער',
'deadendpages'            => 'דעד-ענד בלעטער',
'deadendpagestext'        => 'די פאלגנדע בלעטער לינקען נישט צו קיין אנדערע בלעטער אין דער וויקי.',
'protectedpages'          => 'געשיצטע בלעטער',
'listusers'               => 'ליסטע פון באניצערס',
'newpages'                => 'נייע בלעטער',
'newpages-username'       => 'באניצער נאמען:',
'ancientpages'            => 'עלטסטע בלעטער',
'move'                    => 'באַװעגן',
'movethispage'            => 'באוועג דעם בלאט',
'unusedcategoriestext'    => 'די פֿאלגנדע קאטעגאריעס עקסיסטירן, אבער קיין בלאט ניצט זיי נישט.',
'pager-newer-n'           => '{{PLURAL:$1|ניײַערע|$1 ניײַערע}}',
'pager-older-n'           => '{{PLURAL:$1|עלטערע|$1 עלטערע}}',

# Book sources
'booksources'               => 'דרויסנדיגע ליטעראַטור ISBN',
'booksources-search-legend' => 'זוכט פאר דערויסענדע ביכער מקורות',
'booksources-go'            => 'גייט',
'booksources-text'          => 'אונטן איז א ליסטע פון סייטס וואס פֿארקויפֿן נייע און גענוצטע ביכער און האבן אויך נאך אינפֿארמאציע וועגן די ביכער וואס איר זוכט:',

# Special:Log
'specialloguserlabel'  => 'באַניצער:',
'speciallogtitlelabel' => 'קעפל:',
'log'                  => 'לאג-ביכער',
'all-logs-page'        => 'אלע לאג-ביכער',
'log-search-legend'    => 'זוך לאג ביכער',
'log-search-submit'    => 'ווײַז',
'alllogstext'          => 'קאמבאנירטע אויסלייג פון אלע לאגס פון{{grammar:תחילית|{{SITENAME}}}}.
מען קען פארשמעלרן די אויסוואל דורך אויסוועלן די סארט לאג, באנוצער נאמען אדער אפעקטירטע בלעטער.',

# Special:AllPages
'allpages'          => 'אלע בלעטער',
'alphaindexline'    => '$1 ביז $2',
'nextpage'          => 'קומענדיגער בלאט ($1)',
'prevpage'          => 'פֿריערדיגער בלאט ($1)',
'allpagesfrom'      => 'ווייזן בלעטער אנגעהויבן פון:',
'allarticles'       => 'אלע ארטיקלען',
'allinnamespace'    => 'אלע בלעטער ($1 נאָמענטייל )',
'allnotinnamespace' => 'אלע בלעטער (נישט אין נאמענטייל  $1)',
'allpagesprev'      => 'פריערדיגע',
'allpagesnext'      => 'נעקסט',
'allpagessubmit'    => 'גיי',
'allpagesprefix'    => 'בלעטער וואס זייער נאמען הייבט זיך אן מיט…:',
'allpagesbadtitle'  => 'דער אײַנגעגעבענער נאָמען איז אומגילטיק: לײדיק, אַנטהאַלט אינטערװיקי. עס איז מעגליך אז ער אנטהאלט אותיות וואס מען קען נישט ניצן אין קעפלעך.',
'allpages-bad-ns'   => '{{SITENAME}} האט נישט קיין נאָמענטייל "$1".',

# Special:Categories
'categories'         => 'קאַטעגאָריעס',
'categoriespagetext' => 'די פאלגענדע קאַטעגאָריעס אנטהאלטן בלעטער אדער מעדיע.',
'categoriesfrom'     => 'ווײַזן קאטעגאריעס אנהייבנדיג פֿון:',

# Special:ListUsers
'listusers-submit'   => 'ווײַז',
'listusers-noresult' => 'קיין באניצער נישט געטראפֿן.',

# Special:ListGroupRights
'listgrouprights'          => 'באַניצער גרופע רעכטן',
'listgrouprights-group'    => 'גרופע',
'listgrouprights-rights'   => 'רעכטן',
'listgrouprights-helppage' => 'Help: גרופע רעכטן',
'listgrouprights-members'  => '(רשימה פֿון מיטגלידער)',

# E-mail user
'emailuser'       => 'אי-מעיל דעם באנוצער',
'emailpage'       => "אי-מעיל'ט באנוצער.",
'emailpagetext'   => 'אויב דער באניצער האט אריינגעלייגט א גוטן ע-פאסט אדרעס אין זיינע באניצער פרעפערענצן, וועט דער פארעם פון דא אונטן אים שיקן איין בריוו. דער ע-פאסט אדרעס וואס איר האט אריינגעלייגט אין [[Special:Preferences| אייערע באניצער פרעפערנעצן]] וועט זיך ווייזן כאילו דאס איז געקומען פון דארטן, בכדי צו דערמעגלעכן א תשובה .',
'defemailsubject' => 'אימעיל {{SITENAME}}',
'noemailtitle'    => 'נישטא קיין אי-מעיל אדרעס',
'noemailtext'     => 'דער באניצער האט נישט באשטימט קיין ע-פאסט אדרעס, אדער וויל נישט באקומען קיין ע-פאסט פון אנדערע באניצערס.',
'emailfrom'       => 'פון',
'emailto'         => 'צו',
'emailsubject'    => 'טעמע',
'emailmessage'    => 'מעסעדזש',
'emailsend'       => 'שיק',
'emailccme'       => 'אימעיל מיר א קאפי פון מיין מעסעדזש.',
'emailccsubject'  => 'קאפי פון דיין מעסעדזש צו $1: $2',
'emailsent'       => 'א-מעיל געשיקט',
'emailsenttext'   => 'דיין אי-מעיל מעסעדזש איז געשיקט געווארן.',

# Watchlist
'watchlist'            => 'מיין אויפפַּאסונג ליסטע',
'mywatchlist'          => 'מיין אויפפַּאסונג ליסטע',
'watchlistfor'         => "(פאר '''$1''')",
'nowatchlist'          => 'איר האט נישט קיין שום בלעטער אין אייער אויפפַּאסונג ליסטע.',
'watchlistanontext'    => 'ביטע $1 כדי צו זעהן אדער ענדערן בלעטער פון אייער אויפפַּאסונג ליסטע.',
'watchnologin'         => 'איר זענט נישט אריינגעסיינט',
'watchnologintext'     => 'איר מוזט זיין אריינגעסיינט [[Special:UserLogin|אריינגעסיינט]] צו מאדיפיצירן אייער אויפפַּאסונג ליסטע.',
'addedwatch'           => 'דער בלאט איז צוגעלייגט געוואָרן צו דער אויפֿפַּאסונג ליסטע',
'addedwatchtext'       => "דער בלאט \"[[:\$1]]\" איז צוגעלײגט געוואָרן צו אײַער[[Special:Watchlist|אויפפַּאסונג ליסטע]].

ענדערונגען צו דעם בלאט און צו זײַן פארבינדענעם רעדן בלאט וועלן זײַן אויסגערעכענט דא.
און דער בלאט וועט זיין '''דיק''' [[Special:RecentChanges|ליסטע פון לעצטע ענדערונגען]] צו גרינגער מאכן דאס ארויסנעמען.",
'removedwatch'         => 'אַראָפּגענומען געווארן פון דער אויפפַּאסונג ליסטע',
'removedwatchtext'     => 'דער אַרטיקל "[[:$1]]" איז אָפּגעראַמעט געוואָרן פון אייער אױפֿפּאַסונג ליסטע',
'watch'                => 'אױפֿפּאַסן',
'watchthispage'        => 'טוט אױפֿפּאַסן דעם בלאט',
'unwatch'              => 'אויפֿהערן אויפֿפּאַסן',
'unwatchthispage'      => 'ענדיג אויפפאסן',
'notanarticle'         => 'דאס איז נישט קיין אינהאלט בלאט',
'notvisiblerev'        => 'די באארבעטונג איז געווארן אויסגעמעקט',
'watchlist-details'    => '{{PLURAL:$1|איין בלאט|$1 בלעטער}} אין אייער אויפֿפאסן ליסטע (נישט רעכענען  רעדן בלעטער).',
'wlheader-enotif'      => '* אי-מעיל נאטיפיקאציע ערמעגליכט.',
'watchlistcontains'    => 'אייער אויפֿפאסונג ליסטע אנטהאלט {{PLURAL:$1|איין בלאט|$1 בלעטער}}.',
'wlshowlast'           => "(ווײַזן די לעצטע $1 שעה'ן | $2 טעג | $3)",
'watchlist-hide-bots'  => 'באהאלטן באטן',
'watchlist-show-own'   => 'צייג מיינע ענדערונגן',
'watchlist-hide-own'   => 'באהאלטן מיינע רעדאקטירונגען',
'watchlist-show-minor' => 'צייג מינדעריגע ענדערונגן',
'watchlist-hide-minor' => 'באהאלטן מינעריגע ענדערונגען',

# Displayed when you click the "watch" button and it is in the process of watching
'watching'   => 'אויפפאסענדונג…',
'unwatching' => 'נעמט אראפ פון אויפפאסונג ליסטע…',

'enotif_mailer'                => 'נאטיפאקאציע שיקער {{SITENAME}}',
'enotif_reset'                 => 'באצייכן אלע בלעטער שוין געזעהן',
'enotif_newpagetext'           => 'דאס איז א נייער בלאט.',
'enotif_impersonal_salutation' => 'באנוצער {{SITENAME}}',
'changed'                      => 'געטוישט',
'created'                      => 'באשאפן',
'enotif_subject'               => 'דער בלאט $PAGETITLE אין {{grammar:תחילית|{{SITENAME}}}} $CHANGEDORCREATED דורך $PAGEEDITOR',
'enotif_lastvisited'           => 'זעה $1 פאר אלע ענדערונגען זינט אייער לעצטער וויזיט.',
'enotif_lastdiff'              => 'זעה $1 פאר די ענדערונג.',
'enotif_anon_editor'           => 'אנאנינאמע באנוצער $1',
'enotif_body'                  => 'לכבוד $WATCHINGUSERNAME,

די {{SITENAME}} בלאט $PAGETITLE איז געווארן $CHANGEDORCREATED אין $PAGEEDITDATE דורך $PAGEEDITOR, זעהט $PAGETITLE_URL פאר די איצטיגע ווערסיע.

$NEWPAGE

ענדערערס קורץ ווארט: $PAGESUMMARY $PAGEMINOREDIT

פארבידט זיך צום דעם שרייבער:
אי-מעיל: $PAGEEDITOR_EMAIL
וויקי: $PAGEEDITOR_WIKI

עס וועט מער נישט זיין קיין מעלדונגען אין פאל פון נאך ענדערונגען נאר אויב איר וועט באזוכן דעם בלאט איר קענט אויך איבערסעטן די מעלדונגען פאנען פון אלע אייערע אויפפאסונג בלעטער אין אייער אויפפאסונג ליסטער.
             אייער פריינטליכער  {{SITENAME}} מעלדונגען סיסטעם

--
צו ענדערן אייעע אויפפאסונג ליסטע, באזוכט
{{fullurl:{{ns:special}}:Watchlist/edit}}

פידבעק און מער הילף:
{{fullurl:{{MediaWiki:Helppage}}}}',

# Delete/protect/revert
'deletepage'                  => 'מעק אויס בלאט',
'confirm'                     => 'באשטעטיג',
'excontent'                   => 'אינהאלט געווען: "$1"',
'excontentauthor'             => "אינהאלט געווען: '$1' (און דער איינציגסטער בארבייטער איז געווען '[[Special:Contributions/$2|$2]]')",
'exbeforeblank'               => 'אינהאלט בעפארן אויסליידיגען איז געווען: "$1"',
'exblank'                     => 'בלאט איז געווען ליידיג',
'delete-confirm'              => 'אויסמעקן $1',
'delete-legend'               => 'אויסמעקן',
'historywarning'              => 'אכטונג – איר גייט אויסמעקן א בלאט מיט א היסטאריע פֿון פֿריערדיגע ווערסיעס:',
'confirmdeletetext'           => 'איר גייט איצט אויסמעקן א בלאט אדער א בילד, צוזאמן מיט איר גאנצע היסטאריע, פון די דאטעבאזע.

ביטע באשטעטיגט אז דאס איז טאקע אייער כוונה, אז איר פארשטייט פולערהייט די קאנסקווענסן פון אזא הארבע אקט, און אז דאס איז אין איינקלאנג מיטן פאליסי פון דעם סייט.',
'actioncomplete'              => 'די אַקציע אָט זיך דורכגעפֿירט',
'deletedtext'                 => '"<nowiki>$1</nowiki>" אויסגעמעקט. זעה $2 פאר רעקארד פון לעצטיגע אויסמעקונגען.',
'deletedarticle'              => 'אויסגעמעקט "[[$1]]"',
'dellogpage'                  => 'אויסמעקונג לאג',
'dellogpagetext'              => 'ווייטער איז א ליסטע פון די מערסט לעצטיגע אויסמעקונגען.',
'deletionlog'                 => 'אויסמעקונג לאג',
'deletecomment'               => 'סיבה פארן אויסמעקן:',
'deleteotherreason'           => 'אנדער/נאך או אורזאך:',
'deletereasonotherlist'       => 'אנדער אורזאך',
'deletereason-dropdown'       => '* געוויינטלעכע אויסמעקן אורזאכן
** פֿארלאנג פֿון שרייבער
** קאפירעכט ברעכונג
** וואנדאליזם',
'rollback_short'              => 'אויפֿריכטן',
'rollbacklink'                => 'צוריקדרייען',
'cantrollback'                => 'מען קען נישט צוריקדרייען די ענדערונג – די לעצטער באטייליגער איז דער איינציגסטער באטייליגונג; פארט, קען מען אויסמעקן דעם בלאט.',
'alreadyrolled'               => 'מען קעגן נישט צוריקדריין די לעצטע ענדערונג פון בלאט [[:$1]] דורך
[[User:$2|$2]] ([[User talk:$2|רעדן]]| [[Special:Contributions/$2|{{int:contribslink}}]]); 
אן אנדערער האט שוין געענדערט אדער צוריקגעדרייט דעם בלאט.

די לעצטע ענדערונג איז געווען פון [[User:$3|$3]] ([[User talk:$3|רעדן]]|[[Special:Contributions/$3|{{int:contribslink}}]]).',
'editcomment'                 => "קורץ ווארט איז געווען: \"'''\$1'''\".", # only shown if there is an edit comment
'revertpage'                  => 'אויפֿגעריכט פון באַנוצער $2 צוריק צום לעצטע ווערסיע פון באַנוצער $1', # Additional available: $3: revid of the revision reverted to, $4: timestamp of the revision reverted to, $5: revid of the revision reverted from, $6: timestamp of the revision reverted from
'protectlogpage'              => 'שיצן לאָג',
'protectcomment'              => 'הערה:',
'protectexpiry'               => 'גייט אויס:',
'protect_expiry_invalid'      => 'אויסגיין צײַט אומגילטיג.',
'protect_expiry_old'          => 'שוין דערנאך דער אויסגיין צײַט.',
'protect-unchain'             => 'אויפֿשליסן באוועגונג הרשאות',
'protect-text'                => 'איר מעגט זען און ענדערן דעם שוץ ניווא דא פֿארן בלאט <strong><nowiki>$1</nowiki></strong>.',
'protect-locked-blocked'      => 'איר קען נישט ענדערן דעם שוץ ניווא בעת ווען איר זענט בלאקירט.
פֿאלגנד זענען די לויפֿיגע שטעלונגען פֿארן בלאט <strong>$1</strong>:',
'protect-level-autoconfirmed' => 'בלאקירן נישט איינגעשריבענע באַניצערס',
'protect-level-sysop'         => 'נאר סיסאפן',
'protect-expiring'            => 'גייט אויס $1 (UTC)',
'protect-cascade'             => 'שיץ בלעטער איינגעשלאסן אין דעם בלאט (קאסקאד שיץ)',
'protect-cantedit'            => 'איר קען נישט ענדערן די שוץ ניוואען פֿון דעם בלאט, ווײַל איר האט נישט קיין רשות  צו רעדאקטירן אים.',
'restriction-type'            => 'ערלויבניש:',

# Undelete
'undeletebtn'            => 'צוריקשטעלן',
'cannotundelete'         => 'צוריקשטעלונג איז דורכגעפאלן; עס איז מעגליך אז אן אנדערע האט דאס שוין צוריקגעשטעלט.',
'undelete-search-box'    => 'זוכן אויסגעמעקטע בלעטער',
'undelete-search-prefix' => 'ווײַז בלעטער וואס הייבן אן מיט:',
'undelete-search-submit' => 'זוכן',

# Namespace form on various pages
'namespace'      => 'נאמענטייל:',
'invert'         => 'ווײַז אַלע אויסער די',
'blanknamespace' => '(הויפט)',

# Contributions
'contributions' => "באניצער'ס בײַשטײַערונגען",
'mycontris'     => 'מײַנע בײַשטײַערונגען',
'contribsub2'   => 'וועגן $1 ($2)',
'uctop'         => '(לעצטע)',
'month'         => 'ביז חודש:',
'year'          => 'ביז יאר:',

'sp-contributions-newbies'     => 'ווײַזן בײַשטײַערונגען נאר פֿון נײַע באַניצערס',
'sp-contributions-newbies-sub' => 'פאר נייע קאנטעס',
'sp-contributions-blocklog'    => 'בלאקירן לאג',
'sp-contributions-search'      => 'זוכן בײַשטײַערונגען',
'sp-contributions-username'    => 'באניצער נאמען אדער IP אדרעס:',
'sp-contributions-submit'      => 'זוכן',

# What links here
'whatlinkshere'            => 'װאָס פֿאַרבינדט דא',
'whatlinkshere-title'      => 'בלעטער וואס פֿארבינדן צו $1',
'whatlinkshere-page'       => 'בלאַט:',
'linklistsub'              => '(ליסטע פֿון פֿארבינדונגען)',
'linkshere'                => "די פאלגנדע בלעטער פארבינדן צום בלאט '''[[:$1]]''':",
'nolinkshere'              => "קיין שום בלאט פארבינדט נישט צו '''[[:$1]]'''.",
'isredirect'               => 'ווײַטערפירן בלאט',
'istemplate'               => 'אײַנשליסן',
'isimage'                  => 'ווײַזן א בילד',
'whatlinkshere-prev'       => '{{PLURAL:$1|פֿריערדיגער|$1 פֿריערדיגע}}',
'whatlinkshere-next'       => '{{PLURAL:$1|קומענדיגער|$1 קומענדיגע}}',
'whatlinkshere-links'      => '→ פֿארבינדונגען',
'whatlinkshere-hideredirs' => '$1 ווײַטערפֿירונגען',
'whatlinkshere-hidetrans'  => '$1 אַריבערשליסונגען',
'whatlinkshere-hidelinks'  => '$1 פֿאַרבינדונגען',
'whatlinkshere-hideimages' => '$1 בילדער פֿאַרבינדונגען',

# Block/unblock
'blockip'                  => 'באנוצער ארויסטרייבן',
'blockiptext'              => 'באנוצט זיך מיט די פארעם דא אונטן כדי צו בלאקירן איינגעשריבענע באנוצער אדער סתם ספעציפישע איי פי אדרעסן.

אזאלכע בלאקירונגן מוזן דורכגעפירט ווערן פאר דעם בלויזן אין איינעם ציל: אפהאלטן וואנדאליזם, און לויט די פארשריפטען און פאליסיס פון די סייט.

ביטע שרייבט ארויס קלאר וואס די וואנדאליזם באשטייט, און וועלכע בלאט ער האט וואנדאליזירט.',
'ipbother'                 => 'אַנדער צײַט',
'ipboptions'               => '15 מינוט:15 minutes,
1 שעה:1 hour,
2 שעהן:2 hours,
1 טאָג:1 day,
3 טעג:3 days,
1 װאָך:1 week,
2 װאָכן:2 weeks,
1 מאָנאַט:1 month,
3 מאָנאַטן:3 months,
6 מאָנאַטן:6 months,
1 יאָר:1 year,
אויף אייביק:infinite', # display1:time1,display2:time2,...
'ipbotheroption'           => 'אַנדער',
'badipaddress'             => 'נישט קיין גוטע אייפי אדרעס.',
'blockipsuccesssub'        => 'בלאק איז דורכגפירט מיט דערפֿאלג',
'blockipsuccesstext'       => 'באנוצער [[Special:Contributions/$1|$1]] <br />איז פארשפארט.
זעהט די [[Special:IPBlockList|ליסטע פון בלאקירטע באנוצער]] כדי צו זעהן די בלאקירונגן.',
'ipb-unblock-addr'         => 'אויפֿבלאקירן $1',
'unblockip'                => 'אויפֿבלאקירן באניצער',
'ipblocklist'              => ' ליסטע פון בלאקירטע באניצערס און IP אדרעסן',
'ipblocklist-legend'       => 'געפֿינען א בלאקירטן באניצער',
'ipblocklist-username'     => 'באניצער נאמען אדער IP אדרעס:',
'ipblocklist-submit'       => 'זוכן',
'blocklistline'            => '$1 $2 פארשפארט $3 ($4)',
'infiniteblock'            => 'אויף אייביק',
'expiringblock'            => 'גייט אויס $1',
'anononlyblock'            => 'אנינאנימעס בלויז',
'createaccountblock'       => 'קאנטע באשאפֿן בלאקירט',
'emailblock'               => 'בליצפאסט בלאקירט',
'ipblocklist-empty'        => 'בלאקירן ליסטע איז  ליידיג.',
'blocklink'                => 'ארויסטרייבן',
'unblocklink'              => 'באַפֿרײַען',
'contribslink'             => 'באַניצערס בײַשטײַערונגען',
'autoblocker'              => 'דו ביסט געבלאקט אטאמאטיק ווייל דו טיילסט זיך די IP אדרעס מיט [[User:$1|$1]]. דער סיבה וואס איז אנגעבען געווארן  [[User:$1|$1]] איז: "$2".',
'blocklogpage'             => 'בלאקירן לאג',
'blocklogentry'            => 'בלאקירט "[[$1]]" אויף אַ תקופה פון $2 $3',
'blocklogtext'             => 'דאס איז א לאג בוך פון אלע בלאקירונגען און באפרייונגען פֿון באניצערס. איי פי אדרעסן וואס זענען בלאקירט אויטאמאטיש ווערן נישט אויסגערעכענט דא.
זעט די איצטיגע [[Special:IPBlockList|ליסטע פון בלאקירטע באניצערס]].',
'unblocklogentry'          => 'באפֿרייט [[$1]]',
'block-log-flags-anononly' => 'בלויז אנינאמע באנוצער',
'block-log-flags-nocreate' => 'אקאונט באשאפען פארשפארט',
'block-log-flags-noemail'  => 'ע-פאסט בלאקירט',
'range_block_disabled'     => 'די סיסאפ מעגליכקייט צו בלאקירן רענזש בלאקס איז אומ-ערמעגליכט.',
'ipb_expiry_invalid'       => 'אפלויפונג צייט אומ-געזעליך.',
'ipb_already_blocked'      => '"$1" איז שוין בלאקירט',
'ipb_cant_unblock'         => "פעילער: בלאק איי.די. $1 געפינט זיך נישט. ס'מעגליך שוין באפרייט געווארן.",
'ip_range_invalid'         => 'אומריכטיגער IP גרייך.',
'proxyblocker'             => 'פראקסי בלאקער',
'proxyblockreason'         => 'אייער איי.פי. אדרעס איז געווארן געבלאקט צוליב דעם ווייל דאס איז א אפענער פראקסי. ביטע פארבינדט זיך מיט אייער אינטערנעט סערוויס פראוויידער אדער טעקס סאפארט צו אינפארמירן זיי איבער דעם ערענסטן זיכערהייט פראבלעם.',

# Developer tools
'databasenotlocked' => 'די דאטעבאזע איז נישט פארשפארט.',

# Move page
'move-page'               => 'באַוועגן $1',
'move-page-legend'        => 'באַוועגן בלאַט',
'movepagetext'            => "זיך באניצן מיט דעם פֿארעם וועט פֿארענדערן דעם נאמען פֿון דעם בלאט, און וועט אריבערפֿירן זיין געשיכטע צום נייעם נאמען.

דאס אלטע קעפל וועט ווערן א ווייטערפֿירן בלאט צום נייעם נאמען.

איר קענט דערהיינטיגן ווייטערפֿירונגען צום אלטן נאמען אויטאמאטיש.

טאמער נישט, טוט פֿארזיכערן אז עס איז נישטא קיין [[Special:DoubleRedirects|געטאפלטע]] אדער [[Special:BrokenRedirects|צעבראכענע]] ווייטערפֿירונגען.

איר זענט פֿאראנטווארטלעך זיכער מאכן אז אלע פֿארבינדונגען ווערן געריכטעט צו דער געהעריגער ריכטונג.

אכטונג: דער בלאט וועט נישט ווערן אריבערגעפֿירט אויב עס איז שוין דא א בלאט אונטער דעם נייעם נאמען, אחוץ ווען ער איז ליידיג. אדער ער איז א ווייטערפֿירונג בלאט, און ער האט נישט קיין געשיכטע פון ענדערונגען. פשט דערפֿון, אז איר קענט איבערקערן א ווייטערפֿירונג וואס איר האט אט געמאכט בטעות, און איר קענט נישט אריבערשרייבן אן עקסיסטירנדן בלאט.

'''ווארענונג:''' אזא ענדערונג קען זיין דראסטיש און נישט געווינטשען פאר א פאפולערן בלאט; ביטע פֿארזיכערט אז איר פֿארשטייט די ווייטגרייכנדע קאנסקווענסן צו דער אקציע בעפֿאר איר פֿירט דאס אויס.",
'movearticle'             => 'באוועג בלאט:',
'newtitle'                => 'צו נייעם קעפל:',
'movepagebtn'             => 'באוועגן',
'pagemovedsub'            => 'באַוועגט מיט הצלחה',
'movepage-moved'          => '<big>דער בלאט "$1" איז אריבערגעפֿירט געווארן צו "$2".</big>', # The two titles are passed in plain text as $3 and $4 to allow additional goodies in the message.
'articleexists'           => 'א בלאט מיט דעם נאמען עקזיסטירט שוין, אדער די נאמען וואס איר האט אויסגעוועילט איז נישט געזעצליך.
ביטע אויסוועילן אן אנדער נאמען.',
'talkexists'              => "דער בלאט אליין איז באוועגט מיט דערפֿאלג, אבער דער רעדן בלאט האט מען נישט באוועגט ווײַל ס'איז שוין דא א בלאט מיט דעם זעלבן נאמען. זײַט אזוי גוט פֿאראייניגט זיי האנטלעך.",
'movedto'                 => 'באַוועגט צו',
'movetalk'                => 'באוועגט אסאסיצירטע רעדן בלאט',
'1movedto2'               => '[[$1]] אריבערגעפירט צו [[$2]]',
'1movedto2_redir'         => '[[$1]] איז אַריבער צו [[$2]] אַנטשטאָט א ווײַטערפֿירונג',
'movelogpage'             => 'באוועגן לאג',
'movereason'              => 'אורזאך:',
'revertmove'              => 'צוריקדרייען',
'delete_and_move'         => 'אויסמעקן און באוועגן',
'delete_and_move_text'    => '== אויסמעקן פארלאנגט ==
די ציל באלט "[[:$1]]" עקזיסטירט שוין. ווילט איר דאס אויסמעקן כדי צו ערמעגליכן דעם באוועגונג?',
'delete_and_move_confirm' => 'יא, מעק אויס דעם בלאט',
'delete_and_move_reason'  => 'אויסמעקן כדי צו קענען באוועגן',

# Export
'export'            => 'עקספארטירן בלעטער',
'exporttext'        => 'איר קענט עקספארטירן דעם טעקסט און די ענדערונג היסטאריע פון א געוויסן בלאט אדער עטלעכע בלעטער ארומגענומען מיט אביסל XML. דאס קען ווערן אימפארטירט אין אן אנדער וויקי ניצנדיג מעדיע-וויקי דורך
דעם [[Special:Import|אימפארט בלאט]].

צו עקספארטירן בלעטער, לייגט אריין די טיטלען אין דעם טעקסט קעסטל פון אונטן, איין טיטל פאר א שורה, און קלויבט אויס צי איר דארפט די לויפיגע ווערסיע, ווי אויך די אלטע ווערסיעס, מיט די בלאט היסטאריע שורות, אדער בלויז די איצטיגע ווערסיע מיט דער קורץ ווארט אינפארמאציע פון דער לעצטער ענדערונג.

אין דעם לעצטן פאל קענט איר אויך ניצן א לינק, למשל [[{{ns:special}}:Export/{{MediaWiki:Mainpage}}]] פארן בלאט [[{{MediaWiki:Mainpage}}]].',
'exportcuronly'     => 'רעכן אריין בלויז די איצטיגע רע-ווערסיע, נישט די פולער היסטאריע',
'exportnohistory'   => "----
'''באמערקונג:''' עקספארטירן די פולער היסטאריע פון בלעטער דורך די פארעם איז געווארן אומ-ערמעגליכט צוליב פערפארמענס סיבות.",
'export-submit'     => 'עקספארט',
'export-addcattext' => 'צולייגן בלעטער פֿון דער קאַטעגאריע:',
'export-addcat'     => 'צולייגן',
'export-download'   => 'אויפֿהיטן אלס טעקע',
'export-templates'  => 'אײַנשליסן מוסטערן',

# Namespace 8 related
'allmessages'               => 'סיסטעם מעלדונגען',
'allmessagesname'           => 'נאָמען',
'allmessagesdefault'        => 'דיפאלט טעקסט',
'allmessagescurrent'        => 'איצטיגער טעקסט',
'allmessagestext'           => 'אט דאס איז א ליסטע פון אלע סיסטעם מעלדונגען וואס זענען פאראן אין דעם  {{ns:mediawiki}}  נאמענטייל, וואס באדינען דעם אויפהאלט פונעם סייט.

סיסאפן קענען ענדערן די מעלדונגען דורך דרוקן אויפן נאמען פון דער מעלדונג.

ביטע באזוכט [http://www.mediawiki.org/wiki/Localisation מעדיעוויקי לאקאליזאציע] און [http://translatewiki.net בעטאוויקי] אויב איר ווילט ביישטייערן צו דער גענערישער מעדיעוויקי לאקאליזאציע.',
'allmessagesnotsupportedDB' => 'מען קען זיך נישט באניצן מיט דעם בלאט וויבאלד די $wgUseDatabseMessages איז געווארן בטל.',
'allmessagesfilter'         => 'מעלדונג נאמען פֿילטער:',
'allmessagesmodified'       => 'ווײַזן נאר מאדיפֿיצירטע',

# Thumbnails
'thumbnail-more'           => 'פארגרעסער',
'filemissing'              => 'טעקע פֿעלט',
'thumbnail_error'          => 'גרײַז בײַם באשאפֿן דאס קליינבילד: $1',
'djvu_page_error'          => 'DjVu בלאט ארויס פֿון גרייך',
'djvu_no_xml'              => "מ'קען נישט באקומען דעם XML פֿאַר דער DjVu טעקע",
'thumbnail_invalid_params' => 'אומגילטיגע קליינבילד פאראמעטערס',
'thumbnail_dest_directory' => "מ'קען נישט שאפֿן דעם ציל קארטאטעק",

# Special:Import
'import'                     => 'אימפארטירן בלעטער',
'importinterwiki'            => 'אריבערוויקי אימפארט',
'import-interwiki-text'      => 'קלויבט אויס א וויקי און אן ארטיקל קעפל צו אימפארטירן.
די דאטעס און די נעמען פון די רעדאקטארן וועט ווערן געהיטן.
אלע צווישנוויקי אימפארט אקציעס ווערן פארשריבן אינעם   [[Special:Log/import|אימפארט לאג]].',
'import-interwiki-history'   => 'קאפירן אלע היסטאריע ווערסיעס פאר דעם בלאט',
'import-interwiki-submit'    => 'אימפארט',
'import-interwiki-namespace' => 'אריבערפֿירן בלעטער אין נאמענטייל:',
'importtext'                 => 'ביטע עקספארטירט די טעקע פון דער מקור וויקי ניצנדיג דאס [[Special:Export|עקספארט הילפמיטל]], שפייכלט איין אויף אייער הארטדיסק און לאדט אויף דא.',
'importstart'                => 'אימפארטירט בלעטער…',
'import-revision-count'      => '{{PLURAL:$1|איין ווערסיע|$1 ווערסיעס}}',
'importnopages'              => 'נישטא קיין בלעטער צו אימפארטירן.',
'importfailed'               => 'אימפארט דורכגעפֿאלן: <nowiki>$1</nowiki>',
'importunknownsource'        => 'אומבאקאנטער  אימפארט טיפ',
'importcantopen'             => 'נישט געקענט עפֿענען אימפארט טעקע',
'importbadinterwiki'         => 'שלעכטע אינטערוויקי לינק',
'importnotext'               => 'ליידיג אדער נישט קיין טעקסט',
'importsuccess'              => '!אימפארט אדורכגעפירט מיט דערפאלג!',
'importhistoryconflict'      => 'קאנפליקטינג היסטאריע רעוויזיע עקזעסטירט (מעגליך אז די בלאט איז געווארן אימפארטעט שוין פון פריער)',

# Import log
'importlogpage'             => 'אימפארט לאג',
'import-logentry-interwiki' => 'אריבערגעוויקיט $1',

# Tooltip help for the actions
'tooltip-pt-userpage'             => 'מיין באניצער בלאט',
'tooltip-pt-anonuserpage'         => 'באניצער בלאט פון  דעם אנאנימען באניצער',
'tooltip-pt-mytalk'               => 'מיין רעדן בלאט',
'tooltip-pt-anontalk'             => 'רעדן אויף אנינונימע באטייליגען',
'tooltip-pt-preferences'          => 'מיינע פרעפערענצן',
'tooltip-pt-watchlist'            => 'אויפפּאסן בלעטער',
'tooltip-pt-mycontris'            => 'מיינע ביישטייערונגען',
'tooltip-pt-login'                => 'ביטע איינשרייבן, אבער עס איז נישט קיין חוב',
'tooltip-pt-anonlogin'            => 'סבעסער איינשרייבן, אבער עס איז נישט קיין חוב',
'tooltip-pt-logout'               => 'זיך אויסשרייבן',
'tooltip-ca-talk'                 => 'שמועס איבער די אינהאלט בלאט',
'tooltip-ca-edit'                 => "איר קענט ענדערן דעם בלאט, ביטע באנוצט זיך מיט ''פארויסדיגע ווייזונג'' קנעפל בעפארן אפהיטען",
'tooltip-ca-addsection'           => 'לייג צו אייער הערה צו דעם שמועס',
'tooltip-ca-viewsource'           => 'דאס איז א פארשלאסן בלאט, קענסט נאר קוקן איר מקור',
'tooltip-ca-history'              => 'פריערדיגע ווערסיעס פון דעם בלאט.',
'tooltip-ca-protect'              => 'באשיצט דעם בלאט',
'tooltip-ca-delete'               => 'אויסמעקן דעם בלאט',
'tooltip-ca-undelete'             => 'צוריק דרייען די ענדערונגען פון דעם בלאט פארן מעקן',
'tooltip-ca-move'                 => 'באוועגט דעם בלאט',
'tooltip-ca-watch'                => 'לייגט צו דעם בלאט אויפצופאסן',
'tooltip-ca-unwatch'              => 'נעמט אראפ דעם בלאט פון אויפפאסן',
'tooltip-search'                  => 'זוכט אינעם סייט',
'tooltip-search-go'               => 'גייט צו א בלאט מיט אט דעם נאמען, אויב ער עקסיסטירט',
'tooltip-search-fulltext'         => 'זוכט דעם טעקסט אין די בלעטער',
'tooltip-p-logo'                  => 'הויפט זייט',
'tooltip-n-mainpage'              => 'באזוכט דעם הויפט זייט',
'tooltip-n-portal'                => 'גייט אריין אין די געמיינדע צו שמועסן',
'tooltip-n-currentevents'         => 'מער אינפארמאציע איבער אקטועלע געשענישען',
'tooltip-n-recentchanges'         => 'ליסטע פון לעצטע ענדערונגען',
'tooltip-n-randompage'            => 'וועלט אויס א צופעליגער בלאט',
'tooltip-n-help'                  => 'הילף',
'tooltip-t-whatlinkshere'         => 'אלע בלעטער וואס פארבינדען צו דעם בלאט',
'tooltip-t-recentchangeslinked'   => 'אלע ענדערונגען פון בלעטער וואס זענען אהער פארבינדען',
'tooltip-feed-rss'                => 'דערהײַנטיגט אויטאמאטיש פון אר.עס.עס. RSS',
'tooltip-feed-atom'               => 'לייג צו אן אטאמאטישער אפדעיט דורך אטאם Atom',
'tooltip-t-contributions'         => 'אלע בײַשטײַערונגען פון דעם באניצער',
'tooltip-t-emailuser'             => 'שיקט אן אימעיל פאר דעם באניצער',
'tooltip-t-upload'                => 'לייגט ארויף פיילס און בילדער',
'tooltip-t-specialpages'          => 'אלע ספעציעלע בלעטער',
'tooltip-t-print'                 => 'דרוק ווערסיע פון דעם בלאט',
'tooltip-t-permalink'             => 'פערמאנענטע פֿארבינדונג צו דער דאזיגער ווערסיע פֿונעם בלאט',
'tooltip-ca-nstab-main'           => 'זעט דעם אינהאַלט בלאַט',
'tooltip-ca-nstab-user'           => 'זעט דעם באניצער בלאט',
'tooltip-ca-nstab-media'          => 'קוקט אין דעם מעדיע בלאט',
'tooltip-ca-nstab-special'        => "דאס איז א ספעציעלער בלאט, מ'קען אים נישט ענדערן",
'tooltip-ca-nstab-project'        => 'באקוקט דעם פראיעקט בלאט',
'tooltip-ca-nstab-image'          => 'באקוקט דעם טעקע בלאט',
'tooltip-ca-nstab-mediawiki'      => 'באקוקט די סיסטעם מעלדונגען',
'tooltip-ca-nstab-template'       => 'זעט דעם מוסטער',
'tooltip-ca-nstab-help'           => 'זעהט די הילף בלעטער',
'tooltip-ca-nstab-category'       => 'באקוקט דעם קאטעגאריע בלאט',
'tooltip-minoredit'               => 'באצייכן דאס אלס מינערדיגע ענדערונג',
'tooltip-save'                    => 'היט אויף אייערע ענדערונגען',
'tooltip-preview'                 => 'פֿארויסדיגע ווײַזונג, זײַט אזוי גוט באניצט די געלעגנהייט פֿארן אויפֿהיטן!',
'tooltip-diff'                    => 'ווײַזן אייערע ענדערונגען צום טעקסט',
'tooltip-compareselectedversions' => 'פארגלײַכם די צוויי ווערסיעס פון דעם בלאט',
'tooltip-watch'                   => 'לייגט צו דעם בלאט צו אייער אויפֿפאסונג ליסטע',
'tooltip-upload'                  => 'הייב אן אויפלאדן',

# Stylesheets
'common.css'   => '/* CSS געשריבן דא וועט אפילירן און באיינפלוסן אלע סקינס */',
'monobook.css' => '/* סטייל דא געלייגט וועט באיינפלוסן די בעקגראונד Monobook בלויז */',

# Scripts
'common.js' => '/* אלע סקריפטן פון JavaScript דא געשריבן וועט לויפן פאר אלע באנוצער ווען זיי וועלן לאדירן דעם בלאט */',

# Attribution
'anonymous'        => 'אַנאָנימע/ר באַניצער(ס) פֿון {{SITENAME}}',
'lastmodifiedatby' => 'די לעצטע ענדערונג פון די בלאט איז געווען $2, $1 ביי $3.', # $1 date, $2 time, $3 user
'othercontribs'    => 'באזירט אויף ארבעט פון $1.',
'others'           => 'אנדערע',
'siteusers'        => 'באניצער(ס) {{SITENAME}} $1',
'creditspage'      => 'בלאט קרעדיטס',

# Info page
'infosubtitle' => 'אינפארמאציע וועגן בלאט',
'numedits'     => 'צאל פון רעדאקציעס (בלאט): $1',

# Patrolling
'markaspatrolleddiff' => 'באצייכנען אלס פאטראלירט',
'markaspatrolledtext' => 'באצייכנען בלאט אלס פאטראלירט',
'markedaspatrolled'   => 'באצייכנט אלס פאטראלירט',

# Image deletion
'deletedrevision' => 'אויסגעמעקט אלטע ווערסיע $1.',

# Browsing diffs
'previousdiff' => 'פריערדיגע ווערסיע →',
'nextdiff'     => 'קומענדיקע ווערסיע ←',

# Media information
'file-info-size'       => '($1 × $2 פיקסעל, טעקע גרייס: $3, טיפ MIME: $4)',
'file-nohires'         => '<small>נישטא מיט א העכערע רעזאלוציע.</small>',
'svg-long-desc'        => '(טעקע SVG, נאמינעל: $1 × $2 פיקסעלן, טעקע גרייס: $3)',
'show-big-image'       => 'בילד מיט דער גרעסטער רעזאלוציע',
'show-big-image-thumb' => '<small>גרייס פון דער ווײַזונג: $1 × $2 פיקסעלן</small>',

# Special:NewImages
'newimages'             => 'גאַלעריע פֿון נײַע בילדער',
'imagelisttext'         => 'פאלגנד א ליסטע פון {{PLURAL:$1|איין בילד|$1 בילדער}}, סארטירט $2:',
'newimages-summary'     => 'דער באזונדערער בלאט ווײַזט די לעצטע ארויפגעלאדענע טעקעס',
'showhidebots'          => '($1 ראָבאָטן)',
'noimages'              => 'נישטא קיין בילדער.',
'ilsubmit'              => 'זוכן',
'bydate'                => 'לויטן דאטום',
'sp-newimages-showfrom' => 'באַװײַזן נײַע טעקעס פון $2, $1',

# Bad image list
'bad_image_list' => 'דער פֿאָרמאַט איז װי פֿאָלגנדיק:

נאר חלקים פון אַ רשימה (שורות װעלכע הײבן זיך אָן מיט *) זײַנען אין באַטראַכט.

דער ערשטער פֿאַרבינדונג אין אַ שורה מוז זײַן אַ פֿאַרבינדונג צו אַ שלעכטער טעקע.

אַלע פֿאָלגנדיקע פֿאַרבינדונגען אין דער זעלבער שורה זײַנען גערעכנט װי אַן אױסנאַם, װי צום בײַשפּיל, בלעטער װעלכע די טעקע קען װערן געפֿאַלן אין קאָנטינואיטער.',

# Metadata
'metadata'          => 'מעטאדאטע',
'metadata-help'     => 'די טעקע אנטהאלט נאך אינפֿארמאציע, אפשר פֿונעם דיגיטאלן אפאראט אדער סקענער וואס האט באשאפֿן דאס בילד.

ווען די טעקע איז געענדערט געווארן פון איר ארגינעלן מצב, עטלעכע פרטים זענען מעגלעך נישט פאסיג צו דער היינטיקער טעקע.',
'metadata-expand'   => 'ווײַזן פֿארברייטערטע פרטים',
'metadata-collapse' => 'באהאלטן פֿארברייטערטע פרטים',
'metadata-fields'   => 'די פֿאלגנדע EXIF מעטאדאטע ווערן געוויזן אפילו ווען די מעטאדאטע טאבעלע איז אײַנגעפֿאלן:
* make
* model
* datetimeoriginal
* exposuretime
* fnumber
* focallength', # Do not translate list items

# EXIF tags
'exif-imagewidth'               => 'ברייט',
'exif-imagelength'              => 'הייך',
'exif-bitspersample'            => 'ביטס פער באשטאנדטייל',
'exif-compression'              => 'צאמקוועטשן סקיעם',
'exif-datetime'                 => 'פייל ענדערונג דאטום און צייט',
'exif-imagedescription'         => 'בילד טיטל',
'exif-make'                     => 'פֿאטא-אפאראט פֿאבריצירער',
'exif-model'                    => 'פֿאטא-אפאראט מאדעל',
'exif-copyright'                => 'קאפירעכטן האלטער',
'exif-exifversion'              => 'Exif ווערסיע',
'exif-flashpixversion'          => 'ווערסיע Flashpix סאפארטעד',
'exif-colorspace'               => 'ספעיס קאליר',
'exif-componentsconfiguration'  => 'מיינונג פון יעדן באשטאנדטייל',
'exif-compressedbitsperpixel'   => 'בילד צוזאמקוועטשן מאוד',
'exif-pixelydimension'          => 'גילטיגע ברייט פֿון בילד',
'exif-pixelxdimension'          => 'גילטיגע הייך פֿון בילד',
'exif-datetimeoriginal'         => 'דאטום און צייט פון פייל באשאפונג',
'exif-datetimedigitized'        => 'דאטום און צייט פון דיזשיטייזונג',
'exif-exposuretime'             => 'עקספאוזשער צייט',
'exif-exposuretime-format'      => '$1 סעק ($2)',
'exif-fnumber'                  => 'נומער F',
'exif-exposureprogram'          => 'אויפדעקונג פראגראם',
'exif-aperturevalue'            => 'עפען',
'exif-brightnessvalue'          => 'אפענקייט',
'exif-exposurebiasvalue'        => 'עקספאוזשער בייעס',
'exif-flash'                    => 'פלעש',
'exif-focallength'              => 'לענס פאוקאל לענג',
'exif-focallength-format'       => '$1 מ"מ',
'exif-flashenergy'              => 'פלעש ענערגיע',
'exif-focalplanexresolution'    => 'פאקאל פלעין עקס רעזאלוציע',
'exif-focalplaneresolutionunit' => 'פאקאל פלעין רעזאלוציע מאס',
'exif-exposureindex'            => 'עקספאוזשער אינדעקס',
'exif-filesource'               => 'פייל מקור',
'exif-cfapattern'               => 'פעטערן CFA',
'exif-customrendered'           => 'קאסטעם בילד פראצעסירונג',
'exif-exposuremode'             => 'עקספאוזשער מאוד',
'exif-digitalzoomratio'         => 'דיזשיטאלער זום ראשיאו',
'exif-focallengthin35mmfilm'    => 'פאקאל לענג אין 35 מ"מ פילם',
'exif-gaincontrol'              => 'סצענע קאנטראל',
'exif-contrast'                 => 'קאנטראסט',
'exif-devicesettingdescription' => 'זאך סעטינגס אראפמאלונג',
'exif-gpslatitude'              => 'לאטיטוד',
'exif-gpsaltituderef'           => 'אלטיטוט רעפערענץ',
'exif-gpsaltitude'              => 'אלטיטוט',
'exif-gpsdop'                   => 'מאס פוקנטליכקייט',
'exif-gpsimgdirectionref'       => 'רעפערענץ פאר ריכטונג פון בילד',
'exif-gpsimgdirection'          => 'ריכטונג פון בילד',
'exif-gpsdestlatituderef'       => 'רעפערענץ פאר לעטיטוד פון דעסטינאציע',
'exif-gpsdestlatitude'          => 'לעטיטוד פון דעסטינאציע',
'exif-gpsdestlongituderef'      => 'רעפערענץ פאר לענגטיטוד פון דעטינאציע',
'exif-gpsdestlongitude'         => 'לאנגטיטוד פון דעסטינאציע',
'exif-gpsdestbearingref'        => 'רעפערענץ פאר ריכטונג פון דעסטינאציע',
'exif-gpsdestbearing'           => 'ריכטונג פון דעסטינאציע',
'exif-gpsdestdistanceref'       => 'רעפערענץ פאר ווייטקייט פון דעסטינאציע',
'exif-gpsdestdistance'          => 'ווייטקייט פון דעטינאציע',
'exif-gpsareainformation'       => 'נאמען פון GPS געגענט',
'exif-gpsdatestamp'             => 'דאטום GPS',
'exif-gpsdifferential'          => 'דיפראנציאלע קאקרעקציע GPS',

# EXIF attributes
'exif-compression-1' => 'אומ-צאמגעקוועטשט',

'exif-componentsconfiguration-0' => "ס'עקזיסטירט נישט.",

'exif-exposureprogram-0' => 'נישט דעפענירט',
'exif-exposureprogram-1' => 'מעניועל',
'exif-exposureprogram-2' => 'נארמאלער פראגראם',
'exif-exposureprogram-3' => 'עפענען פריאריטעט',
'exif-exposureprogram-4' => 'צאמשפארן פריאריטעט',
'exif-exposureprogram-5' => 'שאפענדע פראגראם (בייעסט אין ריכטונג פוןדי טיפקייט פעלד)',
'exif-exposureprogram-6' => 'אקטיוו פראגראם (בייעס אויפן ריכטונג צו צומאכן ספיד)',
'exif-exposureprogram-7' => 'פארטרעיט מצב (פאר קלאוסאפ בילדער אין די בעקגראונד ארויס פון פאקוס)',
'exif-exposureprogram-8' => 'לענדסקעיפ מצב (פאר בילדער פון פאנאראמעס וואס בעקגראונד איז אין פאקוס)',

'exif-focalplaneresolutionunit-2' => 'אינטשעס',

'exif-customrendered-0' => 'נארמאלער פראצעס',
'exif-customrendered-1' => 'קאסטעם פראצעס',

'exif-exposuremode-0' => 'אוטאמאטיק עקספאוזשער',
'exif-exposuremode-1' => 'מעניואל עקספאוזשער',
'exif-exposuremode-2' => 'אטאמאטישער לייסטל',

'exif-gaincontrol-0' => 'גארנישט',
'exif-gaincontrol-1' => 'נידעריגע צובאקומען ארויף',
'exif-gaincontrol-2' => 'הויכע צובאקומען ארויף',
'exif-gaincontrol-3' => 'נידעריגע צובאקומען אראפ',
'exif-gaincontrol-4' => 'הויכע צובאקומען אראפ',

'exif-contrast-0' => 'נארמאל',
'exif-contrast-1' => 'ווייך',
'exif-contrast-2' => 'הארט',

# Pseudotags used for GPSLatitudeRef and GPSDestLatitudeRef
'exif-gpslatitude-n' => 'צפון לעטיטוד',
'exif-gpslatitude-s' => 'דרום לאטיטוד',

# Pseudotags used for GPSTrackRef, GPSImgDirectionRef and GPSDestBearingRef
'exif-gpsdirection-t' => 'ריכטיגע דירעקציע',
'exif-gpsdirection-m' => 'מאגנאטיק ריכטונג',

# External editor support
'edit-externally'      => 'עדיט די פייל דורך א דערויסענדיגער אפליקאציע',
'edit-externally-help' => 'זעהט די [http://www.mediawiki.org/wiki/Manual:External_editors סעטאפ אנווייזונגען] פאר מער אינפארמאציע.',

# 'all' in various places, this might be different for inflected languages
'recentchangesall' => 'אַלע',
'imagelistall'     => 'אַלע',
'watchlistall2'    => 'אַלע',
'namespacesall'    => 'אַלע',
'monthsall'        => 'אלע',

# E-mail address confirmation
'confirmemail'            => 'באשטעטיגט אייער אימעיל אדרעס',
'confirmemail_noemail'    => 'איר האט נישט קיין ריכטיגע אימעיל אדרעס אויפגעסעט אין אייער[[Special:Preferences|באנוצער פרעפערעצן]].',
'confirmemail_text'       => 'די וויקי פארלאנגט אז איר זאלט באשטעטיגן אייער בליצפאסט אדרעס איידער איר באניצט זיך מיט דער ע-פאסט באדינסט. דרוקט אויפן קנעפל אונטן כדי צו שיקן א באשטעטיגונג קאד צו אייער אדרעס. לאדט אן דעם לינק אין אייער בלעטערער צו באשטעטיגן אז אייער אדרעס איז גילטיג.',
'confirmemail_pending'    => '<div class="error">אימעיל באשטעטיגונג קאוד איז שוין געשיקט געווארן צו אייך; אויב האט איר לעצטענס באשאפן אן אקאונט, עס מעגליך אז איר ברויכט ווארטן א פאר סעקונדעס אדער מינוט ביז דאס דערגרייכט אייך ווי איידער צו בעטן א נייע קאוד.</div>',
'confirmemail_send'       => 'שיק א באשטעטיגונג קאוד',
'confirmemail_sent'       => 'באשטעטיגונג קאוד אימעיל געשיקט.',
'confirmemail_oncreate'   => 'באשטעטיגונג קאוד איז געשיקט געווארן צו אייער אימעיל אדרעס. די קאוד פארלאנגט זיך נישט אויף צו קענען אריין, אבער איר וועט עס דארפן דערלאנגן אויף זיך צו קענען באנוצען מיט אימעיל באזירטע פיטשערס אין די וויקי.',
'confirmemail_sendfailed' => 'דאס שיקן אייך די באשטעטיגונג קאוד אויף אימעיל איז דורכגעפאלן. ביטע טוט דובל-טשעקן אויב עס האט נישט קיין טעות און ווערטער.

אימעיל צוריגעקערט: $1',
'confirmemail_invalid'    => 'נישט קיין גוטע קאנפירימאציע קאוד. עס האט מעגליך עקפייערט.',
'confirmemail_needlogin'  => 'ברויכט איר דורכפירן $1 כדי צו באשטעטיגן אייער אימעיל אדרעס.',
'confirmemail_success'    => 'אייער אימעיל אדרעס איז באשטעטיגט. איר קענט איצט אריין אין אייער אקאונט און הנאה האבן פון די וויקי.',
'confirmemail_loggedin'   => 'אייער אימעיל אדרעס איז איצט געווארען באשטעטיגט.',
'confirmemail_error'      => 'עפעס איז געגאנגען שלעכט מיט סעיוון אייער קאנפירימאציע.',
'confirmemail_subject'    => 'באשטעטיגונג קאוד אימעיל פון{{grammar:תחילית|{{SITENAME}}}}',
'confirmemail_body'       => 'עמעצער, ווארשיינליך איר (פון איי פי אדרעס: $1), האט איינגעשריבן די קונטע: "$2" מיט אט דעם בליצפאסט אדרעס אויף {{SITENAME}}.

כדי זיכער מאכן אז די קונטע געהערט טאקע צו אייך, ביטע טוט עפענען דעם לינק אין די אייער בלעטערער:

$3

אויב *נישט* איר האט איינגעשריבן די קונטע, פאלגט די דאזיגע לינק מבטל צו זיין די ע-פאסט אדרעס באשטעטיגונג:

$5

דער באשטעטיגונג קאד גייט אויס $4.',

# Delete conflict
'deletedwhileediting' => 'ווארענונג: דער בלאט איז געווארן אויסגעמעקט נאכדעם וואס איר האט אנגעהויבן רעדאקטירן!',
'confirmrecreate'     => "באנוצער [[User:$1|$1]] ([[User talk:$1|רעדן]]) האט אויסגעמעקט דעם בלאט נאכדעם וואס איר האט אנגעהויבן דאס צו ענדערן, אלס אנגעבליכער סיבה:
:'''$2'''
ביטע באשטעטיגט אז איר ווילט טאקע צוריקשטעלן דעם בלאט.",

# action=purge
'confirm_purge'        => 'אויסקלארן די קאשעי פון דעם בלאט?

$1',
'confirm_purge_button' => 'אויקעי',

# AJAX search
'articletitles' => "זוכט בלעטער וואס הייבן זיך אן מיט '''$1'''",

# Multipage image navigation
'imgmultigo'   => 'גייט!',
'imgmultigoto' => 'אריבער צו בלאט $1',

# Table pager
'ascending_abbrev'         => 'ארויף',
'descending_abbrev'        => 'נידערן',
'table_pager_next'         => 'נעקסטער בלאט',
'table_pager_prev'         => 'פריערדיקער בלאט',
'table_pager_first'        => 'ערשטער בלאט',
'table_pager_last'         => 'לעצטער בלאט',
'table_pager_limit'        => 'ווײַז $1 פרטים א בלאט',
'table_pager_limit_submit' => 'גיי',
'table_pager_empty'        => 'קיין רעזולטאטן',

# Auto-summaries
'autosumm-blank'   => 'אויסגעמעקט דעם גאנצן אינהאלט פון בלאט',
'autosumm-replace' => "פֿאַרבײַט דעם בלאַט מיט '$1'",
'autoredircomment' => 'ווייטערפירן צו [[$1]]',
'autosumm-new'     => 'נייער בלאט: $1',

# Live preview
'livepreview-loading' => 'לאדנדיג…',
'livepreview-ready'   => 'לאדנדיג… גרייט!',

# Watchlist editing tools
'watchlisttools-view' => 'ווייזן שייכדיגע ענדערונגען',
'watchlisttools-edit' => 'זען און רעדאקטירן די אויפֿפאסונג ליסטע',
'watchlisttools-raw'  => 'רעדאקטירן די רויע אויפֿפאסונג ליסטע',

# Iranian month names
'iranian-calendar-m1'  => 'פֿאַרוואַרדין',
'iranian-calendar-m2'  => 'ארדיבעהעשט',
'iranian-calendar-m3'  => 'כארדאַד',
'iranian-calendar-m4'  => 'טיר',
'iranian-calendar-m5'  => 'מארדאַד',
'iranian-calendar-m6'  => 'שאַהריוואַר',
'iranian-calendar-m7'  => 'מעהר',
'iranian-calendar-m8'  => 'אַבאַן',
'iranian-calendar-m9'  => 'אַזאַר',
'iranian-calendar-m10' => 'דיי',
'iranian-calendar-m11' => 'באַהמאַן',
'iranian-calendar-m12' => 'עספֿאַנד',

# Special:Version
'version'              => 'ווערסיע', # Not used as normal message but as header for the special page itself
'version-specialpages' => 'ספעציעלע בלעטער',

# Special:SpecialPages
'specialpages'                   => 'ספּעציעלע זײטן',
'specialpages-note'              => '----
* נארמאַלע ספעציעלע בלעטער.
* <span class="mw-specialpagerestricted">באַגרענעצטע ספעציעלע בלעטער.</span>',
'specialpages-group-maintenance' => 'אויפֿהאַלטונג באַריכטן',
'specialpages-group-other'       => 'אַנדערע ספעציעלע בלעטער',
'specialpages-group-login'       => 'ארײַנלאגירן / אײַנשרײַבן',
'specialpages-group-changes'     => 'לעצטע ענדערונגען און לאג-ביכער',
'specialpages-group-media'       => 'מעדיע באַריכטן און ארויפֿלאדן',
'specialpages-group-users'       => 'באַניצערס און רעכטן',
'specialpages-group-highuse'     => 'בלעטער וואס זענען געניצט אסאך',
'specialpages-group-pages'       => 'ליסטעס פֿון בלעטער',
'specialpages-group-pagetools'   => 'געצייג פֿאר בלעטער',
'specialpages-group-wiki'        => 'וויקי דאַטן און געצייג',
'specialpages-group-redirects'   => 'ווײַטערפֿירן ספעציעלע בלעטער',
'specialpages-group-spam'        => 'ספאַם געצייג',

# Special:BlankPage
'blankpage'              => 'ליידיגער בלאַט',
'intentionallyblankpage' => 'דער בלאַט איז ליידיג בכוונה',

);
