<?php
/** Mongolian (Монгол)
 *
 * @ingroup Language
 * @file
 *
 * @author Chinneeb
 * @author לערי ריינהארט
 */

$linkTrail = '/^([a-zабвгдеёжзийклмнопрстуфхцчшщъыьэюя“»]+)(.*)$/sDu';

$messages = array(
# User preference toggles
'tog-underline'               => 'Линкүүдийн доогуур зураас зур:',
'tog-highlightbroken'         => 'Эвдэрхий линкүүдийг <a href="" class="new">ингэж</a> үзүүлэх: (өөрөөр: ингэж<a href="" class="internal">?</a>).',
'tog-justify'                 => 'Мөрүүдийг тэгшлэх',
'tog-hideminor'               => 'Сүүлийн өөрчлөлтүүд дахь бага зэргийн засваруудыг нуух',
'tog-extendwatchlist'         => 'Хянах жагсаалтаа бүх засварыг харуулахаар тохируулах',
'tog-usenewrc'                => 'Сүүлийн өөрчлөлтүүдийн сайжруулсан хэлбэр (ЖаваСкрипт)',
'tog-numberheadings'          => 'Гарчигуудыг автоматаар дэс дугаарлах',
'tog-showtoolbar'             => 'Засварлах түүлбарыг үзүүлэх (ЖаваСкрипт)',
'tog-editondblclick'          => 'Хоёр удаа дараад хуудсыг засварлах (ЖаваСкрипт)',
'tog-editsection'             => '[Засварлах] линкээр хэсгийг засварладаг болгох',
'tog-editsectiononrightclick' => 'Хэсгийн гарчиг дээр баруун товчлуураар дарж засварладаг болгох (ЖаваСкрипт)',
'tog-showtoc'                 => 'Агуулгын хүснэгтийг үзүүлэх (3-с илүү хэсэгтэй хуудсуудад)',
'tog-rememberpassword'        => 'Энэ компьютер дахь нэвтрэлийг санах',
'tog-editwidth'               => 'Засварлах талбарын өргөн бүтнээр байх',
'tog-watchcreations'          => 'Миний үүсгэсэн хуудсуудыг хянах жагсаалтанд оруулах',
'tog-watchdefault'            => 'Миний засварласан хуудсуудыг хянах жагсаалтанд оруулах',
'tog-watchmoves'              => 'Миний зөөсөн хуудсуудыг хянах жагсаалтанд оруулах',
'tog-watchdeletion'           => 'Миний устгасан хуудсуудыг хянах жагсаалтанд оруулах',
'tog-minordefault'            => 'Бүх засваруудаа бага зэргийн гэж автоматаар тэмдэглэх',
'tog-previewontop'            => 'Засварлах талбарын өмнө урьдчилж харсан байдлыг үзүүлэх',
'tog-previewonfirst'          => 'Эхний засварын үед урьдчилж харсан байдлыг үзүүлэх',
'tog-nocache'                 => 'Хуудасны кеш хийхийг болиулах',
'tog-enotifwatchlistpages'    => 'Миний хянах жагсаалт дахь хуудас өөрчлөгдөхөд и-мэйл явуулах',
'tog-enotifusertalkpages'     => 'Миний хэлэлцүүлгийн хуудас өөрчлөгдөхөд и-мэйл явуулах',
'tog-enotifminoredits'        => 'Хуудсууд бага зэргээр засварлагдахад ч и-мэйл явуулах',
'tog-enotifrevealaddr'        => 'Мэдэгдлийн и-мэйлд миний мэйл хаягийг илчлэх',
'tog-shownumberswatching'     => 'Харж буй хэрэглэгчдийн тоог үзүүлэх',
'tog-fancysig'                => 'Автомат линкгүй түүхий гарын үсэг',
'tog-externaleditor'          => 'Засварлахдаа гадны программыг байнга ашиглах',
'tog-externaldiff'            => 'Өөрчлөлтүүдийг харахдаа гадны программыг ашиглах',
'tog-showjumplinks'           => '"Шууд очих" хялбар линкүүдийг ажиллагаатай болгох',
'tog-uselivepreview'          => 'Шууд байдлаар урьдчилж харах (ЖаваСкрипт) (Туршилт)',
'tog-forceeditsummary'        => 'Товч агуулгын талбарыг хоосон үлдээхэд надад мэдэгдэх',
'tog-watchlisthideown'        => 'Хянах жагсаалтаас миний засваруудыг нуух',
'tog-watchlisthidebots'       => 'Хянах жагсаалтаас роботуудын засваруудыг нуух',
'tog-watchlisthideminor'      => 'Хянах жагсаалтаас бага зэргийн засваруудыг нуух',
'tog-ccmeonemails'            => 'Бусад хэрэглэгчдэд явуулсан мэйлүүдыг над руу давхар илгээх',
'tog-diffonly'                => 'Өөрчлөлтөөс доогуурх хуудсын агуулгыг үзүүлэхгүй байх',
'tog-showhiddencats'          => 'Нуугдсан ангиллуудыг үзүүлэх',

'underline-always'  => 'Байнга',
'underline-never'   => 'Хэзээ ч үгүй',
'underline-default' => 'Броузерын тохиргоотой адил',

'skinpreview' => '(Урьдчилж харах)',

# Dates
'sunday'        => 'Ням',
'monday'        => 'Даваа',
'tuesday'       => 'Мягмар',
'wednesday'     => 'Лхагва',
'thursday'      => 'Пүрэв',
'friday'        => 'Баасан',
'saturday'      => 'Бямба',
'sun'           => 'Ня.',
'mon'           => 'Да.',
'tue'           => 'Мя.',
'wed'           => 'Лх.',
'thu'           => 'Пү.',
'fri'           => 'Ба.',
'sat'           => 'Бя.',
'january'       => 'Нэгдүгээр сар',
'february'      => 'Хоёрдугаар сар',
'march'         => 'Гуравдугаар сар',
'april'         => 'Дөрөвдүгээр сар',
'may_long'      => 'Тавдугаар сар',
'june'          => 'Зургаадугаар сар',
'july'          => 'Долоодугаар сар',
'august'        => 'Наймдугаар сар',
'september'     => 'Есдүгээр сар',
'october'       => 'Аравдугаар сар',
'november'      => 'Арваннэгдүгээр сар',
'december'      => 'Арванхоёрдугаар сар',
'january-gen'   => 'Нэгдүгээр сар',
'february-gen'  => 'Хоёрдугаар сар',
'march-gen'     => 'Гуравдугаар сар',
'april-gen'     => 'Дөрөвдүгээр сар',
'may-gen'       => 'Тавдугаар сар',
'june-gen'      => 'Зургаадугаар сар',
'july-gen'      => 'Долоодугаар сар',
'august-gen'    => 'Наймдугаар сар',
'september-gen' => 'Есдүгээр сар',
'october-gen'   => 'Аравдугаар сар',
'november-gen'  => 'Арваннэгдүгээр сар',
'december-gen'  => 'Арванхоёрдугаар сар',
'jan'           => '1-р сар',
'feb'           => '2-р сар',
'mar'           => '3-р сар',
'apr'           => '4-р сар',
'may'           => '5-р сар',
'jun'           => '6-р сар',
'jul'           => '7-р сар',
'aug'           => '8-р сар',
'sep'           => '9-р сар',
'oct'           => '10-р сар',
'nov'           => '11-р сар',
'dec'           => '12-р сар',

# Categories related messages
'pagecategories'                 => '{{PLURAL:$1|Ангилал|Ангиллууд}}',
'category_header'                => '"$1" ангилал дахь хуудсууд',
'subcategories'                  => 'Дэд ангиллууд',
'category-media-header'          => '"$1" ангилал дахь медиа файлууд',
'category-empty'                 => "''Одоогийн байдлаар энэ ангилалд хуудас, медиа файл байхгүй байна.''",
'hidden-categories'              => '{{PLURAL:$1|Нуугдсан ангилал|Нуугдсан ангиллууд}}',
'hidden-category-category'       => 'Нуугдсан ангиллууд', # Name of the category where hidden categories will be listed
'category-subcat-count'          => '{{PLURAL:$2|Энэ ангилалд дараах дэд ангилал л байна.|Энэ ангилалд нийт $2-с $1 дэд ангилал байна.}}',
'category-subcat-count-limited'  => 'Энэ ангилалд дараах $1 дэд ангилал байна.',
'category-article-count'         => '{{PLURAL:$2|Энэ ангилалд дараах хуудас л байна.|Энэ ангилалд нийт $2-с дараах $1 хуудас байна.}}',
'category-article-count-limited' => 'Энэ ангилалд дараах $1 хуудас байна.',
'category-file-count'            => '{{PLURAL:$2|Энэ ангилалд дараах файл л байна.|Энэ ангилалд нийт $2-с дараах $1 файл байна.}}',
'category-file-count-limited'    => 'Энэ ангилалд дараах $1 файл байна.',
'listingcontinuesabbrev'         => '-н үргэлжлэл',

'mainpagetext'      => "<big>'''МедиаВики амжилттай суулаа.'''</big>",
'mainpagedocfooter' => 'Вики программыг хэрэглэх талаар заавар авахын тулд [http://meta.wikimedia.org/wiki/Help:Contents хэрэглэгчийн гарын авлага]-г үзнэ үү.

== Эхлэх ==
* [http://www.mediawiki.org/wiki/Manual:Configuration_settings Тохиргоо]
* [http://www.mediawiki.org/wiki/Manual:FAQ МедиаВикигийн тогтмол тавигддаг асуултууд]
* [http://lists.wikimedia.org/mailman/listinfo/mediawiki-announce МедиаВикигийн мэдээний мэйл явуулах жагсаалт]',

'about'          => 'Тухай',
'article'        => 'Өгүүлэл',
'newwindow'      => '(шинэ цонх нээгдэнэ)',
'cancel'         => 'Цуцлах',
'qbfind'         => 'Хайх',
'qbbrowse'       => 'Дэлгэх',
'qbedit'         => 'Засварлах',
'qbpageoptions'  => 'Энэ хуудас',
'qbpageinfo'     => 'Агуулга',
'qbmyoptions'    => 'Миний хуудсууд',
'qbspecialpages' => 'Тусгай хуудсууд',
'moredotdotdot'  => 'Дэлгэрэнгүй...',
'mypage'         => 'Миний хуудас',
'mytalk'         => 'Миний яриа',
'anontalk'       => 'Энэ IP-н яриа',
'navigation'     => 'Залуурдлага',
'and'            => 'ба',

# Metadata in edit box
'metadata_help' => 'Зургийн тухай мэдээлэл:',

'errorpagetitle'    => 'Aлдаа',
'returnto'          => '$1 руу буцах.',
'tagline'           => '{{SITENAME}}-с',
'help'              => 'Тусламж',
'search'            => 'Хайлт',
'searchbutton'      => 'Хайх',
'go'                => 'Явах',
'searcharticle'     => 'Явах',
'history'           => 'Хуудасны түүх',
'history_short'     => 'Түүх',
'updatedmarker'     => 'сүүлд зочилсноос хойш шинэчлэгдсэн',
'info_short'        => 'Мэдээлэл',
'printableversion'  => 'Хэвлэх хувилбар',
'permalink'         => 'Байнгын холбоос',
'print'             => 'Хэвлэх',
'edit'              => 'Засварлах',
'create'            => 'Үүсгэх',
'editthispage'      => 'Энэ хуудсыг засварлах',
'create-this-page'  => 'Энэ хуудсыг үүсгэх',
'delete'            => 'Устгах',
'deletethispage'    => 'Энэ хуудсыг устга',
'undelete_short'    => 'Устгагдсан $1 засварыг сэргээх',
'protect'           => 'Хамгаалах',
'protect_change'    => 'хамгаалалтыг өөрчлөх',
'protectthispage'   => 'Энэ хуудсыг хамгаалах',
'unprotect'         => 'Хамгаалахаа болих',
'unprotectthispage' => 'Энэ хуудсыг хамгаалахаа болих',
'newpage'           => 'Шинэ хуудас',
'talkpage'          => 'Энэ хуудсын талаар хэлэлцүүлэг явуулах',
'talkpagelinktext'  => 'Яриа',
'specialpage'       => 'Тусгай хуудас',
'personaltools'     => 'Өөрийн багаж хэрэгслүүд',
'postcomment'       => 'Саналаа нэмэх',
'articlepage'       => 'Өгүүллийг үзэх',
'talk'              => 'Хэлэлцүүлэг',
'views'             => 'Харагдацууд',
'toolbox'           => 'Багаж хэрэгслүүд',
'userpage'          => 'Хэрэглэгчийн хуудсыг үзэх',
'projectpage'       => 'Төслийн хуудсыг үзэх',
'imagepage'         => 'Медиа хуудсыг үзэх',
'mediawikipage'     => 'Мессежний хуудсыг үзэх',
'templatepage'      => 'Загварын хуудсыг үзэх',
'viewhelppage'      => 'Тусламжийн хуудсыг үзэх',
'categorypage'      => 'Ангиллын хуудсыг үзэх',
'viewtalkpage'      => 'Хэлэлцүүлгийг үзэх',
'otherlanguages'    => 'Өөр хэлээр',
'redirectedfrom'    => '($1-с шууд холбогдсон)',
'redirectpagesub'   => 'Хуудсыг шууд холбох',
'lastmodifiedat'    => 'Энэ хуудсыг хамгийн сүүлд өөрчилсөн нь $2, $1.', # $1 date, $2 time
'viewcount'         => 'Энэ хуудсанд $1 удаа хандсан байна.',
'protectedpage'     => 'Хамгаалагдсан хуудас',
'jumpto'            => 'Шууд очих:',
'jumptonavigation'  => 'залуурдлага',
'jumptosearch'      => 'хайлт',

# All link text and link target definitions of links into project namespace that get used by other message strings, with the exception of user group pages (see grouppage) and the disambiguation template definition (see disambiguations).
'aboutsite'            => '{{SITENAME}}-н тухай',
'aboutpage'            => 'Project:Тухай',
'bugreports'           => 'Алдааны мэдүүлгүүд',
'bugreportspage'       => 'Project:Алдааны мэдүүлгүүд',
'copyright'            => 'Агуулгыг $1-н хувьд хэрэглэх боломжтой.',
'copyrightpagename'    => '{{SITENAME}}-н зохиогчийн эрх',
'copyrightpage'        => '{{ns:project}}:Зохиогчийн эрх',
'currentevents'        => 'Сүүлийн үеийн мэдээ',
'currentevents-url'    => 'Project:Сүүлийн үеийн мэдээ',
'disclaimers'          => 'Татгалзлууд',
'disclaimerpage'       => 'Project:Ерөнхий татгалзал',
'edithelp'             => 'Засвар хийх тухай тусламж',
'edithelppage'         => 'Help:Засварлах',
'faq'                  => 'Тогтмол тавигддаг асуултууд',
'faqpage'              => 'Project:Тогтмол тавигддаг асуултууд',
'helppage'             => 'Help:Агуулга',
'mainpage'             => 'Нүүр хуудас',
'mainpage-description' => 'Нүүр хуудас',
'policy-url'           => 'Project:Бодлого баримтлал',
'portal'               => 'Бүлгэмийн портал',
'portal-url'           => 'Project:Бүлгэмийн портал',
'privacy'              => 'Хувийн мэдээллийн талаарх баримтлал',
'privacypage'          => 'Project:Хувийн мэдээллийн талаарх баримтлал',

'badaccess'        => 'Зөвшөөрлийн алдаа',
'badaccess-group0' => 'Таньд энэ үйлдлийг гүйцэтгэх зөвшөөрөл байхгүй байна.',
'badaccess-group1' => 'Энэ үйлдлийг $1 группын хэрэглэгчдэд хязгаарласан байна.',
'badaccess-group2' => 'Энэ үйлдлийг $1 группуудын аль нэгнийх нь хэрэглэгчдэд хязгаарласан байна.',
'badaccess-groups' => 'Энэ үйлдлийг $1 группуудын аль нэгнийх нь хэрэглэгчдэд хязгаарласан байна.',

'versionrequired'     => 'МедиаВикигийн $1 хувилбар шаардлагатай',
'versionrequiredtext' => 'Энэ хуудсыг ашиглахын тулд МедиаВикигйин $1 хувилбар шаардлагатай. [[Special:Version|Энэ хувилбарын тухай]] үзнэ үү.',

'ok'                      => 'OK',
'retrievedfrom'           => '"$1" хуудаснаас авсан',
'youhavenewmessages'      => 'Таньд $1 ($2) байна.',
'newmessageslink'         => 'шинэ мессеж',
'newmessagesdifflink'     => 'сүүлийн өөрчлөлт',
'youhavenewmessagesmulti' => 'Таньд $1 дээр шинэ мессеж ирсэн байна',
'editsection'             => 'засварлах',
'editold'                 => 'засварлах',
'viewsourceold'           => 'кодыг харах',
'editsectionhint'         => 'Хэсгийг засварлах: $1',
'toc'                     => 'Агуулга',
'showtoc'                 => 'үзүүлэх',
'hidetoc'                 => 'нуух',
'thisisdeleted'           => '$1-г харах эсвэл сэргээх үү?',
'viewdeleted'             => '$1-г харах уу?',
'restorelink'             => '$1 арилгагдсан засвар',
'feedlinks'               => 'Фийд:',
'feed-invalid'            => 'Захиалсан фийдийн төрөл буруу байна.',
'feed-unavailable'        => '{{SITENAME}}-д фийд байхгүй байна',
'site-rss-feed'           => '$1-н RSS фийд',
'site-atom-feed'          => '$1-н Atom фийд',
'page-rss-feed'           => '"$1"-н RSS фийд',
'page-atom-feed'          => '"$1"-н Atom фийд',
'red-link-title'          => '$1 (бичигдээгүй байна)',

# Short words for each namespace, by default used in the namespace tab in monobook
'nstab-main'      => 'Хуудас',
'nstab-user'      => 'Хэрэглэгчийн хуудас',
'nstab-media'     => 'Медиа хуудас',
'nstab-special'   => 'Тусгай',
'nstab-project'   => 'Төслийн хуудас',
'nstab-image'     => 'Файл',
'nstab-mediawiki' => 'Мэдэгдэл',
'nstab-template'  => 'Загвар',
'nstab-help'      => 'Тусламж',
'nstab-category'  => 'Ангилал',

# Main script and global functions
'nosuchaction'      => 'Тийм үйлдэл байхгүй байна',
'nosuchactiontext'  => 'URL-н заасан үйлдэл викид танигдахгүй байна',
'nosuchspecialpage' => 'Тийм тусгай хуудас байхгүй байна',
'nospecialpagetext' => "<big>'''Та хүчингүй тусгай хуудас руу орох гэсэн үйлдлийг хийлээ.'''</big>

Тусгай хуудсуудын жагсаалтыг [[Special:SpecialPages|{{int:specialpages}}]] хуудаснаас харна уу.",

# General errors
'error'                => 'Aлдаа',
'databaseerror'        => 'Мэдээллийн сан дахь алдаа',
'dberrortext'          => 'Мэдээллийн бааз дахь хайлтанд синтаксийн алдаа гарлаа. 
Энэ нь программд алдаа байгааг харуулж байж магадгүй.
Хамгийн сүүлд гүйцэтгэсэн мэдээллийн бааз дахь хайлт нь: "<tt>$2</tt>" функцаас
<blockquote><tt>$1</tt></blockquote> 
байна. MySQL-н буцаасан алдаа нь "<tt>$3: $4</tt>".',
'dberrortextcl'        => 'Мэдээллийн бааз дахь хайлтанд синтаксийн алдаа гарлаа. 
Хамгийн сүүлд гүйцэтгэсэн мэдээллийн бааз дахь хайлт нь: "$2" функцаас 
"$1"
байна. MySQL-н буцаасан алдаа нь "$3: $4"',
'noconnect'            => 'Уучлаарай! Викид техникийн саатал гарсан тул мэдээллийн бааз руу холбогдохгүй байна.<br />
$1',
'nodb'                 => '$1 мэдээллийн санг сонгож чадсангүй',
'cachederror'          => 'Дараах нь таны хүссэн хуудасны нөөц хуулбар тул хамгийн шинэ хувилбар биш байх магадлалтай.',
'laggedslavemode'      => 'Анхаар: Энэ хуудас нь хамгийн сүүлийн өөрчлөлтүүдийг хамруулаагүй байж болно.',
'readonly'             => 'Мэдээллийн сан түгжигдсэн байна',
'enterlockreason'      => 'Түгжих болсон шалтгаан болон хэзээ уг түгжээ нь тайлагдах тухай оруулна уу.',
'readonlytext'         => 'Одоогийн байдлаар мэдээллийн сан нь нэмэлтүүд болон өөр өөрчлөлтүүдэд түр хаагдсан байна. Ердийн мэдээллийн сангийн техникийн үзлэг хийгдэж байгаа тул дууссаны дараа хэвийн байдалдаа эргэж орно.

Түгжсэн администратор ийм шалтгааныг өгчээ: $1',
'missingarticle-rev'   => '(засвар#: $1)',
'readonly_lag'         => 'Хоёрдогч серверүүд анхдагчдаа гүйцэж ирэх хүртэл мэдээллийн санг автоматаар түгжлээ.',
'internalerror'        => 'Дотоод алдаа',
'internalerror_info'   => 'Дотоод алдаа: $1',
'filecopyerror'        => 'Файлыг "$1"-с "$2" руу хуулж чадсангүй.',
'filerenameerror'      => 'Файлын нэрийг "$1"-с "$2" болгож өөрчилж чадсангүй.',
'filedeleteerror'      => '"$1" файлыг устгаж чадсангүй.',
'directorycreateerror' => '"$1" жагсаалтыг үүсгэж чадсангүй.',
'filenotfound'         => '"$1" файл олдсонгүй.',
'fileexistserror'      => '"$1" файл руу бичиж болохгүй байна: ийм файлыг урьд нь оруулсан байна',
'unexpected'           => 'Санаандгүй утга: "$1"="$2".',
'formerror'            => 'Алдаа: формыг бүртгүүлж чадсангүй',
'badarticleerror'      => 'Энэ үйлдлийг энэ хуудсан дээр гүйцэтгэх боломжгүй байна.',
'cannotdelete'         => 'Заагдсан хуудас буюу файлыг устгаж чадсангүй.
Өөр хэрэглэгч өрсөж устгасан байж магадгүй.',
'badtitle'             => 'Болохгүй гарчиг',
'badtitletext'         => 'Оруулсан хуудасны нэр тань хүчингүй, хоосон, эсвэл буруу холбосон интер-хэл буюу интер-викигийн нэр байна. Нэрэнд хэрэглэгдэж болохгүй тэмдэгт орсон байж болзошгүй.',
'perfdisabled'         => 'Уучлаарай! Энэ үйлдэл мэдээллийн санг маш удаашруулж, викиг хэн ч хэрэглэж болохгүй явдалд хүргэдэг тул түр хаагдсан байна.',
'perfcached'           => 'Дараах тоо баримт нь нөөц хуулбар учраас хуучирсан мэдээлэлтэй байж магадгүй.',
'perfcachedts'         => 'Дараах тоо баримт нөөц хуулбар бөгөөд хамгийн сүүлд $1-д шинэчлэгдсэн.',
'querypage-no-updates' => 'Одоогийн байдлаар энэ хуудсанд шинэчлэлүүд хаагдсан байна. Энд байгаа тоо баримт одоохондоо сэргээгдэхгүй.',
'wrong_wfQuery_params' => 'wfQuery()-д буруу параметр оруулсан байна<br />
Функц: $1<br />
Асуудал: $2',
'viewsource'           => 'Кодыг харах',
'viewsourcefor'        => '$1',
'actionthrottled'      => 'Үйлдэл хязгаарлагдлаа',
'actionthrottledtext'  => 'Бид спамаас хамгаалахын тулд энэ үйлдлийг богино хугацаанд хэт олон удаа давтахыг хязгаарладаг. Та энэхүү хязгаарт хүрсэн тул түр хүлээгээд дахин оролдоно уу.',
'protectedpagetext'    => 'Засварлах явдлыг саатуулахын тулд энэ хуудас түгжигдсэн байна.',
'viewsourcetext'       => 'Та энэ хуудасны кодыг харах болон хуулж авах үйлдлийг хийх боломжтой:',
'protectedinterface'   => 'Энэ хуудас программын харагдах байдалд ашиглагддаг текстийг агуулдаг тул түгжигдсэн байна.',
'editinginterface'     => "'''Анхаар''': Та программын харагдах байдалд ашиглагддаг текстийг агуулсан хуудсыг засварлах гэж байна. 
Энэ хуудсанд өөрчлөлт оруулснаар бусад хэрэглэгчдийн программын харагдах байдалд нөлөөлөх болно.
Орчуулга хийх гэж байгаа бол МедиаВикигийн орчуулгын төсөл болох, [http://translatewiki.net/wiki/Main_Page?setlang=mn Бетавики]-г хэрэглэхийг санал болгож байна.",
'sqlhidden'            => '(SQL илэрц харагдахгүй байна)',
'cascadeprotected'     => 'Энэ хуудас нь давхар хамгаалалттай дараах {{PLURAL:$1|хуудсанд|хуудсуудад}} орсон тул засварлагдахаас хамгаалагдсан байна:
$2',
'namespaceprotected'   => "Таньд '''$1''' нэрний зай дахь хуудсуудыг засварлах зөвшөөрөл байхгүй байна.",
'customcssjsprotected' => 'Энэ хуудас өөр хэрэглэгчийн хувийн тохиргоог агуулдаг тул та засварлах эрхгүй.',
'ns-specialprotected'  => 'Тусгай хуудсуудыг засварлах боломжгүй.',
'titleprotected'       => "[[User:$1|$1]] нь энэ хуудсыг үүсгэх явдыг хорьжээ.
Шалтгаан нь: ''$2''.",

# Login and logout pages
'logouttitle'                => 'Гарах',
'logouttext'                 => '<strong>Та одоо гарлаа.</strong>

Та ямар нэг хэрэглэгчийн бүртгэлгүйгээр {{SITENAME}}-г ашиглах боломжтой, эсвэл саяынхаа болон өөр хэрэглэгчийн бүртгэлээ ашиглан дахин холбогдож болно. 
Броузерийнхаа хийсвэр санах ойг цэвэрлэх хүртэл зарим нэг хуудсууд нь таны холбогдсон байдлаар харагдаж болзошгүйг анхааруулъя.',
'welcomecreation'            => '== $1, тавтай морилно уу! ==
Та амжилттай бүртгэгдлээ. 
{{SITENAME}}-н тохиргоогоо өөрчлөхөө мартуузай.',
'loginpagetitle'             => 'Хэрэглэгч нэвтрэх',
'yourname'                   => 'Хэрэглэгчийн нэр:',
'yourpassword'               => 'Нууц үг:',
'yourpasswordagain'          => 'Нууц үгээ дахин оруулах:',
'remembermypassword'         => 'Энэ компьютер дээрх миний нэвтрэлийг сана',
'yourdomainname'             => 'Таны домэйн:',
'externaldberror'            => 'Нэг бол гадны баталгаажуулах мэдээллийн сангийн алдаа гарсан, эсвэл та өөрийн гадны бүртгэлээ шинэчлэх эрхгүй байна.',
'loginproblem'               => '<b>Нэвтрэхэд тань алдаа гарлаа.</b><br />Дахин оролдоно уу!',
'login'                      => 'Нэвтрэх',
'nav-login-createaccount'    => 'Нэвтрэх / Бүртгүүлэх',
'loginprompt'                => 'Та {{SITENAME}}-д нэвтрэхийн тулд күүкинүүд ашигладах хэрэгтэй.',
'userlogin'                  => 'Нэвтрэх / Бүртгүүлэх',
'logout'                     => 'Гарах',
'userlogout'                 => 'Гарах',
'notloggedin'                => 'Нэвтрээгүй байна',
'nologin'                    => 'Бүртгүүлээгүй байна уу? $1.',
'nologinlink'                => 'Бүртгүүлэх',
'createaccount'              => 'Бүртгүүлэх',
'gotaccount'                 => 'Та бүртгэлтэй юу? $1',
'gotaccountlink'             => 'Нэвтрэх',
'createaccountmail'          => 'Мэйлээр илгээх',
'badretype'                  => 'Таны оруулсан хоёр нууц үг таарахгүй байна.',
'userexists'                 => 'Хэрэглэгчийн нэр ашиглагдаж байна.
Өөр нэр сонгоно уу.',
'youremail'                  => 'Мэйл хаяг:',
'username'                   => 'Хэрэглэгчийн нэр:',
'uid'                        => 'Хэрэглэгчийн ID:',
'yourrealname'               => 'Жинхэнэ нэр:',
'yourlanguage'               => 'Хэл:',
'yourvariant'                => 'Вариант',
'yournick'                   => 'Дуудах нэр (хоч):',
'badsig'                     => 'Хүчингүй гарын үсэг байна; HTML тагуудаа шалгаж үзнэ үү.',
'badsiglength'               => 'Хоч нэр хэтэрхий урт байна;
$1 үсгээс богино байх ёстой.',
'email'                      => 'Мэйл хаяг',
'prefs-help-realname'        => 'Жинхэнэ нэрээ заавал оруулах албагүй бөгөөд оруулбал таны хийсэн бүтээлийг түүгээр хаяглана.',
'loginerror'                 => 'Нэвтрэхэд алдаа гарлаа',
'prefs-help-email'           => '*Мэйл хаягаа заавал оруулах албагүй. Харин оруулснаар өөрийгөө таниулалгүйгээр таны хэрэглэгчийн эсвэл хэлэлцүүлгийн хуудсаар бусад хэрэглэгчдэд таньтай харилцах боломж олгоно.',
'prefs-help-email-required'  => 'Мэйл хаяг шаардлагатай байна.',
'nocookiesnew'               => 'Таны хэрэглэгчийн бүртгэл үүсгэгдсэн боловч нэвтрээгүй байна.
{{SITENAME}}-д холбогдоход күүкиг хэрэглэдэг.
Та күүкиг идэвхижүүлээгүй байна.
Түүнийг идэвхижүүлж шинэ хэрэглэгчийн нэр, нууц үгээрээ нэвтрэнэ үү.',
'nocookieslogin'             => '{{SITENAME}}-д нэвтрэхэд күүкиг хэрэглэдэг.
Та күүкиг идэвхижүүлээгүй байна.
Түүнийг идэвхижүүлж дахин оролдоно уу.',
'noname'                     => 'Та хүчинтэй хэрэглэгчийн нэрийг өгөөгүй байна.',
'loginsuccesstitle'          => 'Амжилттай нэвтэрлээ',
'loginsuccess'               => "'''Та {{SITENAME}} руу \"\$1\" нэрээр нэвтэрлээ.'''",
'nosuchuser'                 => '"$1" гэсэн нэртэй хэрэглэгч байхгүй байна.
Үсгийн алдаагаа зас, эсвэл шинээр бүртгүүлнэ үү.',
'nosuchusershort'            => '"<nowiki>$1</nowiki>" гэсэн нэртэй хэрэглэгч байхгүй байна. 
Үсгийн алдаагаа шалгана уу.',
'nouserspecified'            => 'Та хэрэглэгчийн нэрээ зааж өгөх хэрэгтэй.',
'wrongpassword'              => 'Нууц үгээ буруу оруулсан байна. Дахин оролдоно уу.',
'wrongpasswordempty'         => 'Хоосон нууц үг оруулсан байна. Дахин оруулна уу.',
'passwordtooshort'           => 'Таны нууц үг хэт богино байна. 
Хамгийн багадаа $1 тэмдэгттэй байх ёстой бөгөөд таны хэрэглэгчийн нэрнээс өөр байх ёстой.',
'mailmypassword'             => 'Мэйл хаягаар нууц үгийг илгээх',
'passwordremindertitle'      => '{{SITENAME}}-д нэвтрэх түр зуурын шинэ нууц үг',
'passwordremindertext'       => 'Хэн нэгэн (бодвол та, IP хаяг нь $1) {{SITENAME}}-д ($4) шинэ нууц үг явуулах хүсэлтийг тавьсан байна.
"$2" хэрэглэгчийн шинэ нууц үг "$3" боллоо.
Та одоо нэвтэрч нууц үгээ солих хэрэгтэй.

Хэрэв энэ хүсэлтийг өөр хүн тавьсан, эсвэл та хуучин нууц үгээ санаж солихыг хүсэхгүй байгаа бол та энэ мэйлийг тоохгүйгээр хуучин нууц үгээ хэвээр хэрэглэж болно.',
'noemail'                    => 'Хэрэглэгч "$1" нь мэйл хаягаа бүртгүүлээгүй байна.',
'passwordsent'               => '"$1"-н бүртгүүлсэн мэйл хаяг руу шинэ нууц үг илгээгдлээ.
Мэйлээ авсныхаа дараа дахин нэвтрээрэй.',
'blocked-mailpassword'       => 'Таны IP хаягаас засвар хийх эрхийг түгжсэн байгаа тул буруугаар ашиглахаас сэргийлэх үүднээс нууц үгийг сэргээхийг зөвшөөрөхгүй.',
'eauthentsent'               => 'Баталгаажуулах мэйл бүртгүүлсэн мэйл хаяг руу илгээгдлээ. 
Өөрийнхөө бүртгэлийг баталгаажуулахын тулд, өөр ямар нэг мэйл таны мэйл хаяг руу явуулагдахын өмнө тухай бүрийнхээ мэйл дэх зааврыг дагана уу.',
'throttled-mailpassword'     => 'Сүүлийн $1 цагт нууц үгийг сануулах мэйлийг явуулсан.
Буруугаар ашиглахаас сэргийлэх үүднээс $1 цагт нэг л удаа явуулах боломжтой.',
'mailerror'                  => 'Мэйл илгээхэд алдаа гарлаа: $1',
'acct_creation_throttle_hit' => 'Уучлаарай, та аль хэдийнээ $1 тооны хэрэглэгчийн бүртгэл үүсгэсэн байна.
Та дахин үүсгэж болохгүй.',
'emailauthenticated'         => 'Таны мэйл хаяг $1-нд баталгаажлаа.',
'emailnotauthenticated'      => 'Таны мэйл хаяг баталгаажаагүй байна.
Иймд доорх функцуудын алинд нь ч мэйл илгээгдэхгүй.',
'noemailprefs'               => 'Эдгээр функцуудыг ашиглахад мэйл хаягаа өгөх хэрэгтэй.',
'emailconfirmlink'           => 'Мэйл хаягаа баталгаажуулах',
'invalidemailaddress'        => 'Таны мэйл хаяг нь хүчингүй форматтай байгаа тул зөвшөөрөгдөхгүй.
Хүчинтэй форматтай майл хаягыг оруул, эсвэл талбарыг хоослоно уу.',
'accountcreated'             => 'Бүртгэл үүсгэгдлээ',
'accountcreatedtext'         => '$1 хэрэглэгчийн бүртгэл үүсгэгдлээ.',
'createaccount-title'        => '{{SITENAME}}-н бүртгэлийн үүсгэл',
'createaccount-text'         => 'Хэн нэгэн {{SITENAME}}-д ($4) "$2" нэртэй, "$3" нууц үгтэй бүртгэлийг энэ мэйл хаягт үүсгэжээ.
Та одоо нэвтэрч өөрийн нууц үгээ солих хэрэгтэй.

Хэрэв энэ бүртгэлийг алдаа гаргаж үүсгэсэн бол энэ мэдэгдлийг үл ойшоож болно.',
'loginlanguagelabel'         => 'Хэл: $1',

# Password reset dialog
'resetpass'               => 'Нууц үгээ дахин тогтоох',
'resetpass_announce'      => 'Та мэйлээр илгээгдсэн түр зуурын нууц үгээр нэвтэрч орсон байна
Бүрэн нэвтэрэхэд та энд шинэ нууц үгээ оруулах хэрэгтэй:',
'resetpass_header'        => 'Нууц үгээ дахин тогтоох',
'resetpass_submit'        => 'Нууц үгээ тогтоож нэвтрэх',
'resetpass_success'       => 'Таны нууц үг амжилттай солигдлоо! Та одоо нэвтэрч байна...',
'resetpass_bad_temporary' => 'Хүчингүй түр зуурын нууц үг байна.
Та аль хэдийнээ нууц үгээ сольсон, эсвэл шинэ түр зуурын нууц үг авах хүсэлтийг тавьсан байж магадгүй.',
'resetpass_forbidden'     => '{{SITENAME}}-д нууц үгийг солих боломжгүй',
'resetpass_missing'       => 'Формын тоо баримт алга.',

# Edit page toolbar
'bold_sample'     => 'Тодруулсан текст',
'bold_tip'        => 'Тодруулсан текст',
'italic_sample'   => 'Налуу текст',
'italic_tip'      => 'Налуу текст',
'link_sample'     => 'Холбоосны нэр',
'link_tip'        => 'Дотоод холбоос',
'extlink_sample'  => 'http://www.example.com холбоосны нэр',
'extlink_tip'     => 'Гадаад холбоос (эхэнд нь http:// бичихээ мартуузай)',
'headline_sample' => 'Гарчигийн текст',
'headline_tip'    => '2-р түвшний гарчиг',
'math_sample'     => 'Энд томъёогоо оруулна уу',
'math_tip'        => 'Математикийн томъёо (LaTeX)',
'nowiki_sample'   => 'Энд хэлбэршүүлээгүй текстээ оруулна уу',
'nowiki_tip'      => 'Вики форматыг хэрэглэхгүй байх',
'image_sample'    => 'жишээ.jpg',
'image_tip'       => 'Оруулсан файл',
'media_tip'       => 'Файлын холбоос',
'sig_tip'         => 'Таны бичлэг үйлдсэн цагтай гарын үсэг',
'hr_tip'          => 'Хөндлөн шугам (бага хэрэглээрэй)',

# Edit pages
'summary'                   => 'Товч агуулга',
'subject'                   => 'Сэдэв/гарчиг',
'minoredit'                 => 'Энэ бол бага зэргийн засвар',
'watchthis'                 => 'Энэ хуудсыг хяна',
'savearticle'               => 'Хуудсыг хадгалах',
'preview'                   => 'Урьдчилж харах',
'showpreview'               => 'Урьдчилж харах',
'showlivepreview'           => 'Шууд байдлаар урьдчилж харах',
'showdiff'                  => 'Өөрчлөлтүүдийг харуул',
'anoneditwarning'           => "'''Анхаар:''' Та нэвтрээгүй байна.
Энэ хуудасны засварын түүхэнд таны IP хаяг хадгалагдана.",
'missingsummary'            => "'''Сануулга:''' Та засварынхаа товч агуулгын тухай оруулаагүй байна.
Хэрэв та Хадгалах товчийг дахин дарвал таны засвар товч агуулгагүйгээр хадгалагдана.",
'missingcommenttext'        => 'Доор санал бодлоо оруулна уу.',
'missingcommentheader'      => "'''Сануулга:''' Та энэ санал бодлынхоо гарчигийг бичээгүй байна.
Хэрэв та Хадгалах товчийг дахин дарвал таны засвар гарчиггүй хадгалагдах болно.",
'summary-preview'           => 'Товч агуулгын урьдчилж харсан байдал',
'subject-preview'           => 'Сэдэв/гарчигийн урьдчилж харсан байдал',
'blockedtitle'              => 'Хэрэглэгч түгжигдлээ.',
'blockedtext'               => "<big>'''Таны хэрэглэгчийн нэр эсвэл IP хаяг түгжигдсэн байна.'''</big>

Түгжээг $1 хийсэн. Шалтгаан нь ''$2'' байна.

* Түгжээ эхлэсэн огноо: $8
* Түгжээ дуусах огноо: $6
* Түгжигдсэн: $7

Та $1 эсвэл бусад [[{{MediaWiki:Grouppage-sysop}}|администраторуудтай]] харилцаж түгжээнийхээ талаар хэлэлцэж болно.
Таны [[Special:Preferences|хувийн тохиргоонд]] мэйл хаяг заагдсан, мөн үүнийгээ хэрэглэхээс түгжигдээгүй үед л 'энэ хэрэглэгчид мэйл илгээх' функцийг хэрэглэх боломжтой.
Таны одоогийн IP хаяг бол $3, түгжээний ID нь #$5 байна. Түгжээний талаарх хэлэлцүүлэгт энэ хоёрыг заавал оруулаарай.",
'autoblockedtext'           => 'Таны IP хаягийг өөр хэрэглэгч хэрэглэж, тэр хэрэглэгчийг $1 түгжсэн тул автоматаар түгжигдсэн байна.
Шалтгаан нь:

:\'\'$2\'\'

* Түгжээ эхлэсэн огноо: $8
* Түгжээ дуусах огноо: $6

Та $1 эсвэл бусад [[{{MediaWiki:Grouppage-sysop}}|администраторуудтай]] харилцаж түгжээнийхээ талаар хэлэлцэж болно.

Таны [[Special:Preferences|хувийн тохиргоонд]] мэйл хаяг заагдсан, мөн үүнийгээ хэрэглэхээс түгжигдээгүй үед л "энэ хэрэглэгчид мэйл илгээх" функцийг хэрэглэх боломжтой.

Таны түгжээний ID $5 байна.
Түгжээний талаарх хэлэлцүүлэгт үүнийгээ заавал оруулаарай.',
'blockednoreason'           => 'шалтгаан өгөгдөөгүй байна',
'blockedoriginalsource'     => "'''$1'''-н кодыг доор үзүүлэв:",
'blockededitsource'         => "Таны '''$1'''-д хийж байгаа '''засваруудын''' текстийг доор үзүүлэв:",
'whitelistedittitle'        => 'Засварлахын тулд холбогдох шаардлагатай',
'whitelistedittext'         => 'Хуудсуудад засвар хийхийн тулд та урьдаар $1 хэрэгтэй.',
'confirmedittitle'          => 'Засварлахын тулд мэйлийн баталгаа шаардлагатай',
'confirmedittext'           => 'Та хуудсуудыг засварлахдаа мэйл хаягаа баталгаажуулах хэрэгтэй.
[[Special:Preferences|Хэрэглэгчийн тохиргоо]] хэсэгт өөрийнхөө мэйл хаягийг оруулж, баталгаажуулна уу.',
'nosuchsectiontitle'        => 'Тийм хэсэг байхгүй байна',
'nosuchsectiontext'         => 'Та оршдоггүй хэсгийг засварлах гэж оролдлоо.
$1 гэсэн хэсэг байхгүй учраас, таны засварыг хадгалах газар байхгүй байна.',
'loginreqtitle'             => 'Нэвтэрсэн байх шаардлагатай',
'loginreqlink'              => 'Нэвтрэх',
'loginreqpagetext'          => 'Та бусад хуудсуудыг үзэхийн тулд $1 хэрэгтэй.',
'accmailtitle'              => 'Нууц үг илгээгдлээ.',
'accmailtext'               => '"$1"-н нууц үг нь $2 руу илгээгдлээ.',
'newarticle'                => '(Шинэ)',
'newarticletext'            => "Таны орохыг хүссэн хуудас байхгүй байна. Энэ хуудсыг шинээр үүсгэхийн тулд доорх талбарт мэдээллээ оруулна уу (дэлгэрэ
нгүй мэдээллийг [[{{MediaWiki:Helppage}}|тусламжийн хуудсаас]] авч болно).
Хэрэв та энд санамсаргүйгээр орж ирсэн бол броузерийнхаа '''back''' товчийг дар.",
'anontalkpagetext'          => "----''Энэ нь хараахан бүртгүүлээгүй байгаа буюу хэрэглэгчийн нэр хэрэглэхгүй байгаа хэрэглэгчийн хэлэлцүүлгийн хуудас болно. Бид ийм хэрэглэгчдийг тогтоохын тулд IP хаягийг нь ашигладаг.
Нэг IP хаягийг хэд хэдэн хэрэглэгч хамтран ашиглаж байх магадлалтай. Хэрвээ таны IP хаягт ирсэн санал хүсэлтүүд танд хандаагүй бөгөөд та цаашид ийм байдал үүсэхээс сэргийлье гэвэл [[Special:UserLogin|бүртгүүлэх буюу нэвтрэхийг]] хүсье.''",
'noarticletext'             => 'Одоогийн байдлаар энэ хуудсанд текст алга. Та нэг бол энэ хуудасны нэрээр бусад хуудсуудад [[Special:Search/{{PAGENAME}}|хайлт хийх]], эсвэл энэ хуудсыг [{{fullurl:{{FULLPAGENAME}}|action=edit}} засварлаж] болно.',
'userpage-userdoesnotexist' => '"$1" хэрэглэгчийн бүртгэл бүртгэгдээгүй байна. Та энэ хуудсыг үүсгэх/засварлах тухайгаа дахин тунгааж бодно уу.',
'clearyourcache'            => "'''Санамж:''' Хадгалсныхаа дараа шинэ тохиргоогоо харахын тулд броузерынхаа кешийг орхих хэрэгтэй болж магадгүй. '''Мозилла / Файрфокс / Сафари:''' ''Shift''-г дарж байхдаа ''Reload'' дээр дар, эсвэл ''Ctrl-Shift-R'' гэж дар (Макинтош дээр ''Cmd-Shift-R''); '''Интернэт Эксплорер:''' ''Ctrl'' -г дарж байхдаа ''Refresh'' дээр дар, эсвэл ''Ctrl-F5'' гэж дар; '''Конкерор:''' ''Reload'' товч дээр л дар, эсвэл ''F5''-г дар; '''Опера'''-гийн хэрэглэгчид кешийг ''Tools→Preferences'' дээр бүрэн арилгах шаардлагатай болж магадгүй.",
'usercssjsyoucanpreview'    => "<strong>Зөвлөгөө:</strong> 'Урьдчилан харах' товчийг ашиглан та өөрийн шинэ CSS/ЖаваСкриптийг хадгалахаасаа өмнө шалгах боломжтой.",
'usercsspreview'            => "'''Та өөрийн хэрэглэгчийн CSS-г зөвхөн урьдчилан харж байгаа бөгөөд энэ нь хараахан хадгалагдаагүй байгаа гэдгийг анхаарна уу!'''",
'userjspreview'             => "'''Та өөрийн хэрэглэгчийн ЖаваСкриптийг зөвхөн урьдчилан харж байгаа бөгөөд энэ нь хараахан хадгалагдаагүй байгаа гэдгийг анхаарна уу!'''",
'userinvalidcssjstitle'     => "'''Анхаар:''' \"\$1\" гэсэн арьс байхгүй байна.
Өөрсдийн .css болон .js хуудсуудыг нэрлэхэд жижиг үсэг хэрэглэдэг болохыг сануулж байна. Жишээ нь: {{ns:user}}:Foo/monobook.css гэж л хэрэглэх бөгөөд {{ns:user}}:Foo/Monobook.css гэхгүй.",
'updated'                   => '(Шинэчлэгдсэн)',
'note'                      => '<strong>Анхааруулга:</strong>',
'previewnote'               => '<strong>Энэ бол зөвхөн урьдчилж харсан байдал; засварууд одоохондоо хадгалагдаагүй байна!</strong>',
'previewconflict'           => 'Энэ урьдчилж харсан байдал нь дээд талын засварлах талбарын текстийг хадгалахад харагдах байдлыг харуулна.',
'session_fail_preview'      => '<strong>Уучлаарай! Мэдээлэл алдагдснаас болж таны засварыг боловсруулж чадсангүй. Дахин оролдож үзнэ үү. Ингээд ч болохгүй байвал сайтаас гарч дахин нэвтэрч орж үзнэ үү.</strong>',
'session_fail_preview_html' => '<strong>Уучлаарай! Мэдээлэл алдагдснаас болж таны засварыг боловсруулж чадсангүй.</strong>

{{SITENAME}} нь түүхий HTML-г хэрэглэж байгаа тул урьдчилж харсан байдал нь ЖаваСкриптийн довтолгооноос сэргийлж нуугдсан байдалтай байна.

<strong>Хэрэв энэ нь жинхэнэ засварлах оролдлого бол дахин оролдож үзнэ үү. Ингээд ч болохгүй бол сайтаас гарч дахин нэвтэрч үзнэ үү.</strong>',
'token_suffix_mismatch'     => '<strong>Таны вэб түнш засварын тэмдэглэгээг гажуудуулсан тул таны засварыг хүлээж авсангүй.
Хуудасны текстийг бүрэн бүтэн байлгах үүднээс засварыг хүлээж авсангүй.
Энэ нь алдаа ихтэй вэбийн нэргүй прокси хэрэглэх үед заримдаа гардаг.</strong>',
'editing'                   => '$1-г засварлаж байна',
'editingsection'            => '$1-г засварлаж байна (хэсэг)',
'editingcomment'            => '$1-г засварлаж байна (товч агуулга)',
'editconflict'              => 'Засварын зөрөлдөөн боллоо: $1',
'explainconflict'           => "Та энэ хуудсыг засварлаж эхэлснээс хойш өөр хэн нэгэн өөрчилжээ.
Дээд талын текстийн талбарт одоогийн хуудасны байдал харагдаж байна.
Таны өөрчлөлтүүд доод талын текстийн талбарт харагдаж байна.
Та өөрийн засваруудаа одоогийн хуудасны байдалтай нэгтгэх хэрэгтэй.
\"Хуудсыг хадгалах\" товчийг дарахад '''зөвхөн''' дээд талын текстийн талбарт буй текст л хадгалагдана.",
'yourtext'                  => 'Таны текст',
'storedversion'             => 'Хадгалагдсан хувилбар',
'nonunicodebrowser'         => '<strong>АНХААР: Таны броузер юникод стандартыг дагадаггүй юм байна. ASCII-биш үсгүүд засварлах талбарт код байдалтай харагдана. Иймээс броузераа тохируулах, эсвэл өөрчилнө үү.</strong>',
'editingold'                => '<strong>АНХААР: Та энэ хуудасны хуучирсан хувилбарт засвар хийж байна.
Хэрэв та хадгалавал энэ хувилбараас хойш хийгдсэн засварууд алдагдах болно.</strong>',
'yourdiff'                  => 'Өөрчлөлтүүд',
'copyrightwarning'          => '{{SITENAME}}-д оруулсан бүх хувь нэмэр $2-н хувьд (дэлгэрэнгүй мэдээллийг $1-ээс авна уу) тавигддаг болохыг анхаарна уу. Хэрэв та өөрийн бичлэгээ бусдад засварлуулах, тараагдуулахыг хүсэхгүй байгаа бол энд битгий оруулаарай.<br />
Та мөн үүнийг өөрөө бичсэн, эсвэл нийтийн өмчид тавигдсан бүтээлийг хуулж тавьсан гэдгээ амласан байгаа.
<strong>ЗОХИОГЧИЙН ЭРХ БҮХИЙ БҮТЭЭЛИЙГ ЗӨВШӨӨРӨЛГҮЙГЭЭР ТАВИХИЙГ ХОРИГЛОНО!</strong>',
'copyrightwarning2'         => '{{SITENAME}}-д оруулсан бүх хувь нэмрийг бусад хэрэглэгчид засварлаж, өөрчилж, устгаж болдгийг анхаарна уу.
Хэрэв та өөрийн үйлдсэн бичлэгээ бусдад засварлуулахыг хүсэхгүй байгаа бол энд бүү оруулна уу.
Та мөн үүнийг өөрөө бичсэн, эсвэл нийтийн өмчид тавигдсан (дэлгэрэнгүй мэдээллийг $1-ээс авна уу) бүтээлийг хуулж тавьсан гэдгээ амласан байгааг анхаараарай.
<strong>ЗОХИОГЧИЙН ЭРХ БҮХИЙ БҮТЭЭЛИЙГ ЗӨВШӨӨРӨЛГҮЙГЭЭР ТАВИХИЙГ ХОРИГЛОНО!</strong>',
'longpagewarning'           => '<strong>АНХААР: Энэ хуудас $1 килобайт урттай байна; зарим броузеруудад 32 килобайт орчим буюу түүнээс урт хуудсыг засварлахад хүндрэлтэй байж магадгүй.
Хуудсыг жижиг хэсгүүдэд хувааж засварлахыг санал болгоё.</strong>',
'longpageerror'             => '<strong>АЛДАА: Таны оруулсан текст нь $1 килобайт урттай байгаа бөгөөд энэ нь дээд хэмжээ болох $2 килобайтаас илүү урт байна.
Хадгалах боломгүй байна.</strong>',
'readonlywarning'           => '<strong>АНХААР: Мэдээллийн сан нь техникийн үзлэг хийхээр түр зуур түгжигдсэн байгаа тул та одоохондоо засваруудаа хадгалах боломжгүй байна.
Та текстээ компьютертаа хадгалж дараа нь энд хадгалахыг санал болгоё.</strong>',
'protectedpagewarning'      => '<strong>АНХААР:  Энэ хуудас нь зөвхөн системийн операторууд л засварлаж болохоор түгжигдсэн байна.</strong>',
'semiprotectedpagewarning'  => "'''Анхаар''': Энэ хуудас нь зөвхөн бүртгэгдсэн хэрэглэгчид л засварлаж болохоор түгжигдсэн байна.",
'cascadeprotectedwarning'   => "'''Анхаар''': Энэ хуудас нь зөвхөн системийн операторууд л засварлаж болохоор түгжигдсэн байна. Учир нь энэ хуудас дараах давхар хамгаалалттай {{PLURAL:$1|хуудаст|хуудсуудад}} оржээ:",
'titleprotectedwarning'     => '<strong>АНХААР:  Энэ хуудас нь зарим хэрэглэгчид л үүсгэж болохоор түгжигдсэн байна.</strong>',
'templatesused'             => 'Энэ хуудсанд ашиглагдаж буй загварууд:',
'templatesusedpreview'      => 'Энэ урьдчилж харсан байдалд ашиглагдаж буй загварууд:',
'templatesusedsection'      => 'Энэ хэсэгт ашиглагдаж буй загварууд:',
'template-protected'        => '(хамгаалагдсан)',
'template-semiprotected'    => '(хагас-хамгаалагдсан)',
'hiddencategories'          => 'Энэ хуудас нь $1 нуугдсан ангилалд багтаж байна:',
'nocreatetitle'             => 'Хуудасны үүсгэл хязгаарлагдсан байна',
'nocreatetext'              => '{{SITENAME}} нь шинэ хуудас үүсгэх явдлыг хаасан байна.
Та буцаад хуучин байсан хуудсыг засварлах, эсвэл [[Special:UserLogin|нэвтэрч орох буюу бүртгүүлж болно]].',
'nocreate-loggedin'         => 'Таньд {{SITENAME}} дээр шинэ хуудас үүсгэх зөвшөөрөл байхгүй байна.',
'permissionserrors'         => 'Зөвшөөрлүүдийн алдаанууд',
'permissionserrorstext'     => 'Таньд үүнийг хийх зөвшөөрөл байхгүй байна. {{PLURAL:$1|Шалтгаан|Шалтгаанууд}} нь:',
'recreate-deleted-warn'     => "'''Анхаар: Та өмнө нь устгагдсан хуудсыг дахин үүсгэх гэж байна.'''

Та энэ хуудсанд засвар хийх нь зүйтэй юу гэж бодох хэрэгтэй.
Энэ хуудасны устгалын лог хэрэг болж магадгүй тул доор байна:",

# Parser/template warnings
'expensive-parserfunction-warning'  => 'Анхаар: Энэ хуудсанд хэт олон парсер функцийн дуудлагууд байна.

$2-с доош байх ёстой, харин одоо $1 байна.',
'expensive-parserfunction-category' => 'Хэт олон парсер функцийн дуудлагатай хуудсууд',

# "Undo" feature
'undo-success' => 'Засвар буцаагдаж болно. Доорх харьцуулалтыг шалгаж үнэхээр хиймээр байгаа зүйл мөн үү гэдгээ нотлоорой. Дараа нь засварыг дуусгахын тулд өөрчлөлтүүдээ хадгална уу.',
'undo-failure' => 'Хоорондын засваруудаас болж засвар буцаагдах боломжгүй байна.',
'undo-summary' => '[[Special:Contributions/$2|$2]] ([[User talk:$2|Яриа]]) хэрэглэгчийн $1-р засварыг буцаах',

# Account creation failure
'cantcreateaccounttitle' => 'Хэрэглэгчийн бүртгэлийг үүсгэж чадсангүй.',
'cantcreateaccount-text' => "[[User:$3|$3]] нь энэ IP хаягаас ('''$1''') бүртгэл үүсгэх эрхийг түгжсэн байна.

$3-н тодорхойлсон шалтгаан нь ''$2''",

# History pages
'viewpagelogs'        => 'Энэ хуудасны логийг үзэх',
'nohistory'           => 'Хуудсанд засвар хийсэн түүх байхгүй байна.',
'revnotfound'         => 'Засвар олдсонгүй',
'revnotfoundtext'     => 'Таны орохыг хүссэн хуудасны хуучин засвар олдсонгүй. Энэ хуудас руу явахад хэрэглэсэн URL-ээ шалгана уу.',
'currentrev'          => 'Одоогийн засвар',
'revisionasof'        => '$1-ий байдлаарх засвар',
'revision-info'       => '$1-ий байдлаарх $2 хэрэглэгчийн хийсэн засвар',
'previousrevision'    => '←Хуучны засвар',
'nextrevision'        => 'Дараагийн засвар→',
'currentrevisionlink' => 'Одоогийн засвар',
'cur'                 => 'одоогийн',
'next'                => 'дараагийн',
'last'                => 'сүүлийн',
'page_first'          => 'эхний',
'page_last'           => 'сүүлийн',
'histlegend'          => 'Өөрчлөлтүүдийг сонгох: харьцуулж үзэхийн тулд хувилбаруудын өмнөх хайрцагыг сонгож нэг бол "enter" товчлуурыг, эсвэл доорх товчлуурыг дараарай.<br />
Тэмдэг: (одоогийн) = одоогийн засвартай харьцуулах
(сүүлчийн) = өмнөх засвартай харьцуулах, Б = бага зэргийн засвар',
'deletedrev'          => '[устгагдсан]',
'histfirst'           => 'Эхний',
'histlast'            => 'Сүүлийн',
'historysize'         => '($1 байт)',
'historyempty'        => '(хоосон байна)',

# Revision feed
'history-feed-title'          => 'Засварын түүх',
'history-feed-description'    => 'Вики дэх энэ хуудасны засварын түүх',
'history-feed-item-nocomment' => '$2 дээрх $1', # user at time
'history-feed-empty'          => 'Таны үзэх гэсэн хуудас байхгүй байна.
Викигээс устгагдсан юмуу нэр нь өөрчлөгдсөн байж магадгүй.
[[Special:Search|Викид хайлт хийж]] үзнэ үү.',

# Revision deletion
'rev-deleted-comment'         => '(товч агуулгын тухай мэдээлэл арилгагдсан байна)',
'rev-deleted-user'            => '(хэрэглэгчийн нэр арилгагдсан байна)',
'rev-deleted-event'           => '(логийн үйлдэл арилгагдсан байна)',
'rev-deleted-text-permission' => '<div class="mw-warning plainlinks">
Энэ хуудасны засвар нийтийн архиваас арилгагдсан байна.
[{{fullurl:Special:Log/delete|page={{FULLPAGENAMEE}}}} Устгалын логт] дэлгэрэнгүй мэдээлэл байж магадгүй.</div>',
'rev-deleted-text-view'       => '<div class="mw-warning plainlinks">
Энэ хуудасны засвар нийтийн архиваас арилгагдсан байна. Та {{SITENAME}}-д администратор учраас харах боломжтой;
[{{fullurl:Special:Log/delete|page={{FULLPAGENAMEE}}}} устгалын логт] дэлгэрэнгүй мэдээлэл байж магадгүй.</div>',
'rev-delundel'                => 'үзүүлэх/нуух',
'revisiondelete'              => 'Засваруудыг устгах/сэргээх',
'revdelete-nooldid-title'     => 'Зорьсон засвар байхгүй байна',
'revdelete-nooldid-text'      => 'Та нэг бол энэ үйлдлийг хийхэд зорьсон засвар(ууд)ыг тодорхойлоогүй, зорьсон засвар нь байхгүй, эсвэл одоогийн засварыг нуух гэж байна.',
'revdelete-selected'          => '[[:$1]]-н {{PLURAL:$2|сонгосон засвар|сонгосон засварууд}}:',
'logdelete-selected'          => '{{PLURAL:$1|Сонгосон логийн үйл явдал|Сонгосон логийн үйл явдлууд}}:',
'revdelete-text'              => 'Устгагдсан засварууд ба үйл явдлууд нь хуудасны түүх болон логуудад харагдах боловч агуулгынх нь зарим хэсгүүд нийтэд үл үзэгдэнэ.

Нуугдсан агуулга нь {{SITENAME}}-н бусад администраторуудад харагдах бөгөөд, нэмэлт хязгааруудууд тавигдахгүй бол дахин сэргээгдэх боломжтой.',
'revdelete-legend'            => 'Харагдах байдалд хязгаар тавих',
'revdelete-hide-text'         => 'Засварын текстийг нуух',
'revdelete-hide-name'         => 'Объект ба түүнд хийсэн үйлдлийг нуух',
'revdelete-hide-comment'      => 'Засварын товч агуулгыг нуух',
'revdelete-hide-user'         => 'Засварлагчийн хэрэглэгчийн нэр/IP хаягийг нуух',
'revdelete-hide-restricted'   => 'Эдгээр хязгаарлалтуудыг системийн операторуудад үйлчлүүлж энэ харагдах байдлыг түгжих',
'revdelete-suppress'          => 'Системийн операторууд болон бусдаас мэдээллийг нууцлах',
'revdelete-hide-image'        => 'Файлын агуулыг нуух',
'revdelete-unsuppress'        => 'Сэргээгдсэн засварууд дахь хязгаарлалтуудыг авч хаях',
'revdelete-log'               => 'Логийн товч агуулга:',
'revdelete-submit'            => 'Сонгосон засварт үйлчлүүлэх',
'revdelete-logentry'          => '[[$1]]-н засварын харагдах байдлыг өөрчиллөө',
'logdelete-logentry'          => '[[$1]]-н үйл явдлын харагдах байдлыг өөрчиллөө',
'revdelete-success'           => "'''Засварын харагдах байдлыг тохирууллаа.'''",
'logdelete-success'           => "'''Логийн харагдах байдлыг тохирууллаа.'''",
'revdel-restore'              => 'Харагдах байдлыг өөрчлөх',
'pagehist'                    => 'Хуудасны түүх',
'deletedhist'                 => 'Устгагдсан түүх',
'revdelete-content'           => 'агуулга',
'revdelete-summary'           => 'засварын товч агуулга',
'revdelete-uname'             => 'хэрэглэгчийн нэр',
'revdelete-restricted'        => 'системийн операторуудад тавигдсан хязгаарлалтууд',
'revdelete-unrestricted'      => 'системийн операторуудаас авч хаясан хязгаарлалтууд',
'revdelete-hid'               => 'нуугдсан $1',
'revdelete-unhid'             => 'нууцлахаа болиулсан $1',
'revdelete-log-message'       => '$2 засварт $1',
'logdelete-log-message'       => '$2 үйл явдалд $1',

# Suppression log
'suppressionlog'     => 'Хязгаарлалтын лог',
'suppressionlogtext' => 'Доорх нь сиестемийн операторуудаас нууцалсан агуулгатай холбоотой устгал ба түгжээнүүдийн жагсаалт юм.
[[Special:IPBlockList|IP түгжээний жагсаалтыг]] үзэж одоо хэрэгжиж буй хорио ба түгжээг харна уу.',

# History merging
'mergehistory'                     => 'Хуудсуудын түүхийг нэгтгэх',
'mergehistory-header'              => 'Энэ хуудас нь нэг хуудасны засварын түүхийг шинэ хуудастай нэгтгэх боломжийг олгоно.
Энэ өөрчлөлт түүхийн тасралтгүй байдалд нөлөөлөхгүй гэдгийг батлаарай.',
'mergehistory-box'                 => 'Хоёр хуудасны засваруудыг нэгтгэх:',
'mergehistory-from'                => 'Эх үүсвэр хуудас:',
'mergehistory-into'                => 'Зорьсон хуудас:',
'mergehistory-list'                => 'Нэгтгэж болох засварын түүх',
'mergehistory-merge'               => '[[:$1]]-н дараах засваруудыг [[:$2]] руу нэгтгэх боломжтой.
Сонгох товчлууруудыг тогтсон огноонд болон түүний өмнөх засваруудыг л нэгтгэхэд ашиглана уу.
Залуурдлагын холбоосуудыг ашиглавал товчлуурууд анхны байдалдаа эргэж орно гэдгийг анхаараарай.',
'mergehistory-go'                  => 'Нэгтгэж болох засваруудыг үзүүлэх',
'mergehistory-submit'              => 'Засваруудыг нэгтгэх',
'mergehistory-empty'               => 'Ямар ч засварыг нэгтгэх боломжгүй байна.',
'mergehistory-success'             => '[[:$1]]-н $3 засварыг [[:$2]] руу нэгтгэлээ.',
'mergehistory-fail'                => 'Түүхийг нэгтгэх боломжгүй байна. Хуудас болон огноогийн параметрийг дахин шалгаж үзнэ үү.',
'mergehistory-no-source'           => '$1 эх үүсвэр хуудас байхгүй байна.',
'mergehistory-no-destination'      => '$1 зорьсон хуудас байхгүй байна.',
'mergehistory-invalid-source'      => 'Эх үүсвэр хуудас хүчинтэй гарчигтай байх ёстой.',
'mergehistory-invalid-destination' => 'Зорьсон хуудас хүчинтэй гарчигтай байх ёстой.',
'mergehistory-autocomment'         => '[[:$1]]-г [[:$2]] руу нэгтгэлээ',
'mergehistory-comment'             => '[[:$1]]-г [[:$2]] руу нэгтгэлээ: $3',

# Merge log
'mergelog'           => 'Нэгтгэлийн лог',
'pagemerge-logentry' => '[[$1]]-г [[$2]] руу нэгтгэлээ ($3 хүртэлх засварууд)',
'revertmerge'        => 'Нэгтгэлийг буцаах',
'mergelogpagetext'   => 'Доорх нь нэг хуудасны түүхийг өөр түүхтэй нэгтгэсэн хамгийн сүүлийн нэгтгэлүүд юм.',

# Diffs
'history-title'           => '"$1"-н засварын түүх',
'difference'              => '(Засварууд хоорондын ялгаа)',
'lineno'                  => '$1-р мөр:',
'compareselectedversions' => 'Сонгосон хувилбаруудыг харьцуулах',
'editundo'                => 'буцаах',
'diff-multi'              => 'Завсрын $1 засварыг үзүүлээгүй байна.',

# Search results
'searchresults'             => 'Хайлтын үр дүн',
'searchresulttext'          => '{{SITENAME}}-с хайх тухай дэлгэрэнгүй мэдээллийг [[{{MediaWiki:Helppage}}|{{int:help}}]] хуудаснаас авна уу.',
'searchsubtitle'            => "Та '''[[:$1]]''' гэж хайлаа",
'searchsubtitleinvalid'     => "Та '''$1''' гэж хайлаа",
'noexactmatch'              => '"$1" гэсэн гарчигтай хуудас байхгүй байна.\'\'\' Та [[:$1|энэ хуудсыг үүсгэх]] боломжтой.',
'noexactmatch-nocreate'     => "'''\"\$1\" гэсэн гарчигтай хуудас байхгүй байна.'''",
'toomanymatches'            => 'Хэт олон илэрц илэрлээ. Өөр үгээр хайна уу.',
'titlematches'              => 'Хуудасны гарчигтай таарсан хуудсууд',
'notitlematches'            => 'Хуудасны гарчигтай таарсан хуудсууд байхгүй байна',
'textmatches'               => 'Хуудасны тексттэй таарсан хуудсууд',
'notextmatches'             => 'Хуудасны тексттэй таарсан хуудсууд байхгүй байна',
'prevn'                     => 'өмнөх $1',
'nextn'                     => 'дараагийн $1',
'viewprevnext'              => 'Үзэх: ($1) ($2) ($3)',
'search-result-size'        => '$1 ($2 үг)',
'search-result-score'       => 'Холбоо хамаарал: $1%',
'search-redirect'           => '($1-г шууд холбох)',
'search-section'            => '(хэсэг $1)',
'search-suggest'            => 'Та $1 гэж хайя гэсэн үү?',
'search-interwiki-caption'  => 'Ах дүү төслүүд',
'search-interwiki-default'  => '$1 үр дүн:',
'search-interwiki-more'     => '(илүү их)',
'search-mwsuggest-enabled'  => 'санаачлагатай',
'search-mwsuggest-disabled' => 'санаачлага байхгүй',
'search-relatedarticle'     => 'Холбоотой',
'mwsuggest-disable'         => 'AJAX саналуудыг болиулах',
'searchrelated'             => 'холбоотой',
'searchall'                 => 'бүгд',
'showingresults'            => "Доор #'''$2'''-с эхлэсэн '''$1''' илэрцийг үзүүлж байна.",
'showingresultsnum'         => "Доор #'''$2'''-с эхлэсэн '''$3''' илэрцийг үзүүлж байна.",
'showingresultstotal'       => "Доор '''$3'''-н '''$1 - $2''' хүртэлх илэрцийг үзүүлж байна.",
'nonefound'                 => "'''Анхаар''': Амжилтгүй хайлтууд нь голдуу \"байх\" зэрэг байнгын хэрэглэдэг үгнүүд оролцуулснаас болдог. Эсвэл нэгээс илүү үгээр хайснаас болдог. Бүх оролцуулсан үг орсон хуудсууд л илэрцэнд багтаж байдаг.",
'powersearch'               => 'Сонгож хайх',
'powersearch-legend'        => 'Сонгосон хайлт',
'search-external'           => 'Гадны хайлт',
'searchdisabled'            => '{{SITENAME}} хайлтыг түр хаасан байна.
Та одоохондоо Google-г ашиглан хайх боломжтой.
Анхааруулж хэлэхэд, тэдний {{SITENAME}}-н агуулгын индексүүд хоцрогдсон байж магадгүй.',

# Preferences page
'preferences'              => 'Хэрэглэгчийн тохиргоо',
'mypreferences'            => 'Миний тохиргоо',
'prefs-edits'              => 'Засваруудын тоо:',
'prefsnologin'             => 'Нэвтрээгүй байна',
'prefsnologintext'         => 'Хэрэглэгчийн тохиргоогоо тохируулахын тулд та [[Special:UserLogin|нэвтэрсэн байх]] шаардлагатай.',
'prefsreset'               => 'Тохиргоонуудыг анхны байдалд нь орууллаа.',
'qbsettings'               => 'Шуурхай тавцан',
'qbsettings-none'          => 'Байхгүй',
'qbsettings-fixedleft'     => 'Зүүн талд бэхжүүлсэн',
'qbsettings-fixedright'    => 'Баруун талд бэхжүүлсэн',
'qbsettings-floatingleft'  => 'Зүүн талд хөвсөн',
'qbsettings-floatingright' => 'Баруун талд хөвсөн',
'changepassword'           => 'Нууц үгээ өөрчлөх',
'skin'                     => 'Арьс',
'math'                     => 'Томъёонууд',
'dateformat'               => 'Огнооний хэлбэр',
'datedefault'              => 'Анхны байдал',
'datetime'                 => 'Огноо ба цаг',
'math_failure'             => 'Задлан ялгал хийж чадсангүй',
'math_unknown_error'       => 'үл мэдэгдэх алдаа',
'math_unknown_function'    => 'үл мэдэгдэх функц',
'math_lexing_error'        => 'лекслэхэд алдаа гарлаа',
'math_syntax_error'        => 'синтаксийн алдаа',
'math_image_error'         => 'PNG руух хувиргал амжилтгүй боллоо;
latex, dvips, gs, convert-г зөв суулгасан эсэхийг шалгана уу',
'math_bad_tmpdir'          => 'Математикийн түр зуурын каталогыг үүсгэх, эсвэл түүн руу хуулж чадсангүй',
'math_bad_output'          => 'Математикийн гадагшлуулах каталогыг үүсгэх, эсвэл түүн руу хуулж чадсангүй',
'math_notexvc'             => 'texvc программ олдохгүй байна;
math/README-г уншиж тохируулна уу.',
'prefs-personal'           => 'Хувийн тохируулга',
'prefs-rc'                 => 'Сүүлийн засварууд',
'prefs-watchlist'          => 'Хянах жагсаалт',
'prefs-watchlist-days'     => 'Хянах жагсаалтанд үзүүлэх өдрүүдийн тоо:',
'prefs-watchlist-edits'    => 'Дэлгэрүүлсэн хянах жагсаалтанд үзүүлэх дээд хэмжээний өөрчлөлтүүдийн тоо:',
'prefs-misc'               => 'Бусад',
'saveprefs'                => 'Хадгалах',
'resetprefs'               => 'Хадгалаагүй өөрчлөлтүүдийг арилгах',
'oldpassword'              => 'Хуучин нууц үг:',
'newpassword'              => 'Шинэ нууц үг:',
'retypenew'                => 'Шинэ нууц үгээ дахин оруулах:',
'textboxsize'              => 'Засварлаж байна',
'rows'                     => 'Мөр:',
'columns'                  => 'Багана:',
'searchresultshead'        => 'Хайлт',
'resultsperpage'           => 'Хуудас тус бүр дээрх илэрцийн тоо:',
'contextlines'             => 'Илэрц тус бүр дэх мөрийн тоо:',
'contextchars'             => 'Нэг мөр тус бүр дэх үгийн тоо:',
'stub-threshold'           => '<a href="#" class="stub">Түүхий холбоосийг</a> форматлах босго (байт):',
'recentchangesdays'        => 'Сүүлийн өөрчлөлтүүдэд үзүүлэх өдрийн тоо:',
'recentchangescount'       => 'Сүүлийн өөрчлөлтүүдэд үзүүлэх засварын тоо:',
'savedprefs'               => 'Таны тохиргоо хадгалагдлаа.',
'timezonelegend'           => 'Цагийн бүс',
'timezonetext'             => '¹Серверийн цаг (UTC) ба таны орон нутгийн цаг хоорондын зөрүү.',
'localtime'                => 'Орон нутгийн цаг',
'timezoneoffset'           => 'Зөрөө¹',
'servertime'               => 'Серверийн цаг',
'guesstimezone'            => 'Броузераас бөглөх',
'allowemail'               => 'Бусад хэрэглэгчдээс ирэх мэйлийг зөвшөөрөх',
'defaultns'                => 'Байнга эдгээр нэрний зайнуудад хайх:',
'default'                  => 'анхны байдал',
'files'                    => 'Файлууд',

# User rights
'userrights'                  => 'Хэрэглэгчдийн эрхийн удирдлага', # Not used as normal message but as header for the special page itself
'userrights-lookup-user'      => 'Хэрэглэгчдийн бүлгүүдийг удирдах',
'userrights-user-editname'    => 'Хэрэглэгчийн нэрээ оруулна уу:',
'editusergroup'               => 'Хэрэглэгчийн бүлгийг засварлах',
'editinguser'                 => "Дараах хэрэглэгчийн эрхийг засварлаж байна: '''[[User:$1|$1]]''' ([[User talk:$1|{{int:talkpagelinktext}}]] | [[Special:Contributions/$1|{{int:contribslink}}]])",
'userrights-editusergroup'    => 'Хэрэглэгчийн бүлгүүдийг засварлах',
'saveusergroups'              => 'Хэрэглэгчийн бүлгүүдийг хадгалах',
'userrights-groupsmember'     => 'Үүний гишүүн:',
'userrights-groups-help'      => 'Та энэ хэрэглэгчийн гишүүн болсон бүлгүүдийг өөрчлөх боломжтой.
Хайрцгийг тэмдэглэсэн байвал хэрэглэгч тэр бүлэгт байгаа, тэмдэглээгүй байвал бүлэгт байхгүй гэсэн үг.
<nowiki>*</nowiki> гэдэг нь нэгэнт нэмсэн бол бүлгийг авч болохгүй, эсвэл түүний эсрэгээр байна гэсэн үг.',
'userrights-reason'           => 'Өөрчилсөн шалтгаан:',
'userrights-no-interwiki'     => 'Таньд өөр викинүүдэд хэрэглэгчдийн эрхийг өөрчлөх зөвшөөрөл байхгүй.',
'userrights-nodatabase'       => '$1 мэдээллийн сан байхгүй, эсвэл дотоодынх биш байна.',
'userrights-nologin'          => 'Та хэрэглэгчдийн эрхийг хуваарилахбн тулд администраторын бүртгэлтэйгээр [[Special:UserLogin|нэвтэрч орох]] шаардлагатай.',
'userrights-notallowed'       => 'Таны бүртгэл хэрэглэгчдийн эрхийг хуваарилах зөвшөөрөлгүй байна.',
'userrights-changeable-col'   => 'Таны өөрчилж болох бүлгүүд',
'userrights-unchangeable-col' => 'Таны өөрчилж болохгүй бүлгүүд',

# Groups
'group'               => 'Бүлэг:',
'group-user'          => 'Хэрэглэгчид',
'group-autoconfirmed' => 'Автоматаар батлагдсан хэрэглэгчид',
'group-bot'           => 'Роботууд',
'group-sysop'         => 'Системийн операторууд',
'group-bureaucrat'    => 'Албаны ажилтангууд',
'group-suppress'      => 'Хянан зохицуулагчид',
'group-all'           => '(бүгд)',

'group-user-member'          => 'Хэрэглэгч',
'group-autoconfirmed-member' => 'Автоматаар батлагдсан хэрэглэгч',
'group-bot-member'           => 'Робот',
'group-sysop-member'         => 'Системийн оператор',
'group-bureaucrat-member'    => 'Албаны ажилтан',
'group-suppress-member'      => 'Хянан зохицуулагч',

'grouppage-user'          => '{{ns:project}}:Хэрэглэгчид',
'grouppage-autoconfirmed' => '{{ns:project}}:Автоматаар батлагдсан хэрэглэгчид',
'grouppage-bot'           => '{{ns:project}}:Роботууд',
'grouppage-sysop'         => '{{ns:project}}:Администраторууд',
'grouppage-bureaucrat'    => '{{ns:project}}:Албаны ажилтангууд',
'grouppage-suppress'      => '{{ns:project}}:Хянан зохицуулагчид',

# User rights log
'rightslog'      => 'Хэрэглэгчдийн эрхийн лог',
'rightslogtext'  => 'Энэ бол хэрэглэгчдийн эрхэд учруулсан өөрчлөлтүүдийн лог юм.',
'rightslogentry' => '$1-н бүлгийн гишүүнчлэлийг $2-с $3 болгож өөрчиллөө',
'rightsnone'     => '(байхгүй)',

# Recent changes
'nchanges'                          => '$1 өөрчлөлт',
'recentchanges'                     => 'Сүүлийн өөрчлөлтүүд',
'recentchangestext'                 => 'Энэхүү хуудсанд викид хийсэн хамгийн сүүлийн өөрчлөлтүүдийг үзүүлж байна.',
'recentchanges-feed-description'    => 'Вики дахь хамгийн сүүлийн өөрчлөлтүүдийг хянах.',
'rcnote'                            => "Доорх нь $5, $4-ий байдлаарх сүүлийн '''$2''' өдрийн турших '''$1''' засвар юм.",
'rcnotefrom'                        => "Доорх нь '''$2'''-с хойших өөрчлөлтүүд ('''$1''' хүртэл харуулагдсан) юм.",
'rclistfrom'                        => '$1-с хойших шинэ засваруудыг үзүүлэх',
'rcshowhideminor'                   => 'Бага зэргийн засваруудыг $1',
'rcshowhidebots'                    => 'Роботуудыг $1',
'rcshowhideliu'                     => 'Бүртгэлтэй хэрэглэгчдийг $1',
'rcshowhideanons'                   => 'Бүртгэлгүй хэрэглэгчдийг $1',
'rcshowhidepatr'                    => 'Хянагдаж буй засваруудыг $1',
'rcshowhidemine'                    => 'Миний засваруудыг $1',
'rclinks'                           => 'Сүүлийн $2 өдрийн турших $1 засварыг үзүүлэх<br />$3',
'diff'                              => 'ялгаа',
'hist'                              => 'түүх',
'hide'                              => 'нуух',
'show'                              => 'үзүүлэх',
'minoreditletter'                   => 'б',
'newpageletter'                     => 'Ш',
'boteditletter'                     => 'р',
'number_of_watching_users_pageview' => '[$1 хэрэглэгч харж байна]',
'rc_categories'                     => 'Ангиллуудад хязгаарлах ("|" тэмдгээр тусгаарлах)',
'rc_categories_any'                 => 'Хамаагүй',
'newsectionsummary'                 => '/* $1 */ шинэ хэсэг',

# Recent changes linked
'recentchangeslinked'          => 'Холбогдох өөрчлөлтүүд',
'recentchangeslinked-title'    => '"$1"-тай холбоотой засварууд',
'recentchangeslinked-noresult' => 'Өгөгдсөн хугацаанд холбогдсон хуудсууд дээр засвар хийгдээгүй байна.',
'recentchangeslinked-summary'  => "Энэ хуудас бол тодорхой хуудаснаас (эсвэл тодорхой ангиллын доторх хуудсууд) холбогдсон хуудсуудад хийгдсэн өөрчлөлтийн жагсаалт юм.
Таны [[Special:Watchlist|хянах жагсаалтанд]] буй хуудсууд '''тодруулагдсан''' байгаа.",
'recentchangeslinked-page'     => 'Хуудасны нэр:',
'recentchangeslinked-to'       => 'Оронд нь өгөгдсөн хуудсанд холбогдсон хуудсуудын өөрчлөлтүүдийг үзүүлэх',

# Upload
'upload'                      => 'Файл оруулах',
'uploadbtn'                   => 'Файл оруулах',
'reupload'                    => 'Дахин оруулах',
'reuploaddesc'                => 'Файл оруулалтыг цуцалж оруулах маягт руу буцах',
'uploadnologin'               => 'Нэвтрээгүй байна',
'uploadnologintext'           => 'Та файл оруулахын тулд [[Special:UserLogin|нэвтэрч орсон]] байх шаардлагатай.',
'upload_directory_read_only'  => 'Файл оруулах каталог ($1) нь вэбсерверт бичигдэх боломгүй байна.',
'uploaderror'                 => 'Файл оруулахад алдаа гарлаа',
'uploadtext'                  => "Доорх маягтыг хэрэглэж файлыг оруулна уу.
Өмнө нь оруулсан файлуудыг [[Special:ImageList|оруулсан файлуудын жагсаалтаас]] харна уу. Оруулсан ба устгасан файлуудын жагсаалт нь мөн [[Special:Log/upload|файл оруулалтын логт]] бий.

Хуудсанд файл оруулахад дараахийг хэрэглэнэ үү:
'''<nowiki>[[</nowiki>{{ns:image}}<nowiki>:Файл.jpg]]</nowiki>''',
'''<nowiki>[[</nowiki>{{ns:image}}<nowiki>:Файл.png|alt text]]</nowiki>''', эсвэл шууд холбоход
'''<nowiki>[[</nowiki>{{ns:media}}<nowiki>:Файл.ogg]]</nowiki>'''",
'upload-permitted'            => 'Оруулж болох файлын төрлүүд: $1.',
'upload-preferred'            => 'Хэрэглэхийг зөвлөж буй файлын төрлүүд: $1.',
'upload-prohibited'           => 'Оруулж болохгүй файлын төрлүүд: $1.',
'uploadlog'                   => 'файл оруулалтын лог',
'uploadlogpage'               => 'Файл оруулалтын лог',
'uploadlogpagetext'           => 'Доорх нь хамгийн сүүлд оруулсан файлуудын жагсаалт юм.',
'filename'                    => 'Файлын нэр',
'filedesc'                    => 'Товч агуулга',
'fileuploadsummary'           => 'Товч агуулга:',
'filestatus'                  => 'Зохиогчийн эрхийн статус:',
'filesource'                  => 'Эх сурвалж:',
'uploadedfiles'               => 'Оруулагдсан файлууд',
'ignorewarning'               => 'Анхааруулгыг үл тоомсорлон файлыг хадгалах',
'ignorewarnings'              => 'Ямар ч анхааруулгыг үл тоомсорлох',
'minlength1'                  => 'Файлын нэрүүд доод тал нь нэг үсгийн урттай байх ёстой.',
'illegalfilename'             => '"$1" файлын нэрэнд хуудасны нэрэнд хэрэглэхээс хориглосон үсгүүд байна. Файлынхаа нэрийг солиод дахин оруулна уу.',
'badfilename'                 => 'Файлын нэр нь "$1" болж өөрчлөгдлөө.',
'filetype-badmime'            => '"$1" MIME төрлийн файлуудыг оруулахыг хориглосон байна.',
'filetype-unwanted-type'      => "'''\".\$1\"''' файлын төрлийг битгий хэрэглээрэй. \$2 файлын төрлүүдийг ашиглахыг зөвлөж байна.",
'filetype-banned-type'        => "'''\".\$1\"''' нь оруулж болохгүй файлын төрөл юм. \$2 файлын төрлүүдийг оруулж болно.",
'filetype-missing'            => 'Энэ файлд өргөтгөл байхгүй байна (".jpg" гэх мэт).',
'large-file'                  => 'Файлуудын хэмжээ $1-с ихгүй байхыг зөвлөж байна;
энэ файл $2 байна.',
'largefileserver'             => 'Энэ файл серверийн зөвшөөрсөн хэмжээнээс том байна.',
'emptyfile'                   => 'Таны оруулсан файл хоосон байх шиг байна. Энэ нь файлын нэрийг алдаатай оруулснаас болсон байж магадгүй.
Энэ файлыг үнэхээр оруулахыг хүсэж байгаа эсэхээ шалгана уу.',
'fileexists'                  => 'Ийм нэртэй файл байна. Та үнэхээр үүнийг өөрчлөхийг хүсэж байгаадаа итгэлгүй байвал <strong><tt>$1</tt></strong>-г шалгаж үзнэ үү.',
'filepageexists'              => 'Энэ файлын тайлбар хуудас <strong><tt>$1</tt></strong>-д аль хэдийнээ үүсгэгдсэн байна. Харин энэ нэртэй файл байхгүй байна.
Таны оруулсан файлын тухай товч агуулга нь тайлбарын хуудсанд гарахгүй.
Өөрийн оруулсан файлын тухай товч агуулгыг тэнд тавихын тулд та гар аргаар засварлах хэрэгтэй',
'fileexists-extension'        => 'Ойролцоо нэртэй файл байна:<br />
Оруулж байгаа файлын нэр: <strong><tt>$1</tt></strong><br />
Ойролцоо файлын нэр: <strong><tt>$2</tt></strong><br />
Өөр нэрийг сонгоно уу.',
'fileexists-thumb'            => "<center>'''Байгаа файл'''</center>",
'fileexists-thumbnail-yes'    => 'Энэ файл хэмжээг нь багасгасан зураг юм шиг байна <i>(thumbnail)</i>. <strong><tt>$1</tt></strong> файлыг шалгана уу.<br />
Хэрэв шалгагдсан файл анхны хэмжээний зурагтай адил бол дахин жижиг зургыг оруулах хэрэггүй.',
'file-thumbnail-no'           => 'Файлын нэр <strong><tt>$1</tt></strong>-р эхэлж байна.
Хэмжээг нь багасгасан зураг юм шиг байна <i>(thumbnail)</i>.
Таньд энэ зурагны чанар сайтай хувилбар байвал түүнийгээ оруулж, байхгүй бол файлын нэрийг өөрчлөнө үү.',
'fileexists-forbidden'        => 'Ийм нэртэй файл байна;
файландаа шинэ нэр өгөөд дахин оруулна уу.
[[Image:$1|thumb|center|$1]]',
'fileexists-shared-forbidden' => 'Ийм нэртэй файл нь хамтран эзэмших файлын санд байна.
Файландаа шинэ нэр өгөөд дахин оруулна уу.
[[Image:$1|thumb|center|$1]]',
'successfulupload'            => 'Файлыг амжилттай орууллаа',
'uploadwarning'               => 'Хуулах үеийн анхааруулга',
'savefile'                    => 'Файлыг хадгалах',
'uploadedimage'               => '"[[$1]]"-г орууллаа',
'overwroteimage'              => '"[[$1]]"-н шинэ хувилбарыг орууллаа',
'uploaddisabled'              => 'Файл оруулах боломжгүй байна.',
'uploaddisabledtext'          => '{{SITENAME}}-д файл оруулах боломжгүй болсон байна.',
'uploadscripted'              => 'Энэ файл нь вэб броузераас шалтгаалж алдаатай уншигдах магадлал бүхий HTML буюу скрипт код агуулсан байна.',
'uploadcorrupt'               => 'Файл эвдэрхий буюу өргөтгөл нь буруу байна.
Файлаа шалгаад дахин оруулна үү.',
'uploadvirus'                 => 'Энэ файл вирусыг агуулж байна! Дэлгэрэнгүй: $1',
'sourcefilename'              => 'Эх үүсвэр файлын нэр',
'destfilename'                => 'Зорьсон файлын нэр',
'upload-maxfilesize'          => 'Файлын дээд хэмжээ: $1',
'watchthisupload'             => 'Энэ хуудсыг хянах',
'filewasdeleted'              => 'Өмнө нь ийм нэртэй файл оруулагдсан бөгөөд дараа нь устгагдсан байна.
Та үүнийг дахин оруулахын өмнө $1-г шалгаж үзнэ үү.',
'upload-wasdeleted'           => "'''Анхаар: Та өмнө нь устгагдсан файлыг дахин оруулах гэж байна.'''

Энэ файлыг дахин оруулах нь зүйтэй эсэхийг та бодож үзнэ үү.
Файлын устгалын лог энд байна:",
'filename-bad-prefix'         => 'Таны оруулж байгаа файлын нэр <strong>"$1"</strong>-р эхэлж байна. Энэ нь файлыг тодорхойлойлоогүй, голдуу дижитал аппаратын автоматаар гаргадаг нэр болно.
Файланд түүнийг илүү сайн тодорхойлсон нэр өгнө үү.',

'upload-proto-error'      => 'Буруу протокол',
'upload-proto-error-text' => 'Файл оруулахад хэрэгтэй URL-үүд нь <code>http://</code> эсвэл <code>ftp://</code>-р эхлэсэн байх шаардлагатай.',
'upload-file-error'       => 'Дотоод алдаа',
'upload-file-error-text'  => 'Серверт түр зуурын файл үүсгэх явцад дотоод алдаа гарлаа.
Системийн администраторт хандана уу.',
'upload-misc-error'       => 'Мэдэгдэхгүй файл оруулалтын алдаа',
'upload-misc-error-text'  => 'Файл оруулахад үл мэдэгдэх алдаа гарлаа.
URL нь хүчинтэй болон түүн руу орж болж байгааг шалган, дахин оролдож үзнэ үү.
Энэ асуудал үргэлжилсээр байх бол системийн администраторт хандана уу.',

# Some likely curl errors. More could be added from <http://curl.haxx.se/libcurl/c/libcurl-errors.html>
'upload-curl-error6'       => 'URL-д хүрч чадсангүй',
'upload-curl-error6-text'  => 'Өгсөн URL-д хүрч чадсангүй.
URL нь зөв болон сайт ажиллагаатай байгаа эсэхийг дахин шалгана уу.',
'upload-curl-error28'      => 'Файл оруулалтын хугацааны тасралт',
'upload-curl-error28-text' => 'Сайт хариу үйлдэл хийхэд хэт удлаа.
Сайт нь ажиллагаатай байгаа эсэхийг шалгаж, түр хүлээгээд дахин оролдоно уу.
Арай ажил багатай цагт дахин оролдохыг санал болгоё.',

'license'            => 'Эрх олгож байна:',
'nolicense'          => 'Алиныг ч сонгоогүй байна',
'license-nopreview'  => '(Урьдчилж харсан байдлыг харж болохгүй байна)',
'upload_source_url'  => ' (хүчинтэй, нийтэд нээлттэй URL)',
'upload_source_file' => '(таны компьютер доторх файл)',

# Special:ImageList
'imagelist-summary'     => 'Энэ тусгай хуудсанд бүх оруулагдсан файлыг харуулсан байгаа.
Хамгийн сүүлд оруулсан файлууд жагсаалтын хамгийн дээр байгаа.
Баганын гарчиг дээр дарвал жагсаалт өөрчлөгдөнө.',
'imagelist_search_for'  => 'Зургийн нэрээр хайх:',
'imgfile'               => 'файл',
'imagelist'             => 'Файлын жагсаалт',
'imagelist_date'        => 'Огноо',
'imagelist_name'        => 'Нэр',
'imagelist_user'        => 'Хэрэглэгч',
'imagelist_size'        => 'Хэмжээ (bytes)',
'imagelist_description' => 'Тодорхойлолт/Дүрслэл',

# Image description page
'filehist'                  => 'Файлын түүх',
'filehist-help'             => 'Огноо/цаг дээр нь дарж тухайн үед файл ямар байсныг харна уу.',
'filehist-deleteall'        => 'бүгдийг арилга',
'filehist-deleteone'        => 'үүнийг арилга',
'filehist-revert'           => 'буцаах',
'filehist-current'          => 'одоогийн',
'filehist-datetime'         => 'Огноо/Цаг',
'filehist-user'             => 'Хэрэглэгч',
'filehist-dimensions'       => 'Хэмжээ',
'filehist-filesize'         => 'Файлын хэмжээ',
'filehist-comment'          => 'Тайлбар',
'imagelinks'                => 'Линкүүд',
'linkstoimage'              => 'Дараах хуудсууд уг файлтай холбогдсон байна:',
'nolinkstoimage'            => 'Энэ файлд холбогдсон хуудас байхгүй байна.',
'sharedupload'              => 'Энэ файл нь өөр төслүүд ч хэрэглэж болохоор оруулагдсан байна.',
'shareduploadwiki'          => 'Дэлгэрэнгүй мэдээллийг $1-с авна уу.',
'shareduploadwiki-desc'     => '$1 дээрх тайлбарыг доор үзүүлэв.',
'shareduploadwiki-linktext' => 'файлын тайлбарын хуудас',
'noimage'                   => 'Ийм нэртэй файл байхгүй байна. Та $1 боломжтой.',
'noimage-linktext'          => 'үүнийг оруулах',
'uploadnewversion-linktext' => 'Энэ файлын шинэ хувилбарыг оруулах',
'imagepage-searchdupe'      => 'Хуулбар файлуудыг хайх',

# File reversion
'filerevert'                => '$1-г буцаах',
'filerevert-legend'         => 'Файлыг буцаах',
'filerevert-intro'          => "Та '''[[Media:$1|$1]]'''-г [$3, $2-ий байдлаарх $4 хувилбар] руу буцааж байна.",
'filerevert-comment'        => 'Тайлбар:',
'filerevert-defaultcomment' => '$2, $1-ий байдлаарх хувилбар руу буцаалаа',
'filerevert-submit'         => 'Буцаах',
'filerevert-success'        => "'''[[Media:$1|$1]]''' нь [$3, $2-ий байдлаарх $4 хувилбар руу] буцаагдлаа.",
'filerevert-badversion'     => 'Өгөгдсөн огнооны тэмдэгтэй энэ файлын дотоод хувилбар байхгүй байна.',

# File deletion
'filedelete'                  => '$1-г устга',
'filedelete-legend'           => 'Файлыг устга',
'filedelete-intro'            => "Та '''[[Media:$1|$1]]'''-г устгаж байна.",
'filedelete-intro-old'        => '<span class="plainlinks">Та \'\'\'[[Media:$1|$1]]\'\'\'-н [$4 $3, $2]-н байдлаарх хувилбарыг устгаж байна.</span>',
'filedelete-comment'          => 'Устгах шалтгаан:',
'filedelete-submit'           => 'Устга',
'filedelete-success'          => "'''$1''' устгагдлаа.",
'filedelete-success-old'      => '<span class="plainlinks">\'\'\'[[Media:$1|$1]]\'\'\'-н $3, $2-ий байдлаарх хувилбар устгагдлаа.</span>',
'filedelete-nofile'           => "{{SITENAME}} дээр '''$1''' байхгүй байна.",
'filedelete-nofile-old'       => "'''$1''' файлын өгөгдсөн өгөгдөлтэй архивлагдсан хувилбар байхгүй байна.",
'filedelete-iscurrent'        => 'Та энэ файлын хамгийн сүүлийн хувилбарыг устгах гэж байна. Эхлээд хуучин хувилбар руу буцаана уу.',
'filedelete-otherreason'      => 'Өөр/нэмэлт шалтгаан:',
'filedelete-reason-otherlist' => 'Өөр шалтгаан',
'filedelete-reason-dropdown'  => '*Ерөнхий устгах шалтгаанууд
** Зохиогчийн эрхэд халдсан
** Файлыг давхар оруулсан',
'filedelete-edit-reasonlist'  => 'Устгах шалтгаануудыг засварлах',

# MIME search
'mimesearch'         => 'MIME хайлт',
'mimesearch-summary' => 'Энэ хуудас MIME-төрлөөр нь файлуудыг шүүх боломжийг олгодог.
Оруулалт: агуулгын төрөл/доод төрөл, ж.нь. <tt>image/jpeg</tt>.',
'mimetype'           => 'MIME төрөл:',
'download'           => 'Татаж авах',

# Unwatched pages
'unwatchedpages' => 'Хяналтанд байдаггүй хуудсууд',

# List redirects
'listredirects' => 'Шууд холбогч хуудсуудын жагсаалт',

# Unused templates
'unusedtemplates'     => 'Ашиглагдаагүй загварууд',
'unusedtemplatestext' => 'Энэ хуудас бусад хуудаснаас дуудагдаагүй бүх загвар хуудсуудыг жагсааж үзүүлнэ. Загварыг устгахаасаа өмнө уг загварыг дуудсан бусад холбооснуудыг шалгахыг сануулж байна.',
'unusedtemplateswlh'  => 'бусад холбоосууд',

# Random page
'randompage'         => 'Хамаагүй хуудас',
'randompage-nopages' => 'Энэ нэрний зайд хуудас байхгүй байна.',

# Random redirect
'randomredirect'         => 'Хамаагүй шууд холбогч',
'randomredirect-nopages' => 'Энэ нэрний зайд шууд холбогч байхгүй байна.',

# Statistics
'statistics'             => 'Статистик мэдээлэл',
'sitestats'              => '{{SITENAME}} статистик',
'userstats'              => 'Хэрэглэгчийн статистик',
'sitestatstext'          => "Мэдээллийн санд {{PLURAL:\$1|'''1''' хуудас|нийт '''\$1''' хуудас}} байна.
Энэ тоонд \"хэлэлцүүлгийн\" хуудсууд, {{SITENAME}}-н тухай хуудсууд, жижиг буюу \"түүхий\" хуудсудд, шууд холбогчууд, болон агуулгын хуудас гэж тооцогдохгүй бусад хуудсуудыг оруулсан тоо болно.
Эдгээрийг тооцолгүйгээр агуулгын хуудас {{PLURAL:\$2|'''1'''|нийт '''\$2'''}} байна.

'''\$8''' файл оруулагдсан байна.

{{SITENAME}} гарснаас хойш нийт '''\$3''' удаа хандсан бөгөөд '''\$4''' засвар хийгдсэн байна.
Эдгээрийг тооцвол дунджаар хуудас тутмыг '''\$5''' удаа засварлаж, засвар тус бүрт '''\$6''' удаа хандсан байна.

[http://www.mediawiki.org/wiki/Manual:Job_queue Ажлын цувааны урт] одоогийн байдлаар '''\$7''' байна.",
'userstatstext'          => "Нийт {{PLURAL:$1|'''1''' бүртгэгдсэн [[Special:ListUsers|хэрэглэгч]]|'''$1''' хэрэглэгч [[Special:ListUsers|хэрэглэгч]]}} байгаа бөгөөд үүнээс '''$2''' буюу '''$4%''' нь $5 гэсэн эрхтэй.",
'statistics-mostpopular' => 'Хамгийн олон удаа үзсэн хуудсууд',

'disambiguations'      => 'Салаа утгатай үгнүүд',
'disambiguationspage'  => 'Template:Салаа утгатай',
'disambiguations-text' => "Дараах хуудсууд '''салаа утгатай үгнүүдийн хуудас''' руу холбогдоно.
Тэдгээр нь зөв сэдэв руу холбогдох ёстой.<br />
[[MediaWiki:Disambiguationspage]]-с холбогдсон загвар хэрэглэж байвал хуудас нь салаа утгатай үгнүүдийн хуудас гэж тооцогдоно.",

'doubleredirects'            => 'Давхар чиглүүлэгчүүд',
'doubleredirectstext'        => 'Энэ хуудас нь өөр чиглүүлэгч хуудас руу чиглүүлдэг хуудсуудыг жагсаана.
Мөр тус бүр нь эхний ба хоёр дахь чиглүүлэгч рүүх холбоосыг болон эхний чиглүүлэгчийн чиглэх ёстой, хоёр дахь чиглүүлэгчийн чиглэх "жинхэнэ" чиглэх ёстой хуудсыг заана.',
'double-redirect-fixed-move' => '[[$1]] зөөгдөж, [[$2]] руух чиглүүлэгч боллоо',
'double-redirect-fixer'      => 'Чиглүүлэгчийг засварлагч',

'brokenredirects'        => 'Эвдэрхий чиглүүлэгчүүд',
'brokenredirectstext'    => 'Дараах автомат холбогч нь одоо байхгүй хуудас руу холбож байна:',
'brokenredirects-edit'   => '(засварлах)',
'brokenredirects-delete' => '(устгах)',

'withoutinterwiki'         => 'Бусад хэлтэйх холбоосгүй хуудсууд',
'withoutinterwiki-summary' => 'Дараах хуудсууд бусад хэлний хувилбаруудад холбогддоггүй:',
'withoutinterwiki-submit'  => 'Үзүүлэх',

'fewestrevisions' => 'Хамгийн бага засварлагдсан хуудсууд',

# Miscellaneous special pages
'nbytes'                  => '$1 байт',
'ncategories'             => '$1 ангилал',
'nlinks'                  => '$1 линк',
'nmembers'                => '$1 гишүүн',
'nrevisions'              => '$1 засвар',
'nviews'                  => '$1 удаа үзсэн',
'specialpage-empty'       => 'Энэ мэдүүлэгт үр дүн гарсангүй.',
'lonelypages'             => 'Өнчин хуудсууд',
'lonelypagestext'         => 'Дараах хуудсууд нь {{SITENAME}}-н бусад хуудсуудаас холбогдоогүй байна.',
'uncategorizedpages'      => 'Ангилагдаагүй хуудсууд',
'uncategorizedcategories' => 'Ангилагдаагүй ангиллууд',
'uncategorizedimages'     => 'Ангилагдаагүй зургууд',
'uncategorizedtemplates'  => 'Ангилагдаагүй загварууд',
'unusedcategories'        => 'Ашиглагдаагүй ангиллууд',
'unusedimages'            => 'Ашиглагдаагүй файлууд',
'popularpages'            => 'Эрэлттэй хуудсууд',
'wantedcategories'        => 'Хэрэгцээт ангиллууд',
'wantedpages'             => 'Хэрэгцээтэй хуудсууд',
'mostlinked'              => 'Хамгийн их холбогдсон хуудсууд',
'mostlinkedcategories'    => 'Хамгийн их холбогдсон ангиллууд',
'mostlinkedtemplates'     => 'Хамгийн их ашиглагдсан загварууд',
'mostcategories'          => 'Хамгийн олон ангилалд багтаж буй хуудсууд',
'mostimages'              => 'Хамгийн их ашиглагдсан файлууд',
'mostrevisions'           => 'Хамгийн их засварлагдсан хуудсууд',
'prefixindex'             => 'Өмнөх индекс',
'shortpages'              => 'Богино хуудсууд',
'longpages'               => 'Урт хуудсууд',
'deadendpages'            => 'Төгсгөлийн хуудсууд',
'deadendpagestext'        => 'Дараах хуудсууд викигийн бусад хуудсуудтай холбогдоогүй байна.',
'protectedpages'          => 'Хамгаалагдсан хуудсууд',
'protectedpages-indef'    => 'Зөвхөн хугацаагүй хамгаалалтууд',
'protectedpagestext'      => 'Дараах хуудсууд нь зөөх ба засварлах явдлаас хамгаалагдсан байна',
'protectedpagesempty'     => 'Эдгээр параметрээр хамгаалагдсан хуудас байхгүй байна.',
'protectedtitles'         => 'Хамгаалагдсан гарчигууд',
'protectedtitlestext'     => 'Дараах гарчигуудтай хуудсуудыг үүсгэхээс хамгаалсан байна',
'protectedtitlesempty'    => 'Эдгээр параметрээр хамгаалагдсан гарчиг байхгүй байна.',
'listusers'               => 'Хэрэглэгчдийн жагсаалт',
'newpages'                => 'Шинэ хуудсууд',
'newpages-username'       => 'Хэрэглэгчийн нэр:',
'ancientpages'            => 'Хамгийн хуучин хуудсууд',
'move'                    => 'Зөөх',
'movethispage'            => 'Энэ хуудсыг зөөх',
'unusedimagestext'        => '<p>Бусад веб хуудаснуудаас зураг руу шууд хаягаар нь хандаж болох учраас идэвхтэй хэрэглэгдэж буй эсэхээс үл хамааран энэ жагсаалтанд бүртгэгдсэн байж болно гэдгийг анзаарна уу.</p>',
'unusedcategoriestext'    => 'Дараах категори нь ямар нэг өгүүлэл эсвэл категорит хэрэглэгдээгүй боловч категорийн хуудас оршин байна.',
'notargettitle'           => 'чиглэлгүй',
'notargettext'            => 'Та энэ функцийг биелүүлэх хуудас буюу хэрэглэгчийг тодорхойлоогүй байна.',
'pager-newer-n'           => '{{PLURAL:$1|илүү шинэ 1|илүү шинэ $1}}',
'pager-older-n'           => '{{PLURAL:$1|илүү хуучин 1|илүү хуучин $1}}',
'suppress'                => 'Хянан зохицуулагч',

# Book sources
'booksources'               => 'Номон эх сурвалжууд',
'booksources-search-legend' => 'Номын эх сурвалж хайх',
'booksources-go'            => 'Явах',
'booksources-text'          => 'Доорх нь шинэ, хуучин ном зардаг өөр сайт руу очих холбоосуудын жагсаалт бөгөөд таны хайж буй номнуудын тухай дэлгэрэнгүй мэдээлэл байх магадлалтай:',

# Special:Log
'specialloguserlabel'  => 'Хэрэглэгч:',
'speciallogtitlelabel' => 'Гарчиг:',
'log'                  => 'Логууд',
'all-logs-page'        => 'Бүх лог',
'log-search-legend'    => 'Логуудаас хайх',
'log-search-submit'    => 'Явах',
'alllogstext'          => 'Энэ нь аплоуд, устгал, хамгаалалт, түгжигдсэн хэрэглэгч, зөөлт, шинэ хэрэглэгчийн үүсгэл, хэрэглэгчийн нэрний өөрчлөл, хэрэглэгчийн эрхний логуудыг багтаасан хуудас юм. Та логийн төрөл, хэрэглэгчийн нэр, нөлөөлөгдсөн хуудасны нэрийг оруулснаар хайж буй зүйл тань илүү амар олдогдоно. Оруулсан үгнийхээ том ба жижиг үсгийг яг зөв оруулахгүй бол болохгүй.',
'logempty'             => 'Логт тохирох зүйл алга.',
'log-title-wildcard'   => 'Энэ текстээр эхлэсэн гарчигуудыг хайх',

# Special:AllPages
'allpages'          => 'Бүх хуудас',
'alphaindexline'    => '$1-с $2 хүртэл',
'nextpage'          => 'Дараагийн хуудас ($1)',
'prevpage'          => 'Өмнөх хуудас ($1)',
'allpagesfrom'      => 'Дараахаас эхэлж хуудсуудыг үзүүлэх:',
'allarticles'       => 'Бүх хуудас',
'allinnamespace'    => 'Бүх хуудас ($1 namespace)',
'allnotinnamespace' => 'Бүх хуудас (нэрэндээ $1-г агуулаагүй)',
'allpagesprev'      => 'Өмнөх',
'allpagesnext'      => 'Дараагийнх',
'allpagessubmit'    => 'Явах',
'allpagesprefix'    => 'Дараах угтвараар эхэлсэн хуудсуудыг үзүүлэх:',
'allpagesbadtitle'  => 'Хуудасны нэр нь хүчингүй эсвэл интер-хэл буюу интер-викид байгаа нэр байна. Нэрэнд хэрэглэж болохгүй тэмдэгт агуулагдаж байж болзошгүй юм.',
'allpages-bad-ns'   => '{{SITENAME}} нь "$1"-ийг агуулаагүй байна.',

# Special:Categories
'categories'                    => 'Ангиллууд',
'categoriespagetext'            => 'Дараах ангиллуудад хуудас эсвэл медиа файл агуулагдаж байна.',
'special-categories-sort-count' => 'тоогоор ялгах',
'special-categories-sort-abc'   => 'үсгийн дарааллаар ялгах',

# Special:ListUsers
'listusersfrom'      => 'Дараахь тэмдэгтээр эхэлсэн нэртэй хэрэглэгчдийг харуул:',
'listusers-submit'   => 'Үзүүлэх',
'listusers-noresult' => 'Хэрэглэгч олдсонгүй.',

# Special:ListGroupRights
'listgrouprights'          => 'Хэрэглэгчийн бүлгийн эрхүүд',
'listgrouprights-summary'  => 'Дараах нь энэ вики дээрх хэрэглэгчийн бүлгүүд болон тэдгээрийн эрх, зөвшөөрлүүдийн жагсаалт юм.',
'listgrouprights-group'    => 'Бүлэг',
'listgrouprights-rights'   => 'Эрхүүд',
'listgrouprights-helppage' => 'Help:Бүлгийн эрхүүд',

# E-mail user
'mailnologin'     => 'илгээх хаяг байхгүй',
'mailnologintext' => 'Та бусад хэрэглэгчдэд мэйл явуулахын тулд өөрийн [[Special:Preferences|хувийн тохируулгадаа]] мэйлээ оруулсан, мөн [[Special:UserLogin|нэвтэрсэн]] байх шаардлагатай.',
'emailuser'       => 'Энэ хэрэглэгчид мэйл илгээх',
'emailpage'       => 'мэйл хэрэглэгч',
'emailpagetext'   => 'Энэ хэрэглэгч нь тохиргоондоо хүчинтэй мэйл хаяг оруулсан бол доорх формоос мэйл илгээж болно. Таны тохиргоонд оруулсан мэйл хаяг нь илгээж буй мэйлний “Хэнээс” гэдэг дээр гарч ирэх тул хүлээн авагч нь хариуг илгээх боломжтой.',
'usermailererror' => 'Мэйл нь буцаж ирсэн шалтгаан:',
'defemailsubject' => '{{SITENAME}} Мэйл хаяг',
'noemailtitle'    => 'Мэйл хаяггүй байна',
'noemailtext'     => 'Энэ хэрэглэгч нь хүчинтэй мэйл хаяг бүртгүүлээгүй эсвэл энэ хаягаар бусдаас мэйл хүлээн авахгүй байна.',
'emailfrom'       => 'Хэнээс',
'emailto'         => 'хэнд',
'emailsubject'    => 'гарчиг',
'emailmessage'    => 'мэссеж',
'emailsend'       => 'илгээх',
'emailccme'       => 'Миний мессэжний хуулбарыг надад мэйлээр явуулна уу.',
'emailccsubject'  => 'Таны мессэжийг $1: $2 руу хуулна.',
'emailsent'       => 'Илгээсэн мэйл',
'emailsenttext'   => 'Таны мэйл илгээгдлээ.',

# Watchlist
'watchlist'            => 'Миний хянаж буй хуудсууд',
'mywatchlist'          => 'Миний хянаж буй хуудсуудын жагсаалт',
'watchlistfor'         => "'''$1'''",
'nowatchlist'          => 'Танд хянаж буй зүйл байхгүй.',
'watchlistanontext'    => 'Та өөрийн хянах листийг өөрчлөх буюу үзэхийг хүсвэл $1 хэрэгтэй.',
'watchnologin'         => 'Нэвтрээгүй байна.',
'watchnologintext'     => 'Та өөрийн хянаж буй хуудаснуудын жагсаалтыг өөрчлөхийн тулд [[Special:UserLogin|нэвтэрсэн байх]] шаардлагатай.',
'addedwatch'           => 'Хянах жагсаалтанд нэмэгдлээ',
'addedwatchtext'       => "\"[[:\$1]]\" гэсэн хуудас таны [[Special:Watchlist|хянах жагсаалтанд]] нэмэгдлээ.
Энэ хуудас эсвэл түүний хэлэлцүүлгийн хуудас засварлагдахад тэдгээр нь [[Special:RecentChanges|сүүлийн засваруудын жагсаалтад]] '''тодруулалттай''' харагдах болно.",
'removedwatch'         => 'Хянах жагсаалтнаас хасагдлаа',
'removedwatchtext'     => '"[[:$1]]" хуудас нь таны хянаж буй хуудсуудын жагсаалтаас хасагдлаа.',
'watch'                => 'Хянах',
'watchthispage'        => 'Энэ хуудсыг хяна',
'unwatch'              => 'Хянахаа болих',
'unwatchthispage'      => 'Хянахаа зогсоох',
'notanarticle'         => 'Агуулгагүй хуудас',
'notvisiblerev'        => 'Засвар устгагдлаа',
'watchnochange'        => 'Дурьдагдсан хугацаанд таны хянаж буй хуудсуудад өөрчлөлт ороогүй байна.',
'watchlist-details'    => 'Хэлэлцүүлгийн хуудсуудыг оруулалгүйгээр $1 хуудсыг хянаж байна.',
'wlheader-enotif'      => '* И-мэйл мэдэгдэл хүчинтэй боллоо.',
'wlheader-showupdated' => "* Таны хамгийн сүүлд айлчилснаас хойш өөрчлөгдсөн хуудсууд '''тодоор''' бичигдсэн байгаа",
'watchmethod-recent'   => 'хяналтад буй хуудсуудад шинэ өөрчлөлт орсон эсэхийг шалгаж байна',
'watchmethod-list'     => 'хяналтад буй хуудсуудад саяхан өөрчлөлт орсон эсэхийг шалгаж байна',
'watchlistcontains'    => 'Таны хянах жагсаалтанд $1 хуудас байна.',
'iteminvalidname'      => "'$1' зүйлд асуудал гарлаа, хүчингүй нэр...",
'wlnote'               => "Доорх нь сүүлийн {{PLURAL:$2|цагт|'''$2''' цагт}} хийгдсэн {{PLURAL:$1|сүүлийн|сүүлийн '''$1'''}} өөрчлөлт юм.",
'wlshowlast'           => 'Сүүлийн $1 цагийн $2 өдрийн $3-г харуул',
'watchlist-show-bots'  => 'Автоматаар хийгдсэн засваруудыг харуул',
'watchlist-hide-bots'  => 'Роботуудын хийсэн засваруудыг нуух',
'watchlist-show-own'   => 'Миний хийсэн засваруудыг харуул',
'watchlist-hide-own'   => 'Миний хийсэн засваруудыг нуух',
'watchlist-show-minor' => 'Жижиг засваруудыг харуул',
'watchlist-hide-minor' => 'Бага зэргийн засваруудыг нуух',

# Displayed when you click the "watch" button and it is in the process of watching
'watching'   => 'Хянаж байна...',
'unwatching' => 'Хянахаа больж байна...',

'enotif_mailer'                => '{{SITENAME}} Мэйлэн сонордуулга',
'enotif_reset'                 => 'бүх хуудсыг үзсэн болгох',
'enotif_newpagetext'           => 'энэ нь шинэ хуудас.',
'enotif_impersonal_salutation' => '{{SITENAME}}-н хэрэглэгч',
'changed'                      => 'өөрчлөгдсөн',
'created'                      => 'үүсгэсэн',
'enotif_subject'               => '{{SITENAME}} $PAGETITLE энэ хуудсыг $PAGEEDITOR нь $CHANGEDORCREATED хийлээ.',
'enotif_lastvisited'           => '$1-ийн хамгийн сүүлд зочилсноос хойших өөрчлөлтүүдийг харуул.',
'enotif_lastdiff'              => '$1-г харж энэ өөрчлөлтийг үзнэ үү.',
'enotif_anon_editor'           => '$1 бүртгэлгүй хэрэглэгч',

# Delete/protect/revert
'deletepage'                  => 'Хуудсыг устга',
'confirm'                     => 'Баталгаажуулах',
'excontent'                   => "агуулга нь ийм байсан: '$1'",
'excontentauthor'             => "агуулга нь ийм байсан: '$1' （зөвхөн '$2' нь л бичлэг үйлдэгч）",
'exbeforeblank'               => "хоосон болохын өмнөх үеийн агуулга: '$1'",
'exblank'                     => 'хуудас нь хоосон байсан',
'delete-confirm'              => '"$1"-г устгах',
'delete-legend'               => 'Устгах',
'historywarning'              => 'Анхаар: Таны устгах гэж байгаа хуудас түүхтэй байна:',
'confirmdeletetext'           => 'Та энэ хуудсыг түүхтэй нь бүхлээр нь устгах гэж байна.
Энэхүү үйлдлийг хийснээр ямар үр дүнд хүрэхийг бүрэн гүйцэд ойлгож хийж байгаа гэдгээ, мөн [[{{MediaWiki:Policy-url}}|дүрэм журмынх нь дагуу]] хийж байнаагаа илтгэнэ үү.',
'actioncomplete'              => 'Үйлдлийг гүйцэтгэлээ.',
'deletedtext'                 => '"<nowiki>$1</nowiki>" нь устгагдлаа.
Сүүлд устгагдсан зүйлсийг $2-с харна уу.',
'deletedarticle'              => '"[[$1]]" нь устгагдлаа',
'suppressedarticle'           => '"[[$1]]"-г далдаллаа',
'dellogpage'                  => 'Устгагдсан өгүүллүүдийн лог',
'dellogpagetext'              => 'Доорх нь хамгийн сүүлийн үед хийгдсэн устгасан зүйлсийн лист.',
'deletionlog'                 => 'устгагдсан өгүүллүүдийн лог',
'reverted'                    => 'Хуучны засвар руу буцаах',
'deletecomment'               => 'Устгасан шалтгаан:',
'deleteotherreason'           => 'Өөр/нэмэлт шалтгаан:',
'deletereasonotherlist'       => 'Өөр шалтгаан',
'deletereason-dropdown'       => '*Ерөнхий устгах шалтгаанууд
** Бичлэг үйлдэгчийн хүсэлтээр
** Зохиогчийн эрхэд халдсан
** Вандализм',
'delete-edit-reasonlist'      => 'Устгах шалтгаануудыг засварлах',
'delete-toobig'               => 'Энэ хуудасны засварын түүх маш том байгаа бөгөөд $1 гаруй засвартай байна.
{{SITENAME}}-д санамсаргүй байдлаар муугаар нөлөөлж болзошгүй тул эдгээр хуудсуудыг устгах явдлыг хорьсон байна.',
'delete-warning-toobig'       => 'Энэ хуудасны засварын түүх маш том байгаа бөгөөд $1 гаруй засвартай байна.
Устгавал {{SITENAME}}-н мэдээллийн сангийн үйл ажиллагаанд нөлөөлж магадгүй тул та анхаар сэрэмжтэйгээр дараах үйлдлээ гүйцэтгэнэ үү.',
'rollback'                    => 'Засваруудыг буцаах',
'rollback_short'              => 'Буцаах',
'rollbacklink'                => 'буцаах',
'rollbackfailed'              => 'Буцааж чадсангүй',
'cantrollback'                => 'Засварласан хэсгийг буцааж чадсангүй. Сүүлчийн засварыг хийгч нь энэ хуудасны цорын ганц бичигч юм.',
'alreadyrolled'               => '[[User:$2|$2]] ([[User talk:$2|Яриа]])-ын хийсэн [[$1]] дэх сүүлчийн засварыг буцааж чадахгүй байна; хэн нэг нь аль хэдийн уг хуудсыг засварласан буюу буцаасан байж болзошгүй. Сүүлчийн засварыг [[User:$3|$3]] ([[User talk:$3|Яриа]]) хийсэн.',
'editcomment'                 => 'Засварлаж байгаа санал хүсэлт нь: "<i>$1</i>".', # only shown if there is an edit comment
'revertpage'                  => '[[Special:Contributions/$2|$2]] ([[User talk:$2|Яриа]]) хэрэглэгчийн засваруудыг;
[[User:$1|$1]] хэрэглэгчийн үйлдсэн хамгийн сүүлийн хувилбар руу буцаалаа', # Additional available: $3: revid of the revision reverted to, $4: timestamp of the revision reverted to, $5: revid of the revision reverted from, $6: timestamp of the revision reverted from
'rollback-success'            => '$1-н өөрчлөлтүүдийг $2-н үйлдсэн сүүлийн хувилбар руу буцаалаа.',
'sessionfailure'              => 'Таны нэвтрэлд алдаа гарсан бололтой;
компьютерийн систем дэх мэдээллийг хууль бусаар авах явдлаас хамгаалах гэж үйлдэл цуцлагдсан байна
"Back" товч дээр дарж өмнөх хуудас руугаа буцаж, дараа нь дахин оролдоно уу.',
'protectlogpage'              => 'Хамгаалалтын лог',
'protectlogtext'              => 'доорх нь түгжигдсэн ба түгжигдээгүй хуудасны лист.',
'protectedarticle'            => '"[[$1]]"-г хамгааллаа',
'modifiedarticleprotection'   => '"[[$1]]"-н хамгаалалтын түвшинг өөрчиллөө',
'unprotectedarticle'          => '"[[$1]]"-г хамгаалахаа больсон',
'protect-title'               => '"[[$1]]"-н хамгаалалтын түвшинг өөрчлөх',
'protect-legend'              => 'Хамгаалалтыг баталгаажуулах',
'protectcomment'              => 'Тайлбар:',
'protectexpiry'               => 'Дуусах:',
'protect_expiry_invalid'      => 'Дуусах хугацаа хүчингүй байна.',
'protect_expiry_old'          => 'Дуусах хугацаа өнгөрсөн цагт байна.',
'protect-unchain'             => 'Зөөх зөвшөөрлүүдийг тайлах',
'protect-text'                => 'Та <strong><nowiki>$1</nowiki></strong> хуудасны хамгаалалтын түвшинг харж, өөрчлөх боломжтой.',
'protect-locked-blocked'      => 'Түгжигдсэн байхад хамгаалалтын түвшинг өөрчилж болохгүй.
<strong>$1</strong> хуудасны одоогийн тохиргоо энд байна:',
'protect-locked-dblock'       => 'Мэдээллийн санг түгжсэн байгаа тул хамгаалалтын түвшинг өөрчилж болохгүй. 
<strong>$1</strong> хуудасны одоогийн тохиргоо энд байна:',
'protect-locked-access'       => 'Таны бүртгэл хамгаалалтын түвшинг өөрчлөх зөвшөөрөлгүй байна.
<strong>$1</strong> хуудсаны одоогийн тохиргоо энд байна:',
'protect-cascadeon'           => 'Энэ хуудас давхар хамгаалалттай $1 хуудсанд орсон тул одоогийн байдлаар түгжигдсэн байна.
Та энэ хуудасны хамгаалалтын түвшинг өөрчилж болох боловч давхар хамгаалалтанд нөлөөлөхгүй.',
'protect-default'             => '(анхны байдал)',
'protect-fallback'            => '"$1" зөвшөөрөл хэрэгтэй',
'protect-level-autoconfirmed' => 'Бүртгэлгүй хэрэглэгчдээс түгжих',
'protect-level-sysop'         => 'Зөвхөн системийн операторууд',
'protect-summary-cascade'     => 'давхар хамгаалалт',
'protect-expiring'            => 'Дуусах хугацаа: $1 (UTC)',
'protect-cascade'             => 'Энэ хуудсанд орсон хуудсуудыг хамгаалах (давхар хамгаалалт)',
'protect-cantedit'            => 'Таньд энэ хуудсыг засварлах эрх байхгүй тул хамгаалалтын түвшинг өөрчилж болохгүй.',
'restriction-type'            => 'Зөвшөөрөл:',
'restriction-level'           => 'Хамгаалалтын түвшин:',
'minimum-size'                => 'Доод хэмжээ',
'maximum-size'                => 'Дээд хэмжээ:',
'pagesize'                    => '(байт)',

# Restrictions (nouns)
'restriction-edit'   => 'Засварлах',
'restriction-move'   => 'Зөөх',
'restriction-create' => 'Үүсгэх',

# Restriction levels
'restriction-level-sysop'         => 'бүтэн хамгаалагдсан',
'restriction-level-autoconfirmed' => 'хагас хамгаалагдсан',
'restriction-level-all'           => 'хамаагүй түвшин',

# Undelete
'undelete'                     => 'Устгагдсан хуудсуудыг харах',
'undeletepage'                 => 'Устгагдсан хуудсуудыг харах ба сэргээх',
'undeletepagetitle'            => "'''Дараах нь [[:$1|$1]]-н устгагдсан засварууд юм.'''",
'viewdeletedpage'              => 'Устгагдсан хуудсуудыг харах',
'undeletepagetext'             => 'Дараах хуудсууд устгагдсан боловч одоогоор сэргээж болохоор төлөвт байна.',
'undeleteextrahelp'            => "Бүхэл хуудсыг сэргээхийн тулд бүх жижиг дөрвөлжингүүдийг сонгохгүй үлдээгээд '''''Сэргээх''''' товчийг дар. Зарим хувилбаруудыг сэргээхийн тулд сэргээх хувилбаруудын өмнөх жижиг дөрвөлжинг идэвхжүүлээд '''''Сэргээх''''' товчийг дар. '''''Дахин эхлүүлэх''''' товчийг дарснаар тайлбарын талбар ба бүх жижиг дөрвөлжингүүд хоосон болно",
'undeleterevisions'            => '$1 хувилбар архивлагдлаа',
'undeletehistory'              => 'Хэрэв та энэ хуудсыг сэргээвэл түүний өмнөх бүх хувилбарууд нь түүх рүү сэргээгдэж бичигдэнэ. Хэрэв үүнийг устгаснаас хойш үүнтэй адил нэртэй шинэ хуудас үүсгэгдсэн бол сэргээгдсэн хувилбарууд түүх хэсэгт гарч ирэх боловч одоо байгаа бодит хуудсыг автоматаар солихгүй.',
'undeleterevdel'               => 'Дээд хуудас буюу файлын засвар бага зэргээр устгагдах явдал гарах бол хуудас сэргээгдэхгүй.
Ийм тохиолдолд та хамгийн сүүлд устгагдсан засварыг нууцлахаа, эсвэл тэмдэглэхээ болих шаардлагатай.',
'undeletehistorynoadmin'       => 'Энэ өгүүлэл устгагдсан. Үүний устгагдсан шалтгаан нь устгалын өмнө энэ хуудсыг засварласан хэрэглэгчдийн тухай мэдээллүүдтэй хамт доорх тайланд өгөгдсөн байгаа. Эдгээр устгагдсан хувилбаруудад яг юу байсныг зөвхөн администраторууд л харж чадна.',
'undelete-revision'            => '$3 хэрэглэгчийн $1-н ($2-ий байдлаарх) устгасан засвар',
'undeleterevision-missing'     => 'Хүчингүй эсвэл алга болсон засвар.
Таньд буруу холбоос байна, эсвэл засвар сэргээгдсэн, эсвэл архиваас устгагдсан байж болзошгүй.',
'undelete-nodiff'              => 'Өмнөх засвар олдсонгүй.',
'undeletebtn'                  => 'Сэргээх',
'undeletelink'                 => 'сэргээх',
'undeletereset'                => 'Дахин эхлүүлэх',
'undeletecomment'              => 'Сэтгэгдэл:',
'undeletedarticle'             => '"[[$1]]"-ийг сэргээв',
'undeletedrevisions'           => '{{PLURAL:$1|1 хувилбар|$1 хувилбар}}  сэргээгдлээ',
'undeletedrevisions-files'     => '{{PLURAL:$1|1 засвар|$1 засвар}} ба {{PLURAL:$2|1 файл|$2 файл}} сэргээгдлээ',
'undeletedfiles'               => '{{PLURAL:$1|1 файл|$1 файл}} сэргээгдлээ',
'cannotundelete'               => 'Устгасан хуудсыг буцааж сэргээх үйлдэл амжилтгүй боллоо. Хэн нэгэн уг хуудсыг өрсөж сэргээсэн байх боломжтой.',
'undeletedpage'                => "<big>'''$1 сэргээгдэв'''</big>

Сүүлийн үед устгагдсан ба сэргээгдсэн зүйлүүдийн жагсаалтыг [[Special:Log/delete|устгалын бүртгэл]] дээрээс харна уу.",
'undelete-header'              => '[[Special:Log/delete|Устгалын бүртгэл]]ээс сүүлд устгагдсан хуудсуудыг харна уу.',
'undelete-search-box'          => 'Устгагдсан хуудсуудаас хайх',
'undelete-search-prefix'       => 'Доорхиор эхэлсэн хуудсуудыг харуул:',
'undelete-search-submit'       => 'Хайлт',
'undelete-no-results'          => 'Устгалын архиваас хайлтын үр дүнд таарах хуудас олдсонгүй.',
'undelete-filename-mismatch'   => '$1 тэмдэгтэй засварыг сэргээж болохгүй байна: файлын нэр зөрөлдөж байна',
'undelete-bad-store-key'       => '$1 тэмдэгтэй засварыг сэргээж болохгүй байна: файл устгахаас өмнө алга болсон байна.',
'undelete-cleanup-error'       => 'Хэрэглэгддэггүй архивийн "$1" файлыг устгахад алдаа гарлаа.',
'undelete-missing-filearchive' => 'Файлын архивийн ID $1 нь мэдээллийн санд байхгүй тул сэргээх боломжгүй байна.
Аль хэдийнээ сэргээгдсэн байж магадгүй.',
'undelete-error-short'         => 'Файлыг сэргээхэд алдаа гарлаа: $1',
'undelete-error-long'          => 'Дараах файлыг сэргээхэд алдаа гарлаа:

$1',

# Namespace form on various pages
'namespace'      => 'Нэрний зай:',
'invert'         => 'Эсрэгээр нь болгох',
'blanknamespace' => '(Гол)',

# Contributions
'contributions' => 'Хэрэглэгчийн хувь нэмэр',
'mycontris'     => 'Миний оруулсан хувь нэмэр',
'contribsub2'   => 'Хэрэглэгчийн нэр: $1 ($2)',
'nocontribs'    => 'Энэ шалгуурт тохирох өөрчилсөн зүйлүүд олдсонгүй.',
'uctop'         => '(дээд)',
'month'         => 'Дараах сараас (өмнөх засварууд нь ч орно):',
'year'          => 'Дараах жилээс (өмнөх засварууд нь ч орно):',

'sp-contributions-newbies'     => 'Зөвхөн шинэ бүртгэлүүдийн хувь нэмрийг харуулах',
'sp-contributions-newbies-sub' => 'Шинээр бүртгүүлсэн хэрэглэгчид',
'sp-contributions-blocklog'    => 'Түгжээний лог',
'sp-contributions-search'      => 'Хувь нэмрийг хайх',
'sp-contributions-username'    => 'IP хаяг эсвэл хэрэглэгчийн нэр:',
'sp-contributions-submit'      => 'Хайх',

# What links here
'whatlinkshere'            => 'Энд холбогдсон хуудсууд',
'whatlinkshere-title'      => '$1-д холбогдсон хуудсууд',
'whatlinkshere-page'       => 'Хуудас:',
'linklistsub'              => '(Холбоосуудын жагсаалт)',
'linkshere'                => "Дараах хуудсууд '''[[:$1]]'''-тай холбогдсон байна:",
'nolinkshere'              => "'''[[:$1]]'''-тай холбогдсон хуудас байхгүй байна.",
'nolinkshere-ns'           => "Сонгосон нэрний зайд '''[[:$1]]''' руу холбогдсон хуудас байхгүй байна.",
'isredirect'               => 'шууд холбогдсон хуудас',
'istemplate'               => 'оруулалт',
'whatlinkshere-prev'       => '{{PLURAL:$1|өмнөх|өмнөх $1}}',
'whatlinkshere-next'       => '{{PLURAL:$1|дараагийнх|дараагийн $1}}',
'whatlinkshere-links'      => '← линкүүд',
'whatlinkshere-hideredirs' => '$1 шууд холбогч',
'whatlinkshere-hidelinks'  => 'Линкүүдийг $1',

# Block/unblock
'blockip'                     => 'Хэрэглэгчийг түгжих',
'blockip-legend'              => 'Хэрэглэгчийг түгжих',
'blockiptext'                 => 'Доорх маягтыг ашиглан тодорхой IP хаяг эсвэл хэрэглэгчийн нэрийг засвар хийхээс түгжинэ үү.
Энэ нь зөвхөн вандализм үйлдэх явдлаас сэргийлэхийн тулд, [[{{MediaWiki:Policy-url}}|бодлого, баримтлалын]] дагуу хийгдэх ёстой.
Доор тодорхой шалтгаанаа бичнэ үү.',
'ipaddress'                   => 'IP хаяг',
'ipadressorusername'          => 'IP хаяг буюу хэрэглэгчийн нэр',
'ipbexpiry'                   => 'Түгжээ нь нээгдэх хугацаа',
'ipbreason'                   => 'Шалтгаан:',
'ipbreasonotherlist'          => 'Өөр шалтгаан',
'ipbreason-dropdown'          => '*Ерөнхий түгжих шалтгаанууд
** Худал мэдээлэл оруулсан
** Хуудаснуудаас агуулга устгасан
** Гадны холбоосууд руу линк оруулж спам үйлдсэн
** Утгагүй зүйл/бувтнал оруулсан
** Сүрдүүлсэн/зовоосон ааш авиртай
** Олон бүртгэлийг буруу хэргээр ашигласан
** Зөвшөөршгүй хэрэглэгчийн нэртэй',
'ipbanononly'                 => 'Зөвхөн бүртгэлгүй хэрэглэгчдийг л түгжих',
'ipbcreateaccount'            => 'Бүртгэл нээхээс хамгаалах',
'ipbemailban'                 => 'Хэрэглэгчийг мэйл явуулахаас саатуулах',
'ipbenableautoblock'          => 'Энэ хэрэглэгчийн сүүлийн IP хаягийг түгж. Дээр нь дахин оролдого хийж болох хаягуудыг ч мөн түгжих.',
'ipbsubmit'                   => 'Энэ хэрэглэгчийг түгжих',
'ipbother'                    => 'Өөр хугацаа',
'ipboptions'                  => '15 минут:15 minutes,30 минут:30 minutes,2 цаг:2 hours,1 өдөр:1 өдөр,3 days:3 өдөр,1 долоо хоног:1 week,2 долоо хоног:2 weeks,1 сар:1 month,3 сар:3 months,6 сар:6 months,1 жил:1 year,хугацаагүй:infinite', # display1:time1,display2:time2,...
'ipbotheroption'              => 'бусад',
'ipbotherreason'              => 'Өөр/нэмэлт шалтгаан:',
'ipbhidename'                 => 'Хэрэглэгчийн нэрийг түгжээний лог, одоо хэрэгжиж буй түгжээний жагсаалт болон хэрэглэгчийн жагсаалтаас нууцлах',
'badipaddress'                => 'Хүчингүй IP хаяг',
'blockipsuccesssub'           => 'Түгжээ амжилттай боллоо.',
'blockipsuccesstext'          => '[[Special:Contributions/$1|$1]] түгжигдсэн.
<br />Түгжилтийн тоймыг [[Special:IPBlockList|түгжигдсэн IP-ийн жагсаалт]]аас үзнэ үү.',
'ipb-edit-dropdown'           => 'Түгжих шалтгаануудыг засварлах',
'ipb-unblock-addr'            => '$1-н түгжээг тайлах',
'ipb-unblock'                 => 'Хэрэглэгчийн нэр эсвэл IP хаягийн түгжээг тайлах',
'ipb-blocklist-addr'          => '$1-д байгаа түгжээнүүдийг харах',
'ipb-blocklist'               => 'Байгаа түгжээнүүдийг харах',
'unblockip'                   => 'Хэрэглэгчийг идэвхижүүлэх',
'unblockiptext'               => 'Өмнө нь хориг тавьсан интернет хаяг юм уу хэрэглэгчийн бичих эрхийг сэргээхийн тулд дорх маягтыг ашигла.',
'ipusubmit'                   => 'Энэ хаягийн түгжээг буцаах',
'unblocked'                   => '[[User:$1|$1]]-ийн хориг цуцлагдсан (идэвхижсэн) байна.',
'unblocked-id'                => '$1 түгжээг авч хаялаа',
'ipblocklist'                 => 'Түгжигдсэн хэрэглэгчдийн нэрс болон IP хаягуудын жагсаалт',
'ipblocklist-legend'          => 'Түгжигдсэн хэрэглэгчийг хайх',
'ipblocklist-username'        => 'Хэрэглэгчийн нэр эсвэл IP хаяг:',
'ipblocklist-submit'          => 'Хайх',
'blocklistline'               => '$1, $2 нь $3 ($4)-г түгжив.',
'infiniteblock'               => 'тодорхойгүй',
'expiringblock'               => '$1-д хугацаа нь дуусна',
'anononlyblock'               => 'зөвхөн бүртгэгдээгүйг',
'noautoblockblock'            => 'Автоматаар түгжихийг хаасан байна.',
'createaccountblock'          => 'шинэ бүртгэл үүсгэх явдлыг түгжсэн',
'emailblock'                  => 'и-мэйл түгжигдлээ',
'ipblocklist-empty'           => 'Түгжээний жагсаалт хоосон байна.',
'ipblocklist-no-results'      => 'Өгсөн IP хаяг эсвэл хэрэглэгчийн нэр түгжигдээгүй байна.',
'blocklink'                   => 'түгжих',
'unblocklink'                 => 'түгжээг тайлах',
'contribslink'                => 'хувь нэмэр',
'autoblocker'                 => 'Автоматаар түгжигдлээ. Учир нь таны IP хаягийг "[[User:$1|$1]]" нь хэрэглэж байжээ. "$1"-г түгжих болсон шалтгаан нь: "\'\'\'$2\'\'\'"',
'blocklogpage'                => 'Түгжээний лог',
'blocklogentry'               => '[[$1]] нь $2 $3 хугацаатайгаар түгжигдсэн',
'blocklogtext'                => 'Энэ нь хэрэглэгчийг түгжсэн болон тайлсан үйлдлийн лог юм.
Автоматаар түгжигдсэн IP хаягууд жагсаагдаагүй.
[[Special:IPBlockList|IP хаягийн түгжээний жагсаалтыг]] харж одоо түгжигдсэн хаягуудыг харна уу.',
'unblocklogentry'             => '$1 идэвхтэй',
'block-log-flags-anononly'    => 'зөвхөн нэргүй хэрэглэгчид',
'block-log-flags-nocreate'    => 'Бүртгэл үүсгэх боломжгүй',
'block-log-flags-noautoblock' => 'автотүгжээ зогсоогдсон',
'block-log-flags-noemail'     => 'и-мэйл түгжигдсэн',
'range_block_disabled'        => 'Системийн операторуудын хэсгийн түгжээ хийх чадварыг зогсоосон байна.',
'ipb_expiry_invalid'          => 'Түгжээ нээгдэх хугацааг оруулаагүй байна.',
'ipb_already_blocked'         => '"$1" нь аль хэдийн түгжигдсэн байна.',
'ipb_cant_unblock'            => 'Алдаа: Түгжигдсэн ID $1 нь олдохгүй байна. Түгжээ нь аль хэдийн тайлагдсан байж болзошгүй.',
'ipb_blocked_as_range'        => 'Алдаа: $1 гэсэн IP хаяг нь шууд түгжигдээгүй бөгөөд тайлах боломжгүй байна.
Харин энэ нь $2 хэсгийн хэсэг болж түгжигдсэн байгаа бөгөөд үүнийг тайлах боломжтой.',
'ip_range_invalid'            => 'Хүчингүй IP-н хүрээ.',
'blockme'                     => 'Намайг түгж',
'proxyblocker'                => 'Түгжигч прокси',
'proxyblocker-disabled'       => 'Энэ функцийг хаасан байна.',
'proxyblockreason'            => 'Таны IP хаяг нь чөлөөт прокси учраас түгжигдсэн байна.
Та өөрийн ISP-тэйгээ холбоо барьж техникийн зөвлөгөө авч энэ асуудлынхаа тухай хэлнэ үү.',
'proxyblocksuccess'           => 'Гүйцэтгэсэн.',
'sorbsreason'                 => '{{SITENAME}}-н хэрэглэдэг DNSBL-д таны IP хаягийг чөлөөт прокси хэмээн тодорхойлсон байна.',
'sorbs_create_account_reason' => '{{SITENAME}}-н хэрэглэдэг DNSBL-д таны IP хаягийг чөлөөт прокси гэж тэмдэглэсэн байна.
Та бүртгэл үүсгэх боломжгүй.',

# Developer tools
'lockdb'              => 'Мэдээллийн баазыг түгжих',
'unlockdb'            => 'Мэдээллийн сангийн цоожийг тайл',
'lockdbtext'          => 'Мэдээллийн баазыг түгжсэнээр бүх хэрэглэгчид ямар нэг хуудсанд засвар хийх, өөрийн тохиргоо, хянах листийг өөрчлөх болон мэдээллийн баазад өөрчлөлт оруулах бусад үйлдлийг хийх боломжгүй болно. Та үнэхээр үүнийг хийхийг хүсч байгаа бөгөөд хийх гэж буй засвараа дуусгасны дараа түгжээг тайлна гэдгээ батална уу.',
'unlockdbtext'        => 'Мэдээллийн сангийн цоожийг цуцласнаар бүх хэрэглэгчдэд хуудас засварлах, өөрсдийн тохируулгыг өөрчлөх, хянах жагсаалтаа засах болон мэдээлийн санг өөрчлөхөд хүргэх бусад үйлдлүүдийг хийх эрхийг олгоно. Эдгээр нь таны хийх гэсэн зүйлс мөн эсэхийг дахин нэг баталгаажуулна уу.',
'lockconfirm'         => 'Тийм, би мэдээллийн баазыг түгжихийг үнэхээр хүсч байна.',
'unlockconfirm'       => 'Тийм,үнэхээр би энэ мэдээллийн сангийн цоожийг тайлахыг хүсэж байна',
'lockbtn'             => 'Мэдээллийн баазыг түгжих',
'unlockbtn'           => 'Мэдээллийн баазын цоожийг тайл',
'locknoconfirm'       => 'Та хайрцагт тэмдэглээгүй байна.',
'lockdbsuccesssub'    => 'Мэдээллийн баазыг амжилттайгаар түгжлээ.',
'unlockdbsuccesssub'  => 'Мэдээллийн сангийн цоожийг авлаа',
'lockdbsuccesstext'   => 'Мэдээллийн баазыг түгжлээ.
<br />Та засвараа хийж дууссаны дараа [[Special:UnlockDB|түгжээг тайлах]]аа мартуузай.',
'unlockdbsuccesstext' => 'Мэдээллийн сангийн цоожийг тайллаа.',
'lockfilenotwritable' => 'Мэдээллийн сан цоожлоход файл бичигдэхгүй болно. Мэдээллийн санг цоожлох болон тайлах нь файл хуулж болох вэб сервер тусламжтай хийгдэнэ.',
'databasenotlocked'   => 'Мэдээллийн сан нь түгжигдээгүй байна.',

# Move page
'move-page'               => '$1-г зөөх',
'move-page-legend'        => 'Хуудсыг зөөх',
'movepagetext'            => "Хуудасны нэрийг өөрчилж, түүний бүх түүхийг шинэ нэр рүү шилжүүлэхэд доорх цонхыг ашиглана. Хуучин гарчиг нь шинэ гарчиг руух шууд холбогч болно. 
Хуучин гарчигны холбоос өөрчлөгдөхгүй үлдэх ба давхардсан юм уу тасарсан холбогч байгаа эсэхийг шалгаарай. 
Та холбоосууд заасан зүйлээ олж байгаа эсэхийг заавал шалгаарай.

Шинэ гарчигтай адил нэртэй хуудас байвал тийшээ '''зөөгдөхгүй''' (тэр хуудас хоосон, шууд холбогч, түүхгүй үед л зөөгдөнө) гэдгийг анхаараарай. Энэ нь одоо байгаа хуудсыг дарж бичиж болохгүй ба саяхан зөөгдсөн хуудасны хуучин гарчгийг буцаан өгч алдаагаа засч болно гэсэн үг юм.

<b>АНХААР!</b> Энэ үйлдэл нь нийтлэг хуудсуудад засч болшгүй өөрчлөлт оруулж магадгүй тул та хийх гэж байгаа үйлдлийнхээ үр дагаврыг сайн ойлгож байгаа гэдэгт итгэж байгаагаа илтгээрэй.",
'movepagetalktext'        => "Харгалзах хэлэлцүүлгийн хуудас нь автоматаар үүнтэй хамт зөөгдөх болно. '''Зөөгдөхгүй байх тохиолдол нь:'''
*Шинэ нэр дээр нь хоосон биш хэлэлцүүлгийн хуудас байгаа
*Доорх дөрвөлжинг хоосон болгосон

Эдгээр тохиолдлуудад уг хуудсыг гар аргаар зөөх эсвэл нэгтгэх шаардлагатай болно.",
'movearticle'             => 'Хуудсыг зөөх:',
'movenotallowed'          => 'Таньд {{SITENAME}} дээрх хуудсуудыг зөөх зөвшөөрөл байхгүй байна.',
'newtitle'                => 'Шинээр нэрлэх:',
'move-watch'              => 'Энэ хуудсыг хянах',
'movepagebtn'             => 'Хуудсыг зөөх',
'pagemovedsub'            => 'Амжилттай зөөгдлөө',
'movepage-moved'          => '<big>\'\'\'"$1" нь "$2" руу зөөгдлөө\'\'\'</big>', # The two titles are passed in plain text as $3 and $4 to allow additional goodies in the message.
'articleexists'           => 'Ийм нэртэй хуудсыг өмнө нь үүсгэсэн, эсвэл сонгосон нэр тань хүчингүй байна.
Өөр нэр сонгоно уу.',
'cantmove-titleprotected' => 'Шинэ гарчигтай хуудас нь үүсгэгдэхээс хамгаалагдсан тул та ийшээ хуудсыг зөөх боломжгүй.',
'talkexists'              => "'''Хуудас өөрөө амжилттай зөөгдсөн боловч шинэ нэр дээр хэлэлцүүлэг байгаа тул хэлэлцүүлгийн хуудас нь зөөгдсөнгүй.
Хэлэлцүүлгийн хуудсуудыг гар аргаар нэгтгэнэ үү.'''",
'movedto'                 => 'Зөөгдсөн газар:',
'movetalk'                => 'Харгалзах хэлэлцүүлгийн хуудсыг зөөх',
'1movedto2'               => '[[$1]] нь [[$2]] руу зөөгдлөө',
'1movedto2_redir'         => '[[$1]] нь [[$2]] руу дахин чиглэнэ.',
'movelogpage'             => 'Зөөлтийн лог',
'movelogpagetext'         => 'Доорх нь зөөвөрлөгдсөн хуудасны лист.',
'movereason'              => 'Шалтгаан:',
'revertmove'              => 'буцаах',
'delete_and_move'         => 'Устгах ба Зөөх',
'delete_and_move_text'    => '==устгахыг шаардав== Энэ "[[:$1]]" нь урьд нь оруулсан байна. Та зөөвөрлөлтөнд зам үүсгэхийн тулд устгахыг хүсэж байна уу？',
'delete_and_move_confirm' => 'Тийм, Хуудсыг устгана.',
'delete_and_move_reason'  => 'зөөвөрлөлтөнд зам үүсгэхийн тулд устгагдсан.',
'selfmove'                => 'Зөөгдөх гэж байгаа хуудас болон шинээр нэрлэх гэж байгаа хуудасны нэрүүд ижил байна;
хуудсыг өөр рүү нь зөөж болохгүй.',
'immobile_namespace'      => 'Тусгай төрлийн байршилын эсвэл эх үүсвэрийн нэршил; нэрсээс зөөх ба оруулах нь боломжгүй.',

# Export
'export'            => 'Хуудсыг экспортлох',
'exportcuronly'     => 'Бүх түүхийг биш, зөвхөн одоогийн өөрчлөлтийг багтаа',
'exportnohistory'   => "----
'''Анхаар:''' Энэ маягтын дагуу хуудсуудын бүтэн түүхийг экспортлох үйлдэл гүйцэтгэлийн шалтгаануудын улмаас зогсоогдсон байна.",
'export-submit'     => 'Экспортлох',
'export-addcattext' => 'Дараах ангиллаас хуудсуудыг нэмэх:',
'export-addcat'     => 'Нэмэх',
'export-download'   => 'Файл гэж хадгалах',
'export-templates'  => 'Загваруудыг оруулах',

# Namespace 8 related
'allmessages'               => 'Системийн мэдэгдлүүд',
'allmessagesname'           => 'Нэр',
'allmessagesdefault'        => 'Анхны текст',
'allmessagescurrent'        => 'Одоогийн текст',
'allmessagestext'           => 'Энэ бол МедиаВики дахь системийн мэдэгдлүүдийн жагсаалт юм.
МедиаВикиг орчуулах тухай мэдээллийг [http://www.mediawiki.org/wiki/Localisation МедиаВикигийн орчуулга], мөн [http://translatewiki.net Бетавики]-гаас авна уу.',
'allmessagesnotsupportedDB' => "'''\$wgUseDatabaseMessages''' нь унтарсан байгаа тул '''Special:Allmessages'''-г хэрэглэж болохгүй.",
'allmessagesfilter'         => 'Мэдэгдлийн нэрийн шүүлтүүр:',
'allmessagesmodified'       => 'Зөвхөн өөрчлөгдсөнийг нь харуулах',

# Thumbnails
'thumbnail-more'           => 'Томруулах',
'filemissing'              => 'Файл байхгүй байна',
'thumbnail_error'          => 'Жижиг зургийг үүсгэхэд алдаа гарлаа: $1',
'djvu_page_error'          => 'DjVu хуудас хэсгийн гадна байна',
'djvu_no_xml'              => 'DjVu файлын XML-г авч чадсангүй',
'thumbnail_invalid_params' => 'Жижиг зургийн параметр хүчингүй байна',
'thumbnail_dest_directory' => 'Зорьсон санг үүсгэх боломжгүй байна',

# Special:Import
'import'                     => 'Хуудаснуудыг импортлох',
'importinterwiki'            => 'Транс-викигийн импорт',
'import-interwiki-text'      => 'Импортлох вики болон хуудасны нэрийг сонгоно уу.
Засварын огноонууд болон засварлагчдын нэрс хэвээр үлдэнэ.
[[Special:Log/import|Импортын логоос]] бүх транс-викигийн үйлдлүүд жагсаагдсан байгаа.',
'import-interwiki-history'   => 'Энэ хуудсын бүх хувилбаруудын түүхийг хуулах',
'import-interwiki-submit'    => 'Импортлох',
'import-interwiki-namespace' => 'Дараах нэрний зай руу хуудсуудыг зөөх:',
'importtext'                 => 'Special:Export багажийг ашиглан файлыг эх үүсвэр викигээс татаад, өөрийн дискэнд хадгалаж, энд оруулна уу.',
'importstart'                => 'Хуудсыг импортлож байна...',
'import-revision-count'      => '$1 засвар',
'importnopages'              => 'Импортлох хуудас алга байна.',
'importfailed'               => 'Импорт бүтэлгүйтлээ: $1',
'importunknownsource'        => 'Мэдэгдээгүй төрлийн импортлох эх үүсвэр',
'importcantopen'             => 'Импортлосон файлыг нээж чадсангүй',
'importbadinterwiki'         => 'Интервикигийн хүчингүй холбоос',
'importnotext'               => 'Хоосон эсвэл текст байхгүй',
'importsuccess'              => 'Амжилттай импортлолоо!',
'importhistoryconflict'      => 'Өмнөх хувилбар нь оршин байгаа эсэх нь харшилдаж байна(магадгүй өмнө нь импотлосон хуудас байж болзошгүй)',
'importnosources'            => 'Транс-викигийн импортын эх үүсвэрүүд тодорхойлогдоогүй байгаа бөгөөд түүхийг шууд оруулах явдлыг хаасан байна.',
'importnofile'               => 'Имтортлосон файл хуулагдаагүй байна.',
'importuploaderrorsize'      => 'Импортлогдсон файлыг оруулж чадсангүй. Файлыг хэмжээ зөвшөөрөгдсөн хэмжээнээс том байна.',
'importuploaderrorpartial'   => 'Импортлогдсон файлыг оруулж чадсангүй. Файлын зөвхөн нэг хэсэг нь л оруулагдсан байна.',
'importuploaderrortemp'      => 'Импортлогдсон файлыг оруулж чадсангүй. Түр зуурын хавтас байхгүй байна.',
'import-noarticle'           => 'Оруулах хуудас байхгүй байна!',
'import-nonewrevisions'      => 'Бүх засварууд өмнө нь оруулагдсан байна.',
'xml-error-string'           => '$2-р мөр, $3-р баганад $1 (байт $4): $5',

# Import log
'importlogpage'                    => 'Импортын лог',
'import-logentry-upload'           => 'файлын оруулалтаар [[$1]]-г орууллаа',
'import-logentry-upload-detail'    => '$1 засвар',
'import-logentry-interwiki'        => '$1-г транс-викидлээ',
'import-logentry-interwiki-detail' => '$2-с авсан $1 засвар',

# Tooltip help for the actions
'tooltip-pt-userpage'             => 'Миний хэрэглэгчийн хуудас',
'tooltip-pt-anonuserpage'         => 'Таны хэрэглэж буй IP хаягийн хэрэглэгчийн хуудас',
'tooltip-pt-mytalk'               => 'Миний ярианы хуудас',
'tooltip-pt-anontalk'             => 'Энэ IP хаягаас үйлдсэн засваруудын тухай хэлэлцүүлэг',
'tooltip-pt-preferences'          => 'Миний тохиргоо',
'tooltip-pt-watchlist'            => 'Засварууд нь хянагдаж буй хуудсуудын жагсаалт',
'tooltip-pt-mycontris'            => 'Миний оруулсан хувь нэмрийн жагсаалт',
'tooltip-pt-login'                => 'Заавал хийх ёстой зүйл биш боловч таныг нэвтрэхийг зөвлөж байна.',
'tooltip-pt-anonlogin'            => 'Таныг нэвтрэхийг зөвлөж байна, гэхдээ энэ бол заавал хийх ёстой зүйл биш.',
'tooltip-pt-logout'               => 'Гарах',
'tooltip-ca-talk'                 => 'Хуудасны талаарх хэлэлцүүлэг',
'tooltip-ca-edit'                 => 'Та энэ хуудсыг засварлах боломжтой. Хадгалахынхаа өмнө "Урьдчилан харах" товчлуурыг хэрэглэнэ үү.',
'tooltip-ca-addsection'           => 'Энэ хэлэлцүүлэгт санал бодлоо нэмж оруулах.',
'tooltip-ca-viewsource'           => 'Энэ хуудас хамгаалагдсан байна. Та зөвхөн кодыг нь харах боломжтой.',
'tooltip-ca-history'              => 'Энэ хуудасны өмнөх засварууд.',
'tooltip-ca-protect'              => 'Энэ хуудсыг хамгаалах',
'tooltip-ca-delete'               => 'Энэ хуудсыг устгах',
'tooltip-ca-undelete'             => 'Энэ хуудсыг арилгахын өмнө хийсэн засваруудыг буцаах.',
'tooltip-ca-move'                 => 'Энэ хуудсыг зөөх',
'tooltip-ca-watch'                => 'Энэ хуудсыг хянах жагсаалтандаа нэмэх',
'tooltip-ca-unwatch'              => 'Энэ хуудсыг өөрийн хянаж буй хуудсуудын жагсаалтаас хасах',
'tooltip-search'                  => '{{SITENAME}}-с хайх',
'tooltip-search-go'               => 'Яг ийм нэртэй хуудас байгаа бол түүн рүү явах',
'tooltip-search-fulltext'         => 'Энэ текстийг хуудсуудаас хайх',
'tooltip-p-logo'                  => 'Нүүр хуудас',
'tooltip-n-mainpage'              => 'Нүүр хуудас руу зочлох',
'tooltip-n-portal'                => 'Энэ төслийн тухай, түүн дээр юу хийж болох, ба хаана зүйлсийг мэдэж авах тухай',
'tooltip-n-currentevents'         => 'Сүүлийн үед болсон үйл явдлуудын тухай',
'tooltip-n-recentchanges'         => '{{SITENAME}} дэх хамгийн сүүлийн өөрчлөлтүүдийн жагсаалт.',
'tooltip-n-randompage'            => 'Хамаагүй хуудсыг дуудах',
'tooltip-n-help'                  => 'Туслалцааг олох газар.',
'tooltip-t-whatlinkshere'         => 'Энд холбогдсон бүх вики хуудсуудын жагсаалт',
'tooltip-t-recentchangeslinked'   => 'Энэ хуудаснаас линк хийгдсэн хуудсуудын шинэ өөрчлөлтүүд',
'tooltip-feed-rss'                => 'Энэ хуудасны RSS фийд',
'tooltip-feed-atom'               => 'Энэ хуудасны Atom фийд',
'tooltip-t-contributions'         => 'Энэ хэрэглэгчийн оруулсан бүх хувь нэмрийн жагсаалтыг үзэх',
'tooltip-t-emailuser'             => 'Энэ хэрэглэгчид мэйл илгээх',
'tooltip-t-upload'                => 'Файлыг оруулах',
'tooltip-t-specialpages'          => 'Тусгай хуудаснуудын жагсаалт',
'tooltip-t-print'                 => 'Энэ хуудасны хувилж болох хувилбар',
'tooltip-t-permalink'             => 'Хуудасны одоогийн хувилбар луу очих тогтмол линк',
'tooltip-ca-nstab-main'           => 'Өгүүллийн хуудсыг үзэх',
'tooltip-ca-nstab-user'           => 'Хэрэглэгчийн хуудсыг үзэх',
'tooltip-ca-nstab-media'          => 'Медиа хуудсыг үзэх.',
'tooltip-ca-nstab-special'        => 'Энэ бол тусгай хуудас, та үүнийг шууд засварлах боломжгүй.',
'tooltip-ca-nstab-project'        => 'Төслийн хуудсыг үзэх',
'tooltip-ca-nstab-image'          => 'Файлын хуудсыг үзэх',
'tooltip-ca-nstab-mediawiki'      => 'Системийн мэдэгдлийг үзэх.',
'tooltip-ca-nstab-template'       => 'Загварыг үзэх',
'tooltip-ca-nstab-help'           => 'Тусламжийн хуудсыг үзэх',
'tooltip-ca-nstab-category'       => 'Ангиллын хуудсыг үзэх',
'tooltip-minoredit'               => 'Бага зэргийн засвар гэж тэмдэглэх',
'tooltip-save'                    => 'Засваруудаа хадгалах',
'tooltip-preview'                 => 'Өөрийн оруулах гэж буй өөрчлөлтүүдийг урьдчилан харах. Үүнийг ашиглана уу!',
'tooltip-diff'                    => 'Таны бичлэгт үйлдсэн өөрчлөлтүүдийг харуул.',
'tooltip-compareselectedversions' => 'Энэ хуудасны сонгосон хоёр хувилбарын ялгааг харна уу.',
'tooltip-watch'                   => 'Энэ хуудсыг өөрийн хянах жагсаалтандаа нэмэх',
'tooltip-recreate'                => 'Арилгагдсан хуудсыг дахин эхлүүлэх',
'tooltip-upload'                  => 'Аплоудоо эхлэх',

# Attribution
'anonymous'        => '{{SITENAME}} нэргүй хэрэглэгч(ид)',
'siteuser'         => '{{SITENAME}}-н хэрэглэгч $1',
'lastmodifiedatby' => 'Энэ хуудсыг  $3 нь хамгийн сүүлд өөрчилсөн ба өөрчилсөн нь $2, $1.', # $1 date, $2 time, $3 user
'othercontribs'    => '$1-ий бүтээл дээр тулгуурласан.',
'others'           => 'Бусад',
'siteusers'        => '$1 {{SITENAME}}-н хэрэглэгч',
'creditspage'      => 'Хуудасны кредит',

# Spam protection
'spamprotectiontitle' => 'Спамаас хамгаалах шүүлтүүр',
'spamprotectiontext'  => 'Таны хадгалахыг хүссэн хуудас спамаас хамгаалах шүүлтүүрээр хаагдлаа.
Энэ нь гадны сайт руух холбоосны улмаас гарсан байж магадгүй.',
'spamprotectionmatch' => 'Дараах текст нь манай спамаас хамгаалах шүүлтүүрт баригдлаа: $1',
'spambot_username'    => 'МедиаВикигийн спамыг цэвэрлэх',
'spam_reverting'      => '$1 руух холбоосгүй хамгийн сүүлийн хувилбар руу буцааж байна',
'spam_blanking'       => 'Бүх засварууд $1 руу холбоостой тул хуудсыг хоосолж байна',

# Info page
'infosubtitle'   => 'Хуудасны мэдээлэл',
'numedits'       => 'засварласан тоо (Өгүүлэл): $1',
'numtalkedits'   => 'засварласан тоо (Хэлэлцүүлэгийн хуудас): $1',
'numwatchers'    => 'Хянагчдын тоо: $1',
'numauthors'     => 'Ялгаатай зохиогчдын тоо (Бичлэг): $1',
'numtalkauthors' => 'Ялгаатай зохиогчдын тоо (Хэлэлцүүлэгийн хуудас): $1',

# Math options
'mw_math_png'    => 'Байнга PNG болго',
'mw_math_simple' => 'Хялбар бол HTML, үгүй бол PNG',
'mw_math_html'   => 'Болвол HTML, үгүй бол PNG',
'mw_math_source' => 'TeX хэвээр үлдээх (текстэн броузеруудад)',
'mw_math_modern' => 'Сүүлийн үеийн браузер хэрэглэхийг зөвлөж байна/Интернет хөтлөгчийн шинэ хувилбаруудад зориулсан.',
'mw_math_mathml' => 'Бололцоотой бол MathML (туршилт)',

# Patrolling
'markaspatrolleddiff'                 => 'Хяналтанд авъя',
'markaspatrolledtext'                 => 'Үүнийг хяналтанд авъя',
'markedaspatrolled'                   => 'Хяналтанд авсан',
'markedaspatrolledtext'               => 'Сонгосон нэмэлт/өөрчлөлтийг хяналтанд авлаа.',
'rcpatroldisabled'                    => 'Сүүлийн өөрчлөлтүүдийн эргүүл хаагдсан байна',
'rcpatroldisabledtext'                => 'Сүүлийн өөрчлөлтүүдийн эргүүл одоогоор хаагдсан байна.',
'markedaspatrollederror'              => 'Хяналтанд авч чадсангүй',
'markedaspatrollederrortext'          => 'Хяналтад авахын тулд Та нэмэлт/өөрчлөлтийг заах шаардлагатай.',
'markedaspatrollederror-noautopatrol' => 'Та өөрийн өөрчлөлтүүдээ эргүүлээр хянагдсан гэж тэмдэглэж болохгүй.',

# Patrol log
'patrol-log-page' => 'Эргүүлийн лог',
'patrol-log-auto' => '(автомат)',

# Image deletion
'deletedrevision'                 => '$1-н хуучин сайжруулсан нь устгагдав.',
'filedeleteerror-short'           => 'Файлыг арилгахад алдаа гарлаа: $1',
'filedeleteerror-long'            => 'Дараах файлыг арилгахад алдаа гарлаа:

$1',
'filedelete-missing'              => '"$1" файл байхгүй тул арилгаж болохгүй байна.',
'filedelete-old-unregistered'     => '"$1" гэсэн файлын өөрчлөлт байхгүй байна.',
'filedelete-current-unregistered' => 'Өгөгдсөн "$1" файл байхгүй байна.',
'filedelete-archive-read-only'    => '"$1" архивийн лавлах вебсерверээр бичигдэх боломгүй байна.',

# Browsing diffs
'previousdiff' => '← Өмнөх өөрчлөлт',
'nextdiff'     => 'Дараагийн ялгаа →',

# Media information
'mediawarning'         => "'''Анхаар''':Энэ файл нь хор нөлөөтэй код агуулсан байж болзошгүй, хэрвээ ачааллавал таны системийн аюулгүй байдал доройтож болзошгүй.<hr />",
'imagemaxsize'         => 'Доорх шаардлагын дагуу зургын хуудсанд хязгаарлалт хийлээ:',
'thumbsize'            => 'Жижиг зургийн хэмжээ:',
'widthheightpage'      => '$1×$2, $3 хуудас',
'file-info'            => '(файлын хэмжээ: $1, MIME төрөл: $2)',
'file-info-size'       => '($1 × $2 пиксел, файлын хэмжээ: $3, MIME төрөл: $4)',
'file-nohires'         => '<small>Илүү чанар сайтай хувилбар байхгүй байна.</small>',
'svg-long-desc'        => '(SVG файл, $1 × $2 пиксэл, файлын хэмжээ: $3)',
'show-big-image'       => 'Хамгийн сайн чанартай хувилбар',
'show-big-image-thumb' => '<small>Файлын одоогоор харагдаж буй хэмжээ: $1 × $2 пиксел</small>',

# Special:NewImages
'newimages'             => 'Шинэ файлуудын галерэй',
'imagelisttext'         => "Доорх нь $2-р ангилсан '''$1''' файлын жагсаалт юм.",
'newimages-summary'     => 'Энэ тусгай хуудсанд хамгийн сүүлд оруулагдсан файлуудыг үзүүлнэ.',
'showhidebots'          => '(Роботуудыг $1)',
'noimages'              => 'Харах юмгүй.',
'ilsubmit'              => 'Хайлт',
'bydate'                => 'Огноогоор',
'sp-newimages-showfrom' => '$2, $1-с эхлэж шинэ файлуудыг үзүүлэх',

# Bad image list
'bad_image_list' => 'Формат дараах байдлаар байна:

Зөвхөн жагсаагдсан зүйлс (*-аар эхлэх мөрүүд) тооцогдоно.
Мөр дэх эхний линк муу файл руух холбоос байж таарна.
Үүнтэй адил мөр дэх бусад линкүүд тооцогдохгүй. Өөрөөр хэлбэл, файлын орж болзошгүй хуудсууд юм.',

# Metadata
'metadata'          => 'Зургийн тухай мэдээлэл',
'metadata-help'     => 'Энэ файланд бодвол дижитал аппарат эсвэл сканнераас нэмэгдсэн нэмэлт мэдээлэл байна.
Хэрэв энэ файл анхныхаа байдлаас өөрчлөгдсөн бол зарим мэдээлэл нь одоогийн хувилбартайгаа нийцэхгүй байж магадгүй.',
'metadata-expand'   => 'Дэлгэрэнгүй мэдээллийг харуулах',
'metadata-collapse' => 'Дэлгэрэнгүй мэдээллийг нуух',
'metadata-fields'   => 'Энэ мэдэгдэлд байгаа EXIF мэдээллийн талбарууд мэдээллийн хүснэгт буулгагдсан үед зургын хуудсанд харагдана.
Бусад нь анхнаасаа харагдахгүй байна.
* make
* model
* datetimeoriginal
* exposuretime
* fnumber
* focallength', # Do not translate list items

# EXIF tags
'exif-imagewidth'                  => 'өргөн',
'exif-imagelength'                 => 'өндөр',
'exif-bitspersample'               => 'бүрэлдэхүүн хэсэг бүр дэх бит',
'exif-photometricinterpretation'   => 'Пикселийн бүрэлдэхүүн',
'exif-orientation'                 => 'Зүг чиг',
'exif-stripoffsets'                => 'Зургийн мэдээллийн байршил',
'exif-rowsperstrip'                => 'Зурвас тус бүр дэх мөрийн тоо',
'exif-stripbytecounts'             => 'Шахагдсан зурвас тус бүр дэх байт',
'exif-jpeginterchangeformatlength' => 'JPEG хэлбэртэй мэдээллийн байт',
'exif-datetime'                    => 'Файл өөрчлөгдсөн огноо, цаг',
'exif-imagedescription'            => 'Дүрсний нэр',
'exif-make'                        => 'Зургийн аппарат үйлдвэрлэгч',
'exif-model'                       => 'Зургийн аппаратны загвар',
'exif-software'                    => 'Хэрэглэсэн программ(ууд)',
'exif-artist'                      => 'зохиогч',
'exif-copyright'                   => 'зохиогчын эрхийг эзэмшигч',
'exif-exifversion'                 => 'Exif хувилбар',
'exif-flashpixversion'             => 'Хэрэглэж болох Flashpix хувилбар',
'exif-colorspace'                  => 'өнгөний зай',
'exif-componentsconfiguration'     => 'Бүх бүрэлдэхүүн хэсгүүдийн утга',
'exif-compressedbitsperpixel'      => 'Зургийн файлыг шахах арга',
'exif-pixelydimension'             => 'Зургийн хүчинтэй өргөн',
'exif-pixelxdimension'             => 'Зургийн хүчинтэй өндөр',
'exif-usercomment'                 => 'Хэрэглэгчдийн тэмдэглэл',
'exif-relatedsoundfile'            => 'Холбоотой дуун файл',
'exif-datetimeoriginal'            => 'Мэдээллийг үүсгэсэн огноо ба цаг',
'exif-datetimedigitized'           => 'Дижитал болгосон огноо ба цаг',
'exif-exposuretime-format'         => '$1 секунд ($2)',
'exif-isospeedratings'             => 'ISO хурдны үнэлгээ',
'exif-aperturevalue'               => 'Дамжих хоолой',
'exif-brightnessvalue'             => 'гэрэлтэлт',
'exif-lightsource'                 => 'гэрэлтүүлэгч',
'exif-filesource'                  => 'Файлыг эх үүсвэр',
'exif-cfapattern'                  => 'CFA загвар',
'exif-customrendered'              => 'Дурын зургийн файлыг үзүүлж байна',
'exif-contrast'                    => 'харьцуулан үзэх',
'exif-gpsversionid'                => 'GPS шошгоны хувилбар',
'exif-gpslatituderef'              => 'хойд эсвэл өмнөд өргөрөг',
'exif-gpslatitude'                 => 'өргөрөг',
'exif-gpslongituderef'             => 'Зүүн эсвэл баруун уртраг',
'exif-gpslongitude'                => 'уртраг',
'exif-gpsaltitude'                 => 'далайн түвшин',
'exif-gpstimestamp'                => 'GPS цаг (атом цаг)',
'exif-gpssatellites'               => 'Хэмжээс хийхэд хэрэглэсэн хиймэл дагуулууд',
'exif-gpsstatus'                   => 'Хүлээн авагчийн статус',
'exif-gpsspeedref'                 => 'Хурдны нэгж',
'exif-gpsspeed'                    => 'GPS харилцуурын хурд',
'exif-gpstrack'                    => 'Хөдөлгөөний чиглэл',
'exif-gpsimgdirection'             => 'Зургийн зүг чиг',
'exif-gpsdestlatitude'             => 'Өргөрөгийн байршил',
'exif-gpsdestlongitude'            => 'Уртгагийн байршил',
'exif-gpsdestdistance'             => 'Байршил хүртэлх зай',
'exif-gpsareainformation'          => 'GPS бүсийн нэр',
'exif-gpsdatestamp'                => 'GPS огноо',

# EXIF attributes
'exif-compression-1' => 'Шахаагүй',

'exif-unknowndate' => 'Мэдэгдэхгүй огноо',

'exif-orientation-1' => 'энгийн', # 0th row: top; 0th column: left
'exif-orientation-2' => 'Хөндлөнгөөр эргүүлэх', # 0th row: top; 0th column: right
'exif-orientation-3' => '180° эргүүллээ', # 0th row: bottom; 0th column: right
'exif-orientation-4' => 'Босоогоор эргүүлэх', # 0th row: bottom; 0th column: left
'exif-orientation-5' => 'Цагийн зүүний эсрэгээр 90° эргүүлж босоогоор эргүүллээ', # 0th row: left; 0th column: top
'exif-orientation-6' => 'Цагийн зүүний дагуу 90° эргүүллээ', # 0th row: right; 0th column: top
'exif-orientation-7' => 'Цагийн зүүний дагуу 90° эргүүлж босоогоор эргүүллээ', # 0th row: right; 0th column: bottom
'exif-orientation-8' => 'Цагийн зүүний эсрэгээр 90° эргүүллээ', # 0th row: left; 0th column: bottom

'exif-componentsconfiguration-0' => 'байхгүй байна',

'exif-exposureprogram-0' => 'Тодорхойлоогүй',
'exif-exposureprogram-1' => 'заавар',
'exif-exposureprogram-2' => 'Ердийн программ',

'exif-subjectdistance-value' => '$1 метр',

'exif-meteringmode-0'   => 'Үл мэдэх',
'exif-meteringmode-1'   => 'Дундаж',
'exif-meteringmode-255' => 'Бусад',

'exif-lightsource-0'   => 'Үл мэдэх',
'exif-lightsource-1'   => 'өдрийн гэрэл',
'exif-lightsource-2'   => 'Ионы гэрэлтүүлэг',
'exif-lightsource-3'   => 'Вольфрам (улайссан гэрэл)',
'exif-lightsource-4'   => 'флаш',
'exif-lightsource-9'   => 'Таатай цаг агаар',
'exif-lightsource-10'  => 'Үүлэрхэг цаг агаар',
'exif-lightsource-11'  => 'Сүүдэр',
'exif-lightsource-255' => 'Бусад гэрлийн эх сурвалж',

'exif-focalplaneresolutionunit-2' => 'инч',

'exif-customrendered-0' => 'Нормаль процесс',
'exif-customrendered-1' => 'Энгийн процесс',

'exif-scenecapturetype-0' => 'Стандарт',
'exif-scenecapturetype-1' => 'Байгалийн',
'exif-scenecapturetype-2' => 'Цээж зураг',
'exif-scenecapturetype-3' => 'Шөнийн үзэгдэл',

'exif-gaincontrol-0' => 'Байхгүй',

'exif-contrast-0' => 'энгийн',
'exif-contrast-1' => 'зөөлөн',
'exif-contrast-2' => 'хатуу',

'exif-saturation-0' => 'энгийн',

'exif-sharpness-0' => 'энгийн',
'exif-sharpness-1' => 'Зөөлөн',
'exif-sharpness-2' => 'Хатуу',

'exif-subjectdistancerange-0' => 'Үл мэдэх',

# Pseudotags used for GPSLatitudeRef and GPSDestLatitudeRef
'exif-gpslatitude-n' => 'хойд өргөрөг',
'exif-gpslatitude-s' => 'өмнөд өргөрөг',

# Pseudotags used for GPSLongitudeRef and GPSDestLongitudeRef
'exif-gpslongitude-e' => 'Зүүн ба баруун уртраг',
'exif-gpslongitude-w' => 'баруун уртраг',

'exif-gpsstatus-a' => 'Явцын хэмжүүр',
'exif-gpsstatus-v' => 'Хамтарсан үйлдлийн хэмжүүр',

# Pseudotags used for GPSSpeedRef and GPSDestDistanceRef
'exif-gpsspeed-k' => 'километр/цаг',
'exif-gpsspeed-m' => 'Миль/цаг',

# External editor support
'edit-externally'      => 'Гадны программыг ашиглан энэ файлыг засварлах',
'edit-externally-help' => '[http://www.mediawiki.org/wiki/Manual:External_editors Тохируулгын заавраас] дэлгэрэнгүй мэдээллийг авна уу.',

# 'all' in various places, this might be different for inflected languages
'recentchangesall' => 'Бүгд',
'imagelistall'     => 'бүх',
'watchlistall2'    => 'бүгд',
'namespacesall'    => 'бүгд',
'monthsall'        => 'бүгд',

# E-mail address confirmation
'confirmemail'             => 'мэйл хаягийг баталгаажуулах',
'confirmemail_noemail'     => 'Та өөрийн [[Special:Preferences|хэрэглэгчийн тохиргоо]]нд хүчинтэй мэйл хаяг оруулаагүй байна.',
'confirmemail_text'        => 'Вики нь мэйлийн боломжуудыг ашиглахын тулд мэйл хаягаа баталгаажуулахыг хэрэглэгчээс шаарддаг болно. Та өөрийн хаяг руу баталгаажуулах мэйл илгээхийн тулд доорх товчлуурыг идэвхжүүлнэ үү. Уг мэйл нь код бүхий холбоос агуулах бөгөөд та уг холбоос руу орсноор таны мэйл хаяг баталгаажих болно.',
'confirmemail_send'        => 'Баталгаажуулах кодыг мэйлээр илгээх.',
'confirmemail_sent'        => 'Баталгаажуулах мэйл илгээгдлээ.',
'confirmemail_sendfailed'  => 'Баталгаажуулах мэйлийг илгээж чадсангүй. Та хаягаа зөв бичсэн эсэхээ нягтална уу.

Буцаж ирсэн мэйл: $1',
'confirmemail_invalid'     => 'Баталгаажуулах код хүчингүй байна. Кодны хугацаа хэтэрсэн байж болзошгүй.',
'confirmemail_needlogin'   => '$1-г хийхийн тулд та мэйл хаягаа баталгаажуулах шаардлагатай.',
'confirmemail_success'     => 'Таны мэйл хаяг баталгаажлаа. Та одоо викид нэвтэрч чадна.',
'confirmemail_loggedin'    => 'Таны мэйл хаяг баталгаажлаа.',
'confirmemail_error'       => 'таны баталгаажуулалтыг хадгалах үед ямар нэг зүйл буруу хийгдсэн байна.',
'confirmemail_subject'     => '{{SITENAME}}-гийн мэйл хаягийн баталгаажуулалт',
'confirmemail_body'        => 'Та ч байж магадгүй $1 IP хаягнаас $2 гэсэн хэрэглэгчийн бүртгэлтэй энэ мэйл хаягтай хэн нэг хэрэглэгч {{SITENAME}} бүртгүүлсэн байна. 

Энэ хэрэглэгчийн бүртгэл нь үнэхээр таных уу гэдгийг шалгаж үзээд мэйл хаягаар хийж болох үйлдлүүдийг хүчинтэй болгохын тулд энэ холбоосыг нээнэ үү. 

$3 хэрвээ биш бол нээх хэрэггүй. Баталгаажуулах код нь $4-нд хугацаа нь хэтрэх болно.',
'confirmemail_invalidated' => 'Мэйл хаягыг баталгаажуулах үйлдлийг цуцаллаа',
'invalidateemail'          => 'Мэйл хаягыг баталгаажуулах явдлыг цуцлах',

# Scary transclusion
'scarytranscludetoolong' => '[URL хэт урт байна; уучлаарай]',

# Delete conflict
'deletedwhileediting' => 'Анхаар: Таныг засвар хийж эхлэвэл энэ хуудас устгагдах болно!',
'confirmrecreate'     => "Хэрэглэгч [[User:$1|$1]] ([[User talk:$1|яриа]]) нь таныг энэ хуудсыг засварлаж байх хооронд дараах шалтгааны улмаас устгажээ: ''$2''
Та үнэхээр энэ хуудсыг дахин бий болгомоор байна уу?",
'recreate'            => 'Дахин үүсгэх',

# HTML dump
'redirectingto' => '[[:$1]]-тэй шууд холбогдсон',

# action=purge
'confirm_purge'        => 'энэ хуудасны нөөц хувилбарыг устгах уу?

$1',
'confirm_purge_button' => 'Tэг',

# AJAX search
'searchcontaining' => "''$1''-г агуулсан хуудсуудыг хайх.",
'articletitles'    => "''$1''-ээр эхэлсэн бичлэг",
'hideresults'      => 'Үр дүнг нуух',
'useajaxsearch'    => 'AJAX хайлт ашиглах',

# Multipage image navigation
'imgmultipageprev' => '← өмнөх хуудас',
'imgmultipagenext' => 'дараагийн хуудас →',
'imgmultigo'       => 'Үргэлжлүүл!',

# Table pager
'table_pager_next'         => 'Дараагийн хуудас',
'table_pager_prev'         => 'Өмнөх хуудас',
'table_pager_first'        => 'Эхний хуудас',
'table_pager_last'         => 'Сүүлийн хуудас',
'table_pager_limit'        => 'Хуудас бүрт $1 зүйлийг үзүүлэх',
'table_pager_limit_submit' => 'Явах',
'table_pager_empty'        => 'Үр дүн байхгүй байна',

# Auto-summaries
'autosumm-blank'   => 'Хуудасны агуулгыг устгаж байна.',
'autosumm-replace' => "Хуудсыг '$1'-р сольж байна.",
'autoredircomment' => '[[$1]] руу автоматаар холбогдож байна',
'autosumm-new'     => 'Шинэ хуудас: $1',

# Watchlist editor
'watchlistedit-normal-title' => 'Хянах жагсаалтаа засварлах',
'watchlistedit-raw-title'    => 'Түүхий хянах жагсаалтыг засварлах',
'watchlistedit-raw-legend'   => 'Түүхий хянах жагсаалтыг засварлах',
'watchlistedit-raw-titles'   => 'Гарчигууд:',

# Watchlist editing tools
'watchlisttools-view' => 'Холбогдох өөрчлөлтүүдийг үзэх',
'watchlisttools-edit' => 'Хянаж буй хуудсуудын жагсаалтаа үзэж засварлах',
'watchlisttools-raw'  => 'Хянаж буй хуудсуудын жагсаалтаа текстээр засварлах',

# Special:Version
'version'                  => 'Хувилбар', # Not used as normal message but as header for the special page itself
'version-software'         => 'Суулгасан программ',
'version-software-version' => 'Хувилбар',

# Special:FilePath
'filepath'      => 'файлын зам',
'filepath-page' => 'Файл:',

# Special:FileDuplicateSearch
'fileduplicatesearch-filename' => 'Файлын нэр:',
'fileduplicatesearch-submit'   => 'Хайх',
'fileduplicatesearch-info'     => '$1 × $2 пиксэл<br />Файлын хэмжээ: $3<br />MIME төрөл: $4',

# Special:SpecialPages
'specialpages'             => 'Тусгай хуудсууд',
'specialpages-group-login' => 'Нэвтрэх / бүртгүүлэх',

);
