<?php
/** Tajik (Cyrillic) (Тоҷикӣ (Cyrillic))
 *
 * @ingroup Language
 * @file
 *
 * @author Cbrown1023
 * @author Farrukh
 * @author FrancisTyers
 * @author Ibrahim
 * @author Soroush
 * @author לערי ריינהארט
 */

$namespaceNames = array(
	NS_MEDIA          => "Медиа",
	NS_SPECIAL        => "Вижа",
	NS_MAIN           => "",
	NS_TALK           => "Баҳс",
	NS_USER           => "Корбар",
	NS_USER_TALK      => "Баҳси_корбар",
	# NS_PROJECT set by $wgMetaNamespace
	NS_PROJECT_TALK   => "Баҳси_$1",
	NS_IMAGE          => "Акс",
	NS_IMAGE_TALK     => "Баҳси_акс",
	NS_MEDIAWIKI      => "Медиавики",
	NS_MEDIAWIKI_TALK => "Баҳси_медиавики",
	NS_TEMPLATE       => "Шаблон",
	NS_TEMPLATE_TALK  => "Баҳси_шаблон",
	NS_HELP           => "Роҳнамо",
	NS_HELP_TALK      => "Баҳси_роҳнамо",
	NS_CATEGORY       => "Гурӯҳ",
	NS_CATEGORY_TALK  => "Баҳси_гурӯҳ",
);

$datePreferences = array(
	'default',
	'dmy',
	'persian',
	'ISO 8601',
);

$defaultDateFormat = 'dmy';

$datePreferenceMigrationMap = array(
	'default',
	'default',
	'default',
	'default'
);

$dateFormats = array(
	'dmy time' => 'H:i',
	'dmy date' => 'j xg Y',
	'dmy both' => 'H:i، j xg Y',

	'persian time' => 'H:i',
	'persian date' => 'xij xiF xiY',
	'persian both' => 'H:i، xij xiF xiY',

	'ISO 8601 time' => 'xnH:xni:xns',
	'ISO 8601 date' => 'xnY-xnm-xnd',
	'ISO 8601 both' => 'xnY-xnm-xnd"T"xnH:xni:xns',
);

$linkTrail = '/^([a-zабвгдеёжзийклмнопрстуфхчшъэюяғӣқўҳҷцщыь]+)(.*)$/sDu';

$messages = array(
# User preference toggles
'tog-underline'               => 'Зерпайвандҳо хат кашида шаванд:',
'tog-highlightbroken'         => 'Пайвандҳои шикастаро <a href="" class="new">ҳамин хел</a> қолаббандӣ кунед (Имкони дигар:ба ин шакл<a href="" class="internal">?</a>).',
'tog-justify'                 => 'Тамомченкардани бандҳо',
'tog-hideminor'               => 'Нишон надодани тағйироти ҷузъи дар феҳристи тағйироти охир',
'tog-extendwatchlist'         => 'Густариши феҳристи пайгириҳо барои нишон додани ҳамаи тағйиротҳои марбута',
'tog-usenewrc'                => 'Тағйироти охири густаришёфта(ҶаваСкрипт барои ҳар мурургаре нест)',
'tog-numberheadings'          => 'шуморагузори~и худкори инвонҳо',
'tog-showtoolbar'             => 'Намоиши навори абзори вироиш (JavaScript)',
'tog-editondblclick'          => 'Вироиш намудани саҳифаҳо ҳангоми ду карат пахш намудани тугмаи мушак (JavaScript)',
'tog-editsection'             => 'Иҷозат додани вироиши қисмати саҳифа ба воситаи пайванди [вироиш]',
'tog-editsectiononrightclick' => 'Ба кор андохтани вироиши сарлавҳаҳои қисматҳо бо клики рост (ҶаваСкрипт)',
'tog-showtoc'                 => 'Намоиши феҳристи мундариҷон (барои мақолаҳои бо беш аз 3 сарлавҳа)',
'tog-rememberpassword'        => 'Маро дар хотири компютер нигоҳ дор',
'tog-editwidth'               => 'Қуттии вироиш бари пурра дорад',
'tog-watchcreations'          => 'Дохил намудани саҳифаҳое, ки ман сохтаам ба феҳристи назароти ман',
'tog-watchdefault'            => 'Саҳифаҳои эҷодкардаамро ба феҳристи пайгириам илова кунед',
'tog-watchmoves'              => 'Саҳифаҳои кӯчонидаамро ба феҳристи пайгириҳоям илова кунед',
'tog-watchdeletion'           => 'Саҳифаҳои эҷодкардаи манро ба феҳристи пайгириҳоям илова кунед',
'tog-minordefault'            => 'Пешфарзи ҳамаи вироишҳоро ҷузъи ишора кунед',
'tog-previewontop'            => 'Намоиши пешнамоиши қаблӣ пеш аз қуттии вироиш ва на пас аз он',
'tog-previewonfirst'          => 'Нишон додани пешнамоиш дар нахустин вироиш',
'tog-nocache'                 => 'Аз кор андохтани ҳофизаи ниҳонии саҳифа',
'tog-enotifwatchlistpages'    => 'Агар саҳифае мавриди пайгирии ман тағйир карда шавад ба ман тариқи почтаи электронӣ пайём бифиристед.',
'tog-enotifusertalkpages'     => 'Ҳангоме ки дар саҳифаи корбариам тағйир дода мешавад ба ман тариқи почтаи электронӣ пайём бифиристед.',
'tog-enotifminoredits'        => 'Барои тағйироти ҷузъи ба ман тариқи почтаи электронӣ пайём бифиристед.',
'tog-enotifrevealaddr'        => 'Нишонаи почтаи электронии ман дар номаҳои иттилорасонӣ қайд шавад',
'tog-shownumberswatching'     => 'Нишон додани шумораи корбарони пайгир',
'tog-fancysig'                => 'Имзоҳои хом (бе пайванди худкор)',
'tog-externaleditor'          => 'Ба таври пешфарз аз вироишгари хориҷӣ истифода шавад (танҳо барои корбарони бо таҷриба, ниёз ба муҳити вижа дар компютери шумо дорад)',
'tog-externaldiff'            => 'Истифода аз тафовутгири хориҷӣ ба таври пешфарз (танҳо барои корбарони бо таҷриба, ниёз ба муҳити вижа дар компютери шумо дорад)',
'tog-showjumplinks'           => 'Намоиши пайвандҳои дастрасии "ҷаҳиш ба" дар феҳристи мундариҷот',
'tog-uselivepreview'          => 'Истифода аз пешнамоиши зинда (ҶаваСкрипт) (Озмоишӣ)',
'tog-forceeditsummary'        => 'Ҳангоме ки хулосаи вироиш нанавиштаам юа ман ислоҳ бидеҳ',
'tog-watchlisthideown'        => 'Пинҳон намудани вироишҳои ман дар феҳристи назарот',
'tog-watchlisthidebots'       => 'Пинҳон намудани вироишҳои бот дар феҳристи назарот',
'tog-watchlisthideminor'      => 'Пинҳон намудани вироишҳои хурд дар феҳристи назарот',
'tog-ccmeonemails'            => 'Нусхаҳои хатҳоро ба ман рои кунед, ман онҳоро ба корбарон рои мекунам',
'tog-diffonly'                => 'Муҳтавиёти саҳифаи зерин намоиш дода нашавад',
'tog-showhiddencats'          => 'Гурӯҳҳои пинҳонро намоиш бидеҳ',

'underline-always'  => 'Доимо',
'underline-never'   => 'Ҳеҷгоҳ',
'underline-default' => 'Пешфарзи мурургар',

'skinpreview' => '(Пешнамоиш)',

# Dates
'sunday'        => 'Якшанбе',
'monday'        => 'Душанбе',
'tuesday'       => 'Сешанбе',
'wednesday'     => 'Чоршанбе',
'thursday'      => 'Панҷшанбе',
'friday'        => 'Ҷумъа',
'saturday'      => 'Шанбе',
'sun'           => 'Яш',
'mon'           => 'Ду',
'tue'           => 'Сш',
'wed'           => 'Чш',
'thu'           => 'Пш',
'fri'           => 'Ҷу',
'sat'           => 'Шн',
'january'       => 'Январ',
'february'      => 'Феврал',
'march'         => 'Март',
'april'         => 'Апрел',
'may_long'      => 'май',
'june'          => 'Июн',
'july'          => 'Июл',
'august'        => 'Август',
'september'     => 'Сентябр',
'october'       => 'Октябр',
'november'      => 'Ноябр',
'december'      => 'Декабр',
'january-gen'   => 'Январ',
'february-gen'  => 'феврали',
'march-gen'     => 'марти',
'april-gen'     => 'Апрел',
'may-gen'       => 'май',
'june-gen'      => 'июни',
'july-gen'      => 'Июл',
'august-gen'    => 'Август',
'september-gen' => 'сентябри',
'october-gen'   => 'Октябр',
'november-gen'  => 'Ноябр',
'december-gen'  => 'Декабри',
'jan'           => 'Ян',
'feb'           => 'Фев',
'mar'           => 'Мар',
'apr'           => 'Апр',
'may'           => 'май',
'jun'           => 'Июн',
'jul'           => 'Июл',
'aug'           => 'Авг',
'sep'           => 'Сент',
'oct'           => 'Окт',
'nov'           => 'Нов',
'dec'           => 'Дек',

# Categories related messages
'pagecategories'                 => '{{PLURAL:$1|Гурӯҳ|Гурӯҳҳо}}',
'category_header'                => 'Мақолаҳо дар гурӯҳи "$1"',
'subcategories'                  => 'Зергурӯҳҳо',
'category-media-header'          => 'Парвандаҳои гурӯҳ "$1"',
'category-empty'                 => "''Дар ҳоли ҳозир ин гурӯҳ дорои мақола ё парвандаҳо нест.''",
'hidden-categories'              => '{{PLURAL:$1|Гурӯҳи пинҳон|Гурӯҳҳои пинҳон}}',
'hidden-category-category'       => 'Гурӯҳҳои пинҳон', # Name of the category where hidden categories will be listed
'category-subcat-count'          => '{{PLURAL:$2|Ин гурӯҳ фақат зергурӯҳҳои зеринро дорад.|Ин гурӯҳ дар кул аз $2, {{PLURAL:$1|зергурӯҳ|$1 зергурӯҳҳо}} дорад.}}',
'category-subcat-count-limited'  => 'Ин гурӯҳ шомили {{PLURAL:$1|як зергурӯҳ|$1 зергурӯҳҳо}} мебошад.',
'category-article-count'         => '{{PLURAL:$2|Ин гурӯҳ шомили фақат саҳифаи зерин аст.|{{PLURAL:$1|саҳифаи|$1 саҳифаҳои}} зерин дар ин гурӯҳ, кули ҳавои $2 саҳифа аст.}}',
'category-article-count-limited' => '{{PLURAL:$1|саҳифаи|$1 саҳифаҳои}} зерин дар гурӯҳи феълӣ қарор {{PLURAL:дорад|доранд}}.',
'category-file-count'            => '{{PLURAL:$2|Ин гурӯҳ танҳо парвандаи зеринро дар бар мегирад.|{{PLURAL:$1|Ин парвандаи|$1 парвандаҳои}} зерин дар ин гурӯҳ қарор {{PLURAL:$1|дорад|доранд}}. Ин гурӯҳ дар кул ҳавои $2 саҳифа аст.}}',
'category-file-count-limited'    => '{{PLURAL:$1|парвандаи|$1 парвандаҳои}} зерин дар гурӯҳи феълӣ қарор {{PLURAL:дорад|доранд}}.',
'listingcontinuesabbrev'         => 'идома',

'mainpagetext'      => "<big>'''Нармафзори МедиаВики бо муваффақият насб шуд.'''</big>",
'mainpagedocfooter' => 'Аз [http://meta.wikimedia.org/wiki/Help:Contents Роҳнамои Корбарон] барои истифодаи нармафзори вики кӯмак бигиред.

== Оғоз ба кор ==

* [http://www.mediawiki.org/wiki/Manual:Configuration_settings Феҳристи танзимоти пайгирбандӣ]
* [http://www.mediawiki.org/wiki/Manual:FAQ Пурсишҳои МедиаВики]
* [http://lists.wikimedia.org/mailman/listinfo/mediawiki-announce Феҳристи ройномаҳои нусхаҳои МедиаВики]',

'about'          => 'Дар бораи',
'article'        => 'Саҳифаи мӯҳтаво',
'newwindow'      => '(дар равзанаи ҷадид боз мешавад)',
'cancel'         => 'Лағв',
'qbfind'         => 'Ёфтан',
'qbbrowse'       => 'Мурур',
'qbedit'         => 'Вироиш',
'qbpageoptions'  => 'Ин саҳифа',
'qbpageinfo'     => 'Бофт',
'qbmyoptions'    => 'Саҳифаҳои ман',
'qbspecialpages' => 'Саҳифаҳои вижа',
'moredotdotdot'  => 'Бештар...',
'mypage'         => 'Саҳифаи ман',
'mytalk'         => 'Гуфтугӯи ман',
'anontalk'       => 'Баҳс бо ин IP',
'navigation'     => 'Гаштан',
'and'            => 'ва',

# Metadata in edit box
'metadata_help' => 'Метадода:',

'errorpagetitle'    => 'Хато',
'returnto'          => 'Бозгашт ба $1.',
'tagline'           => 'Аз {{SITENAME}}',
'help'              => 'Роҳнамо',
'search'            => 'Ҷустуҷӯ',
'searchbutton'      => 'Ҷустуҷӯ',
'go'                => 'Рав',
'searcharticle'     => 'Бирав',
'history'           => 'Таърих',
'history_short'     => 'Таърих',
'updatedmarker'     => 'барӯзшуда аз рӯзи охирин ташрифам',
'info_short'        => 'Иттилоот',
'printableversion'  => 'Нусхаи чопӣ',
'permalink'         => 'Пайванди доимӣ',
'print'             => 'Чоп',
'edit'              => 'Вироиш',
'create'            => 'Эҷод',
'editthispage'      => 'Вироиши ин саҳифа',
'create-this-page'  => 'Эҷод кардани ин саҳифа',
'delete'            => 'Ҳазф',
'deletethispage'    => 'Ин саҳифаро ҳазф кунед',
'undelete_short'    => 'Эҳёи {{PLURAL:$1|вироиш|$1 вироишот}}',
'protect'           => 'Ҳифз кардан',
'protect_change'    => 'тағйири муҳофизат',
'protectthispage'   => 'Ҳифз намудани ин саҳифа',
'unprotect'         => 'Тағйири сатҳи муҳофизат',
'unprotectthispage' => 'Аз муҳофизат дар овардани ин саҳифа',
'newpage'           => 'Саҳифаи нав',
'talkpage'          => 'Ин саҳифаро муҳокима кунед',
'talkpagelinktext'  => 'Баҳс',
'specialpage'       => 'Саҳифаи вижа',
'personaltools'     => 'Абзорҳои шахсӣ',
'postcomment'       => 'Фиристодани назар',
'articlepage'       => 'Намоиши мақола',
'talk'              => 'Баҳс',
'views'             => 'Назарот',
'toolbox'           => 'Ҷаъбаи абзор',
'userpage'          => 'Саҳифаи корбарро бинед',
'projectpage'       => 'Дидани саҳифаи лоиҳа',
'imagepage'         => 'Намоиши саҳифаи акс',
'mediawikipage'     => 'Намоиши саҳифаи акс',
'templatepage'      => 'Нигаристани саҳифаи шаблон',
'viewhelppage'      => 'Намоиши саҳифаи роҳнамо',
'categorypage'      => 'Намоиши саҳифаи гурӯҳ',
'viewtalkpage'      => 'Намоиши мубоҳисот',
'otherlanguages'    => 'бо забонҳои дигар',
'redirectedfrom'    => '(Тағйири масир аз $1)',
'redirectpagesub'   => 'Саҳифаи равонакунӣ',
'lastmodifiedat'    => 'Ин саҳифа бори охир $2, $1 дигаргун карда шудааст.', # $1 date, $2 time
'viewcount'         => 'Ин саҳифа {{PLURAL:$1|бор|$1 бор}} дида шудааст.',
'protectedpage'     => 'Саҳифаи муҳофизатшуда',
'jumpto'            => 'Ҷаҳиш ба:',
'jumptonavigation'  => 'гаштан',
'jumptosearch'      => 'Ҷустуҷӯи',

# All link text and link target definitions of links into project namespace that get used by other message strings, with the exception of user group pages (see grouppage) and the disambiguation template definition (see disambiguations).
'aboutsite'            => 'Дар бораи {{SITENAME}}',
'aboutpage'            => 'Project:Дар бораи',
'bugreports'           => 'Гузориши ишколот',
'bugreportspage'       => 'Project:Гузоришҳои ишколот',
'copyright'            => 'Мӯҳтаво таҳти иҷозатномаи $1 дастрас аст.',
'copyrightpagename'    => 'Википедиа copyright',
'copyrightpage'        => '{{ns:project}}:Copyrights',
'currentevents'        => 'Вокеаҳои кунунӣ',
'currentevents-url'    => 'Project:Воқеаҳои кунунӣ',
'disclaimers'          => 'Такзибнома',
'disclaimerpage'       => 'Project:Такзибномаи умумӣ',
'edithelp'             => 'Роҳнамои вироиш',
'edithelppage'         => 'Help:Вироиш',
'faq'                  => 'Саволҳои тез-тез пурсидашуда',
'faqpage'              => 'Project:Саволҳои тез-тез пурсидашуда',
'helppage'             => 'Help:Мундариҷа',
'mainpage'             => 'Саҳифаи Аслӣ',
'mainpage-description' => 'Саҳифаи Аслӣ',
'policy-url'           => 'Project:Сиёсатҳо',
'portal'               => 'Вуруди корбарон',
'portal-url'           => 'Project:Вуруди корбарон',
'privacy'              => 'Сиёсати ҳифзи асрор',
'privacypage'          => 'Project:Сиёсати ҳифзи асрор',

'badaccess'        => 'Иштибоҳи иҷоза',
'badaccess-group0' => 'Шумо рухсати иҷрои амали дархостшударо надоред.',
'badaccess-group1' => 'Амали шумо дархосткарда ба корбарони ин гурӯҳ $1 маҳдуд аст.',
'badaccess-group2' => 'Амале ки дархостаед маҳдуд ба корбарони яке аз гурӯҳои $1 аст.',
'badaccess-groups' => 'Амале ки дархост кардаед маҳдуд ба корбарони яке аз гурӯҳҳои $1 аст.',

'versionrequired'     => 'Нусхаи $1 аз нармафзори МедиаВики лозим аст',
'versionrequiredtext' => 'Барои истифодаи ин саҳифа ба нусхаи $1 аз нармафзори МедиаВики ниёз доред. Барои иттилооъ аз нусхаи нармафзори насбшуда дар ин вики ба [[Special:Version|ин саҳифа]] нигаред.',

'ok'                      => 'Бошад',
'pagetitle'               => '$1 - Википедиа',
'retrievedfrom'           => 'Баргирифта аз "$1"',
'youhavenewmessages'      => 'Шумо $1 ($2) доред.',
'newmessageslink'         => 'пайёмҳои нав',
'newmessagesdifflink'     => 'тағйироти охирин',
'youhavenewmessagesmulti' => 'Шумо номаҳои нав дар $1 доред.',
'editsection'             => 'вироиш',
'editold'                 => 'вироиш',
'viewsourceold'           => 'намоиши манбаъ',
'editsectionhint'         => 'Вироиши қисмат: $1',
'toc'                     => 'Мундариҷа',
'showtoc'                 => 'Намоиш дода шавад',
'hidetoc'                 => 'Пинҳон кардани',
'thisisdeleted'           => 'Намоиш ё эҳёи $1?',
'viewdeleted'             => 'Намоиши $1?',
'restorelink'             => '{{PLURAL:$1|вироиши ҳазфшуда|$1 вироишоти ҳазфшудаҳо}}',
'feedlinks'               => 'Хабархон:',
'feed-invalid'            => 'Ишкол дар обунаи хабархон.',
'feed-unavailable'        => 'Хабархонҳо дар {{SITENAME}} қобили истифода нестанд',
'site-rss-feed'           => 'Барои $1 RSS Хабархон',
'site-atom-feed'          => 'Барои $1 Atom Хабархон',
'page-rss-feed'           => 'Барои "$1" RSS Хабархон',
'page-atom-feed'          => 'Барои "$1" Atom Хабархон',
'red-link-title'          => '$1 (ҳанӯз эҷод нашуда)',

# Short words for each namespace, by default used in the namespace tab in monobook
'nstab-main'      => 'Мақола',
'nstab-user'      => 'Саҳифаи корбар',
'nstab-media'     => 'Расона',
'nstab-special'   => 'Махсус',
'nstab-project'   => 'Саҳифаи лоиҳа',
'nstab-image'     => 'файл',
'nstab-mediawiki' => 'Пайём',
'nstab-template'  => 'Шаблон',
'nstab-help'      => 'Кӯмак',
'nstab-category'  => 'Гурӯҳ',

# Main script and global functions
'nosuchaction'      => 'Чунин амале вуҷуд надорад',
'nosuchactiontext'  => 'Вики амали дар URL мушаххас шударо намешиносад',
'nosuchspecialpage' => 'Чунин саҳифаи вижа вуҷуд надорад',
'nospecialpagetext' => "<big>'''Шумо саҳифаи вижаеро дархост кардаед, ки нодуруст аст.'''</big>

Феҳристи саҳифаҳои вижаи дурустро метавонед дар инҷо [[Special:SpecialPages|{{int:specialpages}}]] нигаред.",

# General errors
'error'                => 'Иштибоҳ',
'databaseerror'        => 'Хатои бойгоҳи дода',
'dberrortext'          => 'Ишколе дар дастури ба бойгоҳи дода фиристодашуда рух дод.
Иллати ин масъала метавонад эроде дар нармафзор бошад.
Ин хато аз даруни амалгир:
<blockquote><tt>$1</tt></blockquote>
фиристода шуд"<tt>$2</tt>".
Бойгоҳи дода MySQL ин хаторо боз гардонд"<tt>$3: $4</tt>".',
'dberrortextcl'        => 'Хатое дар дастури фиристодашуда ба пойгоҳи дода рух дод.
Охирин дастуре ки ба пойгоҳи дода фиристода шуд ин буд:
"$1"
аз даруни амалгар фиристода шуд "$2".
Пойгоҳи дода (MySQL) ин хаторо бозгардонд "$3: $4"',
'noconnect'            => 'Бубахшед! Вики эроди фаннӣ дорад ва наметавонад бо коргузори (сервери) пойгоҳи дода тамос бигирад. <br />
$1',
'nodb'                 => 'Наметавон пойгоҳи додаи $1-ро итихоб кард',
'cachederror'          => 'Дар зер як нусхаи бойгонишудаи саҳифаи дархостӣ оварда шудааст, ва мумкин аст рузрасонӣ шуда набошад.',
'laggedslavemode'      => 'Ҳушдор: Саҳифа мумкин аст рӯзрасониҳои охирро дар бар нагирад.',
'readonly'             => 'Бойгоҳи дода қуфл шудааст',
'enterlockreason'      => 'Далелеро барои қуфл кардан зикр кунед, ва тақрибан вақти аз қуфл озод шуданашро ҳам зикр кунед',
'readonlytext'         => 'Пойгоҳи дода дар ҳоли ҳозир дар баробари тағйирот ва эҷоди саҳифаҳо қуфл шудааст, эҳтимолан он барои таъмири пойгоҳи дода ва расидагиҳое маъмул аст, ки баъд аз анҷоми он вазъ ба ҳолати оддӣ боз хоҳад гашт.

Тавзеҳи мудире, ки онро қуфл кардааст бадин шарҳ аст: $1',
'missingarticle-rev'   => '(нусхаи#: $1)',
'readonly_lag'         => 'Пойгоҳи дода ба таври худкор қуфл шудааст то нусхаҳои пуштибон бо нусхаҳои аслӣ ҳамоҳанг шаванд',
'internalerror'        => 'Хатои дохилӣ',
'internalerror_info'   => 'Хатои дохилӣ: $1',
'filecopyerror'        => 'Натавонистам аз парвандаи "$1" рӯи "$2" нусхабардорӣ кунам.',
'filerenameerror'      => 'Натавонистам парвандаи "$1" ба "$2" тағйири ном диҳам.',
'filedeleteerror'      => 'Парванда "$1" ҳазф натавонист шуд.',
'directorycreateerror' => 'Имкони эҷоди пӯшаи "$1" вуҷуд надорад.',
'filenotfound'         => 'Парвандаи "$1" ёфт нашуд.',
'fileexistserror'      => 'Имкони навиштан рӯи парвандаи "$1" вуҷуд надорад: парванда аз қабл вуҷуд дорад',
'unexpected'           => 'Миқдори ғайри мунтазир: "$1"="$2".',
'formerror'            => 'Хато: наметавон формро фиристод',
'badarticleerror'      => 'Наметавон ин амалро бар ин саҳифа анҷом дод.',
'cannotdelete'         => 'Саҳифа ё парвандаи мушаххасшударо ҳазф карда нашуд. (Мумкин аст қаблан касе дигаре онро ҳазф карда бошад.)',
'badtitle'             => 'Унвони номуносиб',
'badtitletext'         => 'Унвони саҳифаи дархостшуда номӯътабар, холӣ, ё пайванди байнизабони ё байнивикии нодуруст буд. Он метавонад як ё якчанд аломатҳоеро дар бар гирад, ки дар унвонҳо истифода шуда наметавонанд.',
'perfdisabled'         => 'Бубахшед! Ин имкон муваққатан ғайрифаъол шудааст, зеро ки он пойгоҳи додаро суст мекунад ва ҳеҷ касе наметавонад аз вики истифода барад.',
'perfcached'           => 'Додаҳои зерин аз ҳофизаи муваққатӣ фарохонӣ шудаанд ва мумкин аст, комилан ба рӯз нашудаанд.',
'perfcachedts'         => 'Додаҳои зерин аз ҳофизаи муваққатӣ фарохонӣ шудаанд ва мумкин аст, охирин ба рӯзрасонӣ $1 аст.',
'querypage-no-updates' => 'Имкони ба рӯзрасонии ин саҳифа феълан ғайрифаъол шудааст.',
'wrong_wfQuery_params' => 'Параметрҳои нодуруст ба wfQuery()<br />
Амал: $1<br />
Пурсуҷӯ: $2',
'viewsource'           => 'Намоиши матни вики',
'viewsourcefor'        => 'барои $1',
'actionthrottled'      => 'Ҷилави амали шумо гирифта шуд',
'actionthrottledtext'  => 'Ба манзури ҷилавгирӣ аз спам, шумо иҷоза надоред, ки чунин амалеро беш аз чанд бор дар як муддати замони кӯтоҳ анҷом бидиҳед. Лутфан пас аз чанд дақиқа дубора талош кунед.',
'protectedpagetext'    => 'Ин саҳифа барои ҷилавгирӣ аз вироиш қуфл шудааст.',
'viewsourcetext'       => 'Шумо метавонед матни викии ин саҳифаро назар кунед ё нусха бардоред:',
'protectedinterface'   => 'Ин саҳифа ороишдиҳандаи матни ин нармафзор аст, ва ба манзури пешгирӣ аз харобкорӣ қуфл шудааст.',
'editinginterface'     => "'''Огоҳӣ:''' Шумо саҳифаеро вироиш карда истодаед, ки матни интерфейси барнома мебошад. Тағйироти ин саҳифа барои намуди интерфейси дигар корбарон таъсир хоҳад расонид. Барои тарҷумаҳо, лутфан аз [http://translatewiki.net/wiki/Main_Page?setlang=tg Бетавики], ки лоиҳаи маҳаликунонии МедиаВики мебошад, истифода кунед.",
'sqlhidden'            => '(Дастури SQL пинҳонист)',
'cascadeprotected'     => 'Ин саҳифа аз вироиш муҳофизат шудааст, барои ин ки  дар {{PLURAL:$1|саҳифаи|саҳифаҳои}} муҳофизатшудаи зерин, ки гузаинаи "обшорӣ" дар {{PLURAL:$1|он|онҳо}} интихоб шудааст, фаро гирифтааст: $2',
'namespaceprotected'   => "Шумо иҷозати вироиши саҳифаҳои фазоиноми '''$1'''-ро надоред.",
'customcssjsprotected' => 'Шумо иҷозати вироиши ин саҳифаро надоред, барои он ки он танзимҳои шасии як корбари дигареро дар бар мегирад.',
'ns-specialprotected'  => 'Саҳифаҳои вижа ғайри қобили вироиш ҳастанд.',
'titleprotected'       => "Эҷоди саҳифае бо ин унвон аз тарафи [[User:$1|$1]] ҷилавгирӣ шудааст.
Далели зикршуда аз ин қарор аст ''$2''.",

# Login and logout pages
'logouttitle'                => 'Хуруҷи корбар аз систем',
'logouttext'                 => '<strong>Акнун аз систем хориҷ шудаед.</strong>

Шумо метавонед гумном аз {{SITENAME}} истифодабариро идома диҳед, ё метавонед бо ҳамин номи корбариатон ва ё номи корбарии дигаре боз вуруд кунед. Тавваҷӯҳ кунед, ки баъзе аз саҳифаҳо қаблан чи тавре намоиш шуда будан ҳамин тавр намоиш дода мешаванд, то даме ки шумо ҳофизаи мурургаратонро пок кунед.',
'welcomecreation'            => '== Хуш омадед, $1! ==

Ҳисоби шумо эҷод шуд. Танзим кардани тарчиҳоти {{SITENAME}} худро фаромӯш накунед.',
'loginpagetitle'             => 'Вуруди корбар',
'yourname'                   => 'Номи корбар',
'yourpassword'               => 'Калимаи убур\\пароль',
'yourpasswordagain'          => 'Калимаи убурро боз нависед',
'remembermypassword'         => 'Манро дар хотир нигоҳ дор',
'yourdomainname'             => 'Домейни Шумо',
'externaldberror'            => 'Хатое дар иртибот бо пойгоҳи дода рух дода аст ё ин ки шумо иҷозат ба рӯзрасонии ҳисоби берунии худро надоред.',
'loginproblem'               => '<b>Вуруди шумо ба систем бо мушкили рӯ ба рӯ шуд.</b><br />Бори дигар санҷед!',
'login'                      => 'Вуруд',
'nav-login-createaccount'    => 'Вуруд / Сохтани ҳисоби ҷадид',
'loginprompt'                => 'Барои вуруд ба {{SITENAME}} бояд кукиҳоро фаъол кунед.',
'userlogin'                  => 'Вуруд / Сохтани ҳисоби ҷадид',
'logout'                     => 'Хуруҷ аз систем',
'userlogout'                 => 'Хуруҷ аз систем',
'notloggedin'                => 'Ба систем вуруд нашудаед',
'nologin'                    => 'Номи корбар надоред? $1.',
'nologinlink'                => 'Ҳисоберо созед',
'createaccount'              => 'Ҳисоби ҷадидеро созед',
'gotaccount'                 => 'Ҳисоби корбарӣ доред? $1.',
'gotaccountlink'             => 'Вуруд шавед',
'createaccountmail'          => 'бо почтаи электронӣ',
'badretype'                  => 'Калимаҳои убуре, ки ворид кардаед бо ҳамдигар мувофиқат намекунанд.',
'userexists'                 => 'Номи корбарӣ дохил кардашуда мавриди истифода аст. Номи дигарероро интихоб кунед.',
'youremail'                  => 'Почтаи электронии Шумо:',
'username'                   => 'Номи корбар:',
'uid'                        => 'ID-и корбар:',
'yourrealname'               => 'Номи аслӣ:',
'yourlanguage'               => 'Забон:',
'yourvariant'                => 'Вариант',
'yournick'                   => 'Ники шумо:',
'badsig'                     => 'Имзои хом нодуруст аст; барҷасбҳои HTML-ро баррасӣ кунед.',
'badsiglength'               => 'Тахаллус хеле дароз аст. 
Он бояд камтар аз $1 {{PLURAL:$1|аломат|аломатҳо}} бошад.',
'email'                      => 'Почтаи электронӣ',
'prefs-help-realname'        => 'Номи ҳақиқӣ ихтиёрӣ ва агар шумо онро пешниҳод кунед онро ҳамчун муаллифи эҷодиётатон ёдоварӣ карда хоҳад шуд.',
'loginerror'                 => 'Иштибоҳ дар вуруд',
'prefs-help-email'           => 'Нишонаи почтаи электронӣ (ихтиёрӣ); тамоси дигар корбарон бо шуморо ба василаи номаи электронӣ аз тариқи саҳифаи корбарӣ ё саҳифаи баҳси корбарӣ, бидуни ниёз ба фош кардани сомона ва нишонаи воқеъи почтаи электронии шумо мумкин месозад.',
'prefs-help-email-required'  => 'Нишони почтаи электрони лозим аст.',
'nocookiesnew'               => 'Ҳисоби корбарӣ эҷод шуд, аммо шумо вориди сомона нашудаед. {{SITENAME}} барои вуруд кардани корбарон ба сомона аз кукиҳо (cookies) истифода мекунад. Шумо бояд кукиҳоро фаъол кунед. Лутфан кукиҳоро фаъол кунед, баъдан ба систем бо номи корбарии ҷадид ва калимаи убуратон вуруд кунед.',
'nocookieslogin'             => '{{SITENAME}} барои ворид кардани корбарон ба систем аз кукиҳо (cookies) истифода мекунад. Кукиҳо фаъол нестанд. Лутфан кукиҳоро фаъол карда бори дигар бисанҷед.',
'noname'                     => 'Номи корбари дурустеро шумо пешниҳод накардед.',
'loginsuccesstitle'          => 'Вуруд бо муваффақият',
'loginsuccess'               => "'''Шумо акнун ба Википедиа ҳамчун \"\$1\". вуруд кардед'''",
'nosuchuser'                 => 'Корбаре бо номи "$1" вуҷуд надорад. Амали номро барраси кунед, ё ҳисоби ҷадидеро эҷод кунед.',
'nosuchusershort'            => 'Ягон корбаре бо номи "<nowiki>$1</nowiki>" вуҷуд надорад. Тарзи навишти номро санҷед.',
'nouserspecified'            => 'Шумо бояд як номи корбарӣ мушаххас кунед.',
'wrongpassword'              => 'Калимаи убури нодуруст дохил карда шуд. Бори дигар санҷед.',
'wrongpasswordempty'         => 'Калимаи убури дохил шуда холӣ аст. Бори дигар санҷед.',
'passwordtooshort'           => 'Калимаи убур хеле кӯтоҳ аст. Вай бояд ҳадди ақал {{PLURAL:$1|1 аломат|$1 аломатҳо}} дошта аз номи корбарӣ фарқ кунад.',
'mailmypassword'             => 'Калимаи убурро ба E-mail фиристед',
'passwordremindertitle'      => 'Муваққатан калимаи убурӣ ҷадид барои {{SITENAME}}',
'passwordremindertext'       => 'Касе (эҳтимолан худи Шумо), аз нишонаи IP $1 дархост кардааст, ки калимаи убури ҷадиде барои {{SITENAME}} ($4) барои шумо бифиристем.
Калимаи убури корбар "$2" ҳамакнун "$3" аст.
Ҳоло бояд вориди систем шавед ва калимаи убури худро тағйир диҳед.

Агар касе дигаре инро дахост кардааст, ё инки шумо калимаи убури пешинаи худро ба ёд овардаед ва дигар хоҳиши тағйир додани онро надоред, ба ин паём аҳмият надиҳед ва калимаи убури пешинаи худро истифода баред.',
'noemail'                    => 'Ҳеҷ нишонаи почтаи электронӣ барои корбар "$1" сабт нашудааст.',
'passwordsent'               => 'Калимаи убури нав ба адреси e-mail, ки барои "$1" номнавис шудааст фиристода шуд.
Баъд аз дастрас кардани он, марҳамат карда вуруд кунед.',
'blocked-mailpassword'       => 'Нишонаи IP шумо аз вироиш боз дошта шудааст ва аз ин рӯ ба манзури ҷилавгирӣ аз сӯиистифода аз баҳрагирӣ аз қобилияти барқарор кардани калимаи убурро надорад.',
'eauthentsent'               => 'Номаи барои тасдиқ ба нишонаи почта электронӣ фиристода шуд. Пеш аз фиристодани нома ба ин ҳисоб, шумо бояд дастуроте ки ба он нишонаи почтаи электронӣ омадаст, иҷро карда, дар ҳақиқат ҳисоби худ буданашро бояд тасдиқ кунед.',
'throttled-mailpassword'     => 'Як ёдоварии калимаи убур барои шумо {{PLURAL:$1|соат|$1 соат}} гузашта фиристода шудааст. Барои чилавгирӣ аз сӯиистифода, фақат дар ҳар {{PLURAL:$1|соат|$1 соат}} танҳо як ёдоварӣ фиристода мешавад.',
'mailerror'                  => 'Хато дар фиристодани номаи электронӣ: $1',
'acct_creation_throttle_hit' => 'Бубахшед, Шумо аллакай $1 ҳисобҳо сохтед. Шумо бештар сохта наметавонед.',
'emailauthenticated'         => 'E-mail нишонаи Шумо дар санаи $1 сабт шудааст.',
'emailnotauthenticated'      => 'Нишонаи почтаи электронии шумо ҳанӯз тасдиқ нашудааст. Номаи электрони барои ҳар як аз вижагиҳои зерин фиристода нахоҳад шуд.',
'noemailprefs'               => 'Барои корандозии ин қобилиятҳо як нишонаи почтаи электрониро мушаххас кунед.',
'emailconfirmlink'           => 'Адреси почтаи электрониаторо тасдиқ кунед',
'invalidemailaddress'        => 'Нишонаи воридшудаи почтаи электронӣ қобили қабул нест, барои он ки дорои сохтори номӯътабаре аст. Лутфан нишонае бо сохтори саҳеҳ ворид кунед ва ё бахши марбутро холӣ бигузоред.',
'accountcreated'             => 'Ҳисоби ҷадид сохта шуд',
'accountcreatedtext'         => 'Ҳисоби корбар барои $1 сохта шуд.',
'createaccount-title'        => 'Эҷоди ҳисоби корбарӣ дар {{SITENAME}}',
'createaccount-text'         => 'Як нафаре барои 2$ як ҳисоби корбарӣ дар {{SITENAME}} эҷод кардааст ($4). Калимаи убури "$2" чунин аст: "$3". Шумо бояд вориди систем шавед то калимаи убури худро тағйир бидиҳед.

Агар ин ҳисоб иштибоҳе сохта шудааст, ин номаро нодида бигиред.',
'loginlanguagelabel'         => 'Забон: $1',

# Password reset dialog
'resetpass'               => 'Сифр кардани калимаи убурӣ ҳисоби корбарӣ',
'resetpass_announce'      => 'Шумо бо коди мувақатӣ ба систем вуруд шудаед. Барои анҷом додани вурудшавӣ, шумо бояд калимаи убурӣ ҷадидро инҷо ворид кунед:',
'resetpass_header'        => 'Сифр кардани калимаи убур',
'resetpass_submit'        => 'Калимаи убурро танзим карда ба систем вуруд кунед',
'resetpass_success'       => 'Калимаи убури шумо бо муваффақият тағйир дода шуд! Дар ҳоли ворид кардани шумо ба систем...',
'resetpass_bad_temporary' => 'Калимаи убури мувақкатӣ нодуруст аст. Эҳтимолан калимаи убури худро пештар бо муваффақият тағйир додаед ё калимаи убури ҷадидеро дархост кардаед.',
'resetpass_forbidden'     => 'Дар {{SITENAME}} калимаҳои убурро наметавон тағйир дод',
'resetpass_missing'       => 'Иттилооте барои коргузорӣ фиристода нашудааст.',

# Edit page toolbar
'bold_sample'     => 'Матни пурранг',
'bold_tip'        => 'Матни пурранг',
'italic_sample'   => 'Матни хобида',
'italic_tip'      => 'Матни хобида',
'link_sample'     => 'Унвони пайванд',
'link_tip'        => 'Пайванди дохилӣ',
'extlink_sample'  => 'http://www.example.com унвони пайванд',
'extlink_tip'     => 'Пайванди беруна (пешванди http:// фаромӯш накунед)',
'headline_sample' => 'Матни унвон',
'headline_tip'    => 'Унвони сатҳи 2',
'math_sample'     => 'Илова кардани формула дар инҷо',
'math_tip'        => 'Формулаи риёзӣ (LaTeX)',
'nowiki_sample'   => 'Инҷо матни қолаббанди-нашударо дохил кунед',
'nowiki_tip'      => 'Рад кардани қолаббандии вики',
'image_tip'       => 'Тасвири дохили матн',
'media_tip'       => 'Пайванди парвандаи расона',
'sig_tip'         => 'Имзои Шумо бо мӯҳри сана',
'hr_tip'          => 'Хати уфуқӣ (сарфакорона истифода кунед)',

# Edit pages
'summary'                   => 'Хулоса',
'subject'                   => 'Мавзӯъ/сарлавҳа',
'minoredit'                 => 'Ин вироиши хурд аст',
'watchthis'                 => 'Назар кардани ин саҳифа',
'savearticle'               => 'Саҳифа захира шавад',
'preview'                   => 'Пешнамоиш',
'showpreview'               => 'Пеш намоиш',
'showlivepreview'           => 'Пешнамоиши зинда',
'showdiff'                  => 'Намоиши тағйирот',
'anoneditwarning'           => "'''Огоҳӣ:''' Шумо вуруд накардаед. Суроғаи IP Шумо дар вироишоти ин саҳифа сабт хоҳад шуд.",
'missingsummary'            => "'''Ёдоварӣ:''' Шумо хулосаи вироиш нанавиштаед.
Агар дубора тугмаи \"Захира\"-ро клик кунед, вироишатон бидуни хулоса захира хоҳад шуд.",
'missingcommenttext'        => 'Лутфан тавсифе дар зер бинависед.',
'missingcommentheader'      => "'''Ёдоварӣ:''' Шумо мавзӯъ/унвони ин ёддоштро мушаххаст накардаед.
Агар дубора тугмаи \"Захира\"-ро пахш кунед, вироишатон бидуни он захира хоҳад шуд.",
'summary-preview'           => 'Пешнамоиши хулоса',
'subject-preview'           => 'Пешнамоиши мавзӯъ/унвон',
'blockedtitle'              => 'Корбар баста шудааст',
'blockedtext'               => "<big>'''Номи корбарии Шумо ё нишонаи IP баста шудааст.'''</big>

Бастан аз тарафи $1 иҷро шуд. Сабаби он ''$2'' аст.

* Замони қатъ кардан: $8
* Замони саромадани қатъи дастрасӣ: $6
* Қатъкунанда: $7

Шумо метавонед бо $1 ё яке дигаре аз [[{{MediaWiki:Grouppage-sysop}}|мудирон]] барои гуфтугӯ роҷеъ ба қатъи дастрасӣ тамос гиред.
Таваҷҷӯҳ кунед, ки аз қобилияти 'фиристодаи почтаи электронӣ ба ин корбар' наметавоне истифода кард, магар ин ки як нишони мӯътабари почтаи электронӣ дар [[Special:Preferences|тарҷиҳоти корбарии]] худ сабт карда бошед ва аз корбурди он манъ нашуда бошед.
Нишонаи кунунии IP Шумо $3 аст, ва шиносаи қатъи дастрасии Шумо #$5 аст. Лутфан ин ё онро ва ё ҳардуи онро дар дархостҳои худ зикр кунед.",
'autoblockedtext'           => "Дастрасии нишонаи IP шумо қатъ шудааст, сабаб он аст, ки ин нишонаи IP аз тарафи корбаре истифода мешуд, ки дастрасии ӯ аз тарафи $1 қатъ гардонида шудааст.
Иллати зикршуда чунин аст:

:''$2''

* Шурӯъи қатъи дастрасӣ: $8
* Поёни қатъи дастрасӣ: $6

Шумо метавонед бо $1 ё яке аз дигаре [[{{MediaWiki:Grouppage-sysop}}|мудирон]] тамос бигиред, то дар мавриди ин қатъи дастрасӣ сӯҳбат кунед.

Таваҷҷӯҳ кунед, ки барои ирсоли почтаи электронӣ дар вики бояд почтаи электронии худро дар саҳифаи [[Special:Preferences|тарҷиҳоти корбарӣ]] фаъол карда бошед ва низ, имкони истифода аз ин вижагӣ барои шумо қатъ набошад.

Шумораи қатъи дастрасии шумо $5 аст. Лутфан ин шумораро дар ҳар дархосте, ки дар ин матраҳ мекунед, қайд кунед.",
'blockednoreason'           => 'далеле мушаххас нашудааст',
'blockedoriginalsource'     => "Матни манбаи '''$1''' дар зер намоиш дода шудааст:",
'blockededitsource'         => "Матни '''вироишҳои шумо''' дар '''$1''' дар зер нишон дода шудааст:",
'whitelistedittitle'        => 'Барои вироиш вуруд бояд кард',
'whitelistedittext'         => 'Барои вироиши мақола бояд ба систем $1 шавед.',
'confirmedittitle'          => 'Тасдиқ кардани нишонаи почтаи электронӣ барои вироиш кардан лозим аст',
'confirmedittext'           => 'Шумо бояд нишонаи почтаи электрониатонро пеш аз вироиш кардани саҳифаҳо, тасдиқ кунед. Лутфан ин корро тариқи [[Special:Preferences|тарҷиҳоти корбар]] сурат диҳед.',
'nosuchsectiontitle'        => 'Чунин бахше вуҷуд надорад',
'nosuchsectiontext'         => 'Шумо хостед, ки қисмеро вироиш кунед, ки он вуҷуд надорад.  То ҳоле, ки қисми $1 вуҷуд надорад, барои вироиши шумо ҷой нест.',
'loginreqtitle'             => 'Вуруд ба систем лозим аст',
'loginreqlink'              => 'вуруд ба систем',
'loginreqpagetext'          => 'Барои дидани саҳифаҳои дигар шумо бояд $1 кунед.',
'accmailtitle'              => 'Калимаи убур фиристода шуд.',
'accmailtext'               => 'Калимаи убур барои "$1" ба $2 фиристода шуд.',
'newarticle'                => '(Нав)',
'newarticletext'            => "Шумо пайвандеро интихоб кардед, ки саҳифа дар он арзи вуҷуд надорад.
Барои сохтани саҳифа, ба қуттии зерин нависед ([[{{MediaWiki:Helppage}}|саҳифаи роҳнаморо]] барои маълумоти бештар нигаред).
Агар аз сабаби хатогӣ ва ё иштибоҳ омадед, тугмаи '''Ба оқиб'''-ро дар браузери худ пахш кунед.",
'anontalkpagetext'          => "----''Ин саҳифае баҳсе барои корбари гумном (аноним) аст, ки ҳануз ҳисоби ҷадид эчод накардааст ва ё аз он истифода намекунад. Бинобар ин барои шиносоиаш маҷбурем аз нишонаи IP истифода кунем. Чунин нишонаи IP мумкин аст аз тарафи чандин корбарон ба шакли муштарак истифода шавад. Агар шумо корбари гумном ҳастед ва ҳис мекунед, изҳори назари номарбуте ба шумо сурат гирифтааст, лутфан барои пешгири аз иштибоҳ гирифта шудан бо корбарони гумноми дигар дар оянда [[Special:UserLogin|ҳисобе эҷод кунед ё вориди систем шавед]].''",
'noarticletext'             => 'Дар ин саҳифа то кунун, матн вуҷуд надорад, шумо метавонед дар дигар саҳифаҳо [[Special:Search/{{PAGENAME}}|унвони ин саҳифаро ҷустуҷӯ кунед]] ё [{{fullurl:{{FULLPAGENAME}}|action=edit}} ин саҳифаро вироиш кунед].',
'userpage-userdoesnotexist' => 'Ҳисоби корбар "$1" сабт нашудааст. Итминон ҳосил кунед ки мехоҳед ин саҳифаро эчод ё вироиш кунед.',
'clearyourcache'            => "'''Эзоҳ:''' Пас аз захирасозӣ мумкин аст барои дидани тағйирот ниёз бошад, ки ҳофизаи ниҳонии мурургари худро холӣ кунед. '''Мозилла / Файерфокс / Сафари:''' калиди ''Shift''-ро нигоҳ доред  ва рӯи тугмаи  ''Reload'' клик кунед, ё калидҳои ''Ctrl-Shift-R'' (''Cmd-Shift-R'' дар Эппл Макинтош) бо ҳам фишор диҳед; '''IE:''' калиди ''Ctrl'' нигоҳ доред ва рӯи тугмаи ''Refresh'' клик кунед, ё калидҳои ''Ctrl-F5'' бо ҳам фишор диҳед; '''Konqueror:''': тугмаи ''Reload''-ро оддӣ клик кунед, ё калиди ''F5'' фишор диҳед; Ба корбарони '''Opera''' мумкин аст лозим бошад, ки ҳофизаи ниҳонии худро комилан дар ''Tools→Preferences'' холӣ кунанд.",
'usercssjsyoucanpreview'    => '<strong>Эзоҳ:</strong> Пеш парвандаи CSS ё JS худро захира кунед, бо истифода аз тугмаи "Пешнамоиш" метавонед онро озмоиш кунед.',
'usercsspreview'            => "'''Фаромӯш накунед, ки шумо фақат CSS корбариатонро пешнамоиш карда истодааед ва он ҳанӯз захира нашудааст!'''",
'userjspreview'             => "'''Фаромӯш накунед, ки шумо фақат ҶаваСкрипти корбариатонро имтиҳон,пешнамоиш карда истодаед ва он ҳанӯз захира нашудааст!'''",
'userinvalidcssjstitle'     => "'''Ҳушдор:'''Пӯсте бо номи \"\$1\" вуҷуд надорад. Таваҷҷӯҳ кунед ки саҳифаҳои .css ва .js бо ҳарфҳои хурд навишта мешаванд, Намуна. {{ns:user}}:Фу/monobook.css дар муқобили корбар {{ns:user}}:Фу/Monobook.css.",
'updated'                   => '(Ба рӯз шуда)',
'note'                      => '<strong>Эзоҳ:</strong>',
'previewnote'               => '<strong>Ин фақат пешнамоиш аст; дигаргуниҳо ҳоло захира нашудаанд!</strong>',
'previewconflict'           => 'Ин пешнамоиш аккоскунандаи матни ноҳияи вироиш дар боло аст ва агар онро захира кунед бо ҳамин шакл нишода дода хоҳад шуд.',
'session_fail_preview'      => '<strong>Бубахшед! Аз сабаби аз даст рафтани иттилооти нишасти корбарӣ, наметавонем вироишҳои шуморо пардозиш кунем.
Лутфан дубора саъй кунед. Агар боз бо ҳамин паём рӯ ба рӯ шавед, аз систем хориҷ шавед ва муҷаддадан ворид шавед.</strong>',
'session_fail_preview_html' => "<strong>Бубахшед! Имкони сабти вироиши шумо ба хотир аз даст рафтани иттилоот нишаст.</strong>

''Бо таваҷҷӯҳ ба ин ки дар {{SITENAME}} имкони HTML хом фаъол аст, пешнамоиши саҳифа пинҳон шуда то имкони зидди ҳамалоти ҶаваСкрипт вуҷуд ндошта бошад.''

<strong>Агар боварӣ доред, ки ин пешнамоиш як вироиши миҷоз ас, онро такрор кунед. Агар пешнамоиш натиҷае надод, аз систем хориҷ шавед ва дубора ворид шавед</strong>",
'token_suffix_mismatch'     => '<strong>Вироишҳои шумо захира нашуд, зеро мурургари шумо навиштаҳои нуқтагузориро аз ҳам пошида аст. Вироиши шумо захира нашуд то аз вайрон шудани матни саҳифа пешгирӣ кунад.
Баъзан ин хато вақте пайдо мешавад, ки шумо аз хизмати (web-based proxy) истифода мекунед.</strong>',
'editing'                   => 'Дар ҳоли вироиш $1',
'editingsection'            => 'Дар ҳоли вироиши $1 (қисмат)',
'editingcomment'            => 'Дар ҳоли вироиш $1 (comment)',
'editconflict'              => 'Бархӯрди вироишӣ: $1',
'explainconflict'           => "Аз вақте ки шумо вироиши ин саҳифаро оғоз кардаед, шахси дигаре онро тағйир дода аст.
Ноҳияи матни болои шомили матни саҳифа ба шакли феълии он аст.
Тағйироти шумо дар ноҳияи матни поёни нишон дода шудааст.
Шумо бояд тағйиротатонро бо матни феълӣ таркиб кунед.
'''Фақат''', вақте, ки тугмаи \"Саҳифа захира шавад\"-ро фишор диҳед матни ноҳияи матни болои захира хоҳад шуд.",
'yourtext'                  => 'Матни Шумо',
'storedversion'             => 'Нусхаи сабтшуда',
'nonunicodebrowser'         => '<strong>Ҳушдор: Муругари шумо бо стандарти Юникод ҷавобгӯ нест. Аломатҳои ғайр аз ASC11 ба сурати адад ба коди шонздаҳ ба шумо нишон дода мешаванд.</strong>',
'editingold'                => '<strong>ҲУШДОР: Шумо нусхаи кӯҳнаи ин саҳифаро вироиш карда истодаед.
Агар шумо онро захира кунед, ҳар тағйире ки пас аз ин нусха анҷом шуда, аз байн хоҳад рафт.</strong>',
'yourdiff'                  => 'Фарқиятҳо',
'copyrightwarning'          => 'Ҳамаи ҳиссагузорӣ ба {{SITENAME}} аз рӯи қонунҳои зерин $2 (нигаред $1 барои маълумоти бештар) ҳиссагузорӣ мешаванд. Агар Шумо намехоҳед, ки навиштаҷоти Шумо вироиш ва паҳн нашаванд, Шумо метавонед ин мақоларо нафиристед.<br /> Шумо ваъда медиҳед, ки худатон ин мақоларо навиштед ё ки аз сарчашмаҳои кушод нусхабардорӣ кардаед. <strong>АСАРҲОИ ҚОБИЛИ ҲУҚУҚИ МУАЛЛИФРО БЕ ИҶОЗАТ НАФИРИСТЕД!</strong>',
'copyrightwarning2'         => 'Лутфан таваҷҷӯҳ дошта бошед ки ҳамаи ҳиссагузориҳо ба {{SITENAME}} бо таҳти  "Иҷозатномаи мустанадоти Озод GNU" мунташир мешаванд. (барои ҷузъиёти бештар нигаред ба $1). Агар намехоҳед навиштаҳоятон бераҳмона вироиш шуда ва ба дилхоҳ тавзеҳ шавад, инҷо нафиристед.<br />
Ҳамин тавр шумо қавл медиҳед, ки худатонро инро навиштаед ё онро аз як манбаи озод бо моликияти умумӣ ё мушобеҳи он нусхабардорӣ кардаед. <strong>КОРҲОИ ҲУҚУҚИ ИНҲИСОРИ МУАЛЛИФРО (ТАКСИР) БЕ ИҷОЗАТЕ НАФИРИСТЕД!</strong>',
'longpagewarning'           => '<strong>Ҳушдор: Ин саҳифа $1 килобайт дароз аст; баъзе мурургарҳо мумкин ба вироиши саҳифаҳои наздик ба 32kb ё дарозтар аз он мушкили дошта бошанд.
Лутфан дар барои ба қисматҳои хурд ҷудо кардани ин саҳифа фикр кунед.</strong>',
'longpageerror'             => '<strong>ХАТО: Матне ки ирсол кардаед $1 килобайт ҳаҷм дорад, ки ин миқдор аз миқдори пешина $2 килобайт  бештар аст. Наметавон онро захира кард.</strong>',
'readonlywarning'           => '<strong>ҲУШДОР: Пойгоҳи дода барои нигоҳдорӣ қуфл шудааст, бинобар ин наметавонед вироишҳоятонро ҳоло фавран захира кунед. Агар мехоҳед матнро дар як парвандаи матнӣ часпонед ва барои оянда онро захира кунед.</strong>',
'protectedpagewarning'      => '<strong>ҲУШДОР: Ин саҳифа қуфл шудааст то фақат корбароне бо имтиёзи мудир (ё болотар) битавонанд онро вироиш кунанд.</strong>',
'semiprotectedpagewarning'  => "'''Таваҷҷӯҳ:''' Ин саҳифа қуфл шудааст то танҳо корбарони сабтиномкарда қодир ба вироиши он бошанд.",
'cascadeprotectedwarning'   => "'''Ҳушдор:''' Ин саҳифа ба иллати қарор гирифтан дар {{PLURAL:$1|саҳифаи|саҳифаҳои}} обшорӣ-муҳофизатшудаи зер қуфл шудааст, то фақат мудирон битавонанд вироиш кунанд:",
'titleprotectedwarning'     => '<strong>ҲУШДОР:  Ин саҳифа қуфл шудааст, ба шакле ки фақат бархе корбарон метавонанд онро эҷод кунанд.</strong>',
'templatesused'             => 'Шаблонҳои дар ин саҳифа истифодашуда:',
'templatesusedpreview'      => 'Шаблонҳои истифодашуда дар ин пешнамоиш:',
'templatesusedsection'      => 'Шаблонҳои дар ин қисмат истифода шуда:',
'template-protected'        => '(ҳифзшуда)',
'template-semiprotected'    => '(нима-муҳофизатшуда)',
'hiddencategories'          => 'Ин саҳифа дар {{PLURAL:$1|1 гурӯҳи пинҳон|$1 гурӯҳҳои пинҳон}} қарор дорад:',
'nocreatetitle'             => 'Эҷоди саҳифа маҳдуд шудааст',
'nocreatetext'              => '{{SITENAME}} қобилияти эҷоди саҳифаҳои ҷадидро маҳдуд карда аст.
Шумо метавонед бозгашта саҳифаи мавҷудбударо вироиш кунед, ё [[Special:UserLogin|ба систем вуруд кунед ё ҳисоби корбарӣ эҷод кунед]].',
'nocreate-loggedin'         => 'Шумо иҷозати эҷоди саҳифаи ҷадидро дар {{SITENAME}} надоред.',
'permissionserrors'         => 'Хатоҳои сатҳи дастрасӣ',
'permissionserrorstext'     => 'Шумо рухсати анҷоми ин корро ба {{PLURAL:$1|сабаби|сабабҳои}} зерин надоред:',
'recreate-deleted-warn'     => "'''Диққат: Шумо саҳифаеро барқарор карда истодаед, ки пештар ҳазф шудааст.''' 

Шумо зарурияти вироиши ин саҳифаро дида баромаданатон лозим.
Сабти ҳазфшавии ин саҳифа барои фароҳам овардани имкониятҳои қулай оварда шудааст:",

# "Undo" feature
'undo-success' => 'Ин вироиш метавонад ботил шавад. Лутфан муқоисаи зеринро барои таъйид кардани амалӣ худ, баррасӣ кунед, ва баъдан барои анҷом додани ботилкунии вироиш тағйироти зеринро захира кунед.',
'undo-failure' => 'Ба иллати бархӯрдани вироишҳои дар миён омада, ин вироишро ботил наметавон кард.',
'undo-summary' => 'Нусхаи ботил $1 аз тарафи [[Special:Contributions/$2|$2]] ([[User talk:$2|Баҳс]])',

# Account creation failure
'cantcreateaccounttitle' => 'Ҳисобе сохта наметавонам',
'cantcreateaccount-text' => "Имкони сохтани ҳисоби корбарӣ аз ин нишонаи IP ('''$1''') аз тарафи [[User:$3|$3]] баста шудааст.

Далели $3 чунин аст ''$2''",

# History pages
'viewpagelogs'        => 'Намоиши гузоришҳои марбута ба ин саҳифа',
'nohistory'           => 'Таърихи вироиш барои ин саҳифа вуҷуд надорад.',
'revnotfound'         => 'Нусха ёфт нашуд',
'revnotfoundtext'     => 'Нусхаи кӯҳнаи саҳифае, ки дархоста будед, ёфт нашуд. Лутфан нишонаи URL-ро, ки аз он ба ин саҳифа дастрасӣ карда будед, барассӣ кунед.',
'currentrev'          => 'Вироишоти кунунӣ',
'revisionasof'        => 'Нусха $1',
'revision-info'       => 'Нусхаи вироиш $2 дар таърихи $1',
'previousrevision'    => '←Нусхаи кӯҳнатар',
'nextrevision'        => 'Нусхаи навтарин→',
'currentrevisionlink' => 'Намоиши нусхаи феълӣ',
'cur'                 => 'феълӣ',
'next'                => 'баъдӣ',
'last'                => 'қаблӣ',
'page_first'          => 'аввал',
'page_last'           => 'охирин',
'histlegend'          => 'Интихоби тафовут:қуттии нусхаҳоро барои тафовут қайд кунед ва тугмаи дохил кардан ё тугмаи зерро пахш кунед.<br />
Шарҳ: (феълӣ) тафовут бо нусхаи феълӣ
(қаблӣ) = тафовут бо нусхаи феълӣ, ҷузъ = вироиши ҷузъӣ',
'deletedrev'          => '[ҳазфшуда]',
'histfirst'           => 'Аввалин',
'histlast'            => 'Охирин',
'historysize'         => '({{PLURAL:$1|1 байт|$1 байт}})',
'historyempty'        => '(холӣ)',

# Revision feed
'history-feed-title'          => 'Таърихи вироишҳо',
'history-feed-description'    => 'Таърихи вироишҳои ин саҳифа дар вики',
'history-feed-item-nocomment' => '$1 дар $2', # user at time
'history-feed-empty'          => 'Саҳифаи дархостшуда вуҷуд надорад. Мумкин аст, ки аз вики ҳазф ё номаш тағйир дода шуда бошад.
Саҳифаҳои ҷадидӣ алоқамандро метавонед [[Special:Search|дар вики]] ҷустуҷӯ кунед.',

# Revision deletion
'rev-deleted-comment'         => '(тавзиҳот пок шуд)',
'rev-deleted-user'            => '(номи корбар ҳазф шудааст)',
'rev-deleted-event'           => '(амалӣ гузориш пок шуд)',
'rev-deleted-text-permission' => '<div class="mw-warning plainlinks">
Ин вироиш аз ин саҳифа аз таърихи умумии ин саҳифа ҳазф шудааст.
Иттилооти марбутаро эҳтимолан метавонед дар [{{fullurl:Special:Log/delete|page={{FULLPAGENAMEE}}}} гузориши ҳазф] бубинед.</div>',
'rev-deleted-text-view'       => '<div class="mw-warning plainlinks">
Ин вироиш аз ин саҳифа аз таърихи умумии ин саҳифа ҳазф шудааст.
Шумо ҳамчун мудири {{SITENAME}} метавонед онро бубинед; иттилооти марбутаро эҳтимолан метавонед дар [{{fullurl:Special:Log/delete|page={{FULLPAGENAMEE}}}} гузориши ҳазф] бубинед.</div>',
'rev-delundel'                => 'намоиш/пинҳон',
'revisiondelete'              => 'Нусхаҳои ҳазф/эҳёӣ',
'revdelete-nooldid-title'     => 'Нусхаи мақсади номӯътабар',
'revdelete-nooldid-text'      => 'Шумо ин ё он нусхаи(ҳои) мақсадро барои иҷрои ин амал мушаххас накардаед, нусхаи мушаххасшуда вуҷуд надорад, ё  шумо дар ҳоли кӯшиши пинҳон кардани нусхаи кунуниаш ҳастед.',
'revdelete-selected'          => '{{PLURAL:$2|Нусхаи интихобшуда|Нусхаҳои интихобшуда}} аз [[:$1]]:',
'logdelete-selected'          => '{{PLURAL:$1|Гузориши маврид интихобшуда|Гузориши мавориди интихобшуда}}:',
'revdelete-text'              => 'Нусхаҳои ва мавориди ҳазфшуда камокам дар таърих ва гузоришҳои саҳифа қобили мушоҳида ҳастанд, аммо бахшҳои аз мӯҳтавои он ба умум қобили мушоҳида нахоҳанд буд.

Дигар мудирон дар {{SITENAME}} ҳанӯз метавонанд ба ин мӯҳтавои пинҳонро дастрасӣ кунанд ва ҳатто мавориди ҳазфшударо эҳё кунанд, магар он ки маҳдудиятҳои дигаре амалӣ гардад.',
'revdelete-legend'            => 'Танзими маҳдудиятҳои падидорӣ',
'revdelete-hide-text'         => 'Пинҳон кардани нусхаи матн',
'revdelete-hide-name'         => 'Пинҳон кардани амал ва ҳадаф',
'revdelete-hide-comment'      => 'Пинҳон кардани тавзеҳи вироиш',
'revdelete-hide-user'         => 'Номи корбар/нишонаи IP пинҳон шавад',
'revdelete-hide-restricted'   => 'Ин маҳдудиятро ба мудирон амалӣ кунед ва ин рӯхатро қуфл кунед',
'revdelete-suppress'          => 'Аз дастрасии мудирон ба додаҳо низ монанди сайри корбарон ҷилавгирӣ ба амал ояд',
'revdelete-hide-image'        => 'Пинҳон кардани мӯҳтавиёти парванда',
'revdelete-unsuppress'        => 'Хотимаи маҳдудиятҳо дар мавриди нусхаҳои интихобшуда',
'revdelete-log'               => 'Гузориши тавзеҳ:',
'revdelete-submit'            => 'Амали кардан бар нусхаи интихобшуда',
'revdelete-logentry'          => 'тағйири намоии нусха дар [[$1]]',
'logdelete-logentry'          => 'тағйири намоии маврид дар [[$1]]',
'revdelete-success'           => "'''Тағйири намоёнии нусха бо муваффақият анҷом шуд.'''",
'logdelete-success'           => "'''Тағйири намоёнии маврид бо муваффақият анҷом шуд.'''",
'revdel-restore'              => 'Тағйири падидорӣ',
'pagehist'                    => 'Таърихи саҳифа',
'deletedhist'                 => 'Таърихи ҳазфшуда',
'revdelete-content'           => 'мӯҳтаво',
'revdelete-summary'           => 'вироиши хулоса',
'revdelete-uname'             => 'номи корбар',
'revdelete-restricted'        => 'маҳдудиятҳо ба мудирон амалӣ шуданд',
'revdelete-unrestricted'      => 'маҳдудиятҳо аз мудирон бардошта шуданд',
'revdelete-hid'               => '$1-ро пинҳон кард',
'revdelete-unhid'             => '$1-ро аз ҳолати пинҳон дар овард',
'revdelete-log-message'       => '$1 барои $2 {{PLURAL:$2|нусха|нусха}}',
'logdelete-log-message'       => '$1 барои $2 {{PLURAL:$2|воқеа|воқеаҳо}}',

# Suppression log
'suppressionlog'     => 'Гузориши мавқуфсозӣ',
'suppressionlogtext' => 'Дар зер феҳристе аз охирин ҳазфҳо ва қатъи дастрасиҳоеро мебинед, ки мӯҳтавои онҳо аз мудирон пинҳон шуда мебошад. Барои феҳристи қатъи дастрасиҳои фаъол ман мамнӯъҳо ба [[Special:IPBlockList|феҳристи қатъи дастрасиҳои IP]] нигаред.',

# History merging
'mergehistory'                     => 'Идғоми таърихи саҳифаҳо',
'mergehistory-header'              => 'Ин саҳифа ба шумо имконеро медиҳад, ки нусхаҳои таърихи мақолаеро бо як мақолаи дигар идғом кунед.
Итминон ҳосил кунед, ки ин тағйир давомнокии таърихии саҳифаро нигоҳ дорад.',
'mergehistory-box'                 => 'Идғоми нусхаҳои ду саҳифа:',
'mergehistory-from'                => 'Саҳифаи манбаъ:',
'mergehistory-into'                => 'Саҳифаи мақсад:',
'mergehistory-list'                => 'Таърихи қобили идғом',
'mergehistory-merge'               => 'Нусхаҳои [[:$1]] қобили идгом бо [[:$2]] ҳастанд. Аз сутуни тугмаҳои радиоӣ истифода кунед, ту нусхаҳое, ки то қабл аз як вақти мушаххаст эҷодшударо интихоб кунед. Таваҷҷӯҳ кунед, ки клике рӯи пайвандҳо боиси пок шудани танзимоте ки то он лаҳза амалӣ кардаед, хоҳанд шуд.',
'mergehistory-go'                  => 'Намоиши вироишҳои қобили идғом',
'mergehistory-submit'              => 'Идғом нусхаҳо',
'mergehistory-empty'               => 'Ҳеҷ як нусхаҳо қобили идғом нестанд.',
'mergehistory-success'             => '$3 {{PLURAL:$3|нусха|нусхаҳо}} аз [[:$1]] бо муваффақият ба [[:$2]] идғом шуд.',
'mergehistory-fail'                => 'Идғоми таърих мумкин нест, лутфан параметрҳои саҳифа ва вақтро бозбинӣ кунед.',
'mergehistory-no-source'           => 'Саҳифаи манбаъ $1 вуҷуд надорад.',
'mergehistory-no-destination'      => 'Саҳифаи мақсад $1 вуҷуд надорад.',
'mergehistory-invalid-source'      => 'Саҳифа манбаъ бояд унвони қобили қабул дошта бошад.',
'mergehistory-invalid-destination' => 'Саҳифаи мақсад бояд унвони қобили қабул дошта бошад.',
'mergehistory-autocomment'         => '[[:$1]] ба [[:$2]] идғом шуд',
'mergehistory-comment'             => '[[:$1]] ба [[:$2]] идғом шуд: $3',

# Merge log
'mergelog'           => 'Гузориши идғом',
'pagemerge-logentry' => 'идгом шуд [[$1]] дар [[$2]] (нусхаҳо то $3)',
'revertmerge'        => 'Вогардонии идғом',
'mergelogpagetext'   => 'Дар зер феҳристи идғоми охирини таърихи як саҳифаро ба дигар саҳифаро мебинед.',

# Diffs
'history-title'           => 'Таърихчаи вироишҳои "$1"',
'difference'              => '(Фарқияти байни нусхаҳо)',
'lineno'                  => 'Сатри $1:',
'compareselectedversions' => 'Нусхаҳои интихобшударо муқоиса кунед',
'editundo'                => 'ботил',
'diff-multi'              => '({{PLURAL:$1|вироиши миёнӣ|$1 вироишоти миёнӣ}} нишон дода нашудааст.)',

# Search results
'searchresults'            => 'Натиҷаҳои ҷустуҷӯ',
'searchresulttext'         => 'Барои иттилооти бештар дар бораи ҷустуҷӯ дар {{SITENAME}}, нигаред ба [[{{MediaWiki:Helppage}}|{{int:help}}]].',
'searchsubtitle'           => "'''[[:$1]]'''ро ҷустед",
'searchsubtitleinvalid'    => "'''$1''' барои пурсуҷӯ",
'noexactmatch'             => "'''Бо сарлавҳаи \"\$1\" мақола вуҷуд надорад.''' Шумо метавонед [[:\$1|ин саҳифаро бинависед]].",
'noexactmatch-nocreate'    => "'''Саҳифае бо унвони \"\$1\" вуҷуд надорад.'''",
'toomanymatches'           => 'Теъдоди мавориди мутобиқ хеле зиёд буд, лутфан дархости дигареро имтиҳон кунед',
'titlematches'             => 'Унвони саҳифа татбиқ мекунад',
'notitlematches'           => 'Унвонҳои ҳеҷ мақолае рост намеояд',
'textmatches'              => 'Матни мақола татбиқ мекунад',
'notextmatches'            => 'Матни ҳеҷ мақолае рост намеояд',
'prevn'                    => 'қаблӣ $1',
'nextn'                    => 'баъдӣ $1',
'viewprevnext'             => 'Намоиш ($1) ($2) ($3)',
'search-result-size'       => '$1 ({{PLURAL:$2|1 калима|$2 калимаҳо}})',
'search-result-score'      => 'Иртибот: $1%',
'search-redirect'          => '(тағйири масир $1)',
'search-section'           => '(қисмат $1)',
'search-suggest'           => 'Оё шумо инро дар назар доред: $1',
'search-interwiki-default' => '$1 натоиҷ:',
'search-interwiki-more'    => '(бештар)',
'search-relatedarticle'    => 'Алоқаманд',
'searchrelated'            => 'алоқаманд',
'searchall'                => 'ҳама',
'showingresults'           => "Намоиши {{PLURAL:$1|'''1''' натиҷа|'''$1''' натоиҷ}} дар зер оғоз аз #'''$2'''.",
'showingresultsnum'        => "Намоиши {{PLURAL:$3|'''1''' натиҷа|'''$3''' натоиҷ}} оғоз аз #'''$2'''.",
'showingresultstotal'      => "Дар ҳоли намоиши {{PLURAL:$3|натоиҷ '''$1''' аз '''$3'''|натоиҷ '''$1 - $2''' of '''$3'''}}",
'nonefound'                => "'''Эзоҳ''': Танҳо чанд фазоиномҳо аз рӯи пешфарш ҷустуҷӯ мешаванд.  Ҷустуҷӯи худро бо пешванди ''ҳама:'' барои ҷустуҷӯи мӯҳтавои пурра (саҳифаҳои баҳс, шаблонҳо ва ғайраҳо) такрор кунед, ё фазои номи дилхоҳро чун пешванд истифода баред.",
'powersearch'              => 'Ҷустуҷӯ',
'powersearch-legend'       => 'Ҷустуҷӯи пешрафта',
'search-external'          => 'Ҷустуҷӯи хориҷӣ',
'searchdisabled'           => 'Ҷустуҷу дар {{SITENAME}} ғайрифаъол карда шудааст. Шумо метавонед тариқи Google дар ҳол ҷустуҷӯ кунед. Таваҷҷӯҳ кунед, ки натоиҷи ҷустуҷӯ {{SITENAME}} метавонад барӯз набошад.',

# Preferences page
'preferences'              => 'Тарҷиҳот',
'mypreferences'            => 'Тарҷиҳоти ман',
'prefs-edits'              => 'Шумораи вироишҳо:',
'prefsnologin'             => 'Ба систем ворид нашудаед',
'prefsnologintext'         => 'Барои танзими тарҷиҳоти корбарӣ бояд [[Special:UserLogin|вуруд ба систем шавед]].',
'prefsreset'               => 'Тарҷиҳот аз ҳофиза аз нав шуд.',
'qbsettings'               => 'Танзимоти тезхат (Quickbar)',
'qbsettings-none'          => 'Набошад',
'qbsettings-fixedleft'     => 'Сабти чап',
'qbsettings-fixedright'    => 'Сабти рост',
'qbsettings-floatingleft'  => 'Шиновар чап',
'qbsettings-floatingright' => 'Шиновар рост',
'changepassword'           => 'Иваз намудани калимаи убур',
'skin'                     => 'Пӯст',
'math'                     => 'Риёзиёт',
'dateformat'               => 'Қолаби сана',
'datedefault'              => 'Бе тарҷиҳ',
'datetime'                 => 'Сана ва вақт',
'math_failure'             => 'Шикаст дар таҷзеҳ',
'math_unknown_error'       => 'хатои ношинос',
'math_unknown_function'    => 'амали номаълум',
'math_lexing_error'        => 'хатои lexing',
'math_syntax_error'        => 'хатои наҳвӣ',
'math_image_error'         => 'Табдил ба PNG шикаст хӯр; насби дурусти latex, dvips, gs, ва табдилотро баррасӣ кунед',
'math_bad_tmpdir'          => 'Имкони эҷод ё навистани иттилоот дар пӯшаи муваққатии риёзӣ (temp) вуҷуд надорад',
'math_bad_output'          => 'Имкони эҷод ё навистани иттилоот дар пӯшаи хуруҷии риёзӣ (output) вуҷуд надорад',
'math_notexvc'             => 'Барномаи ичроии texvc мавҷуд нест; барои иттилооти бештар ба math/README нигаред.',
'prefs-personal'           => 'Додаҳои корбар',
'prefs-rc'                 => 'Тағйироти охирин',
'prefs-watchlist'          => 'Феҳристи пайгириҳо',
'prefs-watchlist-days'     => 'Теъдоди рӯзҳое ки бояд дар феҳристи пайгириҳои намоиш дода шавад:',
'prefs-watchlist-edits'    => 'Теъдоди вироишҳои нишондода дар феҳристи пайгириҳои густаришёфта:',
'prefs-misc'               => 'Танзимоти ҳархела',
'saveprefs'                => 'Захираи тарҷиҳот',
'resetprefs'               => 'Тозакунии тағйироти захиранашуда',
'oldpassword'              => 'Калимаи кӯҳнаи убур:',
'newpassword'              => 'Калимаи нави убур:',
'retypenew'                => 'Калимаи нави убурро такроран нависед:',
'textboxsize'              => 'Дар ҳоли вироиш',
'rows'                     => 'Теъдоди сатрҳо:',
'columns'                  => 'Теъдоди сутунҳо:',
'searchresultshead'        => 'Ҷустуҷӯ',
'resultsperpage'           => 'Теъдоди натоиҷ дар ҳар саҳифа:',
'contextlines'             => 'Теъдоди сатрҳо дар ҳар натиҷа:',
'contextchars'             => 'Теъдоди навиштаҳо атрофи дар сатр:',
'stub-threshold'           => 'Остонаи вироиши пайвандҳои <a href="#" class="stub">ноқис</a>:',
'recentchangesdays'        => 'Теъдоди рӯзҳои намоиш додашуда дар тағйироти охир:',
'recentchangescount'       => 'Теъдоди вироишҳо барои намоиш дар тағйироти охир:',
'savedprefs'               => 'Тарҷиҳоти шумо захира шуд.',
'timezonelegend'           => 'Минтақаи вақт',
'timezonetext'             => '¹Тафовути теъдоди соати вақати маҳаллиатон бо вақти Ҷаҳонӣ ё Гринвич (UTC).',
'localtime'                => 'Вақти маҳаллӣ',
'timezoneoffset'           => 'Тафовут',
'servertime'               => 'Вақти феълии коргузор',
'guesstimezone'            => 'Аз мурургар гирифта шавад',
'allowemail'               => 'Иҷозат додани e-mail аз дигар корбарон',
'defaultns'                => 'Ба таври пешфарз дар ин фазоҳои ном ҷустуҷӯ шавад:',
'default'                  => 'пешфарз',
'files'                    => 'Файлҳо',

# User rights
'userrights'                  => 'Мудирияти ихтиёроти корбарӣ', # Not used as normal message but as header for the special page itself
'userrights-lookup-user'      => 'Мудирияти гурӯҳҳои корбарӣ',
'userrights-user-editname'    => 'Номи корбарро дохил кунед:',
'editusergroup'               => 'Гуруҳҳои корбарро вироиш кунед',
'editinguser'                 => "Дар ҳоли вироиши корбар '''[[User:$1|$1]]''' ([[User talk:$1|{{int:talkpagelinktext}}]] | [[Special:Contributions/$1|{{int:contribslink}}]])",
'userrights-editusergroup'    => 'Вироиши гурӯҳҳои корбарӣ',
'saveusergroups'              => 'Сабти гурӯҳҳои корбарӣ',
'userrights-groupsmember'     => 'Аъзои:',
'userrights-groups-help'      => 'Шумо метавонед гурӯҳҳое, ки корбар дар он қарор доштаро тағйир диҳед.
* Қуттии аломатхӯрда ба ин маънӣ аст, ки корбар дар он гурӯҳ қарор дорад.
* Қуттии аломатнахӯрда ба ин маънӣ аст, ки корбар дар он гурӯҳ қарор надорад.
* "*" маънои онро дорад, ки шумо қобили ҳазф кардани гурӯҳе нестед дар ҳоле ки шумо онро илова карда бошед, ин ё он.',
'userrights-reason'           => 'Иллати тағйир:',
'userrights-no-interwiki'     => 'Шумо иҷозати тағйири ихтиёроти корбарони дигар викиҳоро надоред.',
'userrights-nodatabase'       => 'Пойгоҳи дода $1 вуҷуд надорад ё маҳаллӣ нест.',
'userrights-nologin'          => 'Шумо бояд бо як ҳисоби корбарӣ дорои ихтиёроти мудириятӣ [[Special:UserLogin|ба систем вуруд кунед]], то битавонед ихтиёроти корбаронро таъйид кунед.',
'userrights-notallowed'       => 'Ҳисоби корбарии шумо иҷозати тағйири ихтиёроти корбариро надорад.',
'userrights-changeable-col'   => 'Гурӯҳҳое, ки шумо метавонед тағйир диҳед',
'userrights-unchangeable-col' => 'Гурӯҳҳое, ки шумо наметавонед тағйир диҳед',

# Groups
'group'               => 'Гурӯҳ:',
'group-user'          => 'Корбарон',
'group-autoconfirmed' => 'Корбарони таъйидшуда',
'group-bot'           => 'Роботҳо',
'group-sysop'         => 'Администраторҳо',
'group-bureaucrat'    => 'Бюрократҳо',
'group-suppress'      => 'Нозирот',
'group-all'           => '(ҳама)',

'group-user-member'          => 'Корбар',
'group-autoconfirmed-member' => 'Корбари таъйидшуда',
'group-bot-member'           => 'Робот',
'group-sysop-member'         => 'Администратор',
'group-bureaucrat-member'    => 'Бюрократ',
'group-suppress-member'      => 'Назар',

'grouppage-user'          => '{{ns:project}}:Корбарон',
'grouppage-autoconfirmed' => '{{ns:project}}:Корбарони таъйидшуда',
'grouppage-bot'           => '{{ns:project}}:Роботҳо',
'grouppage-sysop'         => '{{ns:project}}:Мудирон',
'grouppage-bureaucrat'    => '{{ns:project}}:Девонсолорҳо',
'grouppage-suppress'      => '{{ns:project}}:Назорат',

# Rights
'right-read'          => 'Хондани саҳифаҳо',
'right-edit'          => 'Вироиши саҳифаҳо',
'right-createpage'    => 'Эҷоди саҳифаҳо (кадоме ки саҳифаҳои баҳс нестанд)',
'right-createtalk'    => 'Эҷоди саҳифаҳои баҳс',
'right-createaccount' => 'Эҷоди ҳисобҳои корбарии ҷадид',
'right-move'          => 'Кӯчонидани саҳифаҳо',
'right-upload'        => 'Богузории парвандаҳо',
'right-delete'        => 'Ҳазфи саҳифаҳо',
'right-bigdelete'     => 'Ҳазфи саҳифаҳои бо таърихи бузург',
'right-browsearchive' => 'Ҷустуҷӯи саҳифаҳои ҳазфшуда',

# User rights log
'rightslog'      => 'Гузориши ихтиёроти корбар',
'rightslogtext'  => 'Ин гузориш тағйироти ихтиёроти корбар аст.',
'rightslogentry' => 'узвияти $1 аз гурӯҳ $2 ба $3 тағйир дода шуд',
'rightsnone'     => '(ҳеҷ)',

# Recent changes
'nchanges'                          => '$1 {{PLURAL:$1|тағйир|тағйирот}}',
'recentchanges'                     => 'Тағйироти охирин',
'recentchangestext'                 => 'Назорати тағйиротҳои навтарин дар Википедиа дар ҳамин саҳифа аст.',
'recentchanges-feed-description'    => 'Радёбии охирин тағйироти ин вики дар ин хурд.',
'rcnote'                            => "Дар поён  {{PLURAL:$1|'''1''' тағйире аст|'''$1''' тағйирот мебошанд}}, ки дар давоми {{PLURAL:$2|рӯҳ|'''$2''' рӯзҳои}} охир, сар карда аз $5, $4.",
'rcnotefrom'                        => 'Дар зер тағйиротҳои охирин аз <b>$2</b> (то <b>$1</b> нишон дода шудааст).',
'rclistfrom'                        => 'Нишон додани тағйиротҳои нав сар карда аз $1',
'rcshowhideminor'                   => '$1 вироишҳои хурд',
'rcshowhidebots'                    => '$1 ботҳо',
'rcshowhideliu'                     => '$1 корбарони вурудшуда',
'rcshowhideanons'                   => '$1 корбарони вуруднашуда',
'rcshowhidepatr'                    => '$1 вироишҳои гаштӣ',
'rcshowhidemine'                    => '$1 вироишҳои ман',
'rclinks'                           => 'Нишон додани $1 тағйироти охирин дар $2 рӯзи охир<br />$3',
'diff'                              => 'фарқият',
'hist'                              => 'таърих',
'hide'                              => 'Пинҳон кардани',
'show'                              => 'Нишон додани',
'minoreditletter'                   => 'х',
'newpageletter'                     => 'Нав',
'boteditletter'                     => 'б',
'number_of_watching_users_pageview' => '[$1 пайгирикунанда {{PLURAL:$1|корбар|корбарон}}]',
'rc_categories'                     => 'Маҳдудият ба гурӯҳҳо (бо аломати "|" ҷудо кунед)',
'rc_categories_any'                 => 'Ҳар кадом',
'newsectionsummary'                 => '/* $1 */ бахши ҷадид',

# Recent changes linked
'recentchangeslinked'          => 'Таъғироти монандӣ',
'recentchangeslinked-title'    => 'Тағйирҳои алоқаманд ба "$1"',
'recentchangeslinked-noresult' => 'Дар давоми замони додашуда тағйире дар саҳифаҳои пайваста рух надодааст.',
'recentchangeslinked-summary'  => "Ин феҳристи тағйироти охир барои саҳифаҳои пайваста аз саҳифаи мушаххасшуда мебошад (ё ба аъзоёни гурӯҳи мушаххасшуда). 
Саҳифаҳои дар [[Special:Watchlist|феҳристи назароти шумо]] буда  '''пурранг''' ҳастанд.",
'recentchangeslinked-page'     => 'Номи саҳифа:',

# Upload
'upload'                      => 'Фиристодани парванда',
'uploadbtn'                   => 'Фиристодани файл',
'reupload'                    => 'Боргузории дубора',
'reuploaddesc'                => 'Боргузориро лағв кунед ва ба форми боргузорӣ баргардед.',
'uploadnologin'               => 'Вуруд накарда',
'uploadnologintext'           => 'Барои фиристодани файлҳо Шумо бояд [[Special:UserLogin|вуруд кунед]].',
'upload_directory_read_only'  => 'Шохаи боргузорӣ ($1) аз тарафи веб коргузор қобили навиштан нест.',
'uploaderror'                 => 'Иштибоҳи фиристодан',
'uploadtext'                  => "Аз форми зерин барои богузорӣ кардани парвандаҳои ҷадид истифода кунед. Барои дидани парвандаҳое, ки қаблан боргузори шудаанд ба [[Special:ImageList|феҳристи парвандаҳои боргузоришуда]], боргузориҳо ва ҳамчунин ҳазфҳо дар [[Special:Log/upload|гузориши боргузорӣ]] сабт мешаванд.

Баъд аз ин ки парвандаеро богузорӣ кардаед, ба ин се шакл метавонед онро дар саҳифаҳо истифода кунед
'''<nowiki>[[</nowiki>{{ns:image}}<nowiki>:File.jpg]]</nowiki>''',
'''<nowiki>[[</nowiki>{{ns:image}}<nowiki>:File.png|номи акс]]</nowiki>''' ё
'''<nowiki>[[</nowiki>{{ns:media}}<nowiki>:File.ogg]]</nowiki>''' барои бевосита пайваст кардан ба парванда.",
'upload-permitted'            => 'Навъҳои парвандаҳои иҷозатшуда: $1.',
'upload-preferred'            => 'Навъҳои парвандаҳои иҷозатшуда: $1.',
'upload-prohibited'           => 'Навъҳои парвандаҳои манъшуда: $1.',
'uploadlog'                   => 'сабти фиристодан',
'uploadlogpage'               => 'Сабти фиристодан',
'uploadlogpagetext'           => 'Феҳристи зерин феҳристи охирин парвандаҳои богузоришуда мебошад. (Ҳамаи вақтҳои нишондодашуда вақти Ҷаҳонӣ ё Вақти Гринвич мебошад)',
'filename'                    => 'Номи парванда',
'filedesc'                    => 'Хулоса',
'fileuploadsummary'           => 'Хулоса:',
'filestatus'                  => 'Вазъияти ҳаққи таксир:',
'filesource'                  => 'Манбаъ:',
'uploadedfiles'               => 'Файлҳои фиристодашуда',
'ignorewarning'               => 'Аҳмият надодан ба ҳушдор ва захира кардани парванда',
'ignorewarnings'              => 'Чашмпӯшӣ аз ҳама ҳушдорҳо',
'minlength1'                  => 'Номи парванда дасти кам як ҳарф бошад.',
'illegalfilename'             => 'Номи парвандаи "$1" аломатҳоеро дар бар мегирад, ки барои номи саҳифаҳо истифода намешаванд. Лутфан номи парвандаро тағйир диҳед ва онро аз нав бор кунед.',
'badfilename'                 => 'Номи парванда ба "$1" тағйир дода шуд.',
'filetype-badmime'            => 'Парвандаҳо MIME, ки навъи онҳо "$1" бошад барои боргузорӣ иҷозате надоранд.',
'filetype-unwanted-type'      => "'''\".\$1\"''' як навъи парвандаи номатлубе аст. Навъҳои матлуби парванда \$2 мебошанд.",
'filetype-banned-type'        => "'''\".\$1\"''' як навъи парвандаи иҷозатдодашуда нест.  Навъҳои иҷозатдодашудаи парванда \$2 мебошанд.",
'filetype-missing'            => 'Парванда пасванд надорад (монанди ".jpg").',
'large-file'                  => 'Тавсия шудааст, ки парвандаҳо бузургтар аз $1 набошанд; ин парванда $2 аст.',
'largefileserver'             => 'Ин парванда аз андозаи иҷозат шудаи андозаҳои парванда дар хидматгор бурзургтар аст.',
'emptyfile'                   => 'Парвандаи боршуда холӣ ба назар мерасад. Ин масъала мумкин аст хатои навишт дар номи парванда рух дода бошад. Лутфан таъйид кунед, ки оё шумо дар ҳақиқат мехоҳед ин парвандаро бо ҳамин шароит бор кунед.',
'fileexists'                  => 'Дар ҳоли ҳозир парвандае бо ҳамин ном мавҷуд аст. Агар боварӣ надоред, ки мехоҳед он парвандаро тағйир диҳед, лутфан <strong><tt>$1</tt></strong>-ро баррасӣ кунед.',
'filepageexists'              => 'Як саҳифаи тавсифот (на парванда) бо ҳамин ном дар <strong><tt>$1</tt></strong> эҷод шуда буд, аммо парвандае бо ҳамин ном дар ҳоли ҳозир мавҷуд нест. Хулосаи ворид кардаи шумо дар саҳифаи тавсифот, пайдо нахоҳад шуд. Барои намоён кардани хулосаи худ, шумо ниёз доред онро дастӣ вироиш кунед.',
'fileexists-extension'        => 'Парвандае бо номи мушобеҳ вуҷуд дорад:<br />
Номи парвандаи боргузоришуда истода: <strong><tt>$1</tt></strong><br />
Номи парвандаи вуҷуд дошта: <strong><tt>$2</tt></strong><br />
Лутфан як номи дигареро интихоб кунед.',
'fileexists-thumb'            => "<center>'''Акс аз қабл мавҷуд аст'''</center>",
'fileexists-thumbnail-yes'    => 'Аз акс ба назар мерасад, ки акси андозааш хурд <i>(ангуштдона)</i>. Лутан парвандаро <strong><tt>$1</tt></strong> баррасӣ кунед.<br />
Агар парвандаи баррасишуда акси хурд карда шудаи он парвандаи аслӣ аст, ниёзе ба боргузории акси хурд нест.',
'file-thumbnail-no'           => 'Номи парванда бо <strong><tt>$1</tt></strong> огоз мешавад. Ба назар мерасад, ки ин парванда як аксе <i>(ангуштдона)</i> аз акси калонтар бошад.
Агар акси бо андозаи калонтар доред, онро боргузорӣ кунед, вагарна лутфан номи парвандаро тағйир диҳед.',
'fileexists-forbidden'        => 'Дар ҳоли ҳозир, парвандае бо ҳамин ном вуҷуд дорад; лутфан бар гардед ва парвандаи мавриди назари худро бо номи дигар бор кунед. [[Image:$1|thumb|center|$1]]',
'fileexists-shared-forbidden' => 'Дар ҳоли ҳозир парванде бо ҳамин ном дар анбори муштараки парвандаҳо вуҷуд дорад; лутфан бар гардед ва парвандаи мавриди назари худро бо номи дигар бо кунед. [[Image:$1|thumb|center|$1]]',
'successfulupload'            => 'Фиристодан бомуваффақият',
'uploadwarning'               => 'Огоҳии фиристодан',
'savefile'                    => 'Захираи парванда',
'uploadedimage'               => 'боршуда "[[$1]]"',
'overwroteimage'              => 'нусхаи ҷадиди "[[$1]]" боргузорӣ шуд',
'uploaddisabled'              => 'Бор кордан ғайрифаъол аст',
'uploaddisabledtext'          => 'Имкони боргузории парванда дар {{SITENAME}} ғайрифаъол шудааст.',
'uploadscripted'              => 'Ин парванда коди скриптӣ ё HTML дорад, ки метавонад дар мурургарӣ веб нодуруст намоён шавад.',
'uploadcorrupt'               => 'Ин парванда хароб аст ва ё пасванди хато дорад. Лутфан онро санҷида аз нав бор кунед.',
'uploadvirus'                 => 'Ин парванда вирус дорад! Ҷузъиёт: $1',
'sourcefilename'              => 'Номи парвандаи аслӣ:',
'destfilename'                => 'Номи парвандаи мақсад:',
'upload-maxfilesize'          => 'Бузургтарин андозаи парванда: $1',
'watchthisupload'             => 'Пайгирии ин саҳифа',
'filewasdeleted'              => 'Парвандае бо ҳамин ном пештар боргузорӣ ва пас аз он пок шудааст. Пеш аз боргузорӣ ба $1 нигаред.',
'upload-wasdeleted'           => "'''Ҳушдор: Шумо дар ҳоли боргузории парвандае ҳастед, ки пеш аз ин ҳазф шудааст.'''

Шумо бояд биандешед, ки оё давом додани боргузории ин парванда муносиб аст ё на.
Гузориши ҳазфи марбут ба ин парванда дар зер оварда шудааст:",
'filename-bad-prefix'         => 'Номи парвандае, ки шумо боргузори карданиед бо <strong>"$1"</strong> оғоз мешавад, ки як пешванди махсуси аксҳои сабтшуда тавассути аксбардоракҳои рақамӣ аст. Лутфан номи беҳтари тавсифотӣ барои парванда интихоб кунед.',

'upload-proto-error'      => 'Қарордоди нодуруст',
'upload-proto-error-text' => 'Боргузори аз дурдаст бо нишонаҳое, ки бо <code>http://</code> ё <code>ftp://</code> оғоз мешаванд, ниёз дорад.',
'upload-file-error'       => 'Хатои дохилӣ',
'upload-file-error-text'  => 'Ҳангоми талош барои эчоди як парвандаи муваққатӣ дар коргузор, як хатои дохилӣ рух дод. Лутфан бо мудири систем тамос бигиред.',
'upload-misc-error'       => 'Хатои номаълум дар боргузорӣ',
'upload-misc-error-text'  => 'Ҳангоми боргузорӣ, хатои номаълуме рух дод.  Лутфан итминнон ҳосил кунед, ки нишонаи URL мӯътабар ва қобили дастрасӣ аст, ва баъд дубора талош кунед. Агар мушкили пофишорӣ кунад, бо яке аз мудирони систем  тамос бигиред.',

# Some likely curl errors. More could be added from <http://curl.haxx.se/libcurl/c/libcurl-errors.html>
'upload-curl-error6'       => 'Дастраси ба URL мумкин нест',
'upload-curl-error6-text'  => 'Нишонаи URL-и дода шуда қобили дастрасӣ нест.  Лутфан дурустии он ва вебгоҳро бозрасӣ кунед.',
'upload-curl-error28'      => 'Замони боргузорӣ саромад',
'upload-curl-error28-text' => 'Ин сомона беш аз андоза дар посух тӯл кард. Лутфан баррасӣ кунед, ки оё сомона фаъол ва бар хат аст ё на. Сипас лаҳзае интизор шавед ва дубора талош кунед. Шояд бад набошад дар вақти н он қадар банд дубора талош кунед.',

'license'            => 'Иҷозатнома:',
'nolicense'          => 'Ҳеҷ яке интихоб нашудааст',
'license-nopreview'  => '(Пешнамоиш вуҷуд надорад)',
'upload_source_url'  => '(як нишони интернетии мӯътабар ва оммавӣ)',
'upload_source_file' => ' (парвандае дар компютери шумо)',

# Special:ImageList
'imagelist-summary'     => 'Ин саҳифаи вижа тамоми парвандаҳои боргузоришударо нишон медиҳад.
Ба таври пешфарз охирин парвандаҳои боргузоришуда дар болои феҳрист нишон дода шудаанд.
Як клик кардани рӯи унвони сутунҳо боиси тағйири тартиби намоиши парвандаҳо мешавад.',
'imagelist_search_for'  => 'Ҷустуҷӯи номи акс:',
'imgfile'               => 'парванда',
'imagelist'             => 'Феҳристи парванда',
'imagelist_date'        => 'Сана',
'imagelist_name'        => 'Ном',
'imagelist_user'        => 'Корбар',
'imagelist_size'        => 'Андоза(ҳаҷм)',
'imagelist_description' => 'Тавсифот',

# Image description page
'filehist'                       => 'Таърихи файл',
'filehist-help'                  => 'Рӯи таърихҳо клик кунед то нусхаи марбути парвандаро бубинед.',
'filehist-deleteall'             => 'ҳазфи ҳама',
'filehist-deleteone'             => 'ҳазф',
'filehist-revert'                => 'вогардонӣ',
'filehist-current'               => 'нусхаи феълӣ',
'filehist-datetime'              => 'Таърих',
'filehist-user'                  => 'Корбар',
'filehist-dimensions'            => 'Андоза',
'filehist-filesize'              => 'Андозаи парванда',
'filehist-comment'               => 'Тавзеҳ',
'imagelinks'                     => 'Пайвандҳо',
'linkstoimage'                   => '{{PLURAL:$1|Саҳифаҳои|$1 Саҳифаи}} зерин ба ин акс пайванданд:',
'nolinkstoimage'                 => 'Ҳеҷ саҳифае ба ин акс пайванд надорад.',
'sharedupload'                   => 'Ин парванда бо таври умумӣ бор карда шудааст ва шояд аз тарафи дигар лоиҳаҳо мавриди истифода бошад.',
'shareduploadwiki'               => 'Лутфан барои иттилооти бештар ба $1 нигаред.',
'shareduploadwiki-desc'          => 'Тавзеҳот дар мавриди $1 дар зер нишон дода шудааст.',
'shareduploadwiki-linktext'      => 'саҳифаи тавсифи парванда',
'shareduploadduplicate-linktext' => 'дигар парванда',
'shareduploadconflict-linktext'  => 'дигар парванда',
'noimage'                        => 'Ҳеҷ парвандае бо ин ном мавҷуд нест, шумо метавонед $1.',
'noimage-linktext'               => 'онро бор кунед',
'uploadnewversion-linktext'      => 'Бор кардани нусхаи ҷадидӣ ин парванда',
'imagepage-searchdupe'           => 'Ҷустуҷӯ барои парвандаҳои такрорӣ',

# File reversion
'filerevert'                => 'Вогардонии $1',
'filerevert-legend'         => 'Вогардонии парванда',
'filerevert-intro'          => "Шумо дар ҳоли вогардонии '''[[Media:$1|$1]]''' ба [$4 нусхаи аз $3, $2] ҳастед.",
'filerevert-comment'        => 'Тавзеҳ:',
'filerevert-defaultcomment' => 'Вогардонӣ ба нусхаи $2, $1',
'filerevert-submit'         => 'бирав',
'filerevert-success'        => "'''[[Media:$1|$1]]''' вогардонида шуд ба [нусхаи $4 аз таърихи $3, $2].",
'filerevert-badversion'     => 'Нусхаи кӯҳнатаре аз ин парванда вуҷуд надошт.',

# File deletion
'filedelete'                  => 'Ҳазфи $1',
'filedelete-legend'           => 'Ҳазфи парванда',
'filedelete-intro'            => "Шумо дар ҳоли ҳазф кардани '''[[Media:$1|$1]]''' ҳастед.",
'filedelete-intro-old'        => "Шумо дар ҳоли ҳазфи нусхаи '''[[Media:$1|$1]]''' аз таърихи [$4 $3, $2] ҳастед.",
'filedelete-comment'          => 'Сабаби ҳазф:',
'filedelete-submit'           => 'Ҳазф',
'filedelete-success'          => "'''$1''' ҳазф шуд.",
'filedelete-success-old'      => '<span class="plainlinks">Нусхаи \'\'\'[[Media:$1|$1]]\'\'\' аз таърихи $3, $2 ҳазф шуд.</span>',
'filedelete-nofile'           => "'''$1''' вуҷуд надорад.",
'filedelete-nofile-old'       => "Нусхаи бойгонӣ шудае аз '''$1''' бо мушаххасоти дода шуда, вуҷуд надорад.",
'filedelete-iscurrent'        => 'Шумо мехоҳед, ки охирин нусхаи ин парвандаро ҳазф кунед. Лутфан ибтидо парвандеро ба як нусхаи кӯҳнатар вогардонӣ кунед.',
'filedelete-otherreason'      => 'Далели дигар/изофӣ:',
'filedelete-reason-otherlist' => 'Дигар далел',
'filedelete-reason-dropdown'  => '*Далелҳои умумии ҳазф
** Нақзи ҳаққи таксир
** Парвандаи такрорӣ',
'filedelete-edit-reasonlist'  => 'Вироиш ҳазф далелҳо',

# MIME search
'mimesearch'         => 'Ҷустуҷӯ бо стандарти MIME',
'mimesearch-summary' => 'Бо кӯмаки ин саҳифа шумо метавонед парвандаҳое, ки як навъ ба хусус MIME пайдо кунед. Ворид: contenttype/subtype, намуна. <tt>image/jpeg</tt>.',
'mimetype'           => 'MIME навъ:',
'download'           => 'боргирӣ',

# Unwatched pages
'unwatchedpages' => 'Саҳифаҳои пайгиринашуда',

# List redirects
'listredirects' => 'Рӯйхати саҳифаҳои равонакунӣ',

# Unused templates
'unusedtemplates'     => 'Шаблонҳои истифоданашуда',
'unusedtemplatestext' => 'Ин саҳифа ҳамаи саҳифаҳои дар фазоиноми шаблонро ки дар ҳеҷ саҳифаҳо ба кор нарафтаанд, феҳрист мекунад. Лутфан пеш аз пок кардани ин саҳифаҳо пайвандҳои дигар ба онҳоро баррасӣ кунед.',
'unusedtemplateswlh'  => 'дигар пайвандҳо',

# Random page
'randompage'         => 'Саҳифаи тасодуфӣ',
'randompage-nopages' => 'Ҳеҷ саҳифае дар ин фазои ном мавҷуд нест.',

# Random redirect
'randomredirect'         => 'Масири тасодуфӣ',
'randomredirect-nopages' => 'Ҳеҷ саҳифаи тағйири масире дар ин фазои ном мавҷуд нест.',

# Statistics
'statistics'             => 'Омор\\Статистика',
'sitestats'              => 'Омори {{SITENAME}}',
'userstats'              => 'Омори корбарон',
'sitestatstext'          => "Куллан {{PLURAL:\$1|'''1'''|'''\$1'''}} саҳифа дар пойгоҳ вуҷуд дорад.
Ин саҳифаҳои \"баҳс\", саҳифаҳо дар {{SITENAME}}, саҳифаҳои \"нопурра\" хурд, тағйири масирҳо, ва дигар саҳифаҳоро дар бар мегирад, эҳтимолан ҳамчун мақолаҳо ба ҳисоб намераванд.
Сарфи назар аз инҳо, {{PLURAL:\$2|'''1''' саҳифае ҳаст|'''\$2''' саҳифаҳое ҳастанд}}, ки эҳтимолан   {{PLURAL:\$2|саҳифаи|саҳифаҳои}} ҳақиқӣ ба шумор {{PLURAL:\$2|меравад|мераванд}}.

'''\$8''' {{PLURAL:\$8|парванда|парвандаҳо}} боргузорӣ {{PLURAL:\$8|шуд|шудаанд}}.

Дар маҷмӯъ '''\$3''' {{PLURAL:\$3|назар|назарот}} ба саҳифа шудаанд, ки шомили '''\$4''' {{PLURAL:\$4|вироиш|вироишҳо}} аз замони насб шудани {{SITENAME}} иҷро шудаанд.
Ба ин тартиб ҳар саҳифа ба ҳисоби миёна '''\$5''' вироиш шудааст, ва '''\$6''' назарот ба ҳар вироиш сурат гирифта аст.

Тӯли [http://www.mediawiki.org/wiki/Manual:Job_queue саф корҳо] '''\$7''' аст.",
'userstatstext'          => "Теъдоди {{PLURAL:$1|'''1''' [[Special:ListUsers|корбаре]] сабти ном шуда вуҷуд дорад,|'''$1''' [[Special:ListUsers|корбароне]] вуҷуд доранд}}, ки аз байни онҳо '''$2''' (ё '''$4%''') нафар $5 дорои дастраси {{PLURAL:$2|аст|ҳастанд}}.",
'statistics-mostpopular' => 'Саҳифаҳои бисёр назаркардашуда',

'disambiguations'      => 'Саҳифаҳои ибҳомзудоӣ',
'disambiguationspage'  => 'Template:ибҳомзудоӣ',
'disambiguations-text' => "Саҳифаҳои зерин пайванд ба '''саҳифаи ибҳомзудоӣ''' доранд. Ин саҳифаҳо бояд ба мавзӯъи муносиби худ пайваст шаванд.<br />Саҳифа Ибҳомзудоӣ дар назар гирифта мешавад, ки дар он шаблоне, ки ба [[MediaWiki:Disambiguationspage]] пайванд дорад истифода шуда бошад",

'doubleredirects'     => 'Тағйири масирҳои дутоӣ',
'doubleredirectstext' => 'Ҳар сатр дар бар дорандаи пайвандҳое ба тағйири масири аввал ва дувум ва ҳамчунин хати нахуст тагйири масири дувум аст. Маъмулан саҳифаи мақсади воқеъӣ, ки нахустин тағйири масир бояд ба он бошад ба ин гуна мушаххас мешавад.',

'brokenredirects'        => 'Саҳифаҳои кандашудаи равонакунӣ',
'brokenredirectstext'    => 'Масирҳои зерин ба саҳифаҳои номавҷуд пайванданд:',
'brokenredirects-edit'   => '(вироиш)',
'brokenredirects-delete' => '(ҳазф)',

'withoutinterwiki'         => 'Саҳифаҳои бидуни пайвандҳои забонӣ',
'withoutinterwiki-summary' => 'Саҳифаҳои зерин пайванде ба забони дигар надоранд:',
'withoutinterwiki-legend'  => 'Пешванд',
'withoutinterwiki-submit'  => 'Намоиш',

'fewestrevisions' => 'Саҳифаҳое, ки шумораи ками нусхаҳо доранд',

# Miscellaneous special pages
'nbytes'                  => '$1 {{PLURAL:$1|байт|байтҳо}}',
'ncategories'             => '$1 {{PLURAL:$1|гурӯҳ|гурӯҳҳо}}',
'nlinks'                  => '$1 {{PLURAL:$1|пайванд|пайвандҳо}}',
'nmembers'                => '$1 {{PLURAL:$1|узв}}',
'nrevisions'              => '$1 {{PLURAL:$1|вироиш|вироиш}}',
'nviews'                  => '$1 {{PLURAL:$1|намоиш|намоишҳо}}',
'specialpage-empty'       => 'Барои ин ҳисобот натиҷае вуҷуд надорад.',
'lonelypages'             => 'Саҳифаҳои ятим',
'lonelypagestext'         => 'Ба саҳифаҳои зерин дар дигар саҳифаи {{SITENAME}} пайванд дода нашудааст.',
'uncategorizedpages'      => 'Саҳифаҳое, ки ба ягон гурӯҳ дохил нестанд',
'uncategorizedcategories' => 'Гурӯҳҳое, ки ба ягон гурӯҳ дохил нестанд',
'uncategorizedimages'     => 'Аксҳое, ки ба ягон гурӯҳ дохил нестанд',
'uncategorizedtemplates'  => 'Шаблонҳое, ки ба ягон гурӯҳ дохил нестанд',
'unusedcategories'        => 'Гурӯҳҳои истифоданашуда',
'unusedimages'            => 'Файлҳои истифоданашуда',
'popularpages'            => 'Саҳифаҳои машҳур',
'wantedcategories'        => 'Гурӯҳҳои дархостӣ',
'wantedpages'             => 'Саҳифаҳои дархостӣ',
'mostlinked'              => 'Саҳифаҳое, ки ба онҳо аз ҳама бештар пайвандҳо равона карда шудааст',
'mostlinkedcategories'    => 'Саҳифаҳое, ки дар бештари гурӯҳҳо дохил шудаанд',
'mostlinkedtemplates'     => 'Шаблонҳое ки бештар аз ҳама бо онҳо пайванд шудааст',
'mostcategories'          => 'Мақолаҳое ки бештарин теъдоди гурӯҳҳоро доранд',
'mostimages'              => 'Аксҳое ки бештар аз ҳама бо онҳо пайванд шудааст',
'mostrevisions'           => 'Саҳифахое, ки аз ҳама бештар вироиш шудаанд',
'prefixindex'             => 'Намоиши пешвандӣ',
'shortpages'              => 'Саҳифаҳои кӯтоҳ',
'longpages'               => 'Саҳифаҳои калон',
'deadendpages'            => 'Саҳифаҳои бемаъно',
'deadendpagestext'        => 'Саҳифаҳои зерин ба ҳеҷ дигар саҳифае дар {{SITENAME}} пайванд нестанд.',
'protectedpages'          => 'Саҳифаҳои ҳифзшуда',
'protectedpagestext'      => 'Саҳифаи зерин аз вироиш ё кӯчонидани ҳифз шудаанд',
'protectedpagesempty'     => 'Дар ҳоли ҳозир ҳеҷ саҳифае муҳофизат нашудааст.',
'protectedtitles'         => 'Унвонҳои муҳофизатшуда',
'protectedtitlestext'     => 'Унвонҳои зерин аз эҷод муҳофизат шудаанд',
'protectedtitlesempty'    => 'Дар ҳоли ҳозир ҳеҷ унвоне бо ин параметрҳо муҳофизат нащудааст',
'listusers'               => 'Рӯйхати корбарон',
'newpages'                => 'Саҳифаҳои нав',
'newpages-username'       => 'Номи корбар:',
'ancientpages'            => 'Саҳифаҳои кӯҳнатарин',
'move'                    => 'Кӯчонидан',
'movethispage'            => 'Кӯчонидани ин саҳифа',
'unusedimagestext'        => 'Лутфан таваҷҷӯҳ кунед, ки сомонаҳои дигар, ах ҷумла мустақим ба акс пайванд дошта бошанд, ва бевосита бо нишонаи URL бо вуҷуди истифодаи фаъол инҷо феҳрист шуда бошад.',
'unusedcategoriestext'    => 'Гурӯҳҳои зерин вуҷуд дорад, вале ягон саҳифа ё гурӯҳе аз онҳо истифода намекунанд.',
'notargettitle'           => 'Мақсаде нест',
'notargettext'            => 'Шумо ягон саҳифа ё корбареро барои иҷрои ин амал рӯи он мушаххас накардаед.',
'pager-newer-n'           => '{{PLURAL:$1|навтар 1|навтар $1}}',
'pager-older-n'           => '{{PLURAL:$1|кӯҳнатар 1|кӯҳнатар $1}}',
'suppress'                => 'Назорат',

# Book sources
'booksources'               => 'Манбаҳои китобҳо',
'booksources-search-legend' => 'Ҷустуҷӯи сарчашмаҳои китоб',
'booksources-go'            => 'Бирав',
'booksources-text'          => 'Дер зер феҳристи пайвандҳо ба сомонаҳое, ки китобҳои нав ва кӯҳна мефурӯшанд, оварда шудааст. Мумкин аст, иттилооти бештарро дар бораи китобҳои ҷустуҷӯ кардаатон дошта бошанд:',

# Special:Log
'specialloguserlabel'  => 'Корбар:',
'speciallogtitlelabel' => 'Сарлавҳа:',
'log'                  => 'Гузоришҳо',
'all-logs-page'        => 'Ҳамаи сабтҳо',
'log-search-legend'    => 'Ба дунболи гузоришҳо ҷустуҷӯ кун',
'log-search-submit'    => 'Бирав',
'alllogstext'          => 'Намоиши ҳамаи гузоришҳои дастраси якҷояи дастраси {{SITENAME}}. Метавонед бо интихоби навъи гузориш, номи корбарӣ ва саҳифаҳои тағйирёфта, намоишро маҳдудтар созед.',
'logempty'             => 'Мавриди мутобиқ ба манзури шумо дар гузориш пайдо нашуд.',
'log-title-wildcard'   => 'Саҳифаҳоеро ҷустуҷӯ кунед, ки унвонашон бо ин матн оғоз мешаванд',

# Special:AllPages
'allpages'          => 'Ҳамаи саҳифаҳо',
'alphaindexline'    => '$1 то $2',
'nextpage'          => 'Саҳифаи баъдина ($1)',
'prevpage'          => 'Саҳифаи пешина ($1)',
'allpagesfrom'      => 'Намоиши саҳифаҳо бо шурӯъ аз:',
'allarticles'       => 'Ҳамаи мақолаҳо',
'allinnamespace'    => 'Ҳамаи саҳифаҳо ($1 namespace)',
'allnotinnamespace' => 'Ҳамаи саҳифаҳо (ки дар фазоином $1 аст)',
'allpagesprev'      => 'Пешина',
'allpagesnext'      => 'Баъдина',
'allpagessubmit'    => 'Рав',
'allpagesprefix'    => 'Намоиши саҳифаҳои дорои пешванд:',
'allpagesbadtitle'  => 'Унвони саҳифаи дода шуда номӯътабар аст, ё инки дорои пешванди байнизабонӣ ё байнивикиӣ аст. Мумкин аст аломатҳоеро дорад, ки наметавон онҳоро дар унвонҳо истифода бурд.',
'allpages-bad-ns'   => '{{SITENAME}} дорои фазоином "$1" нест.',

# Special:Categories
'categories'                    => 'Гурӯҳҳо',
'categoriespagetext'            => 'Гурӯҳҳои зерин дар вики вуҷуд доранд.',
'special-categories-sort-count' => 'муратаб кардан бар асоси теъдод',
'special-categories-sort-abc'   => 'муратаб кардани алифбоӣ',

# Special:ListUsers
'listusersfrom'      => 'Намоиши корбарон бо шурӯъ аз:',
'listusers-submit'   => 'Нишон додани',
'listusers-noresult' => 'Ҳеҷ корбаре ёфт нашуд.',

# Special:ListGroupRights
'listgrouprights-group'   => 'Гурӯҳ',
'listgrouprights-members' => '(феҳристи аъзоён)',

# E-mail user
'mailnologin'     => 'Нишонае аз фиристанда вуҷуд надорад',
'mailnologintext' => 'Барои фиристодани почтаи электронӣ барои корбарони дигар бояд [[Special:UserLogin|ба систем ворид шавед]] ва нишонаи почтаи электронии мӯътабар дар [[Special:Preferences|тарҷиҳоти]] худ дошта бошед.',
'emailuser'       => 'Фиристодани email ба ин корбар',
'emailpage'       => 'Почтаи электронӣ ба корбар',
'emailpagetext'   => 'Агар ин корбар нишонаи почтаи электронии мӯътабаре дар тарҷиҳоти ворид карда бошад, форми зерин як пайғоме мефиристад.
Нишонаи почтаи электроние, ки шумо дар тарҷиҳоти корбариатон ворид кардаед, дар нишони фиристандаи нома "From" хоҳад омад, то ки гиранда тавонад ба шумо посух диҳад.',
'usermailererror' => 'Почтаи электрони ба хатое дучор шуд:',
'defemailsubject' => 'Википедиа e-mail',
'noemailtitle'    => 'Нишонаи почтаи электронӣ мавҷуд нест',
'noemailtext'     => 'Ин корбар, нишонаи мӯътабари почтаи электрониро мушаххас накарда аст, ё тасмим гирифааст, аз корбарони дигар почтаи электронӣ дарёфт накунад.',
'emailfrom'       => 'Аз',
'emailto'         => 'Ба',
'emailsubject'    => 'Мавзӯъ',
'emailmessage'    => 'Пайём',
'emailsend'       => 'Ирсол',
'emailccme'       => 'Нусхаи пайёми маро ба E-mail-и ман фирист.',
'emailccsubject'  => 'Нусхаи номаи шумо ба $1: $2',
'emailsent'       => 'Почтаи электронӣ фиристода шуд',
'emailsenttext'   => 'Номаи почтаи электронии шумо фиристода шуд.',

# Watchlist
'watchlist'            => 'Феҳристи назароти ман',
'mywatchlist'          => 'Феҳристи назароти ман',
'watchlistfor'         => "(барои '''$1''')",
'nowatchlist'          => 'Дар феҳристи пайгириҳои шумо ҳеҷ мавриде нест.',
'watchlistanontext'    => 'Лутфан барои мушоҳида ва вироиши феҳристи пайгириҳои худ аз $1 истифода кунед.',
'watchnologin'         => 'Вуруд нашуда',
'watchnologintext'     => 'Барои тағйири феҳристи пайгириҳои худ бояд [[Special:UserLogin|ба систем ворид шавед]].',
'addedwatch'           => 'Ба феҳристи пайгириҳо илова карда шуд',
'addedwatchtext'       => "Ин саҳифа \"[[:\$1]]\" ва [[Special:Watchlist|феҳристи назароти]] Шумо илова шуд.
Дигаргуниҳои ояндаи ин саҳифа ва саҳифи баҳси алоқаманд дар рӯихати онҷо хоҳад шуд,
ва саҳифа '''ғафс''' дар [[Special:RecentChanges|рӯихати тағйироти охирин]] барои бо осони дарёфт кардан хоҳад ба назар расид.

Агар шумо дертар аз феҳристи назаротатон ин саҳифаро ҳазв кардан хоҳед, дар меню \"Назар накардан\"-ро пахш кунед.",
'removedwatch'         => 'Аз феҳристи пайгириҳо бардошта шуд',
'removedwatchtext'     => 'Саҳифаи "[[:$1]]" аз феҳристи пайгириҳои шумо бардошта шуд.',
'watch'                => 'Назар кардан',
'watchthispage'        => 'Пайгирии ин саҳифа',
'unwatch'              => 'Назар накардан',
'unwatchthispage'      => 'Тавқифи пайгирии ин саҳифа',
'notanarticle'         => 'Мақола нест',
'notvisiblerev'        => 'Нусха ҳазф шуд',
'watchnochange'        => 'Ягон мавриди пайгириҳои шумо дар давраи замони намоишёфта вироиш нашуда аст.',
'watchlist-details'    => '{{PLURAL:$1|$1 саҳифаи|$1 саҳифаҳои}} бидуни ҳисоби саҳифаҳои баҳс.',
'wlheader-enotif'      => '* Иттилоорасонии тариқи почтаи электронӣ (E-mail) имконпазир аст.',
'wlheader-showupdated' => "* Саҳифаҳое, ки пас аз охирин сар заданатон ба онҳо тағйир кардаанд '''пурранг''' нишон дода шудаанд",
'watchmethod-recent'   => 'баррасии вироишҳои охир барои саҳифаҳои пайгиришуда',
'watchmethod-list'     => 'баррасии саҳифаҳои пайгиришуда барои вироишҳои охир',
'watchlistcontains'    => 'Феҳристи пайгириҳои шумо $1 {{PLURAL:$1|саҳифаро|саҳифаҳоро}} дар бар мегирад.',
'iteminvalidname'      => "Мушкилӣ бо мавриди '$1', номи номӯътабар аст...",
'wlnote'               => "Дар зер {{PLURAL:$1|охирин тағйир|'''$1''' охирин тағйирот}} дар $2 соати охир {{PLURAL:омадааст|омадаанд}}.",
'wlshowlast'           => 'Намоиши охирин $1 соат $2 рӯзҳо $3',
'watchlist-show-bots'  => 'Намоиши вироишҳои роботҳо',
'watchlist-hide-bots'  => 'Пинҳон кардани вироишҳои роботҳо',
'watchlist-show-own'   => 'Намоиши вироишҳои ман',
'watchlist-hide-own'   => 'Пинҳон кардани вироишҳои ман',
'watchlist-show-minor' => 'Намоиши вироишҳои ҷузъӣ',
'watchlist-hide-minor' => 'Пинҳон намудани вироишҳои хурд',

# Displayed when you click the "watch" button and it is in the process of watching
'watching'   => 'Пайгири...',
'unwatching' => 'Тавқифи пайгири...',

'enotif_mailer'                => '{{SITENAME}} Иттилорасонӣ почтаи электронӣ',
'enotif_reset'                 => 'Аломатрасони ҳамаи саҳифаҳо ба унвони боздидшуда',
'enotif_newpagetext'           => 'Ин саҳифаи нав аст',
'enotif_impersonal_salutation' => 'Корбари {{SITENAME}}',
'changed'                      => 'тағйирёфта',
'created'                      => 'эҷод шуд',
'enotif_subject'               => 'Саҳифаи {{SITENAME}} $PAGETITLE аз тарафи $PAGEEDITOR $CHANGEDORCREATED шуд',
'enotif_lastvisited'           => 'Барои дидани ҳамаи тағйирот аз охирин боре, ки сар задаед $1ро бубинед.',
'enotif_lastdiff'              => 'Барои намоиши ин тағйир $1ро бубинед.',
'enotif_anon_editor'           => 'корбари ношинос $1',
'enotif_body'                  => 'Мӯҳтарам $WATCHINGUSERNAME,


Саҳифаи $PAGETITLE дар {{SITENAME}} аз тарафаи $PAGEEDITOR дар $PAGEEDITDATE  $CHANGEDORCREATED шуд, барои нусхаи кунунӣ, нигаред ба $PAGETITLE_URL.

$NEWPAGE

Тавзеҳи вироишгар: $PAGESUMMARY $PAGEMINOREDIT

Тамос бо вироишгар:
почати электронӣ: $PAGEEDITOR_EMAIL
вики: $PAGEEDITOR_WIKI

То ҳангоме, ки ба саҳифа сар назадаед, дар сурати рух додани эҳтимолӣ, тағйироти бештар эълоне барои шумо фиристода нахоҳад шуд. Шумо ҳамчунин метавонед дар саҳифаи пайгириҳои худ парчамҳои марбут огоҳирасонии тариқи почтаи электониро сифр кунед.

             Хоксори шумо {{SITENAME}} сомонаи огоҳирасонӣ

--
Барои танзимоти феҳристи пайгириҳоятон биравед ба
{{fullurl:{{ns:special}}:Watchlist/edit}}

Пешниҳодот ва кӯмаки бештар:
{{fullurl:{{MediaWiki:Helppage}}}}',

# Delete/protect/revert
'deletepage'                  => 'Ҳазфи саҳифа',
'confirm'                     => 'Тасдиқ',
'excontent'                   => "мӯҳтавои саҳифа ин буд: '$1'",
'excontentauthor'             => "мӯҳтавои саҳифа ин буд: '$1' (ва ягона ҳиссагузор '[[Special:Contributions/$2|$2]]' буд)",
'exbeforeblank'               => "мӯҳтавои саҳифа қабл аз холӣ кардан ин '$1' буд",
'exblank'                     => 'саҳифа холӣ буд',
'delete-confirm'              => 'Ҳазф "$1"',
'delete-legend'               => 'Ҳазф',
'historywarning'              => 'Ҳушдор: Саҳифае ки шумо ҳазф карданиед, таърих дорад:',
'confirmdeletetext'           => 'Шумо дар ҳоли ҳазф кардани як саҳифа ё аксе аз пойгоҳ дода ҳамроҳ бо тамоми таърихи он ҳастед. Лутфан ин амалро тасдиқ кунед ва итминон ҳосил кунед, ки оқибати ин корро медонед ва ин амалро мутобиқи [[{{MediaWiki:Policy-url}}|сиёсати ҳазф]] анҷом медиҳед.',
'actioncomplete'              => 'Амал иҷро шуд',
'deletedtext'                 => '"<nowiki>$1</nowiki>" ҳазф шудааст.
Нигаред ба $2 барои гузориши ҳазфи охирин.',
'deletedarticle'              => 'ҳазфшуда "[[$1]]"',
'suppressedarticle'           => '"[[$1]]"-ро мавқуф кард',
'dellogpage'                  => 'Гузоришҳои ҳазф',
'dellogpagetext'              => 'Феҳристи зер феҳристи аз охирин ҳазфҳост. Ҳамаи вақтҳои нишон додашуда, вақти Ҷаҳонӣ (вақти Гринвич) аст.',
'deletionlog'                 => 'гузоришҳои ҳазф',
'reverted'                    => 'Ба нусхаи пештара вогардонида шуд',
'deletecomment'               => 'Сабаби ҳазфкунӣ',
'deleteotherreason'           => 'Далели дигар/иловагӣ:',
'deletereasonotherlist'       => 'Дигар сабаб',
'deletereason-dropdown'       => '*Далелҳои умумии ҳазф
** Дархости корбар
** Нақзи ҳаққи таксир
** Харобкорӣ',
'delete-edit-reasonlist'      => 'Вироиш ҳазф далелҳо',
'delete-toobig'               => 'Ин саҳифа таърихчаи бузурге дорад, ки шомили беш аз $1 вироиш аст. Ҳазфи ин гуна саҳифаҳо барои пешгири аз шикастани тасодуфӣ дар {{SITENAME}} маҳдуд шудааст.',
'delete-warning-toobig'       => 'Ин саҳифа таърихи бузурге дорад, ки шомили беш аз $1 вироиш аст. Ҳазфи ин саҳифа метавонад ихтилол ба амалгари пойгоҳи додаи {{SITENAME}} бишавад; лутфан бо эҳтиёт иқдом кунед.',
'rollback'                    => 'Вогардонии вироишҳо',
'rollback_short'              => 'Вогард',
'rollbacklink'                => 'вогардони',
'rollbackfailed'              => 'Вогардони нашуд',
'cantrollback'                => 'Наметавон вироишро вогардонд; охирин ҳиссагузор танҳо муаллифи ин мақола аст.',
'alreadyrolled'               => 'Охирин вироиши [[:$1]] аз тарафи [[User:$2|$2]] ([[User talk:$2|Баҳс]]) наметавон вогардонӣ кард; пеш аз ин шахси дигаре мақоларо вироиш ё вогардонӣ кардааст.

Охирин вироиш аз тарафи [[User:$3|$3]] ([[User talk:$3|Баҳс]]) буд.',
'editcomment'                 => 'Тавзеҳи вироиш ин буд: "<i>$1</i>".', # only shown if there is an edit comment
'revertpage'                  => 'Вироиши [[Special:Contributions/$2|$2]] ([[User talk:$2|Баҳс]]) вогардонида шуд ба охирин тағйире, ки [[User:$1|$1]] анҷом дода буд', # Additional available: $3: revid of the revision reverted to, $4: timestamp of the revision reverted to, $5: revid of the revision reverted from, $6: timestamp of the revision reverted from
'rollback-success'            => 'Вироишҳои $1 вогардонӣ шуд; саҳифа ба вироиши $2 баргардонида шуд.',
'sessionfailure'              => 'Ба назар мерасад, мушкилие дар мавриди нишасти корбарии шумо вуҷуд дорад; амали дархостшуда ба унвони иқдоми пешгирона дар баробари рабуда шудани иттилооти нишасти корбарӣ, лағв шуд. Лутфан тугмаи "бозгашт"-ро дар мурургари худ пахш кунед ва саҳифае, ки аз он инҷо расидаед муҷаддадан фарохонӣ кунед, сипас муҷаддадан боз саъй кунед.',
'protectlogpage'              => 'Гузориши муҳофизат',
'protectlogtext'              => 'Дар зер феҳристи қуфл карданҳо ва аз қуфл озод шуданҳо омада аст. Барои иттилооти бештар ба [[Special:ProtectedPages|феҳристи саҳифаҳои муҳофизатшуда]] нигаред.',
'protectedarticle'            => '"[[$1]]" муҳофизат шуд',
'modifiedarticleprotection'   => 'сатҳи муҳофизати саҳифаи "[[$1]]" тағйир дода шуд',
'unprotectedarticle'          => 'аз муҳофизат озод шуда "[[$1]]"',
'protect-title'               => 'Дар ҳоли гузоштани сатҳи муҳофизат барои "$1"',
'protect-legend'              => 'Тасдиқи муҳофизат',
'protectcomment'              => 'Далели муҳофизат:',
'protectexpiry'               => 'Замони саромадан:',
'protect_expiry_invalid'      => 'Замони саромадан номӯътабар аст.',
'protect_expiry_old'          => 'Замони саромадан дар гузашта аст.',
'protect-unchain'             => 'Боз кардани иҷозати кӯчонидан',
'protect-text'                => 'Шумо инҷо сатҳи муҳофизати саҳифаи <strong><nowiki>$1</nowiki></strong> метавонед нигаред ё тағйир диҳед',
'protect-locked-blocked'      => 'Шумо муддате, ки дастарсиатон қатъ аст наметавонед сатҳи ҳифзи саҳифаҳоро тагйир диҳед. Танзимоти феълии саҳифаи <strong>$1</strong> ба ин қарор аст:',
'protect-locked-dblock'       => 'Аз сабаби қуфл шудани пойгоҳи дода, имкони тағйири сатҳи ҳифзи саҳифа вуҷуд надорад.
Танзимоти феълии саҳифаи <strong>$1</strong> ба ин қарор аст:',
'protect-locked-access'       => 'Ҳисоби шумо иҷозати тағйири сатҳи ҳифозати саҳифаро надорад.
Танзимоти кунунии саҳифа ба ин қарор аст <strong>$1</strong>:',
'protect-cascadeon'           => 'Ин саҳифа дар ҳоли ҳозир муҳофизат шудааст, чунки он дар {{PLURAL:$1|саҳифае, ки муҳофизати обшорӣ дорад|саҳифаҳое, ки муҳофизати обшорӣ доранд}} илова шудааст. Шумо метавонед сатҳи муҳофизати ин саҳифаро тағйир диҳед, аммо он ба муҳофизати обшорӣ таъсир нахоҳад расонд.',
'protect-default'             => '(пешфарз)',
'protect-fallback'            => 'Сатҳи дастрасӣ "$1" лозим аст',
'protect-level-autoconfirmed' => 'Бастани корбарони сабтиномнакарда',
'protect-level-sysop'         => 'Танҳо барои мудирон',
'protect-summary-cascade'     => 'обшорӣ',
'protect-expiring'            => 'замони саромадан $1 (UTC)',
'protect-cascade'             => 'Муҳофизати обшорӣ - Аз ҳама саҳифаҳое, ки дар ин саҳифа омадаанд муҳофизат мешаванд',
'protect-cantedit'            => 'Шумо вазъияти ҳифзи ин саҳифаро тағйир дода наметавонед, чун иҷозати вироиши онро надоред.',
'restriction-type'            => 'Дастраси:',
'restriction-level'           => 'Сатҳи маҳдудият:',
'minimum-size'                => 'Ҳадди ақали андоза',
'maximum-size'                => 'Ҳадди аксари андоза:',
'pagesize'                    => '(байт)',

# Restrictions (nouns)
'restriction-edit'   => 'Вироиш',
'restriction-move'   => 'Кӯчонидан',
'restriction-create' => 'Эҷод',

# Restriction levels
'restriction-level-sysop'         => 'пурра ҳифзшуда',
'restriction-level-autoconfirmed' => 'нима муҳофизатшуда',
'restriction-level-all'           => 'ҳар сатҳе',

# Undelete
'undelete'                     => 'Эҳёи саҳифаҳои ҳазфшуда',
'undeletepage'                 => 'Намоиш ва эҳёи саҳифаҳои ҳазфшуда',
'undeletepagetitle'            => "'''Он чӣ дар идома меояд, шомили нусхаҳои ҳазфшудаи [[:$1]] аст'''.",
'viewdeletedpage'              => 'Намоиши саҳифаҳои ҳазфшуда',
'undeletepagetext'             => 'Саҳифаҳои зер ҳазф шудаанд, вале ҳанӯз дар бойгонӣ ҳастанд ва метавонанд барқарор шаванд. Ин бойгонӣ метавонад ҳар чанд вақт тоза карда шавад.',
'undeleteextrahelp'            => "Барои барқарор кардани тамоми саҳифа, ҳамаи ҷаъбаҳоро тикнахӯрда раҳо карда ва тугмаи  '''''Барқарор шавад'''''-ро  пахш кунед. Барои анҷоми барқароркунии мунтахабона, ҷаъбаҳои мутобиқ буда ба нусхаҳои мавриди назар барои барқароркуниро тик зада ва тугмаи '''''Барқарор шавад'''''-ро пахш кунед. Тугмаи '''''Аз нав''''' мӯҳтавиёти бахши тавзеҳро пок ва тамоми ҷаъбаҳоро тикнахӯрда мекунад.",
'undeleterevisions'            => '$1 нусха бойгонӣ {{PLURAL:$1|шудааст|шудаанд}}',
'undeletehistory'              => 'Агар ин саҳифаро эҳё кунед, ҳамаи нусхаҳои он дар таърихча эҳё хоҳанд шуд. Агар саҳифаи ҷадиде бо номи яксон аз замони ҳазф эҷод шуда бошад, нусхаҳои эҳёшуда дар таърихчаи қабули хоҳанд омад. Ва нусхаи фаъоли саҳифаи зинда ба таври худкорӣ ҷойгузин нахоҳад шуд.',
'undeleterevdel'               => 'Эҳёи саҳифаҳо дар ҳолате, ки боиси ҳазф шудан қисме охирин нусхаи саҳифа шавад, амалӣ нахоҳад шуд.
Дар ин ҳолатҳо, шумо бояд чанд нусхаи охирин саҳифаро низ эҳё кунед.',
'undeletehistorynoadmin'       => 'Ин мақола ҳазв карда шудааст. Сабаби ҳазв дар эзоҳ дар зер бо дигар маълумотҳои корбар ки ин саҳифаро ҳазф кард оварда шудааст. Матни аслии ин вироишоти ҳазфшуда фақат ба мудирон-администраторон дастрас аст.',
'undelete-revision'            => 'Ҳазфи нусхаи $1 (аз $2) аз тарафи $3:',
'undeleterevision-missing'     => 'Нусхаи номӯътабар ё гум аст. Мумкин аст пайвандатон нодуруст бошад, ё инки аз бойгонӣ ҳазф ё бозёбӣ шудааст.',
'undelete-nodiff'              => 'Нусхаи кӯҳнатаре ёфт нашуд.',
'undeletebtn'                  => 'Барқарор кардан',
'undeletelink'                 => 'барқарор кардан',
'undeletereset'                => 'Аз нав',
'undeletecomment'              => 'Тавзеҳ:',
'undeletedarticle'             => 'эҳё "[[$1]]" {{PLURAL:$1|шуд|шуданд}}',
'undeletedrevisions'           => '$1 нусха бақарор {{PLURAL:$1|шуд|шуданд}}',
'undeletedrevisions-files'     => '$1 нусха ва $2 парванда барқарор {{PLURAL:$1|шуд|шуданд}}',
'undeletedfiles'               => '$1 парванда барқарор {{PLURAL:$1|шуд|шуданд}}',
'cannotundelete'               => 'Барқароркунӣ нашуд; мумкин аст касе дигаре пештар ин саҳифаро барқарор карда бошад.',
'undeletedpage'                => "<big>'''$1 барқарор шуд'''</big>

Барои дидани гузориши ҳазфҳо ва барқароркуниҳои охирин ба [[Special:Log/delete|гузориши ҳазф]] нигаред.",
'undelete-header'              => 'Барои дидани саҳифаҳои ҳазфшудаи охир [[Special:Log/delete|гузоришҳои ҳазфро]] нигаред.',
'undelete-search-box'          => 'Ҷустуҷӯи саҳифаҳои ҳазфшуда',
'undelete-search-prefix'       => 'Намоиши саҳифаҳо бо шурӯъ аз:',
'undelete-search-submit'       => 'Ҷустуҷӯ',
'undelete-no-results'          => 'Ҳеҷ саҳифаи алоқаманде дар бойгони саҳифаҳои ҳазфшуда ёфт нашуд.',
'undelete-filename-mismatch'   => 'Имкони барқароркунии нусхаи $1 вуҷуд надорад: номи парванда мутобиқат намекунад',
'undelete-bad-store-key'       => 'Имкони барқароркунии нусхаи $1 вуҷуд надорад: парванда қабл аз ҳазф аз даст рафта буд.',
'undelete-cleanup-error'       => 'Хато дар ҳазфи таърихчаи истифода нашуда "$1".',
'undelete-missing-filearchive' => 'Имкони барқароркунии таърихчаи шумораи $1 вуҷуд надорад зеро иттилоот дар пойгоҳи дода вуҷуд надорад. Мумкин аст пеш барқарор шуда бошад.',
'undelete-error-short'         => 'Хато дар эҳёи парванда: $1',
'undelete-error-long'          => 'Дар вақти эҳёи парванда хатое рух дод:

$1',

# Namespace form on various pages
'namespace'      => 'Фазоином:',
'invert'         => 'Пинҳон кардани интихобкардашуда',
'blanknamespace' => '(Аслӣ)',

# Contributions
'contributions' => 'Ҳиссагузории корбар',
'mycontris'     => 'Хиссагузории ман',
'contribsub2'   => 'Барои $1 ($2)',
'nocontribs'    => 'Ҳеҷ тағйире бо ин мушаххасот пайдо нашуд.',
'uctop'         => '(боло)',
'month'         => 'Дар ин моҳ (ва қабл аз он):',
'year'          => 'Дар ин сол (ва қабл аз он):',

'sp-contributions-newbies'     => 'Фақат ҳиссагузориҳои ҳисобҳои ҷадидро нишон деҳ',
'sp-contributions-newbies-sub' => 'Барои навкорон',
'sp-contributions-blocklog'    => 'Гузориши басташуданҳо',
'sp-contributions-search'      => 'Ҷустуҷӯи ҳиссагузориҳо',
'sp-contributions-username'    => 'IP нишона ё номи корбар:',
'sp-contributions-submit'      => 'Ҷустуҷӯ',

# What links here
'whatlinkshere'           => 'Пайвандҳои дар ин сахифа',
'whatlinkshere-title'     => 'Саҳифаҳое ки ба $1 пайванд доранд',
'whatlinkshere-page'      => 'Саҳифа:',
'linklistsub'             => '(Феҳристи пайвандҳо)',
'linkshere'               => "Саҳифаҳои зерин ба '''[[:$1]]''' пайванданд:",
'nolinkshere'             => "Ягон саҳифа ба '''[[:$1]]''' пайванд нест.",
'nolinkshere-ns'          => "Ҳеҷ саҳифа аз фазоиноми интихобшуда ба '''[[:$1]]''' пайванд надорад.",
'isredirect'              => 'саҳифаи тағйири масир',
'istemplate'              => 'истифодашуда дар саҳифа',
'isimage'                 => 'пайванди акс',
'whatlinkshere-prev'      => '{{PLURAL:$1|қаблӣ|қаблӣ $1}}',
'whatlinkshere-next'      => '{{PLURAL:$1|баъдӣ|баъдӣ $1}}',
'whatlinkshere-links'     => '← пайвандҳо',
'whatlinkshere-hidelinks' => '$1 пайвандҳо',

# Block/unblock
'blockip'                     => 'Бастани корбар',
'blockip-legend'              => 'Бастани корбар',
'blockiptext'                 => 'Барои бастани дастрасии вироиши нишонаи IP ё номи корбарӣ мушаххас аз форми зерин истифода кунед.
Ин кор фақат бояд барои ҷилавгирӣ аз харобкори ва мувофиқи бо [[{{MediaWiki:Policy-url}}|сиёсати қатъи дастрасӣ]] анҷом шавад.
Далели мушаххас барои ин корро дар зер зикр кунед (барои мисол, зикри саҳифаҳое, ки харобкорӣ шудаанд).',
'ipaddress'                   => 'Нишонаи IP:',
'ipadressorusername'          => 'IP нишона ё номи корбар:',
'ipbexpiry'                   => 'Хотима:',
'ipbreason'                   => 'Сабаб:',
'ipbreasonotherlist'          => 'Дигар далел',
'ipbreason-dropdown'          => '*Сабабҳои умумии бастан
** Ворид кардани иттилооти нодуруст
** Пок кардани иттилооти муфид аз саҳифаҳо
** Истифода бурдани пайвандҳои спам ба сомонаҳои беруна
** Ворид кардани навиштаҳои беманънӣ ба саҳифаҳо
** Рафтори баъд/масхаракунии дигар корбарон
** Сӯиистифода аз чанд ҳисоби корбарӣ
** Номи корбарии номуносиб',
'ipbanononly'                 => 'Фақат бастани корбарони гумном',
'ipbcreateaccount'            => 'Ҷилавгирӣ аз эҷоди ҳисоб',
'ipbemailban'                 => 'Ҷилавгирии корбар аз фиристодани почтаи электронӣ',
'ipbenableautoblock'          => 'Нишонаи охире ки аз он ин корбар истифода мекунад, ба сурати худкор бубанд, ва дигар нишонаҳои IP-ҳои баъдина, ки аз онҳо метавонад вироиш кунанд',
'ipbsubmit'                   => 'Бастани ин корбар',
'ipbother'                    => 'Дигар вақт:',
'ipboptions'                  => '2 соат:2 hours,1 рӯз:1 day,3 рӯз:3 days,1 ҳафта:1 week,2 ҳафта:2 weeks,1 моҳ:1 month,3 моҳ:3 months,6 моҳ:6 months,1 сол:1 year,беохир:infinite', # display1:time1,display2:time2,...
'ipbotheroption'              => 'дигар',
'ipbotherreason'              => 'Далелҳои дигар/изофӣ:',
'ipbhidename'                 => 'Пинҳон кардани номи корбарӣ аз гузориши баста шудан, феҳристи фаъоли бастан ва феҳристи корбарон',
'badipaddress'                => 'IP нишонаи номӯътабар',
'blockipsuccesssub'           => 'Бастан муваффақ щуд',
'blockipsuccesstext'          => '[[Special:Contributions/$1|$1]] баста шудааст.<br />
Барои баррасӣ ба [[Special:IPBlockList|феҳристи нишонаҳои IP ва номҳои корбарии баста шуда]] нигаред.',
'ipb-edit-dropdown'           => 'Далели қатъи дастрасӣ',
'ipb-unblock-addr'            => 'Боз кардани $1',
'ipb-unblock'                 => 'Боз кардани номи корбарӣ ё нишонаи IP',
'ipb-blocklist-addr'          => 'Дидани бастаҳои мавҷуд барои $1',
'ipb-blocklist'               => 'Дидани бастаҳои мавҷуд',
'unblockip'                   => 'Боз кардани корбар',
'unblockiptext'               => 'Барои барқарор кардан дастрасии навиштан барои нишонаи IP ё номи корбарии қаблан баста шуда, аз форми зерин истифода кунед.',
'ipusubmit'                   => 'Боз кардани ин нишона',
'unblocked'                   => 'Дастрасии [[User:$1|$1]] боз карда шуд',
'unblocked-id'                => 'Қатъи дастрасии шумораи $1 хотима ёфт',
'ipblocklist'                 => 'Рӯйхати IP нишонаҳо ва корбарҳои баста шуда',
'ipblocklist-legend'          => 'Ҷустуҷӯи корбари баста шуда',
'ipblocklist-username'        => 'Номи корбарӣ ё нишонаи IP:',
'ipblocklist-submit'          => 'Ҷустуҷӯ',
'blocklistline'               => '$1, $2 ро баст $3 ($4)',
'infiniteblock'               => 'бе поён',
'expiringblock'               => '$1 ба поён мерасад',
'anononlyblock'               => 'фақат корбарони гумном',
'noautoblockblock'            => 'бастани худкор ғайрифаъол аст',
'createaccountblock'          => 'имкони эҷоди ҳисоб баста шудааст',
'emailblock'                  => 'почтаи электронӣ баста шудааст',
'ipblocklist-empty'           => 'Феҳристи басташуданҳо холӣ аст.',
'ipblocklist-no-results'      => 'Дастрасии ҳисоби корбарӣ ё нишонаи интернетии мавриди назар қатъ нест.',
'blocklink'                   => 'бастан',
'unblocklink'                 => 'боз шавад',
'contribslink'                => 'ҳиссагузорӣ',
'autoblocker'                 => 'Ба таври худкор нишонаи IP-и шумо баста шуда чун аз тарафи "[[User:$1|$1]]" истифод шуда буд, ки нишонааш бо шумо як аст. Далели бастан $1 чунини аст: "$2"',
'blocklogpage'                => 'Сабти басташавӣ',
'blocklogentry'               => 'баста шуд [[$1]] бо вақти саромадан $2 $3',
'blocklogtext'                => 'Ин гузориш аз амали бастан ва боз кардани корбарон аст.
Нишонаҳои IP-и бо таври худкор баста шуда, феҳрист нашудаанд.
Барои феҳристи маҳрумиятҳо ва баста шуданҳои амалиёти кунунӣ ба [[Special:IPBlockList|феҳристи IP-ҳои баста]] муроҷиат кунед.',
'unblocklogentry'             => '$1 боз шуд',
'block-log-flags-anononly'    => 'фақат корбарони гумном',
'block-log-flags-nocreate'    => 'қобилияти эҷоди ҳисоб ғайрифаъол шуд',
'block-log-flags-noautoblock' => 'қатъи дастрасии худкор ғайрифаъол шуд',
'block-log-flags-noemail'     => 'почтаи электронӣ баста шуд',
'range_block_disabled'        => 'Қобилияти мудирон барои эҷоди бастаҳо ғайрифаъол шудааст.',
'ipb_expiry_invalid'          => 'Вақти хотима номӯътабар.',
'ipb_already_blocked'         => '"$1" аллакай баста шудааст',
'ipb_cant_unblock'            => 'Хато: Нишонаи баста шудани $1 ёфт нашуд. Мумкин аст пештар боз шуда бошад.',
'ipb_blocked_as_range'        => 'Хато: Нишонаи IP-и $1 ба шакли мустақим баста нашудааст ва наметавонад боз шавад. Ин нишона ҳамроҳи $2, баста шуда қобили боз шудан аст.',
'ip_range_invalid'            => 'Сафи IP номӯътабар аст.',
'blockme'                     => 'Дастрасии манро қать кун',
'proxyblocker'                => 'Проксибанд',
'proxyblocker-disabled'       => 'Ин амал ғайрифаъол шудааст.',
'proxyblockreason'            => 'Аз сабаби пешкор боз (open proxy) буданаш, нишонаи IP-и шумо баста шудааст. Лутфан бо таъминкунандаи хизматҳои Интернетии худ ё пуштибони техникӣ тамос бигиред ва онҳоро бо ин мушкилии амниятии муҳим огоҳ кунед.',
'proxyblocksuccess'           => 'Анҷом шуд.',
'sorbsreason'                 => 'Нишонаи IP-и шумо ҳамчун як проксии кушода дар DNSBL феҳрист шудааст, ки аз тарафи {{SITENAME}} истифода мешавад.',
'sorbs_create_account_reason' => 'Нишонаи IP-и шумо ҳамчун проксии кушода дар DNSBL, ки аз тарафи {{SITENAME}} истифода мешавад, феҳрист шудааст. Шумо наметавонед ҳисоби корабариеро эҷод кунед',

# Developer tools
'lockdb'              => 'Қуфл кардани пойгоҳи дода',
'unlockdb'            => 'Аз қуфл боз кардани пойгоҳи дода',
'lockdbtext'          => 'Қуфл кардани пойгоҳи дода имкони вироиши саҳифаҳо, тағйири танзимот, вироиши пайгириҳо ва сайри тағйиротеро, ки ниёзманди тағйире дар пойгоҳи дода аст, аз ҳама корбарон мавқуф мекунад.
Лутфан таъйид кунед, ки дақиқатан ин корро мехоҳед, ва дар аввалин фурсат пойгоҳи додаро аз ҳолати қуфл шудан хориҷ хоҳед кард.',
'unlockdbtext'        => 'Аз қуфл боз кардани пойгоҳи дода ба тамоми корбарон иҷозат медиҳад, ки тавоноии вироиши саҳифаҳо, тағйири тарҷиҳоташон, вироиши феҳристи пайгириҳояшон, ва ҳар тағйири дигаре, ки ниёзманди тағйире дар пойгоҳи дода бударо дубора ба даст биоваранд.
Лутфан таъйид кунед, ки ҳамин корро мехоҳед анҷом диҳед.',
'lockconfirm'         => 'Бале, ман дар ҳақиқат мехоҳам пойгоҳи додаро қуфл кунам.',
'unlockconfirm'       => 'Бале, ман дар ҳақиқат мехоҳам пойгоҳи додаро аз қуфл кушоям.',
'lockbtn'             => 'Қуфл кардани пойгоҳи дода',
'unlockbtn'           => 'Аз қуфл боз кардани пойгоҳи дода',
'locknoconfirm'       => 'Шумо ба қуттии тасдиқ қайд нагузоштед.',
'lockdbsuccesssub'    => 'Қуфл кардани пойгоҳи дода бо муваффақият анҷом шуд',
'unlockdbsuccesssub'  => 'Қуфли пойгоҳи дода бардошта шуд',
'lockdbsuccesstext'   => 'Пойгоҳи дода қуфл шуд.<br />
Фаромӯш накунед, ки пас аз итмоми нигоҳдорӣ [[Special:UnlockDB|қуфлро бардоред]].',
'unlockdbsuccesstext' => 'Пойгоҳи дода аз қуфл боз шуд.',
'lockfilenotwritable' => 'Парвандаи қуфли дода навиштанӣ нест. Барои он ки битавонед, пойгоҳи додаро қуфл ё боз кунед, ин парванда бояд аз тарафи коргузор навиштанӣ бошад.',
'databasenotlocked'   => 'Пойгоҳи дода қуфл нест.',

# Move page
'move-page'               => 'Интиқол $1',
'move-page-legend'        => 'Кӯчонидани саҳифа',
'movepagetext'            => "Бо истифодаи аз формаи зерин номи саҳифа тағйир хоҳад шуд, ва тамоми таърихаш ба номи ҷадид кӯчонида хоҳад шуд.
Унвони пешина табдил ба як саҳифаи масир ба унвони ҷадид хоҳад шуд.
Пайвандҳо ба унвони пешинаи саҳифа тағйир нахоҳанд кард; ҳатман тағйири масирҳои дутоӣ ё шикастаро барраси кунед.
Шумо масъул итминон ҳастед ки ин пайвандҳо ҳанӯз ба ҳамон ҷое ки қарор аст бираванд.

Таваҷҷӯҳ кунед, ки агар саҳифае дар унвони ҷадид вуҷуд дошта бошад саҳифа кӯчонида '''нахоҳад шуд''', магар ин ки саҳифа холӣ ё тағйири масир бошад ва таърихи вироиши надошта бошад.
Ин яъне иштибоҳ агар иштибоҳ кардед метавонед саҳифаро ба ҳамон ҷое ки аз он кӯчонида шуда буд баргардонед, ва ин ки наметавонед рӯи саҳифаҳои мавҷудбуда бинависед.

'''ҲУШДОР!'''
Кӯчонидани саҳифаҳо ба номи ҷадид мумкин аст тағйири асосӣ ва ғайримунтазире барои саҳифаҳои машҳур бошад;
лутфан мутмаин шавед ки пеш аз кӯчонидани саҳифа, оқибати ин корро дарк мекунед.",
'movepagetalktext'        => "Саҳифаи баҳси марбута, агар вуҷуд дошта бошад, ба таври худкорӣ ҳамроҳ бо мақолаи аслӣ кӯчонида хоҳад шуд '''магар инки:'''

*як саҳифаи баҳси ғайрихолӣ таҳти ин номи ҷадид вуҷуд дошта бошад, ё
*ҷаъбаи зерро тик назада бошед.

Дар он ҳолатҳо, саҳифаро бояд ба таври дастӣ кӯчонид ва ё ду саҳифаро бо вироиш як кунед.",
'movearticle'             => 'Кӯчонидани саҳифа:',
'movenotallowed'          => 'Шумо иҷозати кӯчонидани саҳифаҳоро дар Википедиа надоред.',
'newtitle'                => 'Ба унвони ҷадид:',
'move-watch'              => 'Назар кардани ин саҳифа',
'movepagebtn'             => 'Кӯчонидани саҳифа',
'pagemovedsub'            => 'Кӯчониш бомуваффақият анҷом ёфт',
'movepage-moved'          => '<big>\'\'\'"$1" ба "$2" кӯчонида шуд\'\'\'</big>', # The two titles are passed in plain text as $3 and $4 to allow additional goodies in the message.
'articleexists'           => 'Саҳифае бо ин ном вуҷуд надорад, ё номе, ки интихоб кардаед мӯътабар нест.
Лутфан номи дигареро интихоб намоед.',
'cantmove-titleprotected' => 'Шумо наметавонед ин саҳифаро ба ин нишона кӯчонед, барои он, ки унвони ҷадид аз эҷод кардан муҳофизат шудааст',
'talkexists'              => "'''Саҳифа бо мувафаққият худаш кӯчонида шуд, вале саҳифаи баҳсро, ба ин далел ки саҳифаи баҳсе дар унвони ҷадид вуҷуд дорад, кӯчонида намешавад. Лутфан онҳоро дастӣ таркиб кунед.'''",
'movedto'                 => 'кӯчонидашуда ба',
'movetalk'                => 'Саҳифаи баҳси алоқаманд ҳам кӯчонида шавад',
'1movedto2'               => '[[$1]] ба [[$2]] кӯчонида шудааст',
'1movedto2_redir'         => '[[$1]] ба [[$2]], ки қабалан тағйири масит буд, кӯчонида шуд',
'movelogpage'             => 'Кӯчонидани гузориш',
'movelogpagetext'         => 'Дар зер феҳристи саҳифаҳои кӯчонидашуд омада аст.',
'movereason'              => 'Сабаби кӯчонидан:',
'revertmove'              => 'вогардонӣ',
'delete_and_move'         => 'Ҳазф ва кӯчонидан',
'delete_and_move_text'    => '==Ниёз ба ҳазф==

Мақолаи мақсад "[[:$1]]" вуҷуд дорад. Оё мехоҳед онро ҳазф кунед то интиқол мумкин шавад?',
'delete_and_move_confirm' => 'Бале, саҳифа ҳазф шавад',
'delete_and_move_reason'  => 'Ҳазф шуд барои мумкин шудани кӯчонидан',
'selfmove'                => 'Унвонҳои манбаъ ва мақсад якхела мебошад; кӯчонидани саҳифа ба худаш мумкин нест.',
'immobile_namespace'      => 'Унвони манбаъ ва мақсад як навъи махсус аст; имкони кӯчонидани саҳифаҳо аз ва ба ин фазои ном вуҷуд надорад.',

# Export
'export'            => 'Судури саҳифаҳо',
'exporttext'        => 'Шумо метавонед матн ва таърихи вироиши як саҳифаи мушаххас ё маҷмӯи аз саҳифаҳоро ба шакли пӯшида дар  XML содир кунед. Ин иттилоотро метавон дар викии дигаре, ки нармфазори МедиаВикиро истифода мекунад тариқи [[Special:Import|саҳифаи воридот]] ворид кард, ва ё барои саргармии шахсӣ нигоҳ дошт.

Барои содир кардани саҳифаҳо, унвонҳои онҳоро дар ҷабъи матнии зер дохил кунед, як унвон дар ҳар сатр, ва хоҳиши нусхаи кунунӣ ё нусхаҳои кӯҳнаи саҳифаро бо сатрҳои таърихи саҳифа, ё фақат нусхаи охирин бо  иттилоот дар бораи вироиши охирро интихоб кунед.

Дар ҳолати охир шумо метавонед пайвандеро истифода баред, намуна. [[{{ns:special}}:Export/{{MediaWiki:Mainpage}}]] ба саҳифаи "[[{{MediaWiki:Mainpage}}]]".',
'exportcuronly'     => 'Фақат нусхаи феълро дар бар бигир, на кулли таърихча',
'exportnohistory'   => "----
'''Таваҷҷӯҳ:''' Имкони судури таърихчаи комили саҳифаҳо аз тариқи ин саҳифа ба сабабҳои иҷроӣ аз кор андохта шудааст.",
'export-submit'     => 'Судур',
'export-addcattext' => 'Илова кардани саҳифаҳо аз гурӯҳ:',
'export-addcat'     => 'Илова кардан',
'export-download'   => 'Пешниҳоди захира кардан ба сурати парванда',
'export-templates'  => 'Дар бар гирифтани шаблонҳо',

# Namespace 8 related
'allmessages'               => 'Пайёмҳои системавӣ',
'allmessagesname'           => 'Ном',
'allmessagesdefault'        => 'Матни қарордодӣ',
'allmessagescurrent'        => 'Матни кунунӣ',
'allmessagestext'           => 'Ин рӯйхати паёмҳои системавӣ мебошад, ки дар фазои номҳои MediaWiki дастрас карда шудаанд.',
'allmessagesnotsupportedDB' => "Аз ин саҳифа наметавон истифода бурд, чун '''\$wgUseDatabaseMessages''' ғайрифаъол гардонида шудааст.",
'allmessagesfilter'         => 'Филтри номи пайём:',
'allmessagesmodified'       => 'Фақат тағйирдодаро нишон деҳ',

# Thumbnails
'thumbnail-more'           => 'Бузург шавад',
'filemissing'              => 'Парванда вуҷуд надорад',
'thumbnail_error'          => 'Хато дар эҷоди ангуштдона: $1',
'djvu_page_error'          => 'Саҳифаи DjVu хориҷ аз ҳудуди саф',
'djvu_no_xml'              => 'Барои истифодаи XML имкони пайдо кардани парвандаи DjVu вуҷуд надошт',
'thumbnail_invalid_params' => 'Параметрҳои номӯътабар дар ангуштдонаи акс',
'thumbnail_dest_directory' => 'Ишкол дар эҷоди пӯшаи мақсад',

# Special:Import
'import'                     => 'Ворид кардани саҳифаҳо',
'importinterwiki'            => 'Воридоти трансвики',
'import-interwiki-text'      => 'Як вики ва як номи саҳифаро интихоб кунед, то иттилоот аз он ворид шавад.
Таърихи нусхаҳо ва номҳои вироишкунандагон сабт хоҳанд монд.
Иттилооти марбут ба ворид кардани саҳифаҳо дар [[Special:Log/import|гузоришҳои воридот]] сабт хоҳад шуд.',
'import-interwiki-history'   => 'Тамоми таърихи нусхаҳои ин саҳифа интиқол дода шавад',
'import-interwiki-submit'    => 'Ворид шавад',
'import-interwiki-namespace' => 'Саҳифаҳо ба фазоином интиқол дода шаванд:',
'importtext'                 => 'Лутфан парвандаро аз вики манбаъ содир кунед, аз тариқи саҳифа Special:Export ва пас аз захира кардан он ба ҳофизаи худатон онро ба дар ин вики боргузорӣ кунед.',
'importstart'                => 'Дар ҳоли ворид кардани саҳифаҳо...',
'import-revision-count'      => '$1 {{PLURAL:$1|вироиш|вироиш}}',
'importnopages'              => 'Саҳифаҳо барои ворид кардан нест.',
'importfailed'               => 'Ворид кардани саҳифаҳо шикаст хӯрд: $1',
'importunknownsource'        => 'Навъи манбаи номаълум барои воридкуни',
'importcantopen'             => 'Парвандаи вуруди саҳифаҳо боз нашуд',
'importbadinterwiki'         => 'Пайванди байнивики нодуруст',
'importnotext'               => 'Саҳифа холӣ ё бе матн',
'importsuccess'              => 'Ворид кардан бо муваффақият анҷом ёфт!',
'importhistoryconflict'      => 'Нусхаҳои носозгор аз таърихчаи ин саҳифа вуҷуд дорад (эҳтимолан қаблан ин саҳифа ворид шудааст)',
'importnosources'            => 'Ҳеҷ манбаъе барои ворид кардани иттилоот аз викии дигар таъриф нашудааст ва боргузории бевоситаи таърих ғайрифаъол аст.',
'importnofile'               => 'Ҳеҷ парвандаи вуруди боргузорӣ нашудааст.',
'importuploaderrorsize'      => 'Дар боргузории парвандаи вуруд, ишколе рух дод. Андозаи парванда калонтар аз андозаи иҷозатшуда ба борзуорӣ аст.',
'importuploaderrorpartial'   => 'Дар боргузории парвандаи вуруд, ишколе рух дод. Парванда фақат қисман боргузори шудааст.',
'importuploaderrortemp'      => 'Дар боргузории парвандаи вуруд, ишколе рух дод. Пӯшаи муваққатӣ пайдо нашуд.',
'import-parse-failure'       => 'Хато дар таҳлили XML боргузоришуда',
'import-noarticle'           => 'Саҳифае барои боргузорӣ вуҷуд надорад!',
'import-nonewrevisions'      => 'Тамоми саҳифаҳо қаблан боргузорӣ шудаанд.',
'xml-error-string'           => '$1 дар сатри $2, сутуни $3 ($4 байт): $5',

# Import log
'importlogpage'                    => 'Вориди гузоришҳо',
'importlogpagetext'                => 'Ворид кардани саҳифаҳо бо ҳамроҳи таърихчаи вироиши онҳо аз викиҳои дигар.',
'import-logentry-upload'           => '[[$1]] аз тариқи боргузории парванда, ворид шуд',
'import-logentry-upload-detail'    => '$1 {{PLURAL:$1|нусха|нусха}}',
'import-logentry-interwiki'        => '$1 трансвикишуда',
'import-logentry-interwiki-detail' => '$1 {{PLURAL:$1|нусха|нусха}} аз $2',

# Tooltip help for the actions
'tooltip-pt-userpage'             => 'Саҳифаи корбарии ман',
'tooltip-pt-anonuserpage'         => 'Саҳифаи корбари IP, ки бо он шумо вироиш мекунед',
'tooltip-pt-mytalk'               => 'Саҳифаи баҳси ман',
'tooltip-pt-anontalk'             => 'Баҳси пиромуни вироишҳо аз ин нишонаи IP',
'tooltip-pt-preferences'          => 'Тарҷиҳоти ман',
'tooltip-pt-watchlist'            => 'Рӯйхати саҳифаҳое, ки тағйиротҳояшонро Шумо назорат мекунед',
'tooltip-pt-mycontris'            => 'Рӯихати ҳиссагузориҳои ман',
'tooltip-pt-login'                => 'Тавсия мешавад ки ба систем ворид шавад, лекин иҷборӣ нест.',
'tooltip-pt-anonlogin'            => 'Ба шумо тавзеҳ мешавад, ки ба систем ворид шавед, лекин ин иҷборӣ нест.',
'tooltip-pt-logout'               => 'Хуруҷ аз систем',
'tooltip-ca-talk'                 => 'Баҳси матни таркибии ин саҳифа',
'tooltip-ca-edit'                 => 'Шумо ин саҳифаро вироиш карда метавонед. Пеш аз захира кардани саҳифа пешнамоишро истифода баред.',
'tooltip-ca-addsection'           => 'Илова кардани эзоҳот ба ин баҳс',
'tooltip-ca-viewsource'           => 'Ин саҳифа ҳифз карда шудааст. Шумо танҳо таркиби онро дида метавонед.',
'tooltip-ca-history'              => 'Нусхаи охирини ин саҳифа.',
'tooltip-ca-protect'              => 'Ҳифз намудани ин саҳифа',
'tooltip-ca-delete'               => 'Ин саҳифаро ҳазф кунед',
'tooltip-ca-undelete'             => 'Бозгардонидани нусхаҳои саҳифаҳои ҳазфшуда',
'tooltip-ca-move'                 => 'Кӯчонидани ин саҳифа',
'tooltip-ca-watch'                => 'Ин саҳифаро метавонед ба феҳристи назароти худ дохил кунед',
'tooltip-ca-unwatch'              => 'Гирифта партофтани ин саҳифа аз феҳристи назароти Шумо',
'tooltip-search'                  => 'Ҷустуҷӯи {{SITENAME}}',
'tooltip-search-go'               => 'Гузаштан ба саҳифае, ки айнан чунин ном дорад, агар вуҷуд дошта бошад',
'tooltip-search-fulltext'         => 'Ҷустуҷӯи саҳифаҳое, ки чунин матн доранд',
'tooltip-p-logo'                  => 'Саҳифаи Аслӣ',
'tooltip-n-mainpage'              => 'Гузаштан ба Саҳифаи Аслӣ',
'tooltip-n-portal'                => 'Дар бораи лоиҳа ва чи корҳоро метавонед кард',
'tooltip-n-currentevents'         => 'Ёфтани иттилооти пешзамина перомуни воқеаҳои кунунӣ',
'tooltip-n-recentchanges'         => 'Рӯйхати тағйиротҳо дар Википедиа',
'tooltip-n-randompage'            => 'Овардани як саҳифаи тасодуфӣ',
'tooltip-n-help'                  => 'Гузаштан ба Роҳнамо.',
'tooltip-t-whatlinkshere'         => 'Рӯйхати ҳамаи саҳифаҳое, ки ба ин саҳифа пайванд доранд',
'tooltip-t-recentchangeslinked'   => 'Тағйироти охир ин саҳифаҳое, ки ин саҳифа ба онҳо пайванд дорад',
'tooltip-feed-rss'                => 'Хабарномаи RSS барои ин саҳифа',
'tooltip-feed-atom'               => 'Хабарномаи Atom барои ин саҳифа',
'tooltip-t-contributions'         => 'Мушоҳидаи феҳристи ҳиссагузориҳои ин корбар',
'tooltip-t-emailuser'             => 'Фиристодани почтаи электронӣ ба ин корбар',
'tooltip-t-upload'                => 'Фиристодани парвандаҳо',
'tooltip-t-specialpages'          => 'Рӯихати ҳамаи саҳифаҳои вижа',
'tooltip-t-print'                 => 'Нусхаи чопии ин саҳифа',
'tooltip-t-permalink'             => 'Пайванди доимӣ ба ин нусха аз ин саҳифа',
'tooltip-ca-nstab-main'           => 'Дидани саҳифаи мӯҳтавиёт',
'tooltip-ca-nstab-user'           => 'Намоиши саҳифаи корбар',
'tooltip-ca-nstab-media'          => 'Дидани саҳифаи расона',
'tooltip-ca-nstab-special'        => 'Ин саҳифаи махсус мебошад, Шумо онро вироиш карда наметавонед',
'tooltip-ca-nstab-project'        => 'Намоиши саҳифаи лоиҳа',
'tooltip-ca-nstab-image'          => 'Дидани саҳифаи парванда',
'tooltip-ca-nstab-mediawiki'      => 'Дидани пайғоми системавӣ',
'tooltip-ca-nstab-template'       => 'Намоиши шаблон',
'tooltip-ca-nstab-help'           => 'Намоиши саҳифаи роҳнамо',
'tooltip-ca-nstab-category'       => 'Намоиши саҳифаи гурӯҳ',
'tooltip-minoredit'               => 'Инро ҳамчун вироиши хурд қайд намудан',
'tooltip-save'                    => 'Захира намудани тағйиротҳои худ',
'tooltip-preview'                 => 'Тағйироти худро пешнамоиш кунед, лутфан ин амалро пеш аз захира кардан истифода кунед!',
'tooltip-diff'                    => 'Намоиши тағйиротҳое, ки Шумо бо матн кардаед',
'tooltip-compareselectedversions' => 'Намоиши фарқияти байни ду нусхаи интихобкардашудаи ин саҳифа.',
'tooltip-watch'                   => 'Ин саҳифаро ба рӯихатӣ назароти худ илова кунед',
'tooltip-recreate'                => 'Эҷоди дубораи саҳифаи сарфи назар аз ҳазф шудани қаблии он',
'tooltip-upload'                  => 'Шурӯъ ба боргузорӣ',

# Metadata
'nodublincore'      => 'Метадода Dublin Core RDF барои ин коргузор ғайри фаъол шудааст.',
'nocreativecommons' => 'Метадодаи Creative Commons RDF барои ин коргузор ғайри фаъол шудааст.',
'notacceptable'     => 'Коргузори ин вики аз ирсоли дода ба шакле ки барномаи шумо битавонад намоиш диҳад, пешкаш карда наметавонад.',

# Attribution
'anonymous'        => 'Корбари (они) гумномӣ {{SITENAME}}',
'siteuser'         => 'Википедиа user $1',
'lastmodifiedatby' => 'Ин саҳифа охирин маротиба дар $2, $1 аз тарафи $3 тағйир дода шудааст.', # $1 date, $2 time, $3 user
'othercontribs'    => 'Дар асоси коре аз тарафи $1.',
'others'           => 'дигарон',
'siteusers'        => 'Википедиа user(s) $1',
'creditspage'      => 'Эътибороти ин саҳифа',
'nocredits'        => 'Иттилооти созандагони ин саҳифа мавҷуд нест.',

# Spam protection
'spamprotectiontitle' => 'Филтри муҳофизат аз спам',
'spamprotectiontext'  => 'Саҳифае ки шумо мехоҳед захира кунед аз тарафи филтири спам баста шуд. Эҳтимолан ин аз сабаби дар бар гирифтани пайванди беруна ба сомонаи хориҷӣ бошад.',
'spamprotectionmatch' => 'Матни зер чизе аст, ки филтри (спам) ҳарзанигории моро ба кор андохт: $1',
'spambot_username'    => 'Спамтозакуни МедиаВики',
'spam_reverting'      => 'Вогардони ба охирин нусхае, ки пайванде ба $1 надорад',
'spam_blanking'       => 'Ҳамаи нусхаҳои пайвандҳо $1 доштан, дар ҳоли холӣ кардан',

# Info page
'infosubtitle'   => 'Иттилоот дар мавриди саҳифа',
'numedits'       => 'Теъдоди вироишҳо (саҳифа): $1',
'numtalkedits'   => 'Теъдоди вироишҳо (саҳифаи баҳс): $1',
'numwatchers'    => 'Шумораи пайгирикунандагон: $1',
'numauthors'     => 'Теъдоди муаллифони мухталиф (мақола): $1',
'numtalkauthors' => 'Теъдоди муаллифони мухталиф (саҳифаи баҳс): $1',

# Math options
'mw_math_png'    => 'Ҳамеша PNG кашида шавад',
'mw_math_simple' => 'Агар хеле содда HTML вагарна PNG',
'mw_math_html'   => 'Аз рӯи имкон HTML вагарна PNG',
'mw_math_source' => 'Ҳамчун TeX боқӣ бимон (барои мурургарҳои матнӣ)',
'mw_math_modern' => 'Тавсеҳ шуда барои мурургарҳои замонавӣ',
'mw_math_mathml' => 'Истифода аз MathML дар сурати имкон (озмоишӣ)',

# Patrolling
'markaspatrolleddiff'                 => 'Ба унвони баррасишуда аломат бизан',
'markaspatrolledtext'                 => 'Ин мақоларо ба унвони баррасишуда аломат бизан',
'markedaspatrolled'                   => 'Ба унвони баррасишуда аломат зада шуд',
'markedaspatrolledtext'               => 'Нусхаи интихобшуда ба унвони баррасишуда аломат зада шуд.',
'rcpatroldisabled'                    => 'Баррасии Тағйироти Охир фаъол нест',
'rcpatroldisabledtext'                => 'Имкони Баррасии Тағйироти Охир дар ҳоли ҳозир ғайрифаъол аст.',
'markedaspatrollederror'              => 'Аломати баррасӣ зада нашуд',
'markedaspatrollederrortext'          => 'Бояд як нусхаро мушаххас кунед то барчасб ба унвони баррасишуда аломат бихӯрад.',
'markedaspatrollederror-noautopatrol' => 'Шумо наметавонед ба тағйироти анҷом шуда тавассути худатон аломати баррасӣ бизанед.',

# Patrol log
'patrol-log-page' => 'Гузоришҳои нигаҳбонӣ',
'patrol-log-line' => '$1 аз $2-ро ба сурати посбонишуда аломат зад $3',
'patrol-log-auto' => '(худкор)',

# Image deletion
'deletedrevision'                 => 'Нусхаи ҳазфшудаи кӯҳнаи $1',
'filedeleteerror-short'           => 'Хато дар ҳазфи парванда: $1',
'filedeleteerror-long'            => 'Дар замони ҳазфи парванда хатое рух дод:

$1',
'filedelete-missing'              => 'Парвандаи "$1" қобили ҳазф нест, чун парвандае бо ин ном вуҷуд надорад.',
'filedelete-old-unregistered'     => 'Нусхаи парвандаи "$1" дар по1is noйгоҳи дода вуҷуд надорад.',
'filedelete-current-unregistered' => 'Парвандае бо номи "$1" дар пойгоҳи дода мавҷуд нест.',
'filedelete-archive-read-only'    => 'Имкони навиштан дар пӯшаи "$1" вуҷуд надорад.',

# Browsing diffs
'previousdiff' => '← Фарқияти аввалина',
'nextdiff'     => 'Фарқияти баъдина →',

# Media information
'mediawarning'         => "'''Ҳушдор''': Ин парванда мумкин аст кодҳои бадқасдро дар бар гирад, ки бо иҷрои он системаи шумо осеб бубинад.<hr />",
'imagemaxsize'         => 'Маҳуд кардани аксҳо дар саҳифаҳои тавсифоти парванда ба:',
'thumbsize'            => 'Андозаи ангуштдона (thumbnail):',
'widthheightpage'      => '$1×$2, $3 саҳифаҳо',
'file-info'            => '(андозаи парванда: $1, навъи MIME: $2)',
'file-info-size'       => '($1 × $2 пиксел, ҳаҷми парванда: $3, навъи MIME: $4)',
'file-nohires'         => '<small>Нусхаи ҳаҷман ва сифатан баландтар дастрас нест.</small>',
'svg-long-desc'        => '(SVG парванда, исмӣ $1 × $2 пиксел, андозаи парванда: $3)',
'show-big-image'       => 'Акси пурра',
'show-big-image-thumb' => '<small>Андозаи ин пешнамоиш: $1 × $2 пиксел</small>',

# Special:NewImages
'newimages'             => 'Намоишгоҳи парвандаҳои ҷадид',
'imagelisttext'         => "Дар зер феҳристи '''$1''' {{PLURAL:$1|парвандаи|парвандаҳои}} ба тартиб оварда шуда, омадааст $2.",
'newimages-summary'     => 'Ин саҳифаи вижа охирин парвандаҳои боршударо намоиш медиҳад.',
'showhidebots'          => '($1 ботҳо)',
'noimages'              => 'Чизе барои дидан нест.',
'ilsubmit'              => 'Ҷустуҷӯи',
'bydate'                => 'аз рӯи сана',
'sp-newimages-showfrom' => 'Нишон додани аксҳои нав шурӯъ аз $2, $1',

# Bad image list
'bad_image_list' => 'Иттилоотро бояд бо ин шакл ворид кунед:

Фақат сатрҳое, ки бо * шурӯъ шаванд ба назар гирифта мешаванд. Аввалин пайванд дар ҳар сатр, бояд пайванде ба як тасвир ва ё акси бад бошад. Пайвандҳои баъдӣ дар ҳамон сатр, ба унвони мавриди истисно ба назар гирифта мешавад.',

# Variants for Tajiki language
'variantname-tg-latn' => 'lotinī',
'variantname-tg'      => 'кирилликӣ',

# Metadata
'metadata'          => 'Метадода',
'metadata-help'     => 'Ин парванда иттилооти иловагиро дар бар мегирад, эҳтимол аз аксбардораки рақамӣ ё сканер дар вақти сохтан ва рақамӣ кардан, илова шудааст. Агар парванда аз вазъияти ибтидоиаш тағйир дода бошад, мумкин аст, шарҳу тафсилоти мавҷуди иттилооти аксро тамоман бозтоб надиҳад.',
'metadata-expand'   => 'Намоиши ҷузъиёти тафсилӣ',
'metadata-collapse' => 'Пинҳон кардани ҷузъиёти тафсилӣ',
'metadata-fields'   => 'EXIF фосилаҳои додаҳо, ки дар ин паём оварда шудаанд дар ҷадвали акс ҷамъ шуда бошанд ҳам, намоиш дода хоҳанд шуд. Бақия онҳо танҳо дар вақти боз кардани ҷадвал нишон дода хоҳанд шуд.
* make
* model
* datetimeoriginal
* exposuretime
* fnumber
* focallength', # Do not translate list items

# EXIF tags
'exif-imagewidth'                  => 'Васеъӣ',
'exif-imagelength'                 => 'Баландӣ',
'exif-bitspersample'               => 'Нуқта дар ҳар ҷузъ',
'exif-compression'                 => 'Тарҳи фишурдасозӣ',
'exif-photometricinterpretation'   => 'Таркиби нуқот',
'exif-orientation'                 => 'Ҷиҳатёбӣ',
'exif-samplesperpixel'             => 'Теъдоди қисмҳо',
'exif-planarconfiguration'         => 'Тартиби додаҳо',
'exif-ycbcrsubsampling'            => 'Нисбати зернамунаи Y ба C',
'exif-ycbcrpositioning'            => 'Мавқеияти Y ва C',
'exif-xresolution'                 => 'Таҳлилпазирии уфуқӣ',
'exif-yresolution'                 => 'Таҳлилпазирии амудӣ',
'exif-resolutionunit'              => 'Воҳиди тафкикпазирии X ва Y',
'exif-stripoffsets'                => 'Ҷойгоҳи додаҳои акс',
'exif-rowsperstrip'                => 'Теъдоди радифҳо дар ҳар навор',
'exif-stripbytecounts'             => 'Байт дар ҳар навори фишурда',
'exif-jpeginterchangeformat'       => 'Ҷабъаи ҷойи нисбат ба JPEG SOI',
'exif-jpeginterchangeformatlength' => 'Байт додаи JPEG',
'exif-transferfunction'            => 'Тобеияти табдил',
'exif-whitepoint'                  => 'Рангинагии нуқтаи сафед',
'exif-primarychromaticities'       => 'Рангпазирии аввалиятҳо',
'exif-ycbcrcoefficients'           => 'Зарбкунандаҳои матриси табдили фазои ранг',
'exif-referenceblackwhite'         => 'Ҷуфти қиммати муроҷиаи сиёҳ ва сафед',
'exif-datetime'                    => 'Таърих ва вақти тағйири парванда',
'exif-imagedescription'            => 'Унвони акс',
'exif-make'                        => 'Ширкати созандаи аксбардорак',
'exif-model'                       => 'Модели аксбардорак',
'exif-software'                    => 'Нармафзори истифодашуда',
'exif-artist'                      => 'Муаллиф',
'exif-copyright'                   => 'Дорандаи ҳаққи таксир',
'exif-exifversion'                 => 'Нусхаи exif',
'exif-flashpixversion'             => 'Нусхаи пуштибонишудаи Flashpix',
'exif-colorspace'                  => 'Фазои ранг',
'exif-componentsconfiguration'     => 'Маънии ҳар як аз қисмҳо',
'exif-compressedbitsperpixel'      => 'Ҳолати фишурдасозии акс',
'exif-pixelydimension'             => 'Арзи акси мӯътабар',
'exif-pixelxdimension'             => 'Тӯли акси мӯътабар',
'exif-makernote'                   => 'Тавзеҳоти ширкати созанда',
'exif-usercomment'                 => 'Тавзеҳоти корбар',
'exif-relatedsoundfile'            => 'Парвандаи сабти алоқаманд',
'exif-datetimeoriginal'            => 'Таърих ва вақти тавлиди додаҳо',
'exif-datetimedigitized'           => 'Таърих ва замони рақамӣ(диҷиталӣ) шудан',
'exif-subsectime'                  => 'Касри сонияи таърих ва замон',
'exif-subsectimeoriginal'          => 'Касри сонияи замони аслӣ',
'exif-subsectimedigitized'         => 'Касри сонияи замони рақамӣ(диҷиталӣ) шуда',
'exif-exposuretime'                => 'Замони нурдиҳӣ',
'exif-exposuretime-format'         => '$1 сония ($2)',
'exif-fnumber'                     => 'F Рақам',
'exif-exposureprogram'             => 'Барномаи Нурдиҳӣ',
'exif-spectralsensitivity'         => 'Ҳасосияти тифӣ',
'exif-isospeedratings'             => 'Дараҷабандии суръати ISO',
'exif-oecf'                        => 'Амали табдили нурӣ-электронӣ',
'exif-shutterspeedvalue'           => 'Суръати парда',
'exif-aperturevalue'               => 'Андозаи диафрагм',
'exif-brightnessvalue'             => 'Равшанӣ',
'exif-exposurebiasvalue'           => 'Хатои нурдиҳӣ',
'exif-maxaperturevalue'            => 'Ҳадди аксар кушодагии замин',
'exif-subjectdistance'             => 'Фосилаи ҷисм',
'exif-meteringmode'                => 'Ҳолати санҷиши фосила',
'exif-lightsource'                 => 'Манбаи нур',
'exif-flash'                       => 'Флеш',
'exif-focallength'                 => 'Фосилаи марказии адасӣ',
'exif-subjectarea'                 => 'Масоҳати ҷисм',
'exif-flashenergy'                 => 'Қудрати флеш',
'exif-spatialfrequencyresponse'    => 'Посухи фосилаи фазогӣ',
'exif-focalplanexresolution'       => 'Сафҳаи марказии X тафкикпазирӣ',
'exif-focalplaneyresolution'       => 'Сафҳаи марказии Y тафкикпазирӣ',
'exif-focalplaneresolutionunit'    => 'Воҳиди тафкикпазирии сафҳаи марказӣ',
'exif-subjectlocation'             => 'Макони ҷисм',
'exif-exposureindex'               => 'Шохиси нурдиҳӣ',
'exif-sensingmethod'               => 'Равиши ҳисгарӣ',
'exif-filesource'                  => 'Манбаи парванда',
'exif-scenetype'                   => 'Навъи саҳна',
'exif-cfapattern'                  => 'Қолаби CFA',
'exif-customrendered'              => 'Пардозиши акс',
'exif-exposuremode'                => 'Ҳолати нурдиҳӣ',
'exif-whitebalance'                => 'Мувозинаи ранги сафед',
'exif-digitalzoomratio'            => 'Нисбати тағйирдиҳии рақамии миқёси акс (digital zoom)',
'exif-focallengthin35mmfilm'       => 'Фосилаи марказӣ барои филми 35 мм',
'exif-scenecapturetype'            => 'Навъи сабти саҳна',
'exif-gaincontrol'                 => 'Танзими саҳна',
'exif-contrast'                    => 'Контраст',
'exif-saturation'                  => 'Серобшавӣ',
'exif-sharpness'                   => 'Рӯшанӣ',
'exif-devicesettingdescription'    => 'Шарҳи танзимоти дастгоҳ',
'exif-subjectdistancerange'        => 'Ҳудуди фосилаи ҷисм',
'exif-imageuniqueid'               => 'Шиносаи ягонаи акс',
'exif-gpsversionid'                => 'Нусхаи барчасби ҶПС',
'exif-gpslatituderef'              => 'Арзи ҷуғрофии шимолӣ ё ҷанубӣ',
'exif-gpslatitude'                 => 'Арзи ҷуғрофӣ',
'exif-gpslongituderef'             => 'Тӯли ҷуғрофии шарқӣ ё ғарбӣ',
'exif-gpslongitude'                => 'Тӯли ҷуғрофӣ',
'exif-gpsaltituderef'              => 'Нуқтаи муроҷиаи фароз',
'exif-gpsaltitude'                 => 'Фароз',
'exif-gpstimestamp'                => 'Вақти ҶПС (соати атомӣ)',
'exif-gpssatellites'               => 'Моҳвораҳои истифодашуда барои андозагирӣ',
'exif-gpsstatus'                   => 'Вазъияти гиранда',
'exif-gpsmeasuremode'              => 'Ҳолати андозагирӣ',
'exif-gpsdop'                      => 'Диққати андозагирӣ',
'exif-gpsspeedref'                 => 'Воҳиди суръат',
'exif-gpsspeed'                    => 'Суръати гирандаи ҶПС',
'exif-gpstrackref'                 => 'Муроҷиа барои самти ҳаракат',
'exif-gpstrack'                    => 'Самти ҳаракат',
'exif-gpsimgdirectionref'          => 'Муроҷиа барои самти акс',
'exif-gpsimgdirection'             => 'Самти акс',
'exif-gpsmapdatum'                 => 'Иттилооти нақшабардории Geodetic истифода шудааст',
'exif-gpsdestlatituderef'          => 'Муроҷиа барои арзи ҷуғрофии мақсад',
'exif-gpsdestlatitude'             => 'Арзи ҷуғрофии мақсад',
'exif-gpsdestlongituderef'         => 'Муроҷиа барои тӯли ҷуғрофии мақсад',
'exif-gpsdestlongitude'            => 'Тӯли ҷуғрофии мақсад',
'exif-gpsdestbearingref'           => 'Муроҷиа барои самти мақсад',
'exif-gpsdestbearing'              => 'Самти мақсад',
'exif-gpsdestdistanceref'          => 'Муроҷиа барои фосила то мақсад',
'exif-gpsdestdistance'             => 'Фосила то мақсад',
'exif-gpsprocessingmethod'         => 'Номи равиш пардозиши ҶПС',
'exif-gpsareainformation'          => 'Номи масоҳати ҶПС',
'exif-gpsdatestamp'                => 'Таърихи ҶПС',
'exif-gpsdifferential'             => 'Тасҳеҳи ҷузъии ҶПС',

# EXIF attributes
'exif-compression-1' => 'Ғайрифишурда',

'exif-unknowndate' => 'Таърихи номаълум',

'exif-orientation-1' => 'Оддӣ', # 0th row: top; 0th column: left
'exif-orientation-2' => 'Уфуқӣ пуштурӯ шуда', # 0th row: top; 0th column: right
'exif-orientation-3' => '180° дараҷа чархида', # 0th row: bottom; 0th column: right
'exif-orientation-4' => 'Амудӣ пуштурӯ шуда', # 0th row: bottom; 0th column: left
'exif-orientation-5' => '90° бо ақрабаки соат чархида ва амудӣ пуштурӯ шуда', # 0th row: left; 0th column: top
'exif-orientation-6' => '90° ақрабаки соат чархида', # 0th row: right; 0th column: top
'exif-orientation-7' => '90° ақрабаки соат чархида ва амудӣ пуштурӯ шуда', # 0th row: right; 0th column: bottom
'exif-orientation-8' => '90° бо ақрабаки соат чархида', # 0th row: left; 0th column: bottom

'exif-planarconfiguration-1' => 'Қолаби фарбеҳ',
'exif-planarconfiguration-2' => 'қолаби сатҳӣ',

'exif-componentsconfiguration-0' => 'вуҷуд надорад',

'exif-exposureprogram-0' => 'Таърифнашуда',
'exif-exposureprogram-1' => 'Дастӣ',
'exif-exposureprogram-2' => 'Барномаи оддӣ',
'exif-exposureprogram-3' => 'Аввалияти диафрагм',
'exif-exposureprogram-4' => 'Аввалияти шаттер (Shutter priority)',
'exif-exposureprogram-5' => 'Барномаи эҷодӣ (бо гироиш ба самти қаър медон)',
'exif-exposureprogram-6' => 'Барномаи пурҷунбиш (бо гироиш ба самти суръати тези парда)',
'exif-exposureprogram-7' => 'Ҳолати портрет (барои аксҳои наздик бо пасзаминаи хориҷ аз фосилаи марказ аст)',
'exif-exposureprogram-8' => 'Ҳолати манзара (барои аксҳои манзара бо пасзамина дар фосилаи марказ)',

'exif-subjectdistance-value' => '$1 метр',

'exif-meteringmode-0'   => 'Номаълум',
'exif-meteringmode-1'   => 'Миёна',
'exif-meteringmode-2'   => 'МарказВазниМиёна',
'exif-meteringmode-3'   => 'Нуқта',
'exif-meteringmode-4'   => 'БисёрНуқта',
'exif-meteringmode-5'   => 'Тарҳдор',
'exif-meteringmode-6'   => 'Ҷузъӣ',
'exif-meteringmode-255' => 'Ғайра',

'exif-lightsource-0'   => 'Номаълум',
'exif-lightsource-1'   => 'Рӯшноии рӯз',
'exif-lightsource-2'   => 'Флуоресент',
'exif-lightsource-3'   => 'Тунгстен (нур бидуни гармо)',
'exif-lightsource-4'   => 'Флаш',
'exif-lightsource-9'   => 'Ҳавои хуб',
'exif-lightsource-10'  => 'Осмони абрӣ',
'exif-lightsource-11'  => 'Соя',
'exif-lightsource-12'  => 'Маҳтобӣ дар рӯз (D 5700 – 7100K)',
'exif-lightsource-13'  => 'Маҳтоби сафед дар рӯз (N 4600 – 5400K)',
'exif-lightsource-14'  => 'Маҳтоби сафедӣ хунук (W 3900 – 4500K)',
'exif-lightsource-15'  => 'Маҳтоби сафед (WW 3200 – 3700K)',
'exif-lightsource-17'  => 'Нури стандартӣ A',
'exif-lightsource-18'  => 'Нури стандартӣ B',
'exif-lightsource-19'  => 'Нури стандартӣ C',
'exif-lightsource-24'  => 'ISO лампи тунстени корхона',
'exif-lightsource-255' => 'Дигар манбаъи нур',

'exif-focalplaneresolutionunit-2' => 'инч',

'exif-sensingmethod-1' => 'Таърифнашуда',
'exif-sensingmethod-2' => 'Ҳисгари ноҳияи ранги як тарошае',
'exif-sensingmethod-3' => 'Ҳисгари ноҳияи ранги ду тарошае',
'exif-sensingmethod-4' => 'Ҳисгари ноҳияи ранги се тарошае',
'exif-sensingmethod-5' => 'Ҳисгари ноҳияи тартиби рангҳо',
'exif-sensingmethod-7' => 'Ҳисгари сехатӣ',
'exif-sensingmethod-8' => 'Ҳисгари хати тартибии рангҳо',

'exif-scenetype-1' => 'Акси мустақиман аккосишуда',

'exif-customrendered-0' => 'Пардозиши оддӣ',
'exif-customrendered-1' => 'Пардозиши суфоришӣ',

'exif-exposuremode-0' => 'Нурдиҳии худкор',
'exif-exposuremode-1' => 'Нурдиҳии дастӣ',
'exif-exposuremode-2' => 'Қавсбандии худкор (Auto bracket)',

'exif-whitebalance-0' => 'Танзими худкорӣ ранги сафед (white balance)',
'exif-whitebalance-1' => 'Танзими дастии ранги сафед (white balance)',

'exif-scenecapturetype-0' => 'Стандарт',
'exif-scenecapturetype-1' => 'Чашмандоз',
'exif-scenecapturetype-2' => 'Портрет',
'exif-scenecapturetype-3' => 'Шабона',

'exif-gaincontrol-0' => 'Ҳеҷ',
'exif-gaincontrol-1' => 'Афзоиши ҳадди ақали дарёфтӣ',
'exif-gaincontrol-2' => 'Афзоиши ҳадди аксари дарёфтӣ',
'exif-gaincontrol-3' => 'Коҳиши ҳадди ақали дарёфтӣ',
'exif-gaincontrol-4' => 'Коҳиши ҳадди аксари дарёфтӣ',

'exif-contrast-0' => 'Оддӣ',
'exif-contrast-1' => 'Нарм',
'exif-contrast-2' => 'Сахт',

'exif-saturation-0' => 'Оддӣ',
'exif-saturation-1' => 'Рангҳои рақиқшуда',
'exif-saturation-2' => 'Рангҳои тағлизшуда',

'exif-sharpness-0' => 'Оддӣ',
'exif-sharpness-1' => 'Нарм',
'exif-sharpness-2' => 'Нарм',

'exif-subjectdistancerange-0' => 'Номаълум',
'exif-subjectdistancerange-1' => 'Макро',
'exif-subjectdistancerange-2' => 'Намои наздик',
'exif-subjectdistancerange-3' => 'Намои дур',

# Pseudotags used for GPSLatitudeRef and GPSDestLatitudeRef
'exif-gpslatitude-n' => 'Арзи ҷуғрофиявӣ шимолӣ',
'exif-gpslatitude-s' => 'Арзи ҷуғрофиявӣ ҷанубӣ',

# Pseudotags used for GPSLongitudeRef and GPSDestLongitudeRef
'exif-gpslongitude-e' => 'Арзи ҷуғрофиявӣ шарқӣ',
'exif-gpslongitude-w' => 'Арзи ҷуғрофиявӣ ғарбӣ',

'exif-gpsstatus-a' => 'Дар ҳоли андозагирӣ',
'exif-gpsstatus-v' => 'Муқоисапазирии андозагирӣ',

'exif-gpsmeasuremode-2' => 'Андозагирии 2-баъдӣ',
'exif-gpsmeasuremode-3' => 'Андозагирии 3-баъдӣ',

# Pseudotags used for GPSSpeedRef and GPSDestDistanceRef
'exif-gpsspeed-k' => 'Километр бар соат',
'exif-gpsspeed-m' => 'Мил бар соат',
'exif-gpsspeed-n' => 'Гиреҳ',

# Pseudotags used for GPSTrackRef, GPSImgDirectionRef and GPSDestBearingRef
'exif-gpsdirection-t' => 'Раванди дуруст',
'exif-gpsdirection-m' => 'Раванди магнетикӣ',

# External editor support
'edit-externally'      => 'Ин файлро бо барномаи беруна таҳрир кунед',
'edit-externally-help' => 'Барои иттилооти бештар [http://www.mediawiki.org/wiki/Manual:External_editors роҳнамои танзимотро оиди вироишгарони беруна] нигаред.',

# 'all' in various places, this might be different for inflected languages
'recentchangesall' => 'ҳама',
'imagelistall'     => 'ҳама',
'watchlistall2'    => 'ҳама',
'namespacesall'    => 'ҳама',
'monthsall'        => 'ҳама',

# E-mail address confirmation
'confirmemail'             => 'Тасдиқи нишонаи почтаи электронӣ',
'confirmemail_noemail'     => 'Шумо дар саҳифаи [[Special:Preferences|тарҷиҳоти корбарии]] худ нишонаи почтаи электронии мӯътабареро ворид накардаед.',
'confirmemail_text'        => '{{SITENAME}} таъйиди эътибои почтаи электронии шуморо пеш аз истифода хидмати электронӣ талаб мекунад. Тугмаи зеринро фаъол кунед то номаи таъйидӣ ба почтаи электронии шумо фиристода шавад. Ин нома пайвандеро дар бар мегирад, ки коде дорад; пайвандро дар мурургар боз кунед, то ки почтаи электрониатон  дар ҳақиқат таъйид шавад.',
'confirmemail_pending'     => '<div class="error">Як коди таъйиди пештар барои шумо тариқи почтаи электронӣ фиристода шуда буд; агар ба наздики шумо ҳисоберо эчод карда бошед, шояд якчанд дақиқа пеш аз дархост кардани коди ҷадид омадани коди таъйидии қаблиро интизор шавед.</div>',
'confirmemail_send'        => 'Фиристодани коди тасдиқ',
'confirmemail_sent'        => 'Номаи электронии тасдиқ фиристода шуд.',
'confirmemail_oncreate'    => 'Як коди таъйидие ба почтаи электронии шумо фиристода шуд.
Барои ворид шудан ба систем ниёзе ба ин код нест, вале барои роҳандозии имкони вобаста ба почтаи электронӣ дар ин вики ба он ниёз хоҳед дошт.',
'confirmemail_sendfailed'  => 'Фиристодани почтаи электронии таъйиди мумкин нашуд. Вуҷуди аломатҳои номӯътабареро дар нишонаро баррасӣ кунед.

Фиристанда баргардонд: $1',
'confirmemail_invalid'     => 'Коди тасдиқ номӯътабар аст. Мумкин аст, ки сипарӣ шудааст.',
'confirmemail_needlogin'   => 'Барои тасдиқи почтаи электрониатон ниёз ба $1 доред.',
'confirmemail_success'     => 'Нишонаи почтаи электронии шумо тасдиқ шуд. Ҳамакнун метавонед ба систем вуруд карда аз вики лаззат бубаред.',
'confirmemail_loggedin'    => 'Нишонаи почтаи электронии шумо тасдиқ шуд.',
'confirmemail_error'       => 'Ҳангоми захираи таъйиди шумо ба мушкилие бархӯрда шуд.',
'confirmemail_subject'     => '{{SITENAME}} тасдиқи нишонаи почтаи электронӣ',
'confirmemail_body'        => 'Someone, probably you, from IP address $1,
has registered an account "$2" with this e-mail address on {{SITENAME}}.

To confirm that this account really does belong to you and activate
e-mail features on {{SITENAME}}, open this link in your browser:

$3

If you did *not* register the account, follow this link
to cancel the e-mail address confirmation:

$5

This confirmation code will expire at $4.

---------
Як нафар, эҳтимолан худи шумо, аз ин нишонаи IP $1, ҳисоби корбарие бо номи "$2" бо истифодаи ин нишонаи почтаи электронӣ дар {{SITENAME}} эҷод кардааст.

Барои тасдиқи ин ҳисоб ки дар ҳақиқат ба шумо таалуқ дорад ва низ барои фаъолсозии имконоти почтаи электронӣ дар {{SITENAME}}, ин парвандаро дар мурургари Интернетӣ боз кунед:

$3

Агар ин шумо *нестед*, лутфан пайвандро дунбол накунед.
Ин коди тасдиқ дар $4 сипарӣ хоҳад шуд.

$5

Ин коди таъйид дар $4 ба поён хоҳад расид.',
'confirmemail_invalidated' => 'Таъйиди нишонаи почтаи электронӣ лағв шуд',
'invalidateemail'          => 'Таъйиди тариқи почтаи электрониро лағв кунед',

# Scary transclusion
'scarytranscludedisabled' => '[Ғунҷоиши байнивикиёна фаъол нест]',
'scarytranscludefailed'   => '[Фарохонии шаблон барои $1 муяссар нашуд; бубахшед]',
'scarytranscludetoolong'  => '[URL-Нишонаи интернетии мавриди назар беш аз андоза дароз буд; бубахшед]',

# Trackbacks
'trackbackbox'      => '<div id="mw_trackbacks">Бозтоби ин саҳифа дар вебнавиштҳо:<br />$1</div>',
'trackbackremove'   => ' ([$1 Ҳазф])',
'trackbacklink'     => 'Бозтоб',
'trackbackdeleteok' => 'Бозтоби саҳифа бо муваффақият ҳазф шуд.',

# Delete conflict
'deletedwhileediting' => 'Огоҳӣ: Ин саҳифа баъди ба вироиш шурӯъ кардани шумо ҳазф шуда буд!',
'confirmrecreate'     => "Корбар [[User:$1|$1]] ([[User talk:$1|баҳс]]) ин мақоларо пас аз он ки огоз ба вироиши он намудаед бо далели зерин ҳазф кардааст:
: ''$2''
Лутфан таъйид кунед, ки муҷаддадан мехоҳед ин мақоларо эҷод кунед.",
'recreate'            => 'Аз нав созед',

# HTML dump
'redirectingto' => 'Дар ҳоли тағйири масир ба [[:$1]]...',

# action=purge
'confirm_purge'        => 'Пок карадни нусхаи ҳофизаи ниҳонии (Cache) ин саҳифаро таъйид мекунед?

$1',
'confirm_purge_button' => 'Таъйид',

# AJAX search
'searchcontaining' => "Ҷустуҷӯи саҳифаҳое ки ''$1'' доранд.",
'searchnamed'      => "Ҷустуҷӯи мақолаҳое, ки ''$1'' ном доранд.",
'articletitles'    => "Мақолаҳое, кт бо ''$1'' оғоз мешаванд",
'hideresults'      => 'Натоиҷро пинҳон кун',
'useajaxsearch'    => 'Аз ҷустуҷӯи AJAX истифода кун',

# Multipage image navigation
'imgmultipageprev' => '← саҳифаи пешин',
'imgmultipagenext' => 'саҳифаи баъд →',
'imgmultigo'       => 'Бирав!',

# Table pager
'ascending_abbrev'         => 'афзуншаванда',
'descending_abbrev'        => 'поёнӣ',
'table_pager_next'         => 'Саҳифаи навбатӣ',
'table_pager_prev'         => 'Саҳифаи гузашта',
'table_pager_first'        => 'Саҳифаи аввал',
'table_pager_last'         => 'Саҳифаи охир',
'table_pager_limit'        => 'Нишон додани $1 адад дар як саҳифа',
'table_pager_limit_submit' => 'Бирав',
'table_pager_empty'        => 'Ҳеҷ натиҷа',

# Auto-summaries
'autosumm-blank'   => 'Холӣ кардани саҳифа',
'autosumm-replace' => "Ивазкунии саҳифа бо '$1'",
'autoredircomment' => 'Тағйири масир ба [[$1]]',
'autosumm-new'     => 'Саҳифаи нав: $1',

# Live preview
'livepreview-loading' => 'Дар ҳоли бор шудан…',
'livepreview-ready'   => 'Бор шудан… Омода!',
'livepreview-failed'  => 'Пешнамоиши зинда ба мушкилӣ бархӯрд! Лутфан аз пешнамоиши оддӣ истифода кунед.',
'livepreview-error'   => 'Иртибот ба мушкилӣ бархӯрд: $1 "$2". Аз пешнамоиши оддӣ истифода кунед.',

# Friendlier slave lag warnings
'lag-warn-normal' => 'Мумкин аст тағйироти тозатар аз $1 сония дар ин феҳрист нишон дода нашавад.',
'lag-warn-high'   => 'Мумкин аст, ба хотири пасафтодагии зиёд коргузори додаҳо, тағйироти тоза аз $1 сония дар ин феҳрист нишон нашуда бошанд.',

# Watchlist editor
'watchlistedit-numitems'       => 'Феҳристи пайгириҳои шумо шомили {{PLURAL:$1|1 саҳифа|$1 саҳифаҳо}}, ба ғайр аз саҳифаҳои баҳс аст.',
'watchlistedit-noitems'        => 'Феҳристи пайгириҳои шумо холӣ аст.',
'watchlistedit-normal-title'   => 'Вироиши феҳристи пайгириҳо',
'watchlistedit-normal-legend'  => 'Ҳазфи унвонҳо аз феҳристи пайгириҳо',
'watchlistedit-normal-explain' => 'Унвонҳои мавҷуд дар феҳристи пайгириҳои шумо дар поён намоиш дода шудаанд.
Барои ҳазфи як унвон, ҷаъбаи кӯчаки канори онро тик бизанид.
Шумо метавонед [[Special:Watchlist/raw|феҳристи хоми пайгириҳоро вироиш кунед]].',
'watchlistedit-normal-submit'  => 'Унвонҳо ҳазф шаванд',
'watchlistedit-normal-done'    => '$1 унвон аз феҳристи пайгириҳои шумо ҳазф {{PLURAL:$1|шуд|шуданд}}:',
'watchlistedit-raw-title'      => 'Вироиши феҳристи хомӣ пайгириҳо',
'watchlistedit-raw-legend'     => 'Вироиши феҳристи хомӣ пайгириҳо',
'watchlistedit-raw-explain'    => 'Унвонҳои мавҷуд дар феҳристи пайгириҳои шумо дар зер нишон дода шудаанд, ва шумо метавонед маворидро ҳазф ё изофа кунед; як унвон дар ҳар сатр бояд қарор бигирад. Дар поён, тугмаи "Ба рӯзрасонии пайгириҳо"-ро фишор диҳед.
Таваҷҷӯҳ кунед, ки шумо метавонед аз [[Special:Watchlist/edit|вироишгари стандартии феҳристи пайгириҳо]] истифода кунед.',
'watchlistedit-raw-titles'     => 'Унвонҳо:',
'watchlistedit-raw-submit'     => 'Ба рӯз расонидани пайгириҳо',
'watchlistedit-raw-done'       => 'Феҳристи пайгириҳои шумо ба рӯз шуд.',
'watchlistedit-raw-added'      => '{{PLURAL:$1|1 унвон|$1 унвонҳо}} ба феҳристи пайгириҳо изофа шуд:',
'watchlistedit-raw-removed'    => 'Унвон ҳазф {{PLURAL:$1|шуд|шуданд}}:',

# Watchlist editing tools
'watchlisttools-view' => 'Намоиши тағйироти алоқаманди феҳристи пайгириҳо',
'watchlisttools-edit' => 'Мушоҳида ва вироиши феҳристи пайгириҳо',
'watchlisttools-raw'  => 'Вироиши феҳристи хоми пайгириҳо',

# Iranian month names
'iranian-calendar-m1'  => 'Ҳамал',
'iranian-calendar-m2'  => 'Савр',
'iranian-calendar-m3'  => 'Ҷавзо',
'iranian-calendar-m4'  => 'Саратон',
'iranian-calendar-m5'  => 'Асад',
'iranian-calendar-m6'  => 'Сунбула',
'iranian-calendar-m7'  => 'Мизон',
'iranian-calendar-m8'  => 'Ақраб',
'iranian-calendar-m9'  => 'Қавс',
'iranian-calendar-m10' => 'Ҷадӣ',
'iranian-calendar-m11' => 'Далв',
'iranian-calendar-m12' => 'Ҳут',

# Core parser functions
'unknown_extension_tag' => 'Бачасби ношиноси афзунаи "$1"',

# Special:Version
'version'                          => 'Нусхаи Медиавики', # Not used as normal message but as header for the special page itself
'version-extensions'               => 'Афзунаҳои насбшуда',
'version-specialpages'             => 'Саҳифаҳои вижа',
'version-parserhooks'              => 'Қолабҳои таҷзеҳгар',
'version-variables'                => 'Мутағйирҳо',
'version-other'                    => 'Дигар',
'version-mediahandlers'            => 'Бадастгирандаҳои расонаҳо',
'version-hooks'                    => 'Қолабҳо',
'version-extension-functions'      => 'Амалгарҳои афзуна',
'version-parser-extensiontags'     => 'Барчасбҳои афзунаҳои таҷзеҳгар',
'version-parser-function-hooks'    => 'Қолабҳои амалгарҳои таҷзеҳгар',
'version-skin-extension-functions' => 'Амалгарҳои афзунаҳои пӯст',
'version-hook-name'                => 'Номи қолаб',
'version-hook-subscribedby'        => 'Воридшуда тавассути',
'version-version'                  => 'Нусха',
'version-license'                  => 'Иҷозатнома',
'version-software'                 => 'Нусхаи насбшуда',
'version-software-product'         => 'Маҳсул',
'version-software-version'         => 'Нусха',

# Special:FilePath
'filepath'         => 'Масири парванда',
'filepath-page'    => 'Парванда:',
'filepath-submit'  => 'Масир',
'filepath-summary' => 'Ин саҳифаи вижа нишонаи комил барои як парвандаро нишон медиҳад.
Аксҳо бо кайфият бо ҳаҷми пурраашон нишон дода мешаванд, дигар навъҳои парвандаҳои дигар бо барномаҳои алоқаманди махсус ба худашон боз мешаванд.

Нишонаи пайвандро бидуни пешванд "{{ns:image}}:" ворид кунед.',

# Special:FileDuplicateSearch
'fileduplicatesearch'          => 'Ҷустуҷӯ барои парвандаҳои такрорӣ',
'fileduplicatesearch-summary'  => 'Ҷустуҷӯ барои парвандаҳои такрорӣ бар асоси миқдори дар ҳам шудаи онҳо сурат мегирад.

Номи парвандаро бе пешванди "{{ns:image}}:" ворид кунед.',
'fileduplicatesearch-legend'   => 'Ҷустуҷӯи мавориди такрорӣ',
'fileduplicatesearch-filename' => 'Номи парванда:',
'fileduplicatesearch-submit'   => 'Ҷустуҷӯ',
'fileduplicatesearch-info'     => '$1 × $2 пиксел<br />Андозаи парванда: $3<br />Навъи MIME: $4',
'fileduplicatesearch-result-1' => 'Парвандаи "$1" мавриди такрорӣ надорад.',
'fileduplicatesearch-result-n' => 'Парвандаи "$1" дорои {{PLURAL:$2|1 мавриди такрорӣ|$2 мавриди такрорӣ}} аст.',

# Special:SpecialPages
'specialpages'             => 'Саҳифаҳои вижа',
'specialpages-group-other' => 'Дигар саҳифаҳои вижа',
'specialpages-group-login' => 'Вуруд / сабти ном',

);
