<?php
/** Thai (ไทย)
 *
 * @ingroup Language
 * @file
 *
 * @author Ans
 * @author LMNOP at Thai Wikipedia (manop@itshee.com) since July 2007
 * @author Manop
 * @author Octahedron80
 * @author Passawuth
 * @author לערי ריינהארט
 * @author จักรกฤช วงศ์สระหลวง (Jakkrit Vongsraluang) / PaePae
 * @author วรากร อึ้งวิเชียร (Varakorn Ungvichian)
 */

$skinNames = array(
	'standard'    => 'ดั้งเดิม',
	'nostalgia'   => 'อดีต',
	'cologneblue' => 'น้ำเงินโคโลญจ์',
	'myskin'      => 'ปรุงเอง',
	'simple'      => 'เรียบง่าย',
	'modern'      => 'ทันสมัย',
);

$namespaceNames = array(
	NS_MEDIA            => 'สื่อ',
	NS_SPECIAL          => 'พิเศษ',
	NS_MAIN	            => '',
	NS_TALK	            => 'พูดคุย',
	NS_USER             => 'ผู้ใช้',
	NS_USER_TALK        => 'คุยกับผู้ใช้',
	# NS_PROJECT set by $wgMetaNamespace
	NS_PROJECT_TALK     => 'คุยเรื่อง$1',
	NS_IMAGE            => 'ภาพ',
	NS_IMAGE_TALK       => 'คุยเรื่องภาพ',
	NS_MEDIAWIKI        => 'มีเดียวิกิ',
	NS_MEDIAWIKI_TALK   => 'คุยเรื่องมีเดียวิกิ',
	NS_TEMPLATE         => 'แม่แบบ',
	NS_TEMPLATE_TALK    => 'คุยเรื่องแม่แบบ',
	NS_HELP             => 'วิธีใช้',
	NS_HELP_TALK        => 'คุยเรื่องวิธีใช้',
	NS_CATEGORY         => 'หมวดหมู่',
	NS_CATEGORY_TALK    => 'คุยเรื่องหมวดหมู่',
);

$datePreferences = array(
	'default',
	'thai',
	'mdy',
	'dmy',
	'ymd',
	'ISO 8601',
);

$defaultDateFormat = 'thai';

$dateFormats = array(
	'thai time' => 'H:i',
	'thai date' => 'j F xkY',
	'thai both' => 'H:i, j F xkY',

	'mdy time' => 'H:i',
	'mdy date' => 'F j, Y',
	'mdy both' => 'H:i, F j, Y',

	'dmy time' => 'H:i',
	'dmy date' => 'j F Y',
	'dmy both' => 'H:i, j F Y',

	'ymd time' => 'H:i',
	'ymd date' => 'Y F j',
	'ymd both' => 'H:i, Y F j',

	'ISO 8601 time' => 'xnH:xni:xns',
	'ISO 8601 date' => 'xnY-xnm-xnd',
	'ISO 8601 both' => 'xnY-xnm-xnd"T"xnH:xni:xns',
);

$linkTrail = '/^([a-z]+)(.*)\$/sD';

$messages = array(
# User preference toggles
'tog-underline'               => 'ขีดเส้นใต้ลิงก์',
'tog-highlightbroken'         => 'จัดลิงก์ที่ไม่มีใน<a href="" class="new">ลักษณะนี้</a> (หรือลักษณะนี้<a href="" class="internal">?</a>)',
'tog-justify'                 => 'จัดย่อหน้าเต็มบรรทัด',
'tog-hideminor'               => 'ไม่แสดงการแก้ไขเล็กน้อยในหน้าปรับปรุงล่าสุด',
'tog-extendwatchlist'         => 'ขยายรายการเฝ้าดูเพื่อแสดงผลการเปลี่ยนแปลงที่เกิดขึ้นทั้งหมด',
'tog-usenewrc'                => 'ขยายหน้าปรับปรุงล่าสุด (จาวาสคริปต์)',
'tog-numberheadings'          => 'ใส่ตัวเลขหัวข้อในสารบัญ',
'tog-showtoolbar'             => 'แสดงเครื่องมือแก้ไข',
'tog-editondblclick'          => 'แก้ไขหน้าโดยการดับเบิลคลิก (จาวาสคริปต์)',
'tog-editsection'             => 'เปิดการแก้ไขเฉพาะส่วนโดยใช้ลิงก์ [แก้ไข]',
'tog-editsectiononrightclick' => 'เปิดการแก้ไขเฉพาะส่วนโดยคลิกขวาที่หัวข้อ (จาวาสคริปต์)',
'tog-showtoc'                 => 'แสดงสารบัญ<br />(สำหรับหน้าที่มีมากกว่า 3 หัวข้อ)',
'tog-rememberpassword'        => 'จำชื่อล็อกอินและรหัสผ่านในช่วงการใช้งานนี้',
'tog-editwidth'               => 'กล่องสำหรับการแก้ไขกว้างเต็มหน้าจอ',
'tog-watchcreations'          => 'นำหน้าที่สร้างใส่รายการเฝ้าดู',
'tog-watchdefault'            => 'นำหน้าที่แก้ไขใส่รายการเฝ้าดู',
'tog-watchmoves'              => 'นำหน้าที่เปลี่ยนชื่อใส่รายการเฝ้าดู',
'tog-watchdeletion'           => 'นำหน้าที่ลบใส่รายการเฝ้าดู',
'tog-minordefault'            => 'กำหนดการแก้ไขปกติเป็นการแก้ไขเล็กน้อยทุกครั้ง',
'tog-previewontop'            => 'แสดงตัวอย่างการแก้ไขก่อนกล่องแก้ไข',
'tog-previewonfirst'          => 'แสดงตัวอย่างการแก้ไขสำหรับการแก้ไขครั้งแรก',
'tog-nocache'                 => 'ระงับการบันทึกหน้าลงแคช',
'tog-enotifwatchlistpages'    => 'หน้าที่เฝ้าดูมีการแก้ไข',
'tog-enotifusertalkpages'     => 'หน้าพูดคุยส่วนตัวมีการแก้ไข',
'tog-enotifminoredits'        => 'แม้ว่าการแก้ไขจะเป็นการแก้ไขเล็กน้อย',
'tog-enotifrevealaddr'        => 'เผยที่อยู่อีเมลในอีเมลที่ชี้แจง',
'tog-shownumberswatching'     => 'แสดงจำนวนผู้ใช้ที่เฝ้าดูหน้านี้',
'tog-fancysig'                => 'แสดงเฉพาะลายเซ็น (ไม่มีการสร้างลิงก์)',
'tog-externaleditor'          => 'กำหนดค่ามาตรฐาน ให้แก้ไขโดยใช้โปรแกรมภายนอกตัวอื่น',
'tog-externaldiff'            => 'ใช้ซอฟต์แวร์ในเครื่องแก้ไขวิกิ',
'tog-showjumplinks'           => 'เปิดใช้งาน "กระโดด" อัตโนมัติไปตามลิงก์',
'tog-uselivepreview'          => 'แสดงตัวอย่างการแก้ไขแบบทันที (จาวาสคริปต์) (ทดลอง)',
'tog-forceeditsummary'        => 'เตือนเมื่อช่องสรุปการแก้ไขว่าง',
'tog-watchlisthideown'        => 'ไม่แสดงการแก้ไขของตนเองจากรายการเฝ้าดูของตนเอง',
'tog-watchlisthidebots'       => 'ไม่แสดงการแก้ไขของบอตจากรายการเฝ้าดูของตนเอง',
'tog-watchlisthideminor'      => 'ไม่แสดงการแก้ไขเล็กน้อยจากรายการเฝ้าดูของตนเอง',
'tog-ccmeonemails'            => 'ส่งสำเนาอีเมลกลับมาทุกครั้งที่ส่งหาคนอื่น',
'tog-diffonly'                => 'ไม่แสดงเนื้อหาใต้ส่วนต่างการแก้ไข',
'tog-showhiddencats'          => 'แสดงหมวดหมู่ที่ซ่อนอยู่',

'underline-always'  => 'เสมอ',
'underline-never'   => 'ไม่เคย',
'underline-default' => 'ค่าปริยายตามเว็บเบราว์เซอร์',

'skinpreview' => '(แสดงตัวอย่าง)',

# Dates
'sunday'        => 'วันอาทิตย์',
'monday'        => 'วันจันทร์',
'tuesday'       => 'วันอังคาร',
'wednesday'     => 'วันพุธ',
'thursday'      => 'วันพฤหัสบดี',
'friday'        => 'วันศุกร์',
'saturday'      => 'วันเสาร์',
'sun'           => 'อา.',
'mon'           => 'จ.',
'tue'           => 'อ.',
'wed'           => 'พ.',
'thu'           => 'พฤ.',
'fri'           => 'ศ.',
'sat'           => 'ส.',
'january'       => 'มกราคม',
'february'      => 'กุมภาพันธ์',
'march'         => 'มีนาคม',
'april'         => 'เมษายน',
'may_long'      => 'พฤษภาคม',
'june'          => 'มิถุนายน',
'july'          => 'กรกฎาคม',
'august'        => 'สิงหาคม',
'september'     => 'กันยายน',
'october'       => 'ตุลาคม',
'november'      => 'พฤศจิกายน',
'december'      => 'ธันวาคม',
'january-gen'   => 'มกราคม',
'february-gen'  => 'กุมภาพันธ์',
'march-gen'     => 'มีนาคม',
'april-gen'     => 'เมษายน',
'may-gen'       => 'พฤษภาคม',
'june-gen'      => 'มิถุนายน',
'july-gen'      => 'กรกฎาคม',
'august-gen'    => 'สิงหาคม',
'september-gen' => 'กันยายน',
'october-gen'   => 'ตุลาคม',
'november-gen'  => 'พฤศจิกายน',
'december-gen'  => 'ธันวาคม',
'jan'           => 'ม.ค.',
'feb'           => 'ก.พ.',
'mar'           => 'มี.ค.',
'apr'           => 'เม.ย.',
'may'           => 'พ.ค.',
'jun'           => 'มิ.ย.',
'jul'           => 'ก.ค.',
'aug'           => 'ส.ค.',
'sep'           => 'ก.ย.',
'oct'           => 'ต.ค.',
'nov'           => 'พ.ย.',
'dec'           => 'ธ.ค.',

# Categories related messages
'pagecategories'                 => '{{PLURAL:$1|หมวดหมู่|หมวดหมู่}}',
'category_header'                => 'เนื้อหาในหมวดหมู่ "$1"',
'subcategories'                  => 'หมวดหมู่ย่อย',
'category-media-header'          => 'สื่อในหมวดหมู่ "$1"',
'category-empty'                 => "''หมวดหมู่นี้ว่าง ไม่มีบทความใดอยู่''",
'hidden-categories'              => '{{PLURAL:$1|หมวดหมู่ที่ซ่อนอยู่|หมวดหมู่ที่ซ่อนอยู่}}',
'hidden-category-category'       => 'หมวดหมู่ที่ซ่อนอยู่', # Name of the category where hidden categories will be listed
'category-subcat-count'          => '{{PLURAL:$2|หมวดหมู่นี้มีหมวดหมู่ย่อยเพียงหมวดหมู่เดียว|หมวดหมู่นี้มี {{PLURAL:$1|หมวดหมู่ย่อย|$1 หมวดหมู่ย่อย}} จากทั้งหมด $2 หมวดหมู่}}',
'category-subcat-count-limited'  => 'หมวดหมู่นี้มี {{PLURAL:$1|หมวดหมู่ย่อยเพียงหมวดหมู่เดียว|$1 หมวดหมู่ย่อย}}',
'category-article-count'         => '{{PLURAL:$2|หมวดหมู่นี้มีหน้าอยู่เพียงหน้าเดียว|มี {{PLURAL:$1|หน้าเดียว|$1 หน้า}} ในหมวดหมู่นี้ เต็ม $2}}',
'category-article-count-limited' => '{{PLURAL:$1|หน้า|หน้า}}ต่อไปนี้อยู่ในหมวดหมู่นี้',
'category-file-count'            => '{{PLURAL:$2|มีไฟล์เดียวในหมวดหมู่นี้|มี {{PLURAL:$1|ไฟล์|ไฟล์}} ในหมวดหมู่นี้จากทั้งหมด $2 ไฟล์}}',
'category-file-count-limited'    => '{{PLURAL:$1|ไฟล์|ไฟล์}}ต่อไปนี้อยู่ในหมวดหมู่นี้',
'listingcontinuesabbrev'         => '(ต่อ)',

'mainpagetext'      => "<big>'''ซอฟต์แวร์มีเดียวิกิได้ถูกติดตั้งเรียบร้อย'''</big>",
'mainpagedocfooter' => 'ศึกษา[http://meta.wikimedia.org/wiki/Help:Contents คู่มือการใช้งาน] สำหรับเริ่มต้นใช้งานซอฟต์แวร์วิกิ

== เริ่มต้น ==

* [http://www.mediawiki.org/wiki/Manual:Configuration_settings รายการการปรับแต่งระบบ] (ภาษาอังกฤษ)
* [http://www.mediawiki.org/wiki/Manual:FAQ คำถามที่ถามบ่อยในมีเดียวิกิ] (ภาษาอังกฤษ)
* [http://lists.wikimedia.org/mailman/listinfo/mediawiki-announce เมลลิงลิสต์ของมีเดียวิกิ]',

'about'          => 'เว็บไซต์นี้',
'article'        => 'หน้าเนื้อหา',
'newwindow'      => '(เปิดหน้าต่างใหม่)',
'cancel'         => 'ยกเลิก',
'qbfind'         => 'ค้นหา',
'qbbrowse'       => 'สืบค้น',
'qbedit'         => 'แก้ไข',
'qbpageoptions'  => 'หน้านี้',
'qbpageinfo'     => 'บริบท',
'qbmyoptions'    => 'หน้าของฉัน',
'qbspecialpages' => 'หน้าพิเศษ',
'moredotdotdot'  => 'ดูเพิ่ม...',
'mypage'         => 'หน้าของฉัน',
'mytalk'         => 'หน้าพูดคุยของฉัน',
'anontalk'       => 'พูดคุยกับไอพีนี้',
'navigation'     => 'ป้ายบอกทาง',
'and'            => 'และ',

# Metadata in edit box
'metadata_help' => 'เมทาเดทา:',

'errorpagetitle'    => 'มีข้อผิดพลาด',
'returnto'          => 'กลับไปสู่ $1',
'tagline'           => 'จาก {{SITENAME}}',
'help'              => 'ช่วยเหลือ',
'search'            => 'ค้นหา',
'searchbutton'      => 'ค้นหา',
'go'                => 'ไป',
'searcharticle'     => 'ไป',
'history'           => 'ประวัติหน้า',
'history_short'     => 'ประวัติ',
'updatedmarker'     => 'ความเปลี่ยนแปลงตั้งแต่ครั้งล่าสุด',
'info_short'        => 'ข้อมูล',
'printableversion'  => 'หน้าสำหรับพิมพ์',
'permalink'         => 'ลิงก์ถาวร',
'print'             => 'พิมพ์',
'edit'              => 'แก้ไข',
'create'            => 'สร้าง',
'editthispage'      => 'แก้ไขหน้านี้',
'create-this-page'  => 'สร้างหน้านี้',
'delete'            => 'ลบ',
'deletethispage'    => 'ลบหน้านี้',
'undelete_short'    => 'เรียกคืน {{PLURAL:$1|1 การแก้ไข|$1 การแก้ไข}}',
'protect'           => 'ล็อก',
'protect_change'    => 'เปลี่ยนรูปแบบการล็อก',
'protectthispage'   => 'ล็อกหน้านี้',
'unprotect'         => 'ปลดล็อก',
'unprotectthispage' => 'ปลดล็อกหน้านี้',
'newpage'           => 'หน้าใหม่',
'talkpage'          => 'พูดคุยหน้านี้',
'talkpagelinktext'  => 'พูดคุย',
'specialpage'       => 'หน้าพิเศษ',
'personaltools'     => 'เครื่องมือส่วนตัว',
'postcomment'       => 'แสดงความเห็น',
'articlepage'       => 'แสดงเนื้อหาของหน้า',
'talk'              => 'อภิปราย',
'views'             => 'ดู',
'toolbox'           => 'เครื่องมือเพิ่ม',
'userpage'          => 'ดูหน้าผู้ใช้',
'projectpage'       => 'ดูหน้าโครงการ',
'imagepage'         => 'ดูหน้าภาพ',
'mediawikipage'     => 'ดูหน้าข้อความ',
'templatepage'      => 'ดูหน้าแม่แบบ',
'viewhelppage'      => 'ดูหน้าคำอธิบาย',
'categorypage'      => 'ดูหน้าหมวดหมู่',
'viewtalkpage'      => 'ดูการพูดคุย',
'otherlanguages'    => 'ในภาษาอื่น',
'redirectedfrom'    => '(เปลี่ยนทางจาก $1)',
'redirectpagesub'   => 'หน้าเปลี่ยนทาง',
'lastmodifiedat'    => 'หน้านี้แก้ไขล่าสุดเมื่อวันที่  $1 เวลา $2', # $1 date, $2 time
'viewcount'         => 'หน้านี้มีการเข้าชม {{PLURAL:$1|1 ครั้ง|$1 ครั้ง}}',
'protectedpage'     => 'หน้าถูกล็อก',
'jumpto'            => 'ข้ามไปที่:',
'jumptonavigation'  => 'นำทาง',
'jumptosearch'      => 'ค้นหา',

# All link text and link target definitions of links into project namespace that get used by other message strings, with the exception of user group pages (see grouppage) and the disambiguation template definition (see disambiguations).
'aboutsite'            => 'เกี่ยวกับ {{SITENAME}}',
'aboutpage'            => 'Project:เกี่ยวกับเว็บไซต์',
'bugreports'           => 'รายงานบั๊ก',
'bugreportspage'       => 'Project:รายงานบั๊ก',
'copyright'            => 'เนื้อหาในหน้านี้อยู่ภายใต้ลิขสิทธิ์แบบ $1',
'copyrightpagename'    => 'สงวนลิขสิทธิ์ {{SITENAME}}',
'copyrightpage'        => '{{ns:project}}:ลิขสิทธิ์',
'currentevents'        => 'เหตุการณ์ปัจจุบัน',
'currentevents-url'    => 'Project:เหตุการณ์ปัจจุบัน',
'disclaimers'          => 'ข้อปฏิเสธความรับผิดชอบ',
'disclaimerpage'       => 'Project:ข้อปฏิเสธความรับผิดชอบ',
'edithelp'             => 'คำอธิบายการแก้ไข',
'edithelppage'         => 'Help:การแก้ไข',
'faq'                  => 'คำถามที่ถามบ่อย',
'faqpage'              => 'Project:คำถามที่ถามบ่อย',
'helppage'             => 'Help:วิธีการใช้งาน',
'mainpage'             => 'หน้าหลัก',
'mainpage-description' => 'หน้าหลัก',
'policy-url'           => 'Project:นโยบาย',
'portal'               => 'ศูนย์รวมชุมชน',
'portal-url'           => 'Project:ศูนย์รวมชุมชน',
'privacy'              => 'นโยบายสิทธิส่วนบุคคล',
'privacypage'          => 'Project:นโยบายสิทธิส่วนบุคคล',

'badaccess'        => 'มีข้อผิดพลาดในการใช้สิทธิ',
'badaccess-group0' => 'คุณไม่ได้รับอนุญาตให้กระทำสิ่งที่ร้องขอนี้',
'badaccess-group1' => 'การกระทำที่ร้องขอนี้สงวนไว้เฉพาะผู้ใช้ในกลุ่ม $1',
'badaccess-group2' => 'การกระทำที่ร้องขอนี้สงวนไว้เฉพาะผู้ใช้จากกลุ่ม $1 กลุ่มใดกลุ่มหนึ่งเป็นอย่างน้อย',
'badaccess-groups' => 'การกระทำที่ร้องขอนี้สงวนไว้เฉพาะผู้ใช้จากกลุ่ม $1 กลุ่มใดกลุ่มหนึ่งเป็นอย่างน้อย',

'versionrequired'     => 'ต้องการมีเดียวิกิรุ่น $1',
'versionrequiredtext' => 'ต้องการมีเดียวิกิรุ่น $1 สำหรับใช้งานหน้านี้ ดูเพิ่ม [[Special:Version|รุ่นซอฟต์แวร์]]',

'ok'                      => 'ตกลง',
'retrievedfrom'           => 'รับข้อมูลจาก "$1"',
'youhavenewmessages'      => 'คุณมี $1 ($2)',
'newmessageslink'         => 'ข้อความใหม่',
'newmessagesdifflink'     => 'ข้อความเข้ามาใหม่',
'youhavenewmessagesmulti' => 'คุณมีข้อความใหม่ที่ $1',
'editsection'             => 'แก้ไข',
'editold'                 => 'แก้ไข',
'viewsourceold'           => 'ดูโค้ด',
'editsectionhint'         => 'แก้ไขส่วน: $1',
'toc'                     => 'เนื้อหา',
'showtoc'                 => 'แสดง',
'hidetoc'                 => 'ซ่อน',
'thisisdeleted'           => 'แสดงหรือเรียกดู $1',
'viewdeleted'             => 'ดู $1',
'restorelink'             => '{{PLURAL:$1|1 การแก้ไขที่ถูกลบ|$1 การแก้ไขที่ถูกลบ}}',
'feedlinks'               => 'ฟีด',
'feed-invalid'            => 'ฟีดที่สมัครไม่ถูกชนิด',
'feed-unavailable'        => 'ฟีดไม่เปิดการใช้งานบน {{SITENAME}}',
'site-rss-feed'           => 'ฟีดอาร์เอสเอส $1',
'site-atom-feed'          => 'ฟีดอะตอม $1',
'page-rss-feed'           => 'ฟีดอาร์เอสเอส "$1"',
'page-atom-feed'          => 'ฟีดอะตอม "$1"',
'red-link-title'          => '$1 (ยังไม่ได้สร้าง)',

# Short words for each namespace, by default used in the namespace tab in monobook
'nstab-main'      => 'เนื้อหา',
'nstab-user'      => 'หน้าผู้ใช้',
'nstab-media'     => 'หน้าสื่อ',
'nstab-special'   => 'พิเศษ',
'nstab-project'   => 'หน้าโครงการ',
'nstab-image'     => 'ไฟล์',
'nstab-mediawiki' => 'ข้อความ',
'nstab-template'  => 'แม่แบบ',
'nstab-help'      => 'หน้าคำอธิบาย',
'nstab-category'  => 'หมวดหมู่',

# Main script and global functions
'nosuchaction'      => 'ไม่มีการกระทำดังกล่าว',
'nosuchactiontext'  => 'การกระทำที่กำหนดผ่านยูอาร์แอลไม่เป็นที่ยอมรับของวิกิ',
'nosuchspecialpage' => 'ไม่มีหน้าพิเศษดังกล่าว',
'nospecialpagetext' => 'หน้าพิเศษตามคำขอไม่ถูกต้อง รายชื่อของหน้าพิเศษดูได้ที่ [[Special:SpecialPages|รายชื่อหน้าพิเศษ]]',

# General errors
'error'                => 'ผิดพลาด',
'databaseerror'        => 'ความผิดพลาดที่ฐานข้อมูล',
'dberrortext'          => 'ไวยากรณ์ในการค้นฐานข้อมูลผิดพลาด
สาเหตุอาจเกิดจากบั๊กของซอฟต์แวร์
การค้นฐานข้อมูลล่าสุดกระทำเมื่อ:
<blockquote><tt>$1</tt></blockquote>
จากฟังก์ชัน "<tt>$2</tt>"
MySQL แจ้งข้อผิดพลาดว่า "<tt>$3: $4</tt>".',
'dberrortextcl'        => 'ไวยากรณ์ในการค้นฐานข้อมูลผิดพลาด
การค้นฐานข้อมูลล่าสุดกระทำเมื่อ:
"$1"
จากฟังก์ชัน "$2"
MySQL แจ้งข้อผิดพลาดว่า "$3: $4"',
'noconnect'            => 'ขออภัย เว็บไซต์วิกินี้กำลังขัดข้องทางเทคนิค และไม่สามารถเชื่อมต่อกับเซิร์ฟเวอร์ฐานข้อมูล<br />
$1',
'nodb'                 => 'ไม่สามารถเลือกฐานข้อมูล $1',
'cachederror'          => 'ข้อมูลต่อไปนี้เป็นแคชเก่าของหน้าที่เรียกขอ ซึ่งไม่ใช่ข้อมูลล่าสุด',
'laggedslavemode'      => 'คำเตือน! ข้อมูลในหน้าอาจจะไม่ใช่ข้อมูลล่าสุด',
'readonly'             => 'ฐานข้อมูลถูกล็อก',
'enterlockreason'      => 'ใส่เหตุผลในการล็อก รวมถึงช่วงเวลาที่คาดว่าจะปลดล็อก',
'readonlytext'         => 'ฐานข้อมูลขณะนี้ถูกล็อกสำหรับการปรับปรุง แก้ไข หรือปรับปรุง เป็นระยะ หลังจากเสร็จแล้วสามารถใช้งานได้ตามปกติ

ผู้ดูแลระบบที่ทำการล็อกได้ให้คำอธิบายดังนี้: $1',
'missing-article'      => 'ฐานข้อมูลไม่พบเนื้อหาของหน้าที่ควรจะมี ในชื่อ "$1" $2

สาเหตุมักเกิดจากการเปรียบเทียบที่ล้าสมัย หรือประวัติการเชื่อมโยงไปยังหน้านั้นได้ถูกลบแล้ว

หากไม่ใช่กรณีดังกล่าว คุณอาจจะพบบั๊กในซอฟต์แวร์ กรุณารายงานต่อ[[Special:ListUsers/sysop|ผู้ดูแลระบบ]] โดยระบุ URL ไปด้วย',
'missingarticle-rev'   => '(รุ่น#: $1)',
'missingarticle-diff'  => '(ต่าง: $1, $2)',
'readonly_lag'         => 'ฐานข้อมูลถูกล็อกอัตโนมัติขณะที่เซิร์ฟเวอร์ฐานข้อมูลรองกำลังปรับปรุงตามฐานข้อมูลหลัก',
'internalerror'        => 'เกิดความผิดพลาดภายใน',
'internalerror_info'   => 'เกิดความผิดพลาดภายใน: $1',
'filecopyerror'        => 'ไม่สามารถคัดลอกไฟล์ "$1" ไปที่ "$2"',
'filerenameerror'      => 'ไม่สามารถเปลี่ยนชื่อไฟล์ "$1" เป็น "$2"',
'filedeleteerror'      => 'ไม่สามารถลบไฟล์ "$1"',
'directorycreateerror' => 'ไม่สามารถสร้างไดเรกทอรี "$1"',
'filenotfound'         => 'ไม่พบไฟล์ "$1"',
'fileexistserror'      => 'ไม่สามารถเขียนไฟล์ "$1" ได้ เนื่องจากมีไฟล์อยู่แล้ว',
'unexpected'           => 'ผลที่ไม่คาดคิด: "$1"="$2"',
'formerror'            => 'ผิดพลาด: ไม่สามารถส่งฟอร์มได้',
'badarticleerror'      => 'การกระทำนี้ไม่สามารถดำเนินการในหน้านี้ได้',
'cannotdelete'         => 'ไม่สามารถลบหน้าหรือไฟล์ที่กำหนด (อาจถูกลบไปก่อนหน้านี้โดยคนอื่นแล้ว)',
'badtitle'             => 'ชื่อหน้าไม่เหมาะสม',
'badtitletext'         => 'ชื่อหน้าที่ร้องขอไม่ถูกต้อง เป็นชื่อว่าง หรือชื่อที่ผิดพลาดเนื่องจากลิงก์ข้ามมาจากภาษาอื่น ชื่อที่ใช้อาจจะมีตัวอักษรที่ไม่สามารถถูกใช้เป็นชื่อได้',
'perfdisabled'         => 'ขออภัย คำสั่งเสริมนี้ถูกระงับการใช้ชั่วคราว เนื่องจากทำให้ฐานข้อมูลทำงานช้าเกินกว่าที่จะมีคนใช้งานวิกิได้',
'perfcached'           => 'ข้อมูลต่อไปนี้อาจเป็นข้อมูลเก่า ที่เก็บไว้ในแคชของระบบ',
'perfcachedts'         => 'ข้อมูลด้านล่างมาจากแคช ซึ่งปรับปรุงครั้งล่าสุดเมื่อ $1',
'querypage-no-updates' => 'ขณะนี้การปรับปรุงหน้านี้ถูกระงับ ข้อมูลในที่นี่จะไม่รีเฟรชเป็นข้อมูลปัจจุบัน',
'wrong_wfQuery_params' => 'พารามิเตอร์ที่ส่งไป wfQuery() ไม่ถูกต้อง<br />
ฟังก์ชั่น: $1<br />
คำค้น: $2',
'viewsource'           => 'ดูโค้ด',
'viewsourcefor'        => 'สำหรับ $1',
'actionthrottled'      => 'การทำสิ่งนี้ถูกระงับไว้ชั่วคราว',
'actionthrottledtext'  => 'เพื่อเป็นการป้องกันสแปม จึงได้มีการจำกัดสิ่งที่คุณกระทำนี้ไม่ให้ทำติดต่อกันหลายครั้งมากจนเกินไปในช่วงระยะเวลาสั้นๆ และในขณะนี้คุณได้ทำสิ่งนี้เกินขีดจำกัดแล้ว กรุณารอสักครู่แล้วลองใหม่อีกครั้ง',
'protectedpagetext'    => 'หน้านี้ถูกล็อกป้องกันการแก้ไข',
'viewsourcetext'       => 'โค้ดหน้านี้สามารถดูและนำไปคัดลอกได้:',
'protectedinterface'   => 'หน้านี้เป็นข้อความที่ใช้แสดงบนหน้าตาหรือส่วนติดต่อผู้ใช้ของซอฟต์แวร์ ถูกล็อกห้ามแก้ไขเพื่อป้องกันการก่อกวน',
'editinginterface'     => "'''คำเตือน:''' คุณกำลังแก้ไขข้อความที่ใช้แสดงบนหน้าตาหรือส่วนติดต่อผู้ใช้ของซอฟต์แวร์  การแก้ไขหน้านี้จะมีผลต่อการแสดงข้อความบนส่วนติดต่อผู้ใช้ของทุกคน  ถ้าคุณต้องการแปลหน้านี้ ให้ลองใช้บริการของ [http://translatewiki.net/wiki/Main_Page?setlang=th Betawiki] ซึ่งเป็นโครงการสำหรับแปลซอฟต์แวร์มีเดียวิกิ",
'sqlhidden'            => '(คำสั่ง SQL ซ่อนอยู่)',
'cascadeprotected'     => 'หน้านี้ได้รับการป้องกันจากการแก้ไข เนื่องจากหน้านี้ถูกใช้เป็นส่วนหนึ่งใน{{PLURAL:$1|หน้า $2 ซึ่งได้รับการป้องกันแบบ "ทบทุกลำดับขั้น"|หน้าซึ่งได้รับการป้องกันแบบ "ทบทุกลำดับขั้น" ดังต่อไปนี้: $2}}',
'namespaceprotected'   => "คุณไม่มีสิทธิในการแก้ไขหน้าในเนมสเปซ '''$1'''",
'customcssjsprotected' => 'คุณไม่ได้รับสิทธิในการแก้ไขหน้านี้ เนื่องจากหน้านี้เก็บการตั้งค่าส่วนตัวของผู้ใช้อื่น',
'ns-specialprotected'  => 'คุณไม่สามารถแก้ไขหน้าพิเศษได้',
'titleprotected'       => "หัวเรื่องนี้ได้รับการป้องกันไม่ให้สร้างใหม่  ผู้ดำเนินการป้องกันคือ [[User:$1|$1]] ได้ให้เหตุผลไว้ว่า ''$2''",

# Virus scanner
'virus-badscanner'     => 'การตั้งค่าผิดพลาด: ไม่รู้จักตัวสแกนไวรัส: <i>$1</i>',
'virus-scanfailed'     => 'การสแกนล้มเหลว (โค้ด $1)',
'virus-unknownscanner' => 'ไม่รู้จักโปรแกรมป้องกันไวรัสตัวนี้:',

# Login and logout pages
'logouttitle'                => 'ผู้ใช้งานล็อกเอาต์',
'logouttext'                 => '<strong>ขณะนี้คุณได้ล็อกเอาต์ออกจากระบบ</strong><br />
คุณสามารถใช้งาน {{SITENAME}} ได้ต่อในแบบผู้ไม่ประสงค์ออกนาม หรือคุณสามารถทำการล็อกอินกลับเข้าไป
อย่างไรก็ตามอาจจะมีบางหน้าที่ยังแสดงข้อความว่าคุณกำลังล็อกอินอยู่ จนกว่าคุณจะปิดเว็บเบราว์เซอร์ หรือเคลียร์แคชออกจากเว็บเบราว์เซอร์',
'welcomecreation'            => '== ยินดีต้อนรับ $1! ==

ชื่อบัญชีผู้ใช้องคุณได้ถูกสร้างขึ้น อย่าลืมเข้าไปตั้งค่าผู้ใช้',
'loginpagetitle'             => 'ล็อกอิน',
'yourname'                   => 'ชื่อผู้ใช้',
'yourpassword'               => 'รหัสผ่าน',
'yourpasswordagain'          => 'พิมพ์รหัสผ่านอีกครั้ง:',
'remembermypassword'         => 'จำชื่อและรหัสผ่าน',
'yourdomainname'             => 'โดเมนของคุณ:',
'externaldberror'            => 'เกิดความผิดพลาดในการระบุตัวตนจากภายนอก หรือคุณไม่มีสิทธิในการแก้ไขบัญชีอื่น',
'loginproblem'               => '<b>เกิดข้อผิดพลาดในการล็อกอิน</b><br />กรุณาลองใหม่',
'login'                      => 'ล็อกอิน',
'nav-login-createaccount'    => 'ล็อกอิน / สร้างบัญชีผู้ใช้',
'loginprompt'                => 'ต้องเปิดใช้คุกกี้ก่อนที่จะล็อกอินเข้าสู่ {{SITENAME}}',
'userlogin'                  => 'ล็อกอิน / สร้างบัญชีผู้ใช้',
'logout'                     => 'ล็อกเอาต์',
'userlogout'                 => 'ล็อกเอาต์',
'notloggedin'                => 'ไม่ได้ล็อกอิน',
'nologin'                    => 'ล็อกอินด้านล่างหรือ $1',
'nologinlink'                => 'สร้างบัญชีผู้ใช้',
'createaccount'              => 'สร้างบัญชีผู้ใช้',
'gotaccount'                 => 'มีบัญชีผู้ใช้แล้วหรือไม่ $1',
'gotaccountlink'             => 'ล็อกอิน',
'createaccountmail'          => 'ผ่านทางอีเมล',
'badretype'                  => 'รหัสผ่านที่ใส่ไม่ถูกต้อง',
'userexists'                 => 'ชื่อบัญชีที่ใส่มีผู้อื่นใช้แล้ว กรุณาเลือกชื่ออื่น',
'youremail'                  => 'อีเมล:',
'username'                   => 'ชื่อผู้ใช้:',
'uid'                        => 'รหัสผู้ใช้:',
'prefs-memberingroups'       => 'สมาชิกใน{{PLURAL:$1|กลุ่ม|กลุ่ม}}:',
'yourrealname'               => 'ชื่อจริง:',
'yourlanguage'               => 'ภาษา:',
'yourvariant'                => 'ภาษาอื่น',
'yournick'                   => 'ชื่อเล่น:',
'badsig'                     => 'ลายเซ็นที่ใช้ผิดพลาด กรุณาตรวจสอบคำสั่งเอชทีเอ็มแอล',
'badsiglength'               => 'ชื่อเล่นยาวเกินไป ซึ่งต้องมีตัวอักษรน้อยกว่า $1 {{PLURAL:$1|ตัว|ตัว}}',
'email'                      => 'อีเมล',
'prefs-help-realname'        => 'ไม่จำเป็นต้องใส่ชื่อจริง โดยชื่อที่ใส่นั้นจะถูกใช้เพียงแค่แสดงผลงานที่คุณได้ร่วมสร้างไว้',
'loginerror'                 => 'ล็อกอินผิดพลาด',
'prefs-help-email'           => 'ไม่จำเป็นต้องใส่อีเมล โดยอีเมลที่ใส่จะถูกใช้ให้ผู้อื่นติดต่อผ่านทางอีเมล ซึ่งชื่ออีเมลนั้นจะไม่แสดงให้ผู้อื่นเห็น',
'prefs-help-email-required'  => 'ต้องการที่อยู่อีเมล',
'nocookiesnew'               => 'ชื่อบัญชีผู้ใช้ได้ถูกสร้างขึ้นแล้ว แต่ยังไม่ได้ล็อกอินเข้าสู่ {{SITENAME}} เนื่องจากว่าไม่ได้เปิดใช้คุกกี้ ถ้าต้องการล็อกอินให้เปิดใช้งานคุกกี้และทำการล็อกอินโดยใส่ชื่อผู้ใช้พร้อมรหัสผ่าน',
'nocookieslogin'             => '{{SITENAME}} ใช้คุกกี้สำหรับการล็อกอิน ขณะนี้คุกกี้ของคุณไม่เปิดใช้งาน กรุณาเปิดใช้งานและลองอีกครั้ง',
'noname'                     => 'คุณไม่ได้ใส่ชื่อผู้ใช้ที่ถูกต้อง',
'loginsuccesstitle'          => 'ล็อกอินสำเร็จ',
'loginsuccess'               => "'''ขณะนี้คุณล็อกอินเข้าสู่ {{SITENAME}} ด้วยชื่อ \"\$1\"'''",
'nosuchuser'                 => 'ไม่มีชื่อผู้ใช้ในชื่อ "$1" กรุณาตรวจการสะกดหรือสร้างบัญชีผู้ใช้ใหม่',
'nosuchusershort'            => 'ไม่มีชื่อผู้ใช้ในชื่อ "<nowiki>$1</nowiki>" กรุณาตรวจสอบการสะกด',
'nouserspecified'            => 'คุณต้องระบุชื่อผู้ใช้',
'wrongpassword'              => 'รหัสผ่านที่ใส่ไม่ถูกต้อง กรุณาลองใหม่',
'wrongpasswordempty'         => 'ยังไม่ได้ระบุรหัสผ่าน กรุณาลองใหม่',
'passwordtooshort'           => 'รหัสผ่านไม่ถูกต้องหรือสั้นเกินไป ซึ่งต้องมีอย่างน้อย {{PLURAL:$1|1 ตัวอักษร|$1 ตัวอักษร}} และแตกต่างจากชื่อผู้ใช้',
'mailmypassword'             => 'อีเมลรหัสผ่าน',
'passwordremindertitle'      => 'คำบอกรหัสผ่านจาก {{SITENAME}}',
'passwordremindertext'       => 'ใครบางคน (ซึ่งอาจจะเป็นคุณจากหมายเลขไอพี $1)
ได้ขอให้ส่งรหัสผ่านใหม่สำหรับ {{SITENAME}} ($4)
ปัจจุบันรหัสผ่านสำหรับชื่อผู้ใช้ "$2" คือ "$3"
แนะนำให้ทำการล็อกอินและเปลี่ยนรหัสผ่านตอนนี้

คุณอาจจะใช้รหัสผ่านเดิมได้ โดยถ้าคนที่ให้เปลี่ยนรหัสผ่านซึ่งไม่ใช่คุณ',
'noemail'                    => 'อีเมลไม่ได้ใส่ไว้สำหรับชื่อผู้ใช้ "$1"',
'passwordsent'               => 'รหัสผ่านใหม่ได้ถูกส่งไปที่อีเมลของผู้ใช้ "$1"
กรุณาล็อกอินหลังจากที่ได้อีเมล',
'blocked-mailpassword'       => 'หมายเลขไอพีของคุณได้ถูกบล็อกจากการแก้ไข ดังนั้นไม่สามารถใช้คำสั่งร้องขอรหัสผ่านได้เพื่อป้องกันปัญหาการก่อกวน',
'eauthentsent'               => 'อีเมลยืนยันได้ถูกส่งไปที่อีเมลที่ได้ถูกเสนอ ก่อนที่อีเมลจะถูกส่งไปที่ชื่อบัญชีนั้น คุณต้องปฏิบัติตามคำแนะนำในอีเมลเพื่อยืนยันว่าหมายเลยบัญชีนั้นเป็นของคุณ',
'throttled-mailpassword'     => 'ตัวเตือนรหัสผ่านได้ถูกส่งไปใน {{PLURAL:$1|1 ชั่วโมงที่ผ่านมา|$1 ชั่วโมงที่ผ่านมา}} ซึ่งตัวเตือนรหัสผ่านนี้จะถูกส่งได้หนึ่งครั้งต่อ {{PLURAL:$1|1 ชั่วโมง|$1 ชั่วโมง}} เท่านั้น เพื่อป้องกันปัญหาการก่อกวน',
'mailerror'                  => 'ไม่สามารถส่งอีเมลเนื่องจาก $1',
'acct_creation_throttle_hit' => 'ขออภัย คุณได้สร้างชื่อบัญชีแล้วทั้งหมด $1 ชื่อ และไม่สามารถสร้างได้มากกว่านี้',
'emailauthenticated'         => 'อีเมลของคุณได้ถูกยืนยันภายใต้ $1',
'emailnotauthenticated'      => 'อีเมลของคุณยังไม่ได้ถูกยืนยัน ดังนั้นคำสั่งพิเศษที่ใช้งานผ่านอีเมลยังไม่เปิดใช้งาน',
'noemailprefs'               => 'รับอีเมลตามเงื่อนไขพิเศษต่อไปนี้',
'emailconfirmlink'           => 'ยืนยันอีเมลของคุณ',
'invalidemailaddress'        => 'รูปแบบอีเมลไม่ถูกต้อง ให้ใส่อีเมลให้ถูกต้องตามรูปแบบอีเมล หรือให้ทำช่องอีเมลให้ว่างแทน',
'accountcreated'             => 'ชื่อบัญชีได้ถูกสร้างขึ้น',
'accountcreatedtext'         => 'ชื่อบัญชีสำหรับ $1 ได้ถูกสร้างขึ้นแล้ว',
'createaccount-title'        => 'สร้างบัญชีผู้ใช้สำหรับ {{SITENAME}}',
'createaccount-text'         => 'มีใครบางคนสร้างบัญชีผู้ใช้สำหรับที่อยู่อีเมลของคุณไว้บน {{SITENAME}} ($4) โดยใช้ชื่อบัญชีผู้ใช้ "$2" และรหัสผ่าน "$3" คุณควรล็อกอินเพื่อเปลี่ยนรหัสผ่านโดยทันที

ข้อความนี้อาจจะไม่สำคัญสำหรับคุณ หากการสร้างบัญชีผู้ใช้นี้เกิดจากความผิดพลาด',
'loginlanguagelabel'         => 'ภาษา: $1',

# Password reset dialog
'resetpass'               => 'ตั้งค่ารหัสผ่านใหม่',
'resetpass_announce'      => 'คุณล็อกอินผ่านรหัสอีเมลชั่วคราว คุณต้องใส่ค่ารหัสผ่านใหม่เพื่อเสร็จสิ้นขั้นตอนการล็อกอิน:',
'resetpass_header'        => 'เปลี่ยนรหัสผ่าน',
'resetpass_submit'        => 'ตั้งรหัสผ่านและล็อกอิน',
'resetpass_success'       => 'รหัสผ่านได้ถูกเปลี่ยนเรียบร้อย ขณะนี้กำลังล็อกอินให้คุณ...',
'resetpass_bad_temporary' => 'รหัสผ่านชั่วคราวไม่ถูกต้อง คุณอาจจะเปลี่ยนรหัสผ่านเรียบร้อยแล้วหรือขอรหัสผ่านชั่วคราวใหม่',
'resetpass_forbidden'     => 'ไม่อนุญาตให้เปลี่ยนรหัสผ่านสำหรับวิกินี้',
'resetpass_missing'       => 'ไม่มีแบบฟอร์มข้อมูล',

# Edit page toolbar
'bold_sample'     => 'ทำตัวหนา',
'bold_tip'        => 'ทำตัวหนา',
'italic_sample'   => 'ทำตัวเอียง',
'italic_tip'      => 'ทำตัวเอียง',
'link_sample'     => 'ลิงก์เชื่อมโยง',
'link_tip'        => 'ลิงก์ภายในเว็บ',
'extlink_sample'  => 'http://www.example.com ชื่อคำอธิบายลิงก์',
'extlink_tip'     => 'ลิงก์ไปที่อื่น (อย่าลืมใส่ http:// นำหน้าเสมอ)',
'headline_sample' => 'หัวข้อ',
'headline_tip'    => 'หัวข้อ',
'math_sample'     => 'ใส่สูตรที่นี่',
'math_tip'        => 'ใส่สูตรทางคณิตศาสตร์ (LaTeX)',
'nowiki_sample'   => 'ใส่ข้อความที่ไม่จัดรูปแบบ',
'nowiki_tip'      => 'ข้ามการจัดรูปแบบวิกิ',
'image_tip'       => 'ใส่ภาพ',
'media_tip'       => 'เชื่อมโยงไฟล์สื่อ',
'sig_tip'         => 'ลายเซ็นพร้อมลงเวลา',
'hr_tip'          => 'เส้นนอน',

# Edit pages
'summary'                          => 'คำอธิบายโดยย่อ',
'subject'                          => 'หัวข้อ',
'minoredit'                        => 'เป็นการแก้ไขเล็กน้อย',
'watchthis'                        => 'เฝ้าดูหน้านี้',
'savearticle'                      => 'บันทึก',
'preview'                          => 'แสดงตัวอย่าง',
'showpreview'                      => 'แสดงตัวอย่าง',
'showlivepreview'                  => 'แสดงตัวอย่างทันที',
'showdiff'                         => 'แสดงความเปลี่ยนแปลง',
'anoneditwarning'                  => "'''คำเตือน:''' หมายเลขไอพีของคุณจะถูกเก็บไว้ในส่วนประวัติของหน้านี้เนื่องจากคุณไม่ได้ล็อกอิน",
'missingsummary'                   => "'''อย่าลืม:''' คุณยังไม่ได้ระบุคำอธิบายการแก้ไขครั้งนี้ ถ้าคุณกดบันทึกไปส่วนคำอธิบายการแก้ไขนั้นจะว่างและไม่แสดงผล",
'missingcommenttext'               => 'กรุณาใส่ความเห็นด้านล่าง',
'missingcommentheader'             => "'''อย่าลืม:''' คุณยังไม่ได้ใส่หัวข้อ/จ่าหัวสำหรับความเห็นในครั้งนี้ ถ้าคุณกดบันทึกไปส่วนหัวข้อความเห็นจะว่างไม่แสดงผล",
'summary-preview'                  => 'ตัวอย่างคำอธิบายการแก้ไข',
'subject-preview'                  => 'ตัวอย่างหัวข้อ',
'blockedtitle'                     => 'ผู้ใช้ถูกห้ามใช้งาน',
'blockedtext'                      => "<big>'''ชื่อผู้ใช้หรือหมายเลขไอพีถูกของคุณถูกบล็อกการใช้งาน'''</big>

$1 เป็นผู้ดำเนินการบล็อกในครั้งนี้ โดยให้เหตุผลไว้ว่า ''$2''

* เริ่มการบล็อก: $8
* สิ้นสุดการบล็อก: $6
* ผู้ถูกบล็อก: $7

คุณสามารถติดต่อ $1 หรือ [[{{MediaWiki:Grouppage-sysop}}|ผู้ดูแลระบบ]]คนอื่นเพื่อหารือเกี่ยวกับการบล็อกนี้ หรือสามารถที่จะอีเมลผ่านระบบวิกิด้วยคำสั่ง 'อีเมลหาผู้ใช้นี้'
(ถ้าคุณได้ตั้งค่ารองรับการใช้คำสั่งพิเศษผ่านทางอีเมลในส่วน [[Special:Preferences|การตั้งค่าผู้ใช้]] และคุณไม่ได้ถูกบล็อกจากการใช้คำสั่งนี้)
หมายเลขไอพีปัจจุบันของคุณคือ $3 และหมายเลขการบล็อกคือ #$5 กรุณาระบุหมายเลขเหล่านี้ในการติดต่อผู้ดูแล",
'autoblockedtext'                  => 'หมายเลขไอพีของคุณถูกบล็อกโดยอัตโนมัติ เนื่องจากมีผู้ใช้อื่นใช้งานผ่านหมายเลขไอพีนี้มาก่อน ซึ่งถูกบล็อกโดย $1
เหตุผลที่ให้ไว้ในการบล็อกคือ:

:\'\'$2\'\'

* เริ่มการบล็อก: $8
* สิ้นสุดการบล็อก: $6
* ผู้ถูกบล็อกโดยเจตนา: $7

คุณอาจติดต่อ $1 หรือ[[{{MediaWiki:Grouppage-sysop}}|ผู้ดูแลระบบ]]คนอื่นเพื่อหารือเกี่ยวกับการบล็อกนี้

โปรดทราบว่าคุณอาจไม่สามารถใช้คำสั่ง "อีเมลหาผู้ใช้นี้" หากคุณไม่มีที่อยู่อีเมลที่ถูกต้อง ดังที่ลงทะเบียนไว้ใน[[Special:Preferences|การตั้งค่าผู้ใช้]] และไม่ถูกบล็อกจากการใช้คำสั่งนี้

หมายเลขไอพีปัจจุบันของคุณคือ $3 หมายเลขการบล็อกคือ #$5
กรุณาระบุรายละเอียดทั้งหมดข้างต้นในการร้องขอใดๆ ที่คุณกระทำ',
'blockednoreason'                  => 'ไม่ได้ให้เหตุผลไว้',
'blockedoriginalsource'            => "โค้ดของ '''$1''' แสดงผลด้านล่าง:",
'blockededitsource'                => "'''ข้อความที่คุณได้แก้ไข''' ใน '''$1''' แสดงผลด้านล่าง:",
'whitelistedittitle'               => 'ไม่อนุญาตให้แก้ไขถ้าไม่ล็อกอิน',
'whitelistedittext'                => 'คุณต้อง $1 เพื่อทำการแก้ไข',
'confirmedittitle'                 => 'ไม่อนุญาตให้แก้ไขถ้าไม่ได้ทำการยืนยันอีเมล',
'confirmedittext'                  => 'ไม่อนุญาตให้แก้ไขถ้าไม่ได้ทำการยืนยันอีเมล กรุณายืนยันอีเมลผ่านทาง [[Special:Preferences|การตั้งค่าผู้ใช้]]',
'nosuchsectiontitle'               => 'ไม่มีหัวข้อย่อย',
'nosuchsectiontext'                => 'ไม่สามารถแก้ไขหัวข้อย่อยได้ เนื่องจากหัวข้อย่อยที่ $1 ไม่มี',
'loginreqtitle'                    => 'จำเป็นต้องล็อกอิน',
'loginreqlink'                     => 'ล็อกอิน',
'loginreqpagetext'                 => 'ถ้าต้องการดูหน้าอื่น คุณต้อง $1',
'accmailtitle'                     => 'ส่งรหัสผ่านแล้ว',
'accmailtext'                      => 'รหัสผ่านสำหรับ "$1" ถูกส่งไปที่ $2',
'newarticle'                       => '(ใหม่)',
'newarticletext'                   => 'หน้านี้ยังไม่มีข้อความใด สามารถเริ่มสร้างหน้านี้โดยการพิมพ์ข้อความลงในกล่องด้านล่าง
(ดูเพิ่มเติมที่ [[{{MediaWiki:Helppage}}|หน้าคำอธิบาย]])
ถ้าไม่ต้องการสร้างให้กดปุ่ม ถอยหลัง (back) ที่เว็บเบราว์เซอร์',
'anontalkpagetext'                 => '----หน้านี้เป็นหน้าพูดคุยสำหรับผู้ใช้ที่ไม่ประสงค์ออกนามผู้ซึ่งยังไม่ได้สร้างบัญชีผู้ใช้ โดยทางเราจำเป็นต้องระบุผ่านทางหมายเลขไอพี อย่างไรก็ตามหมายเลขไอพีนี้ อาจจะเกิดจากจากผู้ใช้หลายคนก็ตาม ถ้าคุณเป็นผู้ไม่ประสงค์ออกนามและรู้สึกว่าข้อความความเห็นที่คุณได้รับไม่เกี่ยวข้องกับคุณแต่อย่างใด กรุณา[[Special:UserLogin|สร้างบัญชีผู้ใช้หรือทำการล็อกอิน]] เพื่อป้องกันการสับสนกับผู้ใช้ที่ไม่ล็อกอินรายอื่น',
'noarticletext'                    => 'ไม่มีข้อความในหน้านี้ ลอง[[Special:Search/{{PAGENAME}}|ค้นหา]]ในหน้าอื่นที่เกี่ยวข้อง หรืออาจจะ [{{fullurl:{{FULLPAGENAME}}|action=edit}} เริ่มสร้างหน้านี้]',
'userpage-userdoesnotexist'        => 'ไม่มีบัญชีผู้ใช้ "$1" อยู่ในสารบบ  กรุณาตรวจสอบให้แน่ใจว่าคุณต้องการสร้างหรือแก้ไขหน้านี้จริงๆ',
'clearyourcache'                   => "'''คำแนะนำ:''' หลังจากบันทึกผลแล้ว คุณอาจจะต้องล้างแคชเว็บเบราว์เซอร์ของคุณเพื่อดูผลการเปลี่ยนแปลง <br />
'''มอซิลลา / ไฟร์ฟอกซ์ / ซาฟารี:''' กดปุ่ม ''Shift'' ค้างไว้ขณะกดปุ่ม ''รีโหลด'' หรือกด  ''Ctrl-F5'' หรือกด ''Ctrl-R'' (''Command-R'' สำหรับเครื่องแมคอินทอช); <br />
'''คองเคอเรอร์:''' กดปุ่ม ''รีโหลด'' หรือกด ''F5;'' <br />
'''โอเปร่า:''' อาจต้องล้างแคชทั้งหมดผ่านเมนู ''Tools → Preferences;'' <br />
'''อินเทอร์เน็ตเอกซ์พลอเรอร์:''' กด  ''Ctrl'' ค้างไว้ขณะที่กดปุ่ม ''รีเฟรช'' หรือกด ''Ctrl-F5;''",
'usercssjsyoucanpreview'           => "<strong>คำแนะนำ:</strong> กดปุ่ม 'แสดงตัวอย่าง' เพื่อทดสอบสไตล์ชีตหรือจาวาสคริปต์ก่อนทำการบันทึก",
'usercsspreview'                   => "'''อย่าลืมว่าสไตล์ชีตยังไม่ได้ถูกบันทึก ขณะนี้แสดงเพียงตัวอย่างเท่านั้น!'''",
'userjspreview'                    => "'''อย่าลืมว่าจาวาสคริปต์ยังไม่ได้ถูกบันทึก ขณะนี้แสดงเพียงตัวอย่างเท่านั้น!'''",
'userinvalidcssjstitle'            => "'''คำเตือน:''' ไม่มีแบบหน้าตา \"\$1\" อย่าลืมว่าหน้า .css และ .js ที่ปรับแต่งเอง ใช้เป็นอักษรตัวพิมพ์เล็กทั้งหมด เช่น ใช้ {{ns:user}}:Foo/monobook.css แทนที่จะเป็น {{ns:user}}:Foo/Monobook.css",
'updated'                          => '(ปรับปรุงแล้ว)',
'note'                             => '<strong>คำแนะนำ:</strong>',
'previewnote'                      => '<strong>ตรงนี้เป็นการแสดงตัวอย่างเท่านั้น การเปลี่ยนแปลงยังไม่ได้ถูกบันทึก!</strong>',
'previewconflict'                  => 'การแสดงผลส่วนนี้เป็นตัวอย่างของการแก้ไขด้านบน  ถ้ากดบันทึกการแสดงผลจะแสดงในลักษณะนี้ทันที',
'session_fail_preview'             => '<strong>ขออภัย ไม่สามารถดำเนินการแก้ไขต่อได้ เนื่องจากข้อมูลเชื่อมต่อสูญหาย
ให้ทดลองแก้ไขอีกครั้งหนึ่ง ถ้ายังไม่สามารถทำได้ ให้ลองล็อกเอาต์และล็อกอินกลับมาอีกครั้ง</strong>',
'session_fail_preview_html'        => "<strong>ขออภัย ไม่สามารถดำเนินการแก้ไขต่อได้ เนื่องจากข้อมูลเชื่อมต่อสูญหาย</strong>

''เนื่องจาก {{SITENAME}} ใช้รูปแบบเอชทีเอ็มแอลล้วน การแสดงตัวอย่างจะถูกซ่อนไว้เพื่อป้องกันการโตมตีด้วยจาวาสคริปต์''

<strong>ถ้าการแก้ไขครั้งนี้ถูกต้อง ให้ทดลองแก้ไขอีกครั้งหนึ่ง ถ้ายังไม่สามารถทำได้ ให้ลอง[[Special:UserLogout|ล็อกเอาต์]]และล็อกอินกลับมาอีกครั้ง</strong>",
'token_suffix_mismatch'            => '<strong>การแก้ไขของคุณได้ถูกปฏิเสธ เนื่องจากเครื่องลูกข่ายที่คุณใช้อยู่ได้ขัดขวางรูปแบบเครื่องหมายวรรคตอนในการแก้ไข
ระบบไม่รับการแก้ไขของคุณเพื่อป้องกันความผิดพลาดของข้อมูล ปัญหานี้มักจะเกิดขึ้นถ้าคุณใช้พร็อกซีสำหรับผู้ไม่ประสงค์ออกนาม</strong>',
'editing'                          => 'กำลังแก้ไข $1',
'editingsection'                   => 'กำลังแก้ไข $1 (เฉพาะส่วน)',
'editingcomment'                   => 'กำลังแก้ไข $1 (ความเห็น)',
'editconflict'                     => 'แก้ไขชนกัน: $1',
'explainconflict'                  => "ใครบางคนได้เปลี่ยนแปลงหน้านี้ในขณะที่คุณกำลังแก้ไข
ข้อความส่วนบนเป็นข้อความปัจจุบันของหน้านี้ และส่วนล่างเป็นการแก้ไขของคุณ
คุณต้องทำการรวมการเปลี่ยนแปลงของคุณเข้ากับข้อความปัจจุบัน เพราะ'''ข้อความในส่วนบนเท่านั้น'''ที่จะถูกบันทึก เมื่อกดปุ่ม \"บันทึกหน้านี้\"",
'yourtext'                         => 'ข้อความของคุณ',
'storedversion'                    => 'รุ่นที่เก็บไว้',
'nonunicodebrowser'                => '<strong>คำเตือน: เว็บเบราว์เซอร์นี้ไม่สนับสนุนการใช้งานแบบยูนิโคด ตัวอักษรที่ไม่ใช่แบบแอสกีจะแสดงในกล่องการแก้ไขในลักษณะรหัสเลขฐานสิบหก</strong>',
'editingold'                       => '<strong>คำเตือน: ข้อมูลที่แก้ไขอยู่ไม่ใช่ข้อมูลใหม่ล่าสุดของหน้านี้ ถ้าทำการบันทึกไป การเปลี่ยนแปลงที่เกิดขึ้นระหว่างรุ่นนี้กับรุ่นใหม่จะสูญหาย</strong>',
'yourdiff'                         => 'ข้อแตกต่าง',
'copyrightwarning'                 => 'โปรดอย่าลืมว่างานเขียนทั้งหมดใน {{SITENAME}} ผู้เขียนทั้งหมดยินดีให้งานเก็บไว้ภายใต้สัญญาลิขสิทธิ์ $2 (ดู $1 สำหรับข้อมูลเพิ่มเติม)
ถ้าคุณไม่ต้องการให้งานของคุณถูกแก้ไข หรือไม่ต้องการให้งานเผยแพร่ตามที่ได้กล่าวไว้ อย่าส่งข้อความเข้ามาที่นี่<br />
นอกจากนี้แน่ใจว่าข้อความที่ส่งเข้ามาได้เขียนด้วยตัวเอง ไม่ได้คัดลอก หรือทำซ้ำจากแหล่งอื่น
<strong>อย่าส่งงานที่มีลิขสิทธิ์เข้ามาก่อนได้รับอนุญาตจากเจ้าของ!</strong>',
'copyrightwarning2'                => 'โปรดอย่าลืมว่างานเขียนทั้งหมดใน {{SITENAME}} อาจจะถูกแก้ไข ดัดแปลง หรือลบออกโดยผู้ร่วมเขียนคนอื่น
ถ้าคุณไม่ต้องการให้งานของคุณถูกแก้ไข หรือไม่ต้องการให้งานเผยแพร่ตามที่กล่าวไว้ อย่าส่งข้อความของคุณเข้ามาที่นี่<br />
นอกจากนี้คุณแน่ใจว่าข้อความที่ส่งเข้ามาคุณได้เขียนด้วยตัวเอง ไม่ได้คัดลอก ทำซ้ำส่วนหนึ่งส่วนใดหรือทั้งหมดจากแหล่งอื่น (ดูรายละเอียดที่ $1)
<strong>อย่าส่งงานที่มีลิขสิทธิ์เข้ามาก่อนได้รับอนุญาตจากเจ้าของ!</strong>',
'longpagewarning'                  => '<strong>คำเตือน: หน้านี้มีความยาว $1 กิโลไบต์ ซึ่งเว็บเบราว์เซอร์บางตัวอาจจะมีปัญหาในการแก้ไขหน้าที่ความยาวเกินกว่า 32 กิโลไบต์

ลองพิจารณาแบ่งหน้าออกเป็นหัวข้อย่อย</strong>',
'longpageerror'                    => '<strong>ผิดพลาด: ข้อความที่คุณส่งเข้ามามีขนาด $1 กิโลไบต์
ซึ่งเกินกว่าขนาดที่กำหนดไว้ที่ $2 กิโลไบต์ จึงไม่สามารถบันทึกได้</strong>',
'readonlywarning'                  => '<strong>คำเตือน: ขณะนี้ฐานข้อมูลถูกล็อกเพื่อบำรุงรักษา จึงไม่สามารถบันทึกข้อมูลที่แก้ไขได้ แนะนำให้คัดลอกไปเก็บไว้ที่อื่นก่อนแล้วนำมาบันทึกในเว็บไซต์นี้ภายหลัง</strong>',
'protectedpagewarning'             => '<strong>คำเตือน: หน้านี้ถูกล็อก และแก้ไขได้เฉพาะผู้ดูแลระบบเท่านั้น</strong>',
'semiprotectedpagewarning'         => "'''คำแนะนำ:''' หน้านี้ถูกล็อก และแก้ไขได้เฉพาะผู้ใช้ที่ลงทะเบียนเท่านั้น",
'cascadeprotectedwarning'          => "'''คำเตือน:''' หน้านี้ถูกล็อก และแก้ไขได้เฉพาะผู้ดูแลระบบเท่านั้น เนื่องจากหน้านี้สืบทอดการล็อกมาจากหน้า $1 ต่อไปนี้:",
'titleprotectedwarning'            => '<strong>คำเตือน:  หน้านี้ได้รับการป้องกันไว้ให้สร้างได้โดยผู้ใช้บางท่านเท่านั้น</strong>',
'templatesused'                    => 'แม่แบบที่ใช้ในหน้านี้:',
'templatesusedpreview'             => 'แม่แบบที่ใช้ในการแสดงตัวอย่าง:',
'templatesusedsection'             => 'แม่แบบที่ใช้ในส่วนนี้:',
'template-protected'               => '(ล็อก)',
'template-semiprotected'           => '(กึ่งล็อก)',
'hiddencategories'                 => 'หน้านี้มี {{PLURAL:$1|1 หมวดหมู่ที่ซ่อนอยู่|$1 หมวดหมู่ที่ซ่อนอยู่}} :',
'edittools'                        => '<!-- ข้อความนี้จะแสดงผลด้านใต้การแก้ไขและฟอร์มสำหรับอัปโหลด -->',
'nocreatetitle'                    => 'จำกัดการสร้างหน้าใหม่',
'nocreatetext'                     => 'เว็บไซต์นี้จำกัดการสร้างหน้าเว็บเพจใหม่
คุณสามารถทำการแก้ไขหน้าที่สร้างไว้แล้ว หรือ [[Special:UserLogin|ล็อกอินหรือสร้างบัญชีผู้ใช้]]',
'nocreate-loggedin'                => 'คุณไม่ได้รับสิทธิในการสร้างหน้าใหม่บน {{SITENAME}}.',
'permissionserrors'                => 'ข้อผิดพลาดในการใช้สิทธิ',
'permissionserrorstext'            => 'คุณไม่ได้รับสิทธิในการทำสิ่งนี้ตาม{{PLURAL:$1|เหตุผล|เหตุผล}}ต่อไปนี้ :',
'permissionserrorstext-withaction' => 'คุณไม่มีสิทธิในการ$2เนื่องใน{{PLURAL:$1|เหตุผล|เหตุผล}}ต่อไปนี้:',
'recreate-deleted-warn'            => "'''คำเตือน: กำลังสร้างหน้าใหม่ซึ่งก่อนหน้านี้ได้ถูกลบไปแล้ว'''

ลองพิจารณาว่าหน้านี้เหมาะสมในการสร้างใหม่หรือไม่ ลองตรวจสอบบันทึกการลบก่อนหน้า:",

# Parser/template warnings
'expensive-parserfunction-category'       => 'หน้าที่มีการเรียกใช้ฟังก์ชันแจงส่วนมากเกินไป',
'post-expand-template-inclusion-warning'  => 'คำเตือน: แม่แบบที่นำมารวมมีขนาดใหญ่เกินไป
แม่แบบบางหน้าจะไม่ถูกรวมเข้ามา',
'post-expand-template-inclusion-category' => 'หน้าที่มีแม่แบบที่รวมมาเกินขนาด',
'post-expand-template-argument-warning'   => 'คำเตือน: หน้านี้มีแม่แบบที่มีอาร์กิวเมนต์ขนาดใหญ่เกินไป อาร์กิวเมนต์เหล่านี้จะถูกละทิ้ง',
'post-expand-template-argument-category'  => 'หน้าที่มีแม่แบบซึ่งอาร์กิวเมนต์ถูกละทิ้ง',

# "Undo" feature
'undo-success' => 'การแก้ไขนี้สามารถย้อนกลับได้ กรุณาตรวจสอบข้อแตกต่างด้านล่างแน่ใจว่านี่คือสิ่งที่คุณต้องการทำ หลังจากนั้นให้ทำการบันทึกการเปลี่ยนแปลงที่แสดงผลด้านล่าง และกดบันทึกเพื่อเสร็จสิ้นขั้นตอน',
'undo-failure' => 'การแก้ไขนี้ไม่สามารถย้อนกลับได้ เนื่องจากขัดแย้งกับการแก้ไขปัจจุบัน',
'undo-norev'   => 'การแก้ไขนี้ไม่สามารถย้อนได้เพราะไม่มีหรือถูกลบแล้วในปัจจุบัน',
'undo-summary' => 'ย้อนการแก้ไขรุ่น $1 โดย [[Special:Contributions/$2|$2]] ([[User talk:$2|พูดคุย]])',

# Account creation failure
'cantcreateaccounttitle' => 'ไม่สามารถสร้างบัญชีผู้ใช้ได้',
'cantcreateaccount-text' => "การสร้างบัญชีผู้ใช้ใหม่ผ่านทางหมายเลขไอพีนี้ ('''$1''') ถูกระงับไว้โดย [[User:$3|$3]]

เหตุผลที่ $3 ให้ไว้ คือ ''$2''",

# History pages
'viewpagelogs'        => 'ดูบันทึกของหน้านี้',
'nohistory'           => 'ไม่มีประวัติการแก้ไขสำหรับหน้านี้',
'revnotfound'         => 'ไม่พบรุ่นการปรับปรุง',
'revnotfoundtext'     => 'ไม่พบรุ่นการปรับปรุงรุ่นเก่าที่ต้องการ กรุณาตรวจสอบยูอาร์แอลที่ใช้เข้ามายังหน้านี้',
'currentrev'          => 'รุ่นปัจจุบัน',
'revisionasof'        => 'การปรับปรุง เมื่อ $1',
'revision-info'       => 'การปรับปรุง เมื่อ $1 โดย $2',
'previousrevision'    => '←รุ่นก่อนหน้า',
'nextrevision'        => 'รุ่นถัดไป→',
'currentrevisionlink' => 'รุ่นปัจจุบัน',
'cur'                 => 'ป',
'next'                => 'ถัดไป',
'last'                => 'ก',
'page_first'          => 'แรกสุด',
'page_last'           => 'ท้ายสุด',
'histlegend'          => 'วิธีเปรียบเทียบ: เลือกปุ่มของรุ่นสองรุ่นที่ต้องการเปรียบเทียบ และกดปุ่มเริ่มเปรียบเทียบด้านล่าง<br />
คำอธิบาย: (ป) = เทียบกับรุ่นปัจจุบัน, (ก) = เทียบกับรุ่นก่อนหน้า, ล = การแก้ไขเล็กน้อย',
'deletedrev'          => '[ถูกลบ]',
'histfirst'           => 'แรกสุด',
'histlast'            => 'ท้ายสุด',
'historysize'         => '({{PLURAL:$1|1 ไบต์|$1 ไบต์}})',
'historyempty'        => '(ว่าง)',

# Revision feed
'history-feed-title'          => 'ประวัติการปรับปรุง',
'history-feed-description'    => 'ประวัติการปรับปรุงของหน้านี้ในวิกิ',
'history-feed-item-nocomment' => '$1 เมื่อ $2', # user at time
'history-feed-empty'          => 'หน้าที่ต้องการไม่มี มันอาจถูกลบหรือถูกเปลี่ยนชื่อไปแล้ว ให้ลอง
[[Special:Search|ค้นหาในวิกินี้]] สำหรับหน้าอื่นที่อาจเกี่ยวข้อง',

# Revision deletion
'rev-deleted-comment'         => '(ความเห็นถูกลบออก)',
'rev-deleted-user'            => '(ชื่อผู้ใช้ถูกลบออก)',
'rev-deleted-event'           => '(หน้าที่ใส่เข้ามาถูกลบออก)',
'rev-deleted-text-permission' => '<div class="mw-warning plainlinks">
รุ่นการปรับปรุงของหน้านี้ถูกลบออกจากการเข้าดูของผู้ใช้ทั่วไป อาจเข้าดูรายละเอียดได้ที่ [{{fullurl:Special:Log/delete|page={{FULLPAGENAMEE}}}} บันทึกการลบ]
</div>',
'rev-deleted-text-view'       => '<div class="mw-warning plainlinks">
รุ่นการปรับปรุงของหน้านี้ถูกลบออกจากการเข้าดูของผู้ใช้ทั่วไป สำหรับผู้ดูแลอาจเข้าดูรายละเอียดได้ที่ [{{fullurl:Special:Log/delete|page={{FULLPAGENAMEE}}}} บันทึกการลบ]
</div>',
'rev-delundel'                => 'แสดง/ซ่อน',
'revisiondelete'              => 'รุ่นการปรับปรุง การลบ/การย้อนการลบ',
'revdelete-nooldid-title'     => 'ไม่มีรุ่นการปรับปรุงที่ต้องการ',
'revdelete-nooldid-text'      => 'รุ่นการปรับปรุงที่ต้องการไม่ได้กำหนด ไม่สามารถใช้คำสั่งนี้ได้',
'revdelete-selected'          => '{{PLURAL:$2|รุ่นการปรับปรุงที่ถูกเลือก|รุ่นการปรับปรุงที่ถูกเลือก}}ของ [[:$1]] :',
'logdelete-selected'          => '{{PLURAL:$1|เหตุการณ์บันทึกที่ถูกเลือก|เหตุการณ์บันทึกที่ถูกเลือก}} :',
'revdelete-text'              => 'รุ่นการปรับปรุงที่ถูกลบและเหตุการณ์ยังคงปรากฏในส่วนประวัติของหน้าและบันทึกของหน้านี้ แต่ส่วนเนื้อหาไม่สามารถแสดงผลต่อผู้ใช้ทั่วไป

ผู้ดูแลระบบคนอื่นในวิกินี้สามารถเข้าดูเนื้อหาได้ และสามารถที่จะย้อนการลบกลับมาเป็นเหมือนเดิม เว้นเสียแต่ว่าจะมีการควบคุมอื่นถูกห้ามไว้',
'revdelete-legend'            => 'ระบุการควบคุม:',
'revdelete-hide-text'         => 'ซ่อนข้อความรุ่นที่ปรับปรุง',
'revdelete-hide-name'         => 'ซ่อนการกระทำและเป้าหมาย',
'revdelete-hide-comment'      => 'ซ่อนความเห็นการแก้ไข',
'revdelete-hide-user'         => 'ซ่อนชื่อผู้แก้ไขและหมายเลขไอพี',
'revdelete-hide-restricted'   => 'กำหนดการควบคุมนี้กับผู้ดูแลระบบเช่นเดียวกับผู้ใช้ทั่วไป',
'revdelete-suppress'          => 'ซ่อนข้อมูลจากผู้ดูแลระบบเช่นเดียวกับผู้ใช้ทั่วไป',
'revdelete-hide-image'        => 'ซ่อนเนื้อหาไฟล์',
'revdelete-unsuppress'        => 'ลบการควบคุมออกสำหรับรุ่นการปรับปรุงที่ถูกเรียกกลับ',
'revdelete-log'               => 'ความเห็นของบันทึก:',
'revdelete-submit'            => 'กำหนดต่อรุ่นการปรับปรุงที่ถูกเลือก',
'revdelete-logentry'          => 'เปลี่ยนแปลงสถานะการซ่อนรุ่นปรับปรุงของ [[$1]]',
'logdelete-logentry'          => 'การเข้าดูเหตุการณ์ที่ถูกเปลี่ยนของ [[$1]]',
'revdelete-success'           => 'การเข้าดูรุ่นปรับปรุงถูกกำหนดค่าเรียบร้อย',
'logdelete-success'           => 'การเข้าดูเหตุการณ์ถูกกำหนดค่าเรียบร้อย',
'revdel-restore'              => 'เปลี่ยนทัศนวิสัย',
'pagehist'                    => 'ประวัติหน้า',
'deletedhist'                 => 'ลบประวัติ',
'revdelete-content'           => 'เนื้อหา',
'revdelete-summary'           => 'คำอธิบายโดยย่อ',
'revdelete-uname'             => 'ชื่อผู้ใช้ :',
'revdelete-restricted'        => 'จำกัดให้เฉพาะผู้ดูแลระบบขั้นพื้นฐาน',
'revdelete-unrestricted'      => 'ยกเลิกการจำกัดให้เฉพาะผู้ดูแลระบบขั้นพื้นฐาน',
'revdelete-hid'               => 'ซ่อน $1',
'revdelete-unhid'             => 'แสดง $1',
'revdelete-log-message'       => '$1 สำหรับ $2 {{PLURAL:$2|รุ่น|รุ่น}}',
'logdelete-log-message'       => '$1 สำหรับ $2 {{PLURAL:$2|เหตุการณ์|เหตุการณ์}}',

# Suppression log
'suppressionlog' => 'บันทึกการระงับ',

# History merging
'mergehistory'                     => 'ประวัติการรวมหน้า',
'mergehistory-header'              => 'หน้านี้ไว้ให้คุณใช้รวมรุ่นต่างๆ ในประวัติการแก้ไขของหน้าต้นทาง ไปยังหน้าใหม่.
ก่อนดำเนินการ ควรให้แน่ใจก่อนว่าการดำเนินการนี้จะไม่ทำให้ความความต่อเนื่องของประวัติหน้าเก่าๆ เสียไป.',
'mergehistory-box'                 => 'รวมรุ่นต่างๆ ของหน้าทั้งสองเข้าด้วยกัน:',
'mergehistory-from'                => 'หน้าต้นทาง:',
'mergehistory-into'                => 'หน้าปลายทาง:',
'mergehistory-list'                => 'ประวัติการแก้ไขที่สามารถรวมได้',
'mergehistory-merge'               => 'รุ่นต่อไปนี้ของหน้า [[:$1]] สามารถรวมเข้าไปยังหน้า [[:$2]] ได้.  ให้เลือกกดปุ่มเพื่อรวมเฉพาะรุ่นที่สร้างนับตั้งแต่เวลาที่กำหนดขึ้นไป.  อย่าลืมว่าการใช้ลิงก์นำทาง (navigation link) จะไปล้างค่าในช่องนี้กลับเป็นค่าตั้งต้นเหมือนเดิม.',
'mergehistory-go'                  => 'แสดงการแก้ไขที่สามารถรวมได้',
'mergehistory-submit'              => 'รวมรุ่นต่างๆ',
'mergehistory-empty'               => 'ไม่มีรุ่นที่สามารถรวมได้.',
'mergehistory-success'             => '[[:$1]] จำนวน $3 {{PLURAL:$3|รุ่น|รุ่น}} ได้ถูกรวมเข้าไปยัง [[:$2]] เรียบร้อยแล้ว',
'mergehistory-fail'                => 'ไม่สามารถรวมประวัติการแก้ไขได้ โปรดตรวจสอบค่าตัวแปรของ หน้า และ เวลา อีกครั้ง',
'mergehistory-no-source'           => 'ไม่มีหน้าต้นทาง $1 อยู่ในสารบบ',
'mergehistory-no-destination'      => 'ไม่มีหน้าปลายทาง $1 อยู่ในสารบบ',
'mergehistory-invalid-source'      => 'หัวเรื่องของหน้าต้นทางต้องตรงตามข้อกำหนด (เช่น ไม่มีตัวอักษรที่ไม่สามารถใช้ในหัวเรื่องได้)',
'mergehistory-invalid-destination' => 'หัวเรื่องของหน้าปลายทางต้องตรงตามข้อกำหนด (เช่น ไม่มีตัวอักษรที่ไม่สามารถใช้ในหัวเรื่องได้)',
'mergehistory-autocomment'         => 'ย้าย [[:$1]] ไปยัง [[:$2]]',
'mergehistory-comment'             => 'ย้าย [[:$1]] ไปยัง [[:$2]]: $3',

# Merge log
'mergelog'           => 'ปูมการรวมหน้า',
'pagemerge-logentry' => 'ย้าย [[$1]] ไปยัง [[$2]] (รุ่นขึ้นอยู่กับ $3)',
'revertmerge'        => 'ยกเลิกการรวมหน้า',
'mergelogpagetext'   => 'ด้านล่างนี้แสดงรายการล่าสุดของการรวมประวัติหน้าหนึ่งๆ เข้ากับอีกหน้าหนึ่ง',

# Diffs
'history-title'           => 'ประวัติการแก้ไขหน้า "$1"',
'difference'              => '(ความแตกต่างระหว่างรุ่นปรับปรุง)',
'lineno'                  => 'แถว $1:',
'compareselectedversions' => 'เปรียบเทียบสองรุ่นที่เลือก',
'editundo'                => 'ย้อนกลับ',
'diff-multi'              => 'การปรับปรุง $1 รุ่นระหว่างกลางไม่แสดงผล',

# Search results
'searchresults'             => 'ค้นหา',
'searchresulttext'          => 'วิธีการค้นหาใน {{SITENAME}} ดูวิธีใช้งานเพิ่มที่ [[{{MediaWiki:Helppage}}|{{int:help}}]]',
'searchsubtitle'            => "ค้นหาเกี่ยวกับ '''[[:$1]]'''",
'searchsubtitleinvalid'     => "ค้นหาเกี่ยวกับ '''$1'''",
'noexactmatch'              => "'''ไม่พบหัวข้อ  \"\$1\"''' คุณอาจจะ [[:\$1|สร้างหน้าใหม่ในชื่อนี้]]",
'noexactmatch-nocreate'     => "'''ไม่มีหน้าหัวเรื่อง \"\$1\" อยู่ในสารบบ'''",
'toomanymatches'            => 'หัวข้อที่พบมีมากเกินไป กรุณาใช้คำค้นหาอื่น',
'titlematches'              => 'พบชื่อหัวข้อนี้',
'notitlematches'            => 'ไม่พบชื่อหัวข้อนี้',
'textmatches'               => 'พบคำนี้ในหน้า',
'notextmatches'             => 'ไม่พบข้อความในหน้า',
'prevn'                     => 'ก่อนหน้า $1',
'nextn'                     => 'ถัดไป $1',
'viewprevnext'              => 'ดู ($1) ($2) ($3)',
'search-result-size'        => '$1 ({{PLURAL:$2|1 คำ|$2 คำ}})',
'search-result-score'       => 'ความเกี่ยวข้อง : $1%',
'search-redirect'           => '(เปลี่ยนทาง $1)',
'search-section'            => '(ส่วน $1)',
'search-suggest'            => 'คุณอาจหมายถึง : $1',
'search-interwiki-caption'  => 'โครงการพี่น้อง',
'search-interwiki-default'  => '$1 ผลลัพธ์:',
'search-interwiki-more'     => '(มากกว่า)',
'search-mwsuggest-enabled'  => 'พร้อมคำแนะนำ',
'search-mwsuggest-disabled' => 'ไม่รวมคำแนะนำ',
'search-relatedarticle'     => 'สัมพันธ์',
'mwsuggest-disable'         => 'ยกเลิกการแนะนำในลักษณะเอแจ็กซ์',
'searchrelated'             => 'สัมพันธ์',
'searchall'                 => 'ทั้งหมด',
'showingresults'            => "แสดง $1 รายการ เริ่มต้นจากรายการที่ '''$2'''",
'showingresultsnum'         => "แสดง $3 รายการ เริ่มต้นจากรายการที่  '''$2'''",
'showingresultstotal'       => "แสดงด้านล่าง {{PLURAL:$3|ผลลัพธ์ '''$1''' จาก '''$3'''|ผลลัพธ์ '''$1 - $2''' จาก '''$3'''}}",
'nonefound'                 => "'''คำแนะนำ''': ค้นหาไม่พบอาจเนื่องจาก การค้นหาจากคำศัพท์ทั่วไป เช่นคำว่า \"ที่\" and \"ของ\" ไม่ได้ถูกเก็บไว้ในดัชนีคำค้นหา",
'powersearch'               => 'ค้นหาระดับสูง',
'powersearch-legend'        => 'ค้นหาระดับสูง',
'powersearch-ns'            => 'ค้นหาในเนมสเปซ:',
'powersearch-redir'         => 'รายการหน้าเปลี่ยนทาง',
'powersearch-field'         => 'ค้นหา',
'search-external'           => 'ค้นหาจากภายนอก',
'searchdisabled'            => 'ระบบการค้นหาใน {{SITENAME}} ไม่เปิดการใช้งาน คุณสามารถค้นหาในกูเกิลหรือเซิร์ชเอนจินอื่น โปรดจำไว้ว่าเนื้อหาของ {{SITENAME}} บนเซิร์ชเอนจินอาจเป็นข้อมูลเก่า',

# Preferences page
'preferences'              => 'ตั้งค่าส่วนตัว',
'mypreferences'            => 'ตั้งค่าส่วนตัว',
'prefs-edits'              => 'จำนวนการแก้ไข:',
'prefsnologin'             => 'ไม่ได้ล็อกอิน',
'prefsnologintext'         => 'ต้อง[[Special:UserLogin|ล็อกอิน]]ก่อนเพื่อจะตั้งค่าส่วนตัว',
'prefsreset'               => 'การตั้งค่าถูกตั้งเป็นค่าเริ่มต้น',
'qbsettings'               => 'แถบพิเศษ',
'qbsettings-none'          => 'ไม่มี',
'qbsettings-fixedleft'     => 'อยู่ทางซ้าย',
'qbsettings-fixedright'    => 'อยู่ทางขวา',
'qbsettings-floatingleft'  => 'ด้านซ้าย',
'qbsettings-floatingright' => 'ด้านขวา',
'changepassword'           => 'เปลี่ยนรหัสผ่าน',
'skin'                     => 'หน้าตา',
'math'                     => 'คณิตศาสตร์',
'dateformat'               => 'รูปแบบวันที่',
'datedefault'              => 'ค่าตั้งต้น',
'datetime'                 => 'วันและเวลา',
'math_failure'             => 'ส่งผ่านค่าไม่ได้',
'math_unknown_error'       => 'ข้อผิดพลาดที่ไม่ทราบ',
'math_unknown_function'    => 'คำสั่งที่ไม่ทราบ',
'math_lexing_error'        => 'การจำแนกสูตรผิดพลาด',
'math_syntax_error'        => 'ไวยากรณ์ผิดพลาด',
'math_image_error'         => 'การแปลงเป็นไฟล์ PNG ขัดข้อง กรุณาตรวจสอบการติดตั้ง LaTex, dvips, gs, และ convert',
'math_bad_tmpdir'          => 'ไม่สามารถเขียนค่าหรือสร้าง ลงไดเรกทอรีชั่วคราวสำหรับเก็บค่าทางคณิตศาสตร์ได้',
'math_bad_output'          => 'ไม่สามารถเขียนค่าหรือสร้าง ลงไดเรกทอรีปลายทางสำหรับเก็บค่าทางคณิตศาสตร์ได้',
'math_notexvc'             => 'เกิดข้อความผิดพลาด texvc ไม่พบ กรุณาตรวจสอบ math/README เพื่อตั้งค่า',
'prefs-personal'           => 'รายละเอียดผู้ใช้',
'prefs-rc'                 => 'ปรับปรุงล่าสุด',
'prefs-watchlist'          => 'รายการเฝ้าดู',
'prefs-watchlist-days'     => 'จำนวนวันที่แสดงในรายการเฝ้าดู:',
'prefs-watchlist-edits'    => 'จำนวนการแก้ไขที่แสดงในรายการเฝ้าดูที่เพิ่มเติมเข้ามา:',
'prefs-misc'               => 'เบ็ดเตล็ด',
'saveprefs'                => 'บันทึก',
'resetprefs'               => 'ตั้งค่าใหม่',
'oldpassword'              => 'รหัสผ่านเดิม:',
'newpassword'              => 'รหัสผ่านใหม่:',
'retypenew'                => 'พิมพ์รหัสผ่านใหม่อีกครั้ง:',
'textboxsize'              => 'แก้ไข',
'rows'                     => 'แถว:',
'columns'                  => 'คอลัมน์:',
'searchresultshead'        => 'ค้นหา',
'resultsperpage'           => 'รายการต่อหน้า:',
'contextlines'             => 'บรรทัดที่แสดงต่อรายการ:',
'contextchars'             => 'ตัวอักษรต่อบรรทัด:',
'stub-threshold'           => 'ขีดแบ่งสำหรับ <a href="#" class="stub">รูปแบบโครง</a> (ความยาวบทความ):',
'recentchangesdays'        => 'วันที่แสดงในปรับปรุงล่าสุด:',
'recentchangescount'       => 'จำนวนการแก้ไขที่แสดงในปรับปรุงล่าสุด:',
'savedprefs'               => 'การตั้งค่าของคุณได้ถูกบันทึกแล้ว',
'timezonelegend'           => 'เวลา',
'timezonetext'             => 'จำนวนชั่วโมงที่แตกต่างจากเวลาเซิร์ฟเวอร์ (UTC)',
'localtime'                => 'เวลาของคุณ',
'timezoneoffset'           => 'ความแตกต่าง¹',
'servertime'               => 'เวลาเซิร์ฟเวอร์',
'guesstimezone'            => 'เรียกค่าจากเว็บเบราว์เซอร์',
'allowemail'               => 'เปิดรับอีเมลจากผู้ใช้อื่น',
'prefs-searchoptions'      => 'ตัวเลือกในการค้นหา',
'prefs-namespaces'         => 'เนมสเปซ',
'defaultns'                => 'ค้นหาในเนมสเปซ (ค่าตั้งต้น):',
'default'                  => 'ค่าตั้งต้น',
'files'                    => 'ไฟล์',

# User rights
'userrights'                  => 'บริหารสิทธิผู้ใช้', # Not used as normal message but as header for the special page itself
'userrights-lookup-user'      => 'บริหารสิทธิผู้ใช้',
'userrights-user-editname'    => 'ใส่ชื่อผู้ใช้:',
'editusergroup'               => 'แก้ไขผู้ใช้',
'editinguser'                 => "กำลังแก้ไขสิทธิของผู้ใช้ '''[[User:$1|$1]]''' ([[User talk:$1|{{int:talkpagelinktext}}]] | [[Special:Contributions/$1|{{int:contribslink}}]])",
'userrights-editusergroup'    => 'แก้ไขผู้ใช้',
'saveusergroups'              => 'ตกลง',
'userrights-groupsmember'     => 'สมาชิกในกลุ่ม:',
'userrights-groups-help'      => 'คุณสามารถเปลี่ยนแปลงกลุ่มที่ผู้ใช้รายนี้อยู่ใน:
* กล่องที่ถูกเลือกหมายความว่าผู้ใช้อยู่ในกลุ่มนั้น
* กล่องที่ไม่ถูกเลือกหมายความว่าผู้ใช้ไม่ได้อยู่ในกลุ่มนั้น
* เครื่องหมาย * ชี้ว่าคุณไม่สามารถเอากลุ่มนั้นออกได้เมื่อใดก็ตามที่คุณเพิ่มกลุ่มนั้นไปแล้ว หรือ ในทำนองเดียวกัน',
'userrights-reason'           => 'สาเหตุการเปลี่ยน:',
'userrights-no-interwiki'     => 'คุณไม่ได้รับสิทธิในการแก้ไขสิทธิของผู้ใช้บนวิกิอื่นๆ',
'userrights-nodatabase'       => 'ไม่มีฐานข้อมูล $1 อยู่ หรือ ฐานข้อมูลอยู่บนเครื่องอื่น',
'userrights-nologin'          => 'คุณต้อง[[Special:UserLogin|ล็อกอิน]]ด้วยบัญชีผู้ใช้ที่เป็นผู้ดูแลสิทธิแต่งตั้ง จึงจะสามารถกำหนดสิทธิต่างๆ ของผู้ใช้ได้',
'userrights-notallowed'       => 'บัญชีผู้ใช้ของคุณไม่ได้รับสิทธิในการแก้ไขสิทธิของผู้ใช้',
'userrights-changeable-col'   => 'กลุ่มที่คุณสามารถเปลี่ยนได้',
'userrights-unchangeable-col' => 'กลุ่มที่คุณไม่สามารถเปลี่ยนได้',

# Groups
'group'               => 'กลุ่ม:',
'group-user'          => 'ผู้ใช้ใหม่',
'group-autoconfirmed' => 'ผู้ใช้ทั่วไป',
'group-bot'           => 'บอต',
'group-sysop'         => 'ผู้ดูแล',
'group-bureaucrat'    => 'ผู้ดูแลสิทธิแต่งตั้ง',
'group-all'           => '(ทั้งหมด)',

'group-user-member'          => 'ผู้ใช้ใหม่',
'group-autoconfirmed-member' => 'ผู้ใช้ทั่วไป',
'group-bot-member'           => 'บอต',
'group-sysop-member'         => 'ผู้ดูแล',
'group-bureaucrat-member'    => 'ผู้ดูแลสิทธิแต่งตั้ง',

'grouppage-user'          => '{{ns:project}}:ผู้ใช้',
'grouppage-autoconfirmed' => '{{ns:project}}:ผู้ใช้ทั่วไป',
'grouppage-bot'           => '{{ns:project}}:บอต',
'grouppage-sysop'         => '{{ns:project}}:ผู้ดูแล',
'grouppage-bureaucrat'    => '{{ns:project}}:ผู้ดูแลสิทธิแต่งตั้ง',

# Rights
'right-read'                 => 'อ่านหน้าต่าง ๆ',
'right-edit'                 => 'แก้ไขหน้า',
'right-createpage'           => 'สร้างหน้า (ที่ไม่ใช่หน้าอภิปราย)',
'right-createtalk'           => 'สร้างหน้าอภิปราย',
'right-createaccount'        => 'สร้างบัญชีผู้ใช้ใหม่',
'right-minoredit'            => 'ทำเครื่องหมายการแก้ไขเล็กน้อย',
'right-move'                 => 'ย้ายหน้า',
'right-move-subpages'        => 'ย้ายหน้าพร้อมกับหน้ารองด้วย',
'right-upload'               => 'อัปโหลดไฟล์',
'right-reupload'             => 'เซฟทับไฟล์เดิม',
'right-reupload-own'         => 'เขียนทับไฟล์เดิมที่อัปโหลดด้วยตนเอง',
'right-upload_by_url'        => 'อัปโหลดไฟล์จาก URL',
'right-autoconfirmed'        => 'แก้ไขหน้าที่ถูกกึ่งล็อก',
'right-writeapi'             => 'ใช้การเขียนเอพีไอ',
'right-delete'               => 'ลบหน้า',
'right-bigdelete'            => 'ลบหน้าที่มีประวัติหน้าขนาดใหญ่',
'right-deleterevision'       => 'ลบและเรียกคืนรุ่นที่เจาะจงของหน้าต่าง ๆ',
'right-deletedhistory'       => 'ดูรายการประวัติที่ถูกลบ โดยไม่มีข้อความที่เกี่ยวข้อง',
'right-browsearchive'        => 'ค้นหาหน้าที่ถูกลบ',
'right-undelete'             => 'เรียกคืนหน้า',
'right-suppressrevision'     => 'ดูและเรียกคืนรุ่นที่ซ่อนโดยผู้ดูแลระบบขั้นพื้นฐาน',
'right-suppressionlog'       => 'ดูบันทึกส่วนตัว',
'right-block'                => 'บล็อกผู้ใช้อื่น ๆ จากการแก้ไข',
'right-blockemail'           => 'บล็อกผู้ใช้จากการส่งอีเมล',
'right-hideuser'             => 'บล็อกผู้ใช้และซ่อนไม่ให้ผู้อื่นเห็น',
'right-ipblock-exempt'       => 'ผ่านการบล็อกหมายเลขไอพี บล็อกแบบอัตโนมัติ และบล็อกเป็นช่วง',
'right-proxyunbannable'      => 'ผ่านการบล็อกแบบอัตโนมัติของพร็อกซี',
'right-protect'              => 'เปลี่ยนระดับการล็อกและแก้ไขหน้าที่ถูกล็อก',
'right-editprotected'        => 'แก้ไขหน้าที่ถูกล็อก (ที่ไม่ล็อกแบบสืบทอด)',
'right-editinterface'        => 'แก้ไขอินเตอร์เฟซของผู้ใช้',
'right-editusercssjs'        => 'แก้ไข CSS และ JS ของผู้ใช้คนอื่น',
'right-rollback'             => 'ย้อนการแก้ไขของผู้ใช้ล่าสุดที่แก้ไขบางหน้าโดยเฉพาะอย่างรวดเร็ว',
'right-markbotedits'         => 'ทำเครื่องหมายการย้อนว่าเป็นการแก้ไขโดยบอต',
'right-noratelimit'          => 'ไม่มีผลกระทบจากการจำกัดสิทธิตามเวลา',
'right-import'               => 'นำเข้าหน้าจากวิกิอื่น',
'right-importupload'         => 'นำเข้าหน้าจากไฟล์ที่อัปโหลด',
'right-patrol'               => 'ทำเครื่องหมายการแก้ไขของผู้อื่นว่าตรวจสอบแล้ว',
'right-autopatrol'           => 'ตั้งให้การแก้ไขของตนเองว่าตรวจสอบแล้วโดยอัตโนมัติ',
'right-patrolmarks'          => 'ดูการเปลี่ยนแปลงล่าสุดของการทำเครื่องหมายตรวจสอบ',
'right-unwatchedpages'       => 'ดูรายชื่อของหน้าที่ไม่ถูกเฝ้าดูโดยผู้ใช้ใด ๆ',
'right-mergehistory'         => 'รวมประวัติการแก้ไขหน้า',
'right-userrights'           => 'แก้ไขสิทธิผู้ใช้ทั้งหมด',
'right-userrights-interwiki' => 'แก้ไขสิทธิของผู้ใช้อื่นบนวิกิอื่น',
'right-siteadmin'            => 'ล็อกและปลดล็อกฐานข้อมูล',

# User rights log
'rightslog'      => 'บันทึกการเปลี่ยนสิทธิผู้ใช้',
'rightslogtext'  => 'ส่วนนี้คือบันทึกการเปลี่ยนแปลงของสิทธิผู้ใช้',
'rightslogentry' => '$1 ถูกเปลี่ยนกลุ่มจาก $2 เป็น $3',
'rightsnone'     => '(ไม่มี)',

# Recent changes
'nchanges'                          => '$1 การเปลี่ยนแปลง',
'recentchanges'                     => 'ปรับปรุงล่าสุด',
'recentchangestext'                 => 'ในหน้านี้เป็นรายการล่าสุดที่มีการปรับปรุง',
'recentchanges-feed-description'    => 'ฟีดนี้แสดงการเปลี่ยนแปลงล่าสุด',
'rcnote'                            => "รายการด้านล่างคือการแก้ไข '''$1''' รายการในช่วง '''$2'''วันที่ผ่านมา ข้อมูล ณ วันที่ $5, $4",
'rcnotefrom'                        => "แสดงการเปลี่ยนแปลงตั้งแต่ '''$2''' (แสดง '''$1''' รายการ)",
'rclistfrom'                        => 'แสดงการเปลี่ยนแปลงตั้งแต่ $1',
'rcshowhideminor'                   => '$1การแก้ไขเล็กน้อย',
'rcshowhidebots'                    => '$1บอต',
'rcshowhideliu'                     => '$1ผู้ใช้ล็อกอิน',
'rcshowhideanons'                   => '$1ผู้ใช้ไม่ล็อกอิน',
'rcshowhidepatr'                    => '$1การตรวจตรา',
'rcshowhidemine'                    => '$1การแก้ไขของฉัน',
'rclinks'                           => 'แสดงการปรับปรุงล่าสุด $1 รายการ ในช่วง $2 วันที่ผ่านมา;<br />$3',
'diff'                              => 'ต่าง',
'hist'                              => 'ประวัติ',
'hide'                              => 'ซ่อน',
'show'                              => 'แสดง',
'minoreditletter'                   => 'ล',
'newpageletter'                     => 'ม',
'boteditletter'                     => 'บ',
'number_of_watching_users_pageview' => '[$1 คนเฝ้าดู]',
'rc_categories'                     => 'จำกัดเฉพาะหมวดหมู่ (แยกด้วย "|")',
'rc_categories_any'                 => 'ใดๆ',
'newsectionsummary'                 => '/* $1 */ หัวข้อใหม่',

# Recent changes linked
'recentchangeslinked'          => 'ปรับปรุงที่เกี่ยวโยง',
'recentchangeslinked-title'    => 'การปรับปรุงที่ "$1" โยงมา',
'recentchangeslinked-noresult' => 'ไม่มีการเปลี่ยนแปลงในหน้าที่ถูกโยงไป ในช่วงเวลาที่กำหนด',
'recentchangeslinked-summary'  => "หน้านี้แสดงรายการปรับปรุงล่าสุดของหน้าที่ถูกโยงไป (หรือไปยังหน้าต่าง ๆ ของหมวดหมู่ที่กำหนด) โดยหน้าที่อยู่ใน[[Special:Watchlist|รายการเฝ้าดู]]แสดงเป็น'''ตัวหนา'''",
'recentchangeslinked-page'     => 'ชื่อหน้า:',
'recentchangeslinked-to'       => 'แสดงการเปลี่ยนแปลงที่เชื่อมโยงมายังหน้านี้แทน',

# Upload
'upload'                      => 'อัปโหลด',
'uploadbtn'                   => 'อัปโหลด',
'reupload'                    => 'อัปโหลดใหม่',
'reuploaddesc'                => 'กลับไปสู่หน้าอัปโหลด',
'uploadnologin'               => 'ไม่ได้ล็อกอิน',
'uploadnologintext'           => 'ต้องทำการ[[Special:UserLogin|ล็อกอิน]]ก่อนถึงจะอัปโหลดไฟล์ได้',
'upload_directory_missing'    => 'ไดเรกทอรีสำหรับอัปโหลด ($1) หายไป และไม่สามารถสร้างขึ้นใหม่โดยเว็บเซิร์ฟเวอร์',
'upload_directory_read_only'  => 'ไม่สามารถเก็บข้อมูลในไดเรกทอรี ($1) ปัญหาเกิดที่เว็บเซิร์ฟเวอร์',
'uploaderror'                 => 'เกิดความขัดข้องในการอัปโหลด',
'uploadtext'                  => "กรุณาใช้แบบฟอร์มด้านล่างในการอัปโหลดไฟล์
สำหรับการดูหรือการค้นหาไฟล์ที่เคยอัปโหลดก่อนหน้านี้ ให้ไปที่[[Special:ImageList|รายชื่อไฟล์ที่ถูกอัปโหลด]] การอัปโหลดและการอัปโหลดซ้ำดูได้ที่[[Special:Log/upload|บันทึกการอัปโหลด]] และการลบไฟล์ดูได้ที่[[Special:Log/delete|บันทึกการลบ]]

ถ้าต้องการแทรกไฟล์ลงในหน้าหนึ่งๆ ให้ใช้คำสั่งหนึ่งในรูปแบบต่อไปนี้
* '''<tt><nowiki>[[</nowiki>{{ns:image}}<nowiki>:File.jpg]]</nowiki></tt>''' เพื่อใช้รูปขนาดเต็ม
* '''<tt><nowiki>[[</nowiki>{{ns:image}}<nowiki>:File.png|200px|thumb|left|ข้อความอธิบาย]]</nowiki></tt>''' เพื่อใช้รูปย่อขนาดกว้าง 200 พิกเซลในกล่องที่จัดชิดซ้าย โดยมี \"ข้อความอธิบาย\" เป็นคำบรรยายใต้ภาพ
* '''<tt><nowiki>[[</nowiki>{{ns:media}}<nowiki>:File.ogg]]</nowiki></tt>''' สำหรับการเชื่อมโยงไฟล์โดยตรง โดยไม่ปรากฏไฟล์นั้นออกมา",
'upload-permitted'            => 'ชนิดชองไฟล์ที่อนุญาตให้ใช้ได้: $1',
'upload-preferred'            => 'ชนิดของไฟล์ที่ควรใช้: $1',
'upload-prohibited'           => 'ชนิดของไฟล์ที่ไม่อนุญาตให้ใช้: $1',
'uploadlog'                   => 'บันทึกการอัปโหลด',
'uploadlogpage'               => 'บันทึกการอัปโหลด',
'uploadlogpagetext'           => 'รายการแสดงไฟล์ที่อัปโหลดล่าสุด',
'filename'                    => 'ชื่อไฟล์',
'filedesc'                    => 'รายละเอียดไฟล์',
'fileuploadsummary'           => 'รายละเอียดไฟล์:',
'filestatus'                  => 'สถานะลิขสิทธิ์:',
'filesource'                  => 'แหล่งที่มา:',
'uploadedfiles'               => 'ไฟล์ที่อัปโหลดแล้ว',
'ignorewarning'               => 'ทำการบันทึกไฟล์โดยไม่สนคำเตือน',
'ignorewarnings'              => 'ไม่สนคำเตือน',
'minlength1'                  => 'ชื่อไฟล์ต้องมีตัวอักษรอย่างน้อยหนึ่งตัวอักษร',
'illegalfilename'             => 'ชื่อไฟล์  "$1" มีตัวอักษรที่ไม่สามารถนำมาใช้ได้ กรุณาเปลี่ยนชื่อไฟล์และอัปโหลดอีกครั้งหนึ่ง',
'badfilename'                 => 'ชื่อไฟล์ถูกเปลี่ยนเป็น "$1"',
'filetype-badmime'            => 'ไม่อนุญาตให้อัปโหลดไฟล์ที่เป็นไมม์ชนิด "$1"',
'filetype-unwanted-type'      => "{{PLURAL:\$3|ไฟล์|ไฟล์}}ชนิด '''\".\$1\"''' เป็นไฟล์ที่ไม่สามารถอัปโหลดได้ ไฟล์ที่สามารถใช้ได้ ได้แก่ \$2",
'filetype-banned-type'        => "ไม่อนุญาตให้ใช้ไฟล์ชนิด '''\".\$1\"''' {{PLURAL:\$3|ชนิดของไฟล์|ชนิดของไฟล์}}ที่อนุญาตให้ใช้ได้คือ \$2",
'filetype-missing'            => 'นามสกุลไฟล์หายไป (เช่น ".jpg")',
'large-file'                  => 'ไฟล์ไม่ควรมีขนาดใหญ่กว่า $1 ไฟล์นี้มีขนาด $2',
'largefileserver'             => 'ไฟล์นี้มีขนาดใหญ่กว่าค่าที่อนุญาตให้ใช้ได้',
'emptyfile'                   => 'ไฟล์ที่อัปโหลดมาเหมือนไฟล์ว่าง อาจเกิดจากปัญหาพิมพ์ชื่อไฟล์ผิด กรุณาตรวจสอบไฟล์อีกครั้ง และแน่ใจว่าต้องการที่จะอัปโหลดไฟล์นี้',
'fileexists'                  => 'มีไฟล์ชื่อนี้อยู่แล้ว กรุณาตรวจสอบ <strong><tt>$1</tt></strong> หากคุณไม่แน่ใจว่าต้องการเปลี่ยนแปลงไฟล์นี้หรือไม่',
'filepageexists'              => 'หน้าคำอธิบายสำหรับไฟล์นี้ได้ถูกสร้างไว้แล้วที่ <strong><tt>$1</tt></strong> แต่ไฟล์ชื่อนี้ไม่มีอยู่ในปัจจุบัน สาระสำคัญที่คุณบันทึกจะไม่ปรากฏบนหน้าคำอธิบาย เพื่อให้สาระสำคัญปรากฏขึ้น คุณจำเป็นต้องแก้ไขด้วยตนเอง',
'fileexists-extension'        => 'ไฟล์ที่โหลดมีชื่อใกล้เคียง:<br />
ชื่อไฟล์ที่กำลังอัปโหลด: <strong><tt>$1</tt></strong><br />
ชื่อไฟล์ที่มีอยู่แล้ว: <strong><tt>$2</tt></strong><br />
กรุณาเลือกชื่อไฟล์ใหม่',
'fileexists-thumb'            => "<center>'''ภาพมีอยู่แล้ว'''</center>",
'fileexists-thumbnail-yes'    => 'ไฟล์นี้เหมือนจะเป็นภาพเดิมที่ถูกลดขนาดมา  กรุณาตรวจสอบ <strong><tt>$1</tt></strong><br />
ถ้าตรวจสอบแล้วและเป็นไฟล์เดียวกัน ไม่จำเป็นต้องอัปโหลดเพิ่ม',
'file-thumbnail-no'           => 'ชื่อไฟล์ที่เริ่มต้นด้วย <strong><tt>$1</tt></strong> เหมือนจะเป็นภาพที่ถูกลดขนาดมา ถ้ามีไฟล์ต้นฉบับแนะนำให้โหลดไฟล์ต้นฉบับ หรือไม่ก็แนะนำให้เปลี่ยนชื่อไฟล์',
'fileexists-forbidden'        => 'ไฟล์ภายใต้ชื่อนี้มีแล้วในระบบ กรุณาอัปโหลดโดยใช้ชื่อใหม่ [[Image:$1|thumb|center|$1]]',
'fileexists-shared-forbidden' => 'ไฟล์ภายใต้ชื่อนี้มีแล้วในระบบเก็บไฟล์ในส่วนกลาง กรุณาอัปโหลดใหม่โดยใช้ชื่อใหม่ [[Image:$1|thumb|center|$1]]',
'file-exists-duplicate'       => 'ไฟล์นี้ซ้ำกับ{{PLURAL:$1|ไฟล์|ไฟล์}}ต่อไปนี้:',
'successfulupload'            => 'อัปโหลดสำเร็จ',
'uploadwarning'               => 'คำเตือนการอัปโหลด',
'savefile'                    => 'บันทึกไฟล์',
'uploadedimage'               => '"[[$1]]" ถูกอัปโหลด',
'overwroteimage'              => 'อัปโหลดรุ่นใหม่ของ "[[$1]]"',
'uploaddisabled'              => 'อัปโหลดปิดการใช้งาน',
'uploaddisabledtext'          => 'การอัปโหลดไฟล์บนวิกินี้ถูกปิดการใช้งาน',
'uploadscripted'              => 'ไฟล์นี้มีส่วนประกอบของโค้ดเอชทีเอ็มแอลหรือสคริปต์ ซึ่งอาจก่อให้เกิดความผิดพลาดในการแสดงผลของเว็บเบราว์เซอร์',
'uploadcorrupt'               => 'ไฟล์ไม่สมบูรณ์หรือมีส่วนขยายไม่ถูกต้อง กรุณาตรวจสอบไฟล์และอัปโหลดใหม่',
'uploadvirus'                 => 'ไฟล์นี้มีไวรัส! รายละเอียด: $1',
'sourcefilename'              => 'ไฟล์ที่ต้องการ:',
'destfilename'                => 'ชื่อไฟล์ที่ต้องการ:',
'upload-maxfilesize'          => 'ขนาดไฟล์ที่ใหญ่ที่สุด : $1',
'watchthisupload'             => 'เฝ้าดูหน้านี้',
'filewasdeleted'              => 'ไฟล์ในชื่อนี้ได้ถูกอัปโหลดก่อนหน้าและถูกลบไปแล้ว กรุณาตรวจสอบ $1 ก่อนที่จะอัปโหลดใหม่อีกครั้ง',
'upload-wasdeleted'           => "'''คำเตือน: คุณกำลังจะอัปโหลดไฟล์ที่เคยถูกลบไปแล้ว'''

โปรดพิจารณาความเหมาะสมว่าจะยังอัปโหลดไฟล์นี้ต่อหรือไม่
นี่คือปูมการลบของไฟล์เพื่อประกอบการตัดสินใจ:",
'filename-bad-prefix'         => 'ไฟล์ที่คุณกำลังจะอัปโหลดเข้ามานี้มีชื่อที่ขึ้นต้นด้วย <strong>"$1"</strong> ซึ่งเป็นชื่อที่ไม่สื่อความหมายใดๆ (โดยปกติแล้วชื่อนี้จะถูกตั้งมาโดยกล้องถ่ายรูปดิจิทัล).  กรุณาตั้งชื่อไฟล์ใหม่ที่สื่อความหมายมากกว่าเดิม',

'upload-proto-error'      => 'โพรโทคอลไม่ถูกต้อง',
'upload-proto-error-text' => 'การอัปโหลดโดยตรงจากเว็บต้องการยูอาร์แอลที่ขึ้นต้นด้วย <code>http://</code> หรือ <code>ftp://</code>',
'upload-file-error'       => 'เกิดความผิดพลาดภายใน',
'upload-file-error-text'  => 'เกิดความผิดพลาดภายในจากปัญหาการสร้างไฟล์ชั่วคราวที่เซิร์ฟเวอร์ กรุณาติดต่อผู้ดูแลระบบ',
'upload-misc-error'       => 'เกิดปัญหาอัปโหลด',
'upload-misc-error-text'  => 'เกิดปัญหาระหว่างการอัปโหลด กรุณาตรวจสอบว่ายูอาร์แอลนั้นถูกต้อง ถ้ายังคงมีปัญหาให้ติดต่อผู้ดูแลระบบ',

# Some likely curl errors. More could be added from <http://curl.haxx.se/libcurl/c/libcurl-errors.html>
'upload-curl-error6'       => 'ไม่สามารถติดต่อยูอาร์แอลได้',
'upload-curl-error6-text'  => 'ยูอาร์แอลที่ใส่ค่ามาไม่สามารถติดต่อได กรุณาตรวจสอบอีกครั้งว่ายูอาร์แอลนั้นถูกต้อง และเว็บไซต์นั้นยังใช้งานได้ตามปกติ',
'upload-curl-error28'      => 'เวลาอัปโหลดถูกตัด',
'upload-curl-error28-text' => 'เว็บไซต์นี้ใช้เวลานานเกินไปในการเชื่อมต่อ กรุณาตรวจสอบว่าเว็บนี้ยังใช้งานได้ตามปกติ หรืออาจจะรอสักครู่แล้วลองอัปโหลดใหม่',

'license'            => 'ลิขสิทธิ์:',
'nolicense'          => 'ไม่ได้เลือก',
'license-nopreview'  => '(ไม่สามารถแสดงตัวอย่าง)',
'upload_source_url'  => ' (ยูอาร์แอลที่ถูกต้องและเข้าถึงได้โดยทั่วไป)',
'upload_source_file' => ' (ไฟล์จากคอมพิวเตอร์คุณ)',

# Special:ImageList
'imagelist-summary'     => 'หน้าพิเศษนี้แสดงไฟล์ทั้งหมดที่ถูกอัปโหลด
โดยปริยาย ไฟล์ที่ถูกอัปโหลดล่าสุด จะแสดงอยู่บนสุดของรายการไฟล์
คลิกที่คอมลัมน์บนสุดจะเปลี่ยนการจัดแยกประเภท',
'imagelist_search_for'  => 'ค้นหาชื่อภาพ:',
'imgfile'               => 'ไฟล์',
'imagelist'             => 'รายชื่อไฟล์',
'imagelist_date'        => 'วันที่',
'imagelist_name'        => 'ชื่อ',
'imagelist_user'        => 'ผู้ใช้',
'imagelist_size'        => 'ขนาด',
'imagelist_description' => 'คำอธิบาย',

# Image description page
'filehist'                       => 'ประวัติไฟล์',
'filehist-help'                  => 'กดเลือก วัน/เวลา เพื่อดูไฟล์ที่แสดงในวันนั้น',
'filehist-deleteall'             => 'ลบทั้งหมด',
'filehist-deleteone'             => 'ลบ',
'filehist-revert'                => 'ย้อน',
'filehist-current'               => 'ปัจจุบัน',
'filehist-datetime'              => 'วันที่/เวลา',
'filehist-user'                  => 'ผู้ใช้',
'filehist-dimensions'            => 'ขนาด',
'filehist-filesize'              => 'ขนาดไฟล์',
'filehist-comment'               => 'ความเห็น',
'imagelinks'                     => 'หน้าที่ใช้ภาพนี้',
'linkstoimage'                   => '{{PLURAL:$1|หน้า|หน้า}}ที่ลิงก์มายังไฟล์นี้:',
'nolinkstoimage'                 => 'ไม่มีหน้าที่ใช้ภาพนี้',
'morelinkstoimage'               => 'ดู[[Special:WhatLinksHere/$1|หน้าที่ลิงก์]]มายังไฟล์นี้เพิ่มเติม',
'redirectstofile'                => '{{PLURAL:$1|ไฟล์|$1 ไฟล์}}ดังต่อไปนี้เปลี่ยนทางมาที่ไฟล์นี้:',
'duplicatesoffile'               => '{{PLURAL:$1|ไฟล์|ไฟล์}}นี้ซ้ำกับไฟล์ดังต่อไปนี้:',
'sharedupload'                   => 'ไฟล์นี้เป็นไฟล์ที่ใช้ร่วมหลายโครงการ และอาจถูกใช้งานในโครงการอื่น',
'shareduploadwiki'               => 'กรุณาดู $1 สำหรับข้อมูลเพิ่มเติม',
'shareduploadwiki-desc'          => 'คำอธิบายสำหรับ $1 อยู่ด้านล่าง',
'shareduploadwiki-linktext'      => 'คำอธิบายไฟล์',
'shareduploadduplicate'          => 'ไฟล์นี้ซ้ำซ้อนกับ $1 จากที่เก็บส่วนรวม',
'shareduploadduplicate-linktext' => 'อีกไฟล์หนึ่ง',
'shareduploadconflict'           => 'ไฟล์นี้มีชื่อเดียวกันกับ $1 จากที่เก็บส่วนรวม',
'shareduploadconflict-linktext'  => 'อีกไฟล์หนึ่ง',
'noimage'                        => 'ไม่มีไฟล์ในชื่อนี้ สามารถที่จะ $1',
'noimage-linktext'               => 'อัปโหลดไฟล์',
'uploadnewversion-linktext'      => 'อัปโหลดรุ่นใหม่ของไฟล์นี้',
'imagepage-searchdupe'           => 'ค้นหาไฟล์ซ้ำซ้อน',

# File reversion
'filerevert'                => 'ย้อน $1',
'filerevert-legend'         => 'ย้อนไฟล์กลับ',
'filerevert-intro'          => '<span class="plainlinks">คุณกำลังย้อนไฟล์ \'\'\'[[Media:$1|$1]]\'\'\' ไปยัง [รุ่น $4 วันที่ $2, $3]</span>',
'filerevert-comment'        => 'ความเห็น:',
'filerevert-defaultcomment' => 'ย้อนไปรุ่น $1, $2',
'filerevert-submit'         => 'ย้อน',
'filerevert-success'        => '<span class="plainlinks">\'\'\'[[Media:$1|$1]]\'\'\' ถูกย้อนไปยัง [รุ่น $4 วันที่ $2, $3]</span>',
'filerevert-badversion'     => 'ไม่มีรุ่นก่อนหน้าของไฟล์นี้ในเวลาที่กำหนดไว้',

# File deletion
'filedelete'                  => 'ลบ $1',
'filedelete-legend'           => 'ลบไฟล์',
'filedelete-intro'            => "คุณกำลังลบ '''[[Media:$1|$1]]'''",
'filedelete-intro-old'        => "คุณกำลังลบ '''[[Media:$1|$1]]''' รุ่น [$4 $3, $2]",
'filedelete-comment'          => 'เหตุผลในการลบ:',
'filedelete-submit'           => 'ลบ',
'filedelete-success'          => "ลบไฟล์ '''$1''' เรียบร้อยแล้ว",
'filedelete-success-old'      => "ไฟล์ '''[[Media:$1|$1]]''' รุ่นเมื่อ $3, $2 ถูกลบเรียบร้อยแล้ว",
'filedelete-nofile'           => "ไม่มีไฟล์ '''$1'''",
'filedelete-nofile-old'       => "ไม่มี '''$1''' ตามคุณลักษณะที่กำหนด อยู่ในกรุ",
'filedelete-iscurrent'        => 'คุณกำลังพยายามลบรุ่นล่าสุดของไฟล์นี้  ก่อนลบกรุณาย้อนไฟล์กลับไปเป็นรุ่นที่เก่ากว่าก่อน',
'filedelete-otherreason'      => 'เหตุผลอื่นเพิ่มเติม:',
'filedelete-reason-otherlist' => 'เหตุผลอื่น',
'filedelete-reason-dropdown'  => '* เหตุผลทั่วไปของการลบ
** ละเมิดลิขสิทธิ์
** ไฟล์ซ้ำ',
'filedelete-edit-reasonlist'  => 'แก้ไขรายชื่อเหตุผลในการลบ',

# MIME search
'mimesearch'         => 'ค้นหาตามชนิดไมม์',
'mimesearch-summary' => 'หน้านี้แสดงไฟล์ตามการแบ่งของชนิดไมม์ (MIME) ของแต่ละไฟล์ ใส่ค่า: contenttype/subtype เช่น <tt>image/jpeg</tt>.',
'mimetype'           => 'ชนิดไมม์:',
'download'           => 'ดาวน์โหลด',

# Unwatched pages
'unwatchedpages' => 'หน้าที่ไม่มีการเฝ้าดู',

# List redirects
'listredirects' => 'รายการหน้าเปลี่ยนทาง',

# Unused templates
'unusedtemplates'     => 'แม่แบบไม่ได้ใช้',
'unusedtemplatestext' => 'หน้านี้แสดงรายการแม่แบบที่ไม่ได้ใช้งานในหน้าใดๆ  อย่าลืมที่จะตรวจสอบรายการหน้าที่ลิงก์มา ก่อนที่จะลบแม่แบบเหล่านี้',
'unusedtemplateswlh'  => 'ลิงก์มา',

# Random page
'randompage'         => 'สุ่มหน้า',
'randompage-nopages' => 'ไม่มีหน้าใดในเนมสเปซนี้',

# Random redirect
'randomredirect'         => 'สุ่มหน้าเปลี่ยนทาง',
'randomredirect-nopages' => 'ไม่มีหน้าเปลี่ยนทางในเนมสเปซนี้',

# Statistics
'statistics'             => 'สถิติ',
'sitestats'              => 'สถิติของ {{SITENAME}}',
'userstats'              => 'สถิติผู้ใช้',
'sitestatstext'          => "ปัจจุบันในวิกินี้ มีข้อมูลทั้งหมด  '''$2''' หน้า <br />ตัวเลขนี้ไม่รวมหน้าพูดคุย หน้าเปลี่ยนทาง และหน้าอื่นที่อาจไม่นับว่าเป็นหน้าที่สมบูรณ์
ซึ่งหากรวมทั้งหมด ในปัจจุบันจะมี '''$1''' หน้า

มีไฟล์ที่อัปโหลดทั้งหมด '''$8''' ไฟล์

มีการเข้าชม  '''$3''' ครั้ง และ  '''$4''' การแก้ไขตั้งแต่ {{SITENAME}} ได้เริ่มใช้งาน ซึ่งเฉลี่ยแล้วมีการแก้ไข '''$5''' ครั้งต่อหนึ่งหน้าหรือการเข้าชม '''$6''' ครั้งต่อหนึ่งการแก้ไข

ปัจจุบันมี[http://www.mediawiki.org/wiki/Manual:Job_queue งานในคิว]ทั้งหมด '''$7''' งาน",
'userstatstext'          => "มีผู้ลงทะเบียนทั้งหมด '''$1''' ชื่อ โดย'''$2''' (หรือ '''$4%''') มีสิทธิ $5",
'statistics-mostpopular' => 'หน้าที่มีการเข้าชมมากที่สุด',

'disambiguations'      => 'หน้าแก้ความกำกวม',
'disambiguationspage'  => 'Template:แก้กำกวม',
'disambiguations-text' => "หน้าต่อไปนี้เชื่อมโยงไปยัง '''หน้าแก้ความกำกวม''' ซึ่งควรแก้ไขลิงก์ให้เชื่อมโยงไปที่หน้าอื่นที่เหมาะสม<br />
หน้าใดที่เรียกใช้แม่แบบ [[MediaWiki:Disambiguationspage|แก้กำกวม]] หน้าเหล่านั้นจะถือเป็นหน้าแก้ความกำกวม",

'doubleredirects'            => 'หน้าเปลี่ยนทางซ้ำซ้อน',
'doubleredirectstext'        => 'ในแต่ละแถวด้านล่างแสดงลิงก์ไปยังการเปลี่ยนทางครั้งแรกและครั้งที่สองตามลำดับ และหน้าเป้าหมายที่ต้องการ ซึ่งควรแก้ไขการเปลี่ยนทางครั้งแรกเป็นหน้านั้น',
'double-redirect-fixed-move' => '[[$1]] ถูกเปลี่ยนชื่อแล้ว และเปลี่ยนทางไปยัง [[$2]]',
'double-redirect-fixer'      => 'Redirect fixer',

'brokenredirects'        => 'หน้าเปลี่ยนทางเสีย',
'brokenredirectstext'    => 'หน้าเปลี่ยนทางต่อไปนี้เชื่อมโยงไปยังหน้าที่ไม่มี:',
'brokenredirects-edit'   => '(แก้ไข)',
'brokenredirects-delete' => '(ลบ)',

'withoutinterwiki'         => 'หน้าที่ไม่มีลิงก์ข้ามภาษา',
'withoutinterwiki-summary' => 'หน้าต่อไปนี้ไม่มีลิงก์ข้ามไปภาษาอื่น',
'withoutinterwiki-legend'  => 'คำนำหน้า',
'withoutinterwiki-submit'  => 'แสดง',

'fewestrevisions' => 'หน้าที่มีการแก้ไขน้อย',

# Miscellaneous special pages
'nbytes'                  => '$1 ไบต์',
'ncategories'             => '$1 หมวดหมู่',
'nlinks'                  => '$1 ลิงก์',
'nmembers'                => '$1 หน้า',
'nrevisions'              => '$1 ครั้ง',
'nviews'                  => '$1 ครั้ง',
'specialpage-empty'       => 'ไม่มีหน้าที่เรียกดู',
'lonelypages'             => 'หน้าสุดทาง',
'lonelypagestext'         => 'หน้าต่อไปนี้ไม่มีหน้าใดเชื่อมโยงเข้ามาหา',
'uncategorizedpages'      => 'หน้าที่ไม่ได้จัดหมวดหมู่',
'uncategorizedcategories' => 'หมวดหมู่ที่ไม่ได้จัดหมวดหมู่',
'uncategorizedimages'     => 'ภาพที่ไม่ได้จัดหมวดหมู่',
'uncategorizedtemplates'  => 'แม่แบบที่ไม่ได้จัดหมวดหมู่',
'unusedcategories'        => 'หมวดหมู่ที่ไม่ได้ใช้',
'unusedimages'            => 'ไฟล์ไม่ได้ใช้',
'popularpages'            => 'หน้าที่มีการเข้าดูมาก',
'wantedcategories'        => 'หมวดหมู่ที่ต้องการ',
'wantedpages'             => 'หน้าที่ต้องการ',
'missingfiles'            => 'ไฟล์ที่หายไป',
'mostlinked'              => 'หน้าที่มีการลิงก์หามาก',
'mostlinkedcategories'    => 'หมวดหมู่ที่มีการโยงหามาก',
'mostlinkedtemplates'     => 'แม่แบบที่ใช้มาก',
'mostcategories'          => 'หน้าที่มีหมวดหมู่มาก',
'mostimages'              => 'ภาพที่ใช้มาก',
'mostrevisions'           => 'หน้าที่มีการแก้ไขมาก',
'prefixindex'             => 'ดัชนีคำนำหน้า',
'shortpages'              => 'หน้าสั้นมาก',
'longpages'               => 'หน้ายาวมาก',
'deadendpages'            => 'หน้าสุดทาง',
'deadendpagestext'        => 'หน้าต่อไปนี้ไม่ได้ลิงก์ไปหน้าหน้าใดในวิกิ',
'protectedpages'          => 'หน้าถูกล็อก',
'protectedpages-indef'    => 'การล็อกแบบไม่จำกัดเท่านั้น',
'protectedpagestext'      => 'หน้าต่อไปนี้ถูกล็อกห้ามแก้ไขหรือห้ามเปลี่ยนชื่อ',
'protectedpagesempty'     => 'ไม่มีหน้าใดที่ถูกล็อกตามค่าที่เลือก',
'protectedtitles'         => 'หัวเรื่องที่ได้รับการป้องกัน',
'protectedtitlestext'     => 'หัวเรื่องต่อไปนี้ได้รับการป้องกันไม่ให้สร้างใหม่',
'protectedtitlesempty'    => 'ปัจจุบันไม่มีหัวเรื่องที่ได้รับการป้องกันด้วยค่าต่อไปนี้',
'listusers'               => 'รายนามผู้ใช้',
'newpages'                => 'หน้าใหม่',
'newpages-username'       => 'ชื่อผู้ใช้:',
'ancientpages'            => 'หน้าที่ไม่ได้แก้ไขนานสุด',
'move'                    => 'เปลี่ยนชื่อ',
'movethispage'            => 'เปลี่ยนชื่อหน้านี้',
'unusedimagestext'        => '<p>คำแนะนำ: ภาพนี้อาจจะถูกใช้จากเว็บไซต์อื่น ซึ่งลิงก์มาภาพในหน้านี้โดยตรง </p>',
'unusedcategoriestext'    => 'หมวดหมู่ต่อไปนี้ยังมีอยู่ถึงแม้ว่าจะไม่มีว่าไม่มีหน้าไหนหรือบทความไหนใช้ส่วนนี้',
'notargettitle'           => 'ไม่พบหน้าปลายทาง',
'notargettext'            => 'ไม่ได้ใส่หน้าปลายทางหรือชื่อผู้ใช้ที่ต้องการใช้คำสั่งนี้',
'nopagetitle'             => 'ไม่มีหน้าเป้าหมายดังกล่าว',
'nopagetext'              => 'หน้าเป้าหมายที่คุณระบุไม่มีอยู่',
'pager-newer-n'           => '{{PLURAL:$1|ใหม่กว่า 1|ใหม่กว่า $1}}',
'pager-older-n'           => '{{PLURAL:$1|เก่ากว่า 1|เก่ากว่า $1}}',
'suppress'                => 'ความผิดพลาดที่ไม่ทันสังเกต',

# Book sources
'booksources'               => 'ค้นหาหนังสือ',
'booksources-search-legend' => 'ค้นหาหนังสือ',
'booksources-go'            => 'ค้นหา',
'booksources-text'          => 'รายการด้านล่างแสดงเว็บไซต์ที่ขายหนังสือใหม่หรือหนังสือใช้แล้ว ซึ่งอาจมีข้อมูลของหนังสือที่คุณกำลังค้นหา:',

# Special:Log
'specialloguserlabel'  => 'ผู้ใช้:',
'speciallogtitlelabel' => 'ชื่อเรื่อง:',
'log'                  => 'บันทึก',
'all-logs-page'        => 'บันทึกทั้งหมด',
'log-search-legend'    => 'ค้นหาบันทึก',
'log-search-submit'    => 'ค้นหา',
'alllogstext'          => 'แสดงผลค่าที่บันทึกทั้งหมดของ {{SITENAME}} สามารถค้นหาให้แคบลงโดยเลือกชนิดของบันทึก ชื่อผู้ใช้ หรือลักษณะหน้าที่ต้องการ',
'logempty'             => 'ไม่มีในบันทึกก่อนหน้า',
'log-title-wildcard'   => 'ค้นหาคำหลากหลาย',

# Special:AllPages
'allpages'          => 'หน้าทุกหน้า',
'alphaindexline'    => '$1 ไป $2',
'nextpage'          => 'ถัดไป ($1)',
'prevpage'          => 'ก่อนหน้า ($1)',
'allpagesfrom'      => 'เริ่มแสดงผลจาก:',
'allarticles'       => 'หน้าทุกหน้า',
'allinnamespace'    => 'หน้าทุกหน้า ($1 เนมสเปซ)',
'allnotinnamespace' => 'หน้าทุกหน้า (ไม่อยู่ใน $1 เนมสเปซ)',
'allpagesprev'      => 'ก่อนหน้า',
'allpagesnext'      => 'ถัดไป',
'allpagessubmit'    => 'ค้นหา',
'allpagesprefix'    => 'แสดงหน้าที่ขึ้นต้นด้วย:',
'allpagesbadtitle'  => 'ชื่อเรื่องนี้ไม่ถูกต้อง อาจจะสะกดผิด ลิงก์มาจากภาษาอื่นที่ไม่ถูกต้อง หรือมีตัวอักษรที่ไม่สามารถใช้เป็นชื่อเรื่องได้',
'allpages-bad-ns'   => '{{SITENAME}} ไม่มีเนมสเปซในชื่อ "$1"',

# Special:Categories
'categories'                    => 'หมวดหมู่',
'categoriespagetext'            => 'หมวดหมู่ต่อไปนี้มีหน้าหรือสื่อต่างๆ
[[Special:UnusedCategories|หมวดหมู่ที่ไม่ได้ใช้]]จะไม่แสดงในที่นี้
ดูเพิ่มที่[[Special:WantedCategories|หมวดหมู่ที่ต้องการ]]',
'categoriesfrom'                => 'แสดงหมวดหมู่โดยเริ่มจาก:',
'special-categories-sort-count' => 'เรียงตามจำนวน',
'special-categories-sort-abc'   => 'เรียงลำดับตามตัวอักษร',

# Special:ListUsers
'listusersfrom'      => 'แสดงชื่อผู้ใช้เริ่มต้นจาก:',
'listusers-submit'   => 'แสดง',
'listusers-noresult' => 'ไม่พบผู้ใช้ที่ต้องการ',

# Special:ListGroupRights
'listgrouprights'          => 'สิทธิกลุ่มผู้ใช้งาน',
'listgrouprights-summary'  => 'รายชื่อกลุ่มผู้ใช้ต่อไปนี้ถูกกำหนดไว้บน {{SITENAME}} โดยมีสิทธิการเข้าถึงที่เกี่ยวข้อง และอาจมี[[{{MediaWiki:Listgrouprights-helppage}}|ข้อมูลเพิ่มเติม]]เกี่ยวกับสิทธิของแต่ละบุคคล',
'listgrouprights-group'    => 'กลุ่ม',
'listgrouprights-rights'   => 'สิทธิ',
'listgrouprights-helppage' => 'Help:สิทธิของกลุ่ม',
'listgrouprights-members'  => '(รายชื่อสมาชิก)',

# E-mail user
'mailnologin'     => 'ไม่มีการส่งอีเมล',
'mailnologintext' => 'ต้องการทำ[[Special:UserLogin|ล็อกอิน]]และตั้งค่าอีเมลในส่วน[[Special:Preferences|การตั้งค่า]] เพื่อจะส่งอีเมลหาผู้ใช้คนอื่น',
'emailuser'       => 'ส่งอีเมลหาผู้ใช้นี้',
'emailpage'       => 'อีเมลผู้ใช้',
'emailpagetext'   => 'ถ้าผู้ใช้คนนี้ได้ตั้งค่าอีเมลในส่วนการตั้งค่าส่วนตัว ข้อความด้านล่างจะถูกส่งผ่านไปที่อีเมลผู้รับ โดยอีเมลของคุณจะแสดงผลในส่วน "อีเมลจาก" ซึ่งสามารถให้ผู้รับตอบกลับได้',
'usermailererror' => 'การส่งอีเมลผิดพลาด:',
'defemailsubject' => '{{SITENAME}} อีเมล',
'noemailtitle'    => 'ไม่ได้ตั้งอีเมล',
'noemailtext'     => 'ผู้ใช้นี้ไม่ได้ตั้งค่าอีเมล หรือเลือกที่จะไม่รับอีเมลจากผู้อื่น',
'emailfrom'       => 'จาก:',
'emailto'         => 'ถึง:',
'emailsubject'    => 'หัวเรื่อง:',
'emailmessage'    => 'ข้อความ:',
'emailsend'       => 'ส่ง',
'emailccme'       => 'ส่งอีเมลสำเนากลับมา',
'emailccsubject'  => 'ส่งข้อความซ้ำไปที่$1: $2',
'emailsent'       => 'อีเมลได้ถูกส่งเรียบร้อย',
'emailsenttext'   => 'อีเมลได้ถูกส่งเรียบร้อย',
'emailuserfooter' => 'อีเมลฉบับนี้ถูกส่งโดย $1 ถึง $2 ด้วยฟังก์ชัน "อีเมลผู้ใช้รายนี้" ที่ {{SITENAME}}',

# Watchlist
'watchlist'            => 'รายการเฝ้าดู',
'mywatchlist'          => 'รายการเฝ้าดู',
'watchlistfor'         => "(สำหรับ '''$1''')",
'nowatchlist'          => 'ไม่ได้ใส่หน้าไหนเข้ารายการเฝ้าดู',
'watchlistanontext'    => 'กรุณา $1 เพื่อที่จะดูหรือแก้ไขหน้าในรายการเฝ้าดู',
'watchnologin'         => 'ไม่ได้ล็อกอิน',
'watchnologintext'     => 'ต้อง[[Special:UserLogin|ล็อกอิน]]เพื่อที่จะแก้ไขรายการเฝ้าดู',
'addedwatch'           => 'ถูกใส่เข้ารายการเฝ้าดู',
'addedwatchtext'       => 'หน้า "[[:$1]]" ถูกใส่เข้าไปใน[[Special:Watchlist|รายการเฝ้าดู]]ของคุณ ถ้ามีการเปลี่ยนแปลงเกิดขึ้นในหน้าเหล่านี้ รวมถึงหน้าพูดคุยของหน้านี้
รายชื่อหน้าจะแสดงเป็นตัวหนาในส่วนของ[[Special:RecentChanges|หน้าการเปลี่ยนแปลงล่าสุด]]เพื่อให้โดดเด่นเป็นที่สังเกต
ถ้าไม่ต้องการเฝ้าดูให้กดที่  "เลิกเฝ้าดู" ในส่วนของเมนู',
'removedwatch'         => 'ถูกนำออกจากรายการเฝ้าดู',
'removedwatchtext'     => 'หน้า "[[:$1]]"ถูกนำออกจากรายการเฝ้าดู',
'watch'                => 'เฝ้าดู',
'watchthispage'        => 'เฝ้าดูหน้านี้',
'unwatch'              => 'เลิกเฝ้าดู',
'unwatchthispage'      => 'เลิกเฝ้าดูหน้านี้',
'notanarticle'         => 'ไม่ใช่หน้าเนื้อหา',
'notvisiblerev'        => 'รุ่นดังกล่าวถูกลบเรียบร้อยแล้ว',
'watchnochange'        => 'ไม่มีการแก้ไขในรายการเฝ้าดูในช่วงเวลาที่กำหนด',
'watchlist-details'    => '$1 หน้าที่เฝ้าดูไม่รวมหน้าพูดคุย',
'wlheader-enotif'      => '* แจ้งเตือนผ่านอีเมลถูกเปิดใช้งาน',
'wlheader-showupdated' => "* หน้าที่ถูกเปลี่ยนแปลงตั้งแต่การใช้งานครั้งล่าสุดแสดงใน'''ตัวหนา'''",
'watchmethod-recent'   => 'ตรวจสอบการปรับปรุงล่าสุดกับหน้าเฝ้าดู',
'watchmethod-list'     => 'ตรวจสอบหน้าเฝ้าดูกับการแก้ไขล่าสุด',
'watchlistcontains'    => 'รายการเฝ้าดูของคุณมี $1 หน้า',
'iteminvalidname'      => "เกิดปัญหาชื่อไม่ถูกต้องกับ '$1'...",
'wlnote'               => 'ด้านล่างเป็นการแก้ไข $1 รายการ ในช่วง $2 ชั่วโมงที่ผ่านมา',
'wlshowlast'           => 'แสดงล่าสุดใน $1 ชั่วโมง $2 วัน $3',
'watchlist-show-bots'  => 'แสดงการแก้ไขของบอต',
'watchlist-hide-bots'  => 'ซ่อนการแก้ไขของบอต',
'watchlist-show-own'   => 'แสดงการแก้ไขของฉัน',
'watchlist-hide-own'   => 'ซ่อนการแก้ไขของฉัน',
'watchlist-show-minor' => 'แสดงการแก้ไขเล็กน้อย',
'watchlist-hide-minor' => 'ซ่อนการแก้ไขเล็กน้อย',

# Displayed when you click the "watch" button and it is in the process of watching
'watching'   => 'เฝ้าดู...',
'unwatching' => 'เลิกเฝ้าดู...',

'enotif_mailer'                => 'แจ้งการแก้ไขจาก {{SITENAME}}',
'enotif_reset'                 => 'กำหนดทุกหน้าว่าผ่านตาแล้ว',
'enotif_newpagetext'           => 'นี่คือหน้าใหม่',
'enotif_impersonal_salutation' => 'ผู้ใช้งาน {{SITENAME}}',
'changed'                      => 'ถูกเปลี่ยนแปลง',
'created'                      => 'ถูกสร้าง',
'enotif_subject'               => '{{SITENAME}} หน้า $PAGETITLE ได้ $CHANGEDORCREATED โดย $PAGEEDITOR',
'enotif_lastvisited'           => 'ดู $1 สำหรับการเปลี่ยนแปลงตั้งแต่ครั้งล่าสุดที่แวะมา',
'enotif_lastdiff'              => 'ดู $1 สำหรับดูการเปลี่ยนแปลง',
'enotif_anon_editor'           => 'ผู้ใช้ไม่ประสงค์ออกนาม $1',
'enotif_body'                  => 'เรียน $WATCHINGUSERNAME,


ทางระบบจากเว็บ {{SITENAME}} ต้องการแจ้งให้ทราบว่า หน้า $PAGETITLE ได้ $CHANGEDORCREATED เมื่อ $PAGEEDITDATE โดย $PAGEEDITOR ดูรุ่นปัจจุบันได้ที่ $PAGETITLE_URL

$NEWPAGE

คำสรุปการแก้ไข: $PAGESUMMARY $PAGEMINOREDIT

ติดต่อผู้แก้ไข:
อีเมล: $PAGEEDITOR_EMAIL
วิกิ: $PAGEEDITOR_WIKI

จะไม่มีการแจ้งเพิ่มเติมจนกระทั่งคุณได้เข้าแวะเข้าไปที่เว็บไซต์ นอกจากนี้คุณสามารถตั้งค่าการแจ้งของรายการเฝ้าดูใหม่ได้

ด้วยความเคารพอย่างสูง
ระบบแจ้งอัตโนมัติจาก {{SITENAME}}

--
ถ้าต้องการเปลี่ยนแปลงรายการเฝ้าดู ให้เข้าที่:
{{fullurl:{{ns:special}}:Watchlist/edit}}

ถ้าต้องการความช่วยเหลือเพิ่มเติม ให้เข้าที่:
{{fullurl:{{MediaWiki:Helppage}}}}',

# Delete/protect/revert
'deletepage'                  => 'ลบหน้า',
'confirm'                     => 'ยืนยัน',
'excontent'                   => "เนื้อหาเดิม: '$1'",
'excontentauthor'             => "เนื้อหาเดิม: '$1' (และมีผู้เขียนคนเดียว คือ '[[Special:Contributions/$2|$2]]')",
'exbeforeblank'               => "เนื้อหาเดิมก่อนหน้าถูกทำให้ว่าง: '$1'",
'exblank'                     => 'หน้าว่าง',
'delete-confirm'              => 'ลบ "$1"',
'delete-legend'               => 'ลบ',
'historywarning'              => 'คำเตือน: ดูประวัติก่อนหน้า:',
'confirmdeletetext'           => 'คุณกำลังจะลบหน้าหรือภาพนี้ รวมไปถึงประวัติหน้าออกจากระบบ
กรุณายืนยันว่าต้องการดำเนินการต่อและแน่ใจว่าได้เข้าใจและการลบครั้งนี้สอดคล้องกับ[[{{MediaWiki:Policy-url}}]]',
'actioncomplete'              => 'จัดการสำเร็จ',
'deletedtext'                 => '"<nowiki>$1</nowiki>" ถูกลบ
ดู $2 สำหรับบันทึกการลบล่าสุด',
'deletedarticle'              => '"[[$1]]" ถูกลบ',
'suppressedarticle'           => '"[[$1]]" ระงับแล้ว',
'dellogpage'                  => 'บันทึกการลบ',
'dellogpagetext'              => 'ด้านล่างเป็นรายการของการลบล่าสุด',
'deletionlog'                 => 'บันทึกการลบ',
'reverted'                    => 'ย้อนไปรุ่นก่อนหน้า',
'deletecomment'               => 'สาเหตุในการลบ',
'deleteotherreason'           => 'เหตุผลอื่นเพิ่มเติม:',
'deletereasonotherlist'       => 'เหตุผลอื่น',
'deletereason-dropdown'       => '* เหตุผลทั่วไปของการลบ
** รับแจ้งจากผู้เขียน
** ละเมิดลิขสิทธิ์
** ก่อกวน',
'delete-edit-reasonlist'      => 'แก้ไขรายชื่อเหตุผลในการลบ',
'delete-toobig'               => 'หน้านี้มีประวัติการแก้ไขมากเกินกว่า $1 {{PLURAL:$1|รุ่น|รุ่น}} ซึ่งถือว่าเยอะมาก เพื่อป้องกันไม่ให้ {{SITENAME}} ได้รับความเสียหายอย่างที่ไม่เคยคาดคิดมาก่อน จึงไม่อนุญาตให้ลบหน้านี้',
'delete-warning-toobig'       => 'หน้านี้มีประวัติการแก้ไขมากเกินกว่า $1 {{PLURAL:$1|รุ่น|รุ่น}} ซึ่งถือว่าเยอะมาก การลบหน้านี้อาจทำให้ {{SITENAME}} ได้รับความเสียหายอย่างที่ไม่เคยคาดคิดมาก่อน จึงได้เตือนไว้ ก่อนที่จะกระทำสิ่งนี้',
'rollback'                    => 'ย้อนการแก้ไข',
'rollback_short'              => 'ย้อน',
'rollbacklink'                => 'ย้อน',
'rollbackfailed'              => 'ย้อนไม่สำเร็จ',
'cantrollback'                => 'ไม่สามารถย้อนการแก้ไขได้ ก่อนหน้านี้ไม่มีผู้แก้ไขรายอื่น',
'alreadyrolled'               => 'ไม่สามารถย้อนการแก้ไข [[:$1]]
แก้โดย [[User:$2|$2]] ([[User talk:$2|พูดคุย]]) มีใครบางคนได้แก้ไขหรือย้อนไปก่อนหน้า

การแก้ไขล่าสุดจัดทำโดย [[User:$3|$3]] ([[User talk:$3|พูดคุย]])',
'editcomment'                 => 'ความเห็นโดย: "<i>$1</i>".', # only shown if there is an edit comment
'revertpage'                  => 'ย้อนการแก้ไขของ [[Special:Contributions/$2|$2]] ([[User talk:$2|Talk]]) ไปยังรุ่นของ [[User:$1|$1]]', # Additional available: $3: revid of the revision reverted to, $4: timestamp of the revision reverted to, $5: revid of the revision reverted from, $6: timestamp of the revision reverted from
'rollback-success'            => 'ย้อนการแก้ไขของ $1 ไปยังรุ่นของ $2',
'sessionfailure'              => 'ท่าทางจะมีปัญหาเกี่ยวการล็อกอินในช่วงเวลานี้ เกิดจากทางระบบป้องกันการลักลอบการขโมยล็อกอิน กรุณาย้อนกลับไปหน้าก่อนหน้า และลองโหลดใหม่อีกครั้ง',
'protectlogpage'              => 'บันทึกการล็อก',
'protectlogtext'              => 'รายการด้านล่างแสดงการล็อกหน้าและการปลดล็อก สำหรับหน้าที่โดนล็อกในปัจจุบันดูที่ [[Special:ProtectedPages|รายการหน้าที่ถูกล็อก]]',
'protectedarticle'            => '"[[$1]]" ถูกล็อก',
'modifiedarticleprotection'   => 'เปลี่ยนระดับการล็อกสำหรับ "[[$1]]"',
'unprotectedarticle'          => '"[[$1]]" ถูกปลดล็อก',
'protect-title'               => 'กำลังล็อกหน้า "$1"',
'protect-legend'              => 'ยืนยันการล็อก',
'protectcomment'              => 'ความเห็น:',
'protectexpiry'               => 'หมดอายุ:',
'protect_expiry_invalid'      => 'เวลาหมดอายุไม่ถูกต้อง',
'protect_expiry_old'          => 'เวลาหมดอายุผ่านมาแล้ว',
'protect-unchain'             => 'ล็อกการเปลี่ยนชื่อ',
'protect-text'                => 'ดูและเปลี่ยนระดับการล็อกสำหรับหน้า <strong><nowiki>$1</nowiki></strong>.',
'protect-locked-blocked'      => 'ไม่สามารถเปลี่ยนระดับการล็อกหน้าขณะที่ถูกบล็อกได้ ดูระดับการล็อกของหน้า <strong>$1</strong>:',
'protect-locked-dblock'       => 'ไม่สามารถเปลี่ยนระดับการล็อกหน้าได้เนื่องจากฐานข้อมูลถูกล็อก ดูระดับการล็อกของหน้า <strong>$1</strong>:',
'protect-locked-access'       => 'คุณไม่สามารถเปลี่ยนระดับการล็อกหน้าได้ เนื่องจากคุณไม่มีสิทธิ  ดูระดับการล็อกของหน้า <strong>$1</strong>:',
'protect-cascadeon'           => 'หน้านี้ถูกล็อกเนื่องจากเป็นส่วนหนึ่งของ{{PLURAL:$1|หน้า|หน้า}}ที่ถูกล็อกแบบสืบทอด
คุณสามารถเปลี่ยนระดับการล็อกได้ แต่จะไม่มีผลต่อการล็อกแบบสืบทอด',
'protect-default'             => 'ใช้ปกติ (ไม่บล็อก)',
'protect-fallback'            => 'จำเป็นต้องใช้สิทธิในการ "$1"',
'protect-level-autoconfirmed' => 'บล็อกผู้ใช้ไม่ลงทะเบียน',
'protect-level-sysop'         => 'ผู้ดูแลระบบแก้ไขเท่านั้น',
'protect-summary-cascade'     => 'สืบทอด',
'protect-expiring'            => 'หมดอายุ $1 (UTC)',
'protect-cascade'             => 'ล็อกหน้าที่เป็นส่วนหนึ่งของหน้านี้ (ล็อกแบบสืบทอด)',
'protect-cantedit'            => 'คุณไม่สามารถเปลี่ยนระดับการป้องกันของหน้านี้ เนื่องจากคุณไม่ได้รับสิทธิในการแก้ไขสิ่งนั้น',
'restriction-type'            => 'อนุญาต',
'restriction-level'           => 'ระดับการล็อก',
'minimum-size'                => 'ขนาดอย่างน้อย',
'maximum-size'                => 'ขนาดอย่างมาก',
'pagesize'                    => '(ไบต์)',

# Restrictions (nouns)
'restriction-edit'   => 'แก้ไข',
'restriction-move'   => 'เปลี่ยนชื่อ',
'restriction-create' => 'สร้าง',
'restriction-upload' => 'อัปโหลด',

# Restriction levels
'restriction-level-sysop'         => 'ล็อกเต็มที่',
'restriction-level-autoconfirmed' => 'ล็อกผู้ไม่ล็อกอิน',
'restriction-level-all'           => 'ระดับ',

# Undelete
'undelete'                     => 'เรียกคืน',
'undeletepage'                 => 'ดูและเรียกคืนหน้าที่ถูกลบ',
'undeletepagetitle'            => "'''ต่อไปนี้เป็นรุ่นการแก้ไขของ [[:$1|$1]] ที่ถูกลบ'''",
'viewdeletedpage'              => 'หน้าที่ถูกลบ',
'undeletepagetext'             => 'หน้าต่อไปนี้ถูกลบไปแล้ว แต่ยังคงอยู่ในกรุซึ่งสามารถเรียกคืนได้ (กรุข้อมูลอาจจะถูกลบเป็นระยะ)',
'undelete-fieldset-title'      => 'เรียกคืนรุ่นต่างๆ',
'undeleteextrahelp'            => "ถ้าต้องการเรียกคืนทั้งหมด  ให้กดปุ่ม '''''เรียกคืน'''''โดยไม่ต้องเลือกช่องใดช่องหนึ่ง ถ้าต้องการเรียกคืนประวัติเฉพาะส่วนใดส่วนหนึ่งให้เลือกเฉพาะส่วนที่ต้องการ  แล้วกด'''''เรียกคืน''''' ถ้ากด '''''ตั้งค่าใหม่''''' จะยกเลิกการเลือกใหม่",
'undeleterevisions'            => '$1 รุ่นการแก้ไขถูกเก็บไว้',
'undeletehistory'              => 'เมื่อคุณเรียกคืนหน้าใดหน้าหนึ่ง รุ่นการแก้ไขทั้งหมดจะถูกเรียกคืนไปยังประวัติ หากมีหน้าใหม่ในชื่อเดียวกันถูกสร้างขึ้นหลังจากการลบ รุ่นที่เรียกคืนจะปรากฏในช่วงประวัติที่มีมาก่อน',
'undeleterevdel'               => 'จะเรียกคืนไม่ได้ถ้ารุ่นในส่วนที่ใหม่ถูกลบไปบางส่วน ถ้าเกิดขึ้นในกรณีนี้ ต้องกดแสดงในส่วนใหม่ก่อน',
'undeletehistorynoadmin'       => 'หน้านี้ถูกลบก่อนหน้านี้ โดยสาเหตุการลบและรายชื่อผู้ร่วมแก้ไขก่อนหน้าแสดงผลด้านล่าง สำหรับข้อมูลที่ถูกลบจะดูได้เฉพาะผู้ดูแลระบบ',
'undelete-revision'            => 'รุ่นที่ถูกลบของหน้า $1 (ปรับปรุงเมื่อ $2) โดย $3:',
'undeleterevision-missing'     => 'รุ่นที่ต้องการดูไม่มี ข้อมูลอาจจะโดนลบ',
'undelete-nodiff'              => 'ไม่พบรุ่นก่อนหน้า',
'undeletebtn'                  => 'เรียกคืน',
'undeletelink'                 => 'เรียกคืน',
'undeletereset'                => 'ตั้งค่าใหม่',
'undeletecomment'              => 'ความเห็น:',
'undeletedarticle'             => 'เรียกคืน "[[$1]]"',
'undeletedrevisions'           => '$1 รุ่นการแก้ไขถูกเรียกคืน',
'undeletedrevisions-files'     => '$1 รุ่นการแก้ไข และ $2 ไฟล์ถูกเรียกคืน',
'undeletedfiles'               => '$1 ไฟล์ถูกเรียกคืน',
'cannotundelete'               => 'เรียกคืนไม่สำเร็จ อาจมีใครบางคนเรียกคืนหน้านั้นแล้ว',
'undeletedpage'                => "<big>'''$1 ถูกเรียกคืน'''</big>

ดูเพิ่มเติม [[Special:Log/delete|บันทึกการลบ]] สำหรับรายชื่อการลบและการเรียกคืนที่ผ่านมา",
'undelete-header'              => 'ดู [[Special:Log/delete|บันทึกการลบ]] สำหรับหน้าที่ถูกลบล่าสุด',
'undelete-search-box'          => 'ค้นหาหน้าที่ถูกลบ',
'undelete-search-prefix'       => 'ค้นหาหน้าที่เริ่มต้นด้วย:',
'undelete-search-submit'       => 'ค้นหา',
'undelete-no-results'          => 'ไม่พบหน้าที่ต้องการจากบันทึกการลบ',
'undelete-filename-mismatch'   => 'ไม่สามารถกู้คืนไฟล์ $1: ชื่อไฟล์ไม่ถูกต้อง',
'undelete-bad-store-key'       => 'ไม่สามารถกู้คืนไฟล์ $1: ไม่มีไฟล์ก่อนที่จะถูกลบ',
'undelete-cleanup-error'       => 'เกิดปัญหาการลบไฟล์เก่า "$1"',
'undelete-missing-filearchive' => 'ไม่สามารถกู้คืนไฟล์เก่ารุ่น $1 เพราะว่าไม่มีไฟล์อยู่ในฐานข้อมูล  ไฟล์อาจจะถูกกู้คืนไปก่อนหน้า',
'undelete-error-short'         => 'เกิดปัญหาในการกู้คืนไฟล์: $1',
'undelete-error-long'          => 'เกิดความผิดพลาดระหว่างการลบไฟล์:

$1',

# Namespace form on various pages
'namespace'      => 'เนมสเปซ:',
'invert'         => 'เลือกตรงข้าม',
'blanknamespace' => '(หลัก)',

# Contributions
'contributions' => 'เรื่องที่เขียนโดยผู้ใช้นี้',
'mycontris'     => 'เรื่องที่เขียน',
'contribsub2'   => 'สำหรับ $1 ($2)',
'nocontribs'    => 'ไม่มีการเปลี่ยนแปลงตามเงื่อนไขที่ใส่มา',
'uctop'         => ' (บนสุด)',
'month'         => 'จากเดือน (และก่อนหน้า):',
'year'          => 'จากปี (และก่อนหน้า):',

'sp-contributions-newbies'     => 'แสดงการแก้ไขของผู้ใช้ใหม่เท่านั้น',
'sp-contributions-newbies-sub' => 'สำหรับผู้ใช้ใหม่',
'sp-contributions-blocklog'    => 'บันทึกการบล็อก',
'sp-contributions-search'      => 'ค้นหาการแก้ไข',
'sp-contributions-username'    => 'หมายเลขไอพีหรือชื่อผู้ใช้:',
'sp-contributions-submit'      => 'ค้นหา',

# What links here
'whatlinkshere'            => 'หน้าที่ลิงก์มา',
'whatlinkshere-title'      => 'หน้าที่โยงมาที่ "$1"',
'whatlinkshere-page'       => 'หน้า:',
'linklistsub'              => '(หน้าที่ลิงก์มา)',
'linkshere'                => "หน้าต่อไปนี้ลิงก์มาที่ '''[[:$1]]''':",
'nolinkshere'              => "ไม่มีหน้าใดลิงก์มาที่ '''[[:$1]]'''",
'nolinkshere-ns'           => "ไม่มีหน้าใดลิงก์มาที่'''[[:$1]]''' ในเนมสเปซที่เลือกไว้",
'isredirect'               => 'หน้าเปลี่ยนทาง',
'istemplate'               => 'รวมอยู่',
'isimage'                  => 'ลิงก์ภาพ',
'whatlinkshere-prev'       => '{{PLURAL:$1|ก่อนหน้า|ก่อนหน้า $1 หน้า}}',
'whatlinkshere-next'       => '{{PLURAL:$1|ถัดไป|ถัดไป $1 หน้า}}',
'whatlinkshere-links'      => '← ลิงก์',
'whatlinkshere-hideredirs' => '$1 หน้าเปลี่ยนทาง',
'whatlinkshere-hidetrans'  => '$1 ถูกรวมอยู่',
'whatlinkshere-hidelinks'  => '$1 ลิงก์',
'whatlinkshere-hideimages' => '$1 ภาพที่ลิงก์',
'whatlinkshere-filters'    => 'ตัวกรอง',

# Block/unblock
'blockip'                     => 'บล็อกผู้ใช้',
'blockip-legend'              => 'บล็อกผู้ใช้',
'blockiptext'                 => 'ใช้ฟอร์มด้านล่างสำหรับการบล็อกหมายเลขไอพีหรือผู้ใช้ ซึ่งก่อกวนระบบ โดยแน่ใจว่าได้ทำตาม [[{{MediaWiki:Policy-url}}|นโยบาย]]
ใส่สาเหตุด้านล่าง (ตัวอย่าง หน้าที่ถูกก่อกวน)',
'ipaddress'                   => 'หมายเลขไอพี:',
'ipadressorusername'          => 'หมายเลขไอพีหรือชื่อผู้ใช้',
'ipbexpiry'                   => 'หมดอายุ',
'ipbreason'                   => 'สาเหตุ',
'ipbreasonotherlist'          => 'เลือกสาเหตุ',
'ipbreason-dropdown'          => '
*สาเหตุการบล็อกทั่วไป
** ใส่ข้อมูลเท็จ
** ลบเนื้อหาในหน้าออก
** ใส่ลิงก์สแปม
** ใส่ข้อความขยะเข้ามา
** คุกคามผู้อื่น
** ก่อกวนผู้อื่น
** ชื่อผู้ใช้ที่ไม่สุภาพหรือไม่ควรใช้',
'ipbanononly'                 => 'บล็อกผู้ใช้ไม่ล็อกอินเท่านั้น',
'ipbcreateaccount'            => 'ป้องกันการสร้างบัญชีผู้ใช้',
'ipbemailban'                 => 'ป้องกันผู้ใช้ส่งอีเมลผ่านระบบ',
'ipbenableautoblock'          => 'บล็อกหมายเลขไอพีนี้และไอพีที่ผู้ใช้นี้อาจจะใช้',
'ipbsubmit'                   => 'บล็อกชื่อผู้ใช้',
'ipbother'                    => 'เวลาอื่น',
'ipboptions'                  => '1 ชั่วโมง:1 hour,2 ชั่วโมง:2 hours,6 ชั่วโมง:6 hours,1 วัน:1 day,3 วัน:3 days,1 อาทิตย์:1 week,2 อาทิตย์:2 weeks,1 เดือน:1 month,3 เดือน:3 months,1 ปี:1 year,ตลอดไป:infinite', # display1:time1,display2:time2,...
'ipbotheroption'              => 'เลือกเวลา',
'ipbotherreason'              => 'เหตุผลอื่น',
'ipbhidename'                 => 'ซ่อน ชื่อผู้ใช้/หมายเลขไอพี จากบันทึกการบล็อก รายชื่อผู้ใช้ และรายการผู้ที่ถูกบล็อก',
'ipbwatchuser'                => 'ดูหน้าผู้ใช้และหน้าคุยกับผู้ใช้ของผู้ใช้รายนี้',
'badipaddress'                => 'หมายเลขไอพีไม่ถูกต้อง',
'blockipsuccesssub'           => 'บล็อกเรียบร้อย',
'blockipsuccesstext'          => '[[Special:Contributions/$1|$1]] ถูกบล็อก
<br />ดู  [[Special:IPBlockList|รายการไอพีที่ถูกบล็อก]] เพื่อตรวจสอบการบล็อก',
'ipb-edit-dropdown'           => 'แก้ไขสาเหตุการบล็อก',
'ipb-unblock-addr'            => 'เลิกบล็อก $1',
'ipb-unblock'                 => 'เลิกบล็อกผู้ใช้หรือหมายเลขไอพี',
'ipb-blocklist-addr'          => 'ดูการบล็อกปัจจุบันสำหรับ $1',
'ipb-blocklist'               => 'ดูการปล็อกปัจจุบัน',
'unblockip'                   => 'ปลดบล็อกผู้ใช้',
'unblockiptext'               => 'ใช้แบบฟอร์มด้านล่างสำหรับบล็อกหรือเลิกบล็อกหมายเลขไอพี หรือผู้ใช้',
'ipusubmit'                   => 'บล็อก',
'unblocked'                   => '[[User:$1|$1]] ถูกบล็อก',
'unblocked-id'                => 'เลิกบล็อก $1',
'ipblocklist'                 => 'หมายเลขไอพีและผู้ใช้ที่ถูกบล็อก',
'ipblocklist-legend'          => 'ค้นหาผู้ใช้ที่ถูกระงับการใช้งาน',
'ipblocklist-username'        => 'ชื่อผู้ใช้หรือหมายเลขไอพี:',
'ipblocklist-submit'          => 'ค้นหา',
'blocklistline'               => '$1, $2 บล็อก $3 ($4)',
'infiniteblock'               => 'ตลอดไป',
'expiringblock'               => 'หมดอายุ $1',
'anononlyblock'               => 'ไม่ล็อกอินเท่านั้น',
'noautoblockblock'            => 'ยกเลิกการบล็อกอัตโนมัติ',
'createaccountblock'          => 'บล็อกการสร้างบัญชีผู้ใช้ใหม่',
'emailblock'                  => 'บล็อกการส่งอีเมล',
'ipblocklist-empty'           => 'รายการบล็อกว่าง',
'ipblocklist-no-results'      => 'หมายเลขไอพีหรือชื่อผู้ใช้ที่ต้องการไม่ได้ถูกบล็อก',
'blocklink'                   => 'บล็อก',
'unblocklink'                 => 'เลิกบล็อก',
'contribslink'                => 'เรื่องที่เขียน',
'autoblocker'                 => 'ถูกบล็อกอัตโนมัติเนื่องจากหมายเลขไอพีของคุณตรงกับ "[[User:$1|$1]]" ถูกบล็อกกล่อนหน้านี้เนื่องจากสาเหตุ: "$2"',
'blocklogpage'                => 'บันทึกการบล็อก',
'blocklogentry'               => 'บล็อก "[[$1]]" หมดอายุ $2 $3',
'blocklogtext'                => 'ด้านล่างเป็นบันทึกการบล็อกและการเลิกบล็อก  ส่วนการบล็อกอัตโนมัติจะไม่ถูกรวมอยู่ในรายการนี้ ดู [[Special:IPBlockList|รายการบล็อกไอพี]] สำหรับการบล็อกทั้งหมด',
'unblocklogentry'             => 'เลิกบล็อก $1',
'block-log-flags-anononly'    => 'ผู้ใช้ไม่ล็อกอินเท่านั้น',
'block-log-flags-nocreate'    => 'ห้ามสร้างบัญชีผู้ใช้',
'block-log-flags-noautoblock' => 'ยกเลิกการบล็อกอัตโนมัติ',
'block-log-flags-noemail'     => 'บล็อกการส่งอีเมล',
'range_block_disabled'        => 'ยกเลิกการบล็อกช่วงไอพีของผู้ดูแลระบบ',
'ipb_expiry_invalid'          => 'ค่าวันหมดอายุไม่ถูกต้อง',
'ipb_already_blocked'         => '"$1" ถูกบล็อกแล้วก่อนหน้านี้',
'ipb_cant_unblock'            => 'ปัญหา: หมายเลขบล็อก $1 ไม่พบ อาจเกิดจากได้ถูกยกเลิกการบล็อกแล้ว',
'ipb_blocked_as_range'        => 'มีข้อผิดพลาด: หมายเลขไอพี $1 ไม่ได้ถูกระงับโดยตรงและไม่สามารถยกเลิกการระงับโดยตรงได้.  อย่างไรก็ตาม ไอพีนี้ถูกระงับในฐานะที่เป็นส่วนหนึ่งของหมายเลขไอพีในช่วง $2 ซึ่งสามารถยกเลิกการระงับได้',
'ip_range_invalid'            => 'ช่วงไอพีไม่ถูกต้อง',
'blockme'                     => 'บล็อกฉัน',
'proxyblocker'                => 'บล็อกพร็อกซี',
'proxyblocker-disabled'       => 'ฟังก์ชั่นนี้ไม่สามารถใช้ได้',
'proxyblockreason'            => 'หมายเลขไอพีของคุณถูกบล็อกเนื่องจากเป็นพร็อกซีเปิด กรุณาติดต่อผู้ให้บริการอินเทอร์เน็ตที่คุณใช้งานอยู่เกี่ยวกับปัญหานี้',
'proxyblocksuccess'           => 'บล็อกสำเร็จ',
'sorbsreason'                 => 'หมายเลขไอพีของคุณอยู่ในพร็อกซีเปิดในส่วน DNSBL ที่ถูกใช้งานในเว็บไซต์',
'sorbs_create_account_reason' => 'หมายเลขไอพีของคุณอยู่ในพร็อกซีเปิดในส่วน DNSBL ที่ถูกใช้งานในเว็บไซต์ ดังนั้นคุณไม่สามารถสร้างชื่อบัญชีผู้ใช้ได้',

# Developer tools
'lockdb'              => 'ล็อกฐานข้อมูล',
'unlockdb'            => 'ปลดล็อกฐานข้อมูล',
'lockdbtext'          => 'เมื่อล็อกฐานข้อมูลจะส่งผลให้ไม่สามารถแก้ไขทุกหน้า หรือแม้แต่เปลี่ยนแปลงการตั้งค่า ตรวจสอบให้แน่ใจว่าต้องการล็อกฐานข้อมูล และอย่าลืมปลดล็อกเมื่อตรวจสอบฐานข้อมูลเรียบร้อย',
'unlockdbtext'        => 'เมื่อปลดล็อกฐานข้อมูลจะส่งผลให้ ผู้ใช้สามารถเริ่มแก้ไขหน้าได้เหมือนเดิม รวมถึงการตั้งค่าทุกอย่าง ตรวจสอบให้แน่ใจว่าต้องการปลดล็อกฐานข้อมูล',
'lockconfirm'         => 'ยืนยัน ต้องการล็อกฐานข้อมูล',
'unlockconfirm'       => 'ยืนยัน ต้องการปลดล็อกฐานข้อมูล',
'lockbtn'             => 'ล็อกฐานข้อมูล',
'unlockbtn'           => 'ปลดล็อกฐานข้อมูล',
'locknoconfirm'       => 'ค่าาตัวเลือกไม่ได้ถูกเลือก',
'lockdbsuccesssub'    => 'ล็อกฐานข้อมูลเรียบร้อย',
'unlockdbsuccesssub'  => 'ปลดล็อกฐานข้อมูลเรียบร้อย',
'lockdbsuccesstext'   => 'ล็อกฐานข้อมูลเรียบร้อย
<br />อย่าลืมที่จะ [[Special:UnlockDB|ปลดล็อก]] เพื่อให้ใช้งานได้ตามปกติ',
'unlockdbsuccesstext' => 'ปลดล็อกฐานข้อมูลเรียบร้อย',
'lockfilenotwritable' => 'ไม่สามารถล็อกฐานข้อมูลได้ เนื่องจากการเขียนลงฐานข้อมูล การล็อกและการปลดล็อกจำเป็นต้องทำที่เว็บเซิร์ฟเวอร์',
'databasenotlocked'   => 'ฐานข้อมูลไม่ได้ล็อก',

# Move page
'move-page'               => 'ย้าย $1',
'move-page-legend'        => 'เปลี่ยนชื่อ',
'movepagetext'            => "ใช้แบบฟอร์มด้านล่างในการเปลี่ยนชื่อหน้า ซึ่งประวัติการแก้ไขของหน้านี้จะถูกย้ายตามไปด้วย
นอกจากนี้ชื่อของหน้าเดิมจะถูกเปลี่ยนเป็นหน้าเปลี่ยนทาง ซึ่งหน้าที่ลิงก์มายังหน้าเก่าจะลิงก์ต่อมาที่หน้าใหม่ แต่ยังคงที่ชื่อเดิม
อย่าลืมตรวจสอบหน้าเปลี่ยนทางซ้ำซ้อนที่อาจจะเกิดขึ้น

การเปลี่ยนชื่อจะ'''ไม่'''สามารถเปลี่ยนทับชื่อเดิมได้ หากหน้านั้นไม่ใช่หน้าว่างหรือหน้าเปลี่ยนทาง

<b>คำเตือน!</b>
การเปลี่ยนชื่อจะมีผลอย่างมากกับสถิติของหน้านิยมที่มีคนเข้าดูมาก ให้แน่ใจว่าต้องการเปลี่ยนชื่อในครั้งนี้",
'movepagetalktext'        => "หน้าพูดคุยของหน้านี้จะถูกเปลี่ยนชื่อตามไปด้วย '''เว้นเสียแต่:'''
*หน้าพูดคุยไม่ว่างมีแล้วที่ชื่อใหม่ หรือ
*ได้เลือกไม่ต้องการเปลี่ยนชื่อด้านล่าง

ในกรณีนั้นให้เปลี่ยนชื่อหน้าเอง",
'movearticle'             => 'เปลี่ยนชื่อ',
'movenotallowed'          => 'คุณไม่ได้รับสิทธิในการย้ายหน้าบน {{SITENAME}}',
'newtitle'                => 'ชื่อใหม่',
'move-watch'              => 'เฝ้าดูหน้านี้',
'movepagebtn'             => 'เปลี่ยนชื่อ',
'pagemovedsub'            => 'เปลี่ยนชื่อสำเร็จ',
'movepage-moved'          => '<big>\'\'\'"$1" ถูกเปลี่ยนชื่อเป็น "$2"\'\'\'</big>', # The two titles are passed in plain text as $3 and $4 to allow additional goodies in the message.
'articleexists'           => 'หน้าที่ต้องการมีอยู่แล้ว หรือชื่อที่เลือกไม่ถูกต้อง กรุณาเลือกชื่อใหม่',
'cantmove-titleprotected' => 'คุณไม่สามารถเปลี่ยนชื่อหน้าเป็นชื่อนี้ได้ เนื่องจากชื่อใหม่นี้ได้รับการป้องกันไม่ให้สร้างใหม่',
'talkexists'              => "'''หน้าได้ถูกเปลี่ยนชื่อเรียบร้อย แต่หน้าพูดคุยไม่ได้ถูกเปลี่ยนตามไปด้วยเนื่องจากมีหน้าพูดคุยซ้ำแล้ว ให้ตรวจสอบและย้ายเองอีกครั้ง'''",
'movedto'                 => 'เปลี่ยนชื่อเป็น',
'movetalk'                => 'เปลี่ยนชื่อหน้าพูดคุยพร้อมกัน',
'move-subpages'           => 'ย้ายหน้าย่อยทั้งหมด (ถ้าเป็นไปได้)',
'move-talk-subpages'      => 'ย้ายหน้าย่อยทั้งหมดของหน้าอภิปรายถ้าทำได้',
'movepage-page-exists'    => 'หน้า $1 มีอยู่แล้วและไม่สามารถเขียนทับได้โดยอัตโนมัติ',
'movepage-page-moved'     => 'หน้า $1 ถูกเปลี่ยนชื่อเป็น $2',
'movepage-page-unmoved'   => 'หน้า $1 ไม่สามารถเปลี่ยนชื่อเป็น $2 ได้',
'movepage-max-pages'      => 'หน้าทั้งหมด $1 {{PLURAL:$1|หน้า|หน้า}} ถูกย้ายไป ซึ่งนับได้ว่าเป็นจำนวนที่มากที่สุดเท่าที่จะทได้ และหยุดการย้ายหน้าอย่างอัตโนมัติแล้ว',
'1movedto2'               => '[[$1]] ถูกเปลี่ยนชื่อเป็น [[$2]]',
'1movedto2_redir'         => '[[$1]] ถูกเปลี่ยนชื่อเป็น [[$2]] ทับหน้าเปลี่ยนทาง',
'movelogpage'             => 'บันทึกการเปลี่ยนชื่อ',
'movelogpagetext'         => 'ด้านล่างแสดงรายการ การเปลี่ยนชื่อ',
'movereason'              => 'เหตุผล',
'revertmove'              => 'ย้อน',
'delete_and_move'         => 'ลบและย้าย',
'delete_and_move_text'    => '== จำเป็นต้องลบ ==

ชื่อหัวข้อที่ต้องการ "[[:$1]]" มีอยู่แล้ว แน่ใจหรือไม่ว่าต้องการลบเพื่อที่จะให้การเปลี่ยนชื่อสำเร็จ',
'delete_and_move_confirm' => 'ยืนยัน ต้องการลบ',
'delete_and_move_reason'  => 'ถูกลบสำหรับการเปลี่ยนชื่อ',
'selfmove'                => 'ชื่อหน้าเดิมและหน้าใหม่เป็นชื่อเดียวกัน ไม่สามารถเปลี่ยนชื่อได้',
'immobile_namespace'      => 'ชื่อหน้าที่ต้องการเป็นชนิดพิเศษ ไม่สามารถเปลี่ยนชื่อไปยังเนมสเปซนั้นได้',
'imagenocrossnamespace'   => 'ไม่สามารถย้ายไฟล์ไปยังเนมสเปซที่ไม่รองรับ',
'imageinvalidfilename'    => 'ชื่อไฟล์เป้าหมายไม่ถูกต้อง',
'fix-double-redirects'    => 'อัปเดตหน้าเปลี่ยนทางทุกหน้าที่โอนไปยังชื่อเดิม',

# Export
'export'            => 'ส่งออกหน้า',
'exporttext'        => 'คุณสามารถส่งออก (export) ข้อความต้นฉบับและประวัติการแก้ไขของหน้าใดๆ มากกว่าหนึ่งหน้าในคราวเดียว ออกมาในรูปแบบ XML ซึ่งสามารถนำไปใส่เข้าไว้ในเว็บไซต์วิกิแห่งอื่นที่ใช้ซอฟต์แวร์มีเดียวิกิได้ ผ่านทางคำสั่ง[[Special:Import|การนำเข้าหน้า]]

การจะส่งออกหน้านั้นสามารถทำได้โดยใส่ชื่อหัวเรื่องของหน้าที่ต้องการ ลงในกล่องข้อความด้านล่าง หนึ่งชื่อต่อหนึ่งบรรทัด จากนั้นเลือกว่าต้องการทั้งรุ่นปัจจุบันและรุ่นเก่าๆ ทั้งหมดพร้อมกับประวัติของหน้านั้น หรือต้องการเพียงแต่เนื้อหารุ่นปัจจุบันพร้อมกับรายละเอียดของรุ่นนั้นเท่านั้น

ในกรณีที่ต้องการเฉพาะรุ่นปัจจุบัน คุณสามารถใช้ในรูปแบบของลิงก์ เช่น [[{{ns:special}}:Export/{{MediaWiki:Mainpage}}]] สำหรับหน้า "[[{{MediaWiki:Mainpage}}]]"',
'exportcuronly'     => 'เอาเฉพาะรุ่นปัจจุบันเท่านั้น ไม่เอาประวัติทั้งหมด',
'exportnohistory'   => "----
'''หมายเหตุ:''' การส่งออกประวัติหน้าทั้งหมดผ่านช่องทางนี้ได้ถูกปิดไว้ เนื่องจากปัญหาทางเทคนิคในด้านประสิทธิภาพ",
'export-submit'     => 'ส่งออกมา',
'export-addcattext' => 'รวมหน้าจากหมวดหมู่:',
'export-addcat'     => 'รวม',
'export-download'   => 'ส่งออกมาเป็นไฟล์',
'export-templates'  => 'รวมแม่แบบมาด้วย',

# Namespace 8 related
'allmessages'               => 'ข้อความของระบบ',
'allmessagesname'           => 'ชื่อ',
'allmessagesdefault'        => 'ข้อความตั้งต้น',
'allmessagescurrent'        => 'ข้อความปัจจุบัน',
'allmessagestext'           => 'รายการข้อความของระบบ อยู่ในเนมสเปซมีเดียวิกิ
กรุณาไปที่ [http://www.mediawiki.org/wiki/Localisation มีเดียวิกิ] และ [http://translatewiki.new Betawiki] ถ้าคุณยังอยากที่จะแปลข้อความของระบบมีเดียวิกิ',
'allmessagesnotsupportedDB' => "หน้านี้ไม่สามารถใช้งานได้เนื่องจาก '''\$wgUseDatabaseMessages''' ถูกระงับการใช้งาน",
'allmessagesfilter'         => 'กรองเฉพาะข้อความ:',
'allmessagesmodified'       => 'แสดงเฉพาะที่ถูกแก้ไข',

# Thumbnails
'thumbnail-more'           => 'ขยาย',
'filemissing'              => 'ไม่เจอไฟล์',
'thumbnail_error'          => 'เกิดปัญหาไม่สามารถธัมบ์เนลได้: $1',
'djvu_page_error'          => 'หน้าเดจาวู (DjVu) เกินขนาด',
'djvu_no_xml'              => 'ไม่สามารถส่งเอกซ์เอ็มแอล (XML) สำหรับไฟล์เดจาวู (DjVu)',
'thumbnail_invalid_params' => 'พารามิเตอร์ของธัมบ์เนลไม่ถูกต้อง',
'thumbnail_dest_directory' => 'ไม่สามารถสร้างไดเรกทอรีภาพได้',

# Special:Import
'import'                     => 'หน้านำเข้า',
'importinterwiki'            => 'นำเข้าข้ามวิกิ',
'import-interwiki-text'      => 'เลือกวิกิและชื่อหัวข้อที่ต้องการนำเข้า วันที่และชื่อผู้แก้ไขทั้งหมดจะถูกเก็บไว้ โดยการนำเข้าทุกส่วนจะถูกเก็บไว้ใน [[Special:Log/import|บันทึกการนำเข้า]]',
'import-interwiki-history'   => 'คัดลอกประวัติทั้งหมดในหน้านี้',
'import-interwiki-submit'    => 'นำเข้า',
'import-interwiki-namespace' => 'โอนย้ายหน้าเหล่านี้ไปสู่เนมสเปซ:',
'importtext'                 => 'กรุณาส่งออกไฟล์จากวิกิอื่นโดยใช้[[Special:Export|เครื่องมือส่งออก]] บันทึก และทำการอัปโหลดมาที่นี่',
'importstart'                => 'กำลังนำเข้าหน้า...',
'import-revision-count'      => '$1 {{PLURAL:$1|รุ่นการแก้ไข|รุ่นการแก้ไข}}',
'importnopages'              => 'ไม่มีหน้าให้นำเข้า',
'importfailed'               => 'การนำเข้าไม่สำเร็จ: <nowiki>$1</nowiki>',
'importunknownsource'        => 'ไม่ทราบชนิดของไฟล์นำเข้า',
'importcantopen'             => 'ไม่สามารถเปิดไฟล์นำเข้าได้',
'importbadinterwiki'         => 'ลิงก์เชื่อมโยงข้ามภาษาเสีย',
'importnotext'               => 'ไฟล์ว่างหรือไฟล์ไม่มีข้อความ',
'importsuccess'              => 'นำเข้าไฟล์สำเร็จ!',
'importhistoryconflict'      => 'ประวัติหน้าขัดแย้งกัน (ซึ่งอาจเคยนำเข้าหน้านี้มาก่อน)',
'importnosources'            => 'ไม่มีการกำหนดแหล่งนำเข้าข้ามวิกิ และการอัปโหลดประวัติหน้าโดยตรงถูกปิดการใช้งาน',
'importnofile'               => 'ไฟล์นำเข้าไม่ได้ถูกอัปโหลด',
'importuploaderrorsize'      => 'อัปโหลดไฟล์ข้อมูลนำเข้าไม่สำเร็จ
ขนาดไฟล์ใหญ่เกินกว่าที่อนุญาตไว้',
'importuploaderrorpartial'   => 'อัปโหลดไฟล์ข้อมูลนำเข้าไม่สำเร็จ
ไฟล์ได้รับการอัปโหลดขึ้นไปเพียงบางส่วนเท่านั้น',
'importuploaderrortemp'      => 'อัปโหลดไฟล์ข้อมูลนำเข้าไม่สำเร็จ
ไม่พบโฟลเดอร์ชั่วคราว',
'import-parse-failure'       => 'มีข้อผิดพลาดในการแปลโครงสร้างของข้อมูลนำเข้า XML',
'import-noarticle'           => 'ไม่มีข้อมูลหน้าให้นำเข้า!',
'import-nonewrevisions'      => 'ทุกรุ่นมาจากการนำเข้าข้อมูลก่อนหน้านี้',
'xml-error-string'           => '$1 ที่บรรทัด $2 คอลัมน์ $3 (ไบต์ที่ $4): $5',
'import-upload'              => 'อัปโหลดข้อมูล XML',

# Import log
'importlogpage'                    => 'บันทึกการนำเข้า',
'importlogpagetext'                => 'นำเข้าไฟล์จากวิกิอื่น โดยผ่านทางผู้ดูแลระบบ',
'import-logentry-upload'           => 'นำเข้า [[$1]] ผ่านการอัปโหลดแล้ว',
'import-logentry-upload-detail'    => '$1 {{PLURAL:$1|รุ่นการแก้ไข|รุ่นการแก้ไข}}',
'import-logentry-interwiki'        => 'นำเข้าข้ามวิกิ $1 แล้ว',
'import-logentry-interwiki-detail' => '$1 {{PLURAL:$1|รุ่นการแก้ไข|รุ่นการแก้ไข}}จาก $2',

# Tooltip help for the actions
'tooltip-pt-userpage'             => 'หน้าผู้ใช้ของฉัน',
'tooltip-pt-anonuserpage'         => 'หน้าผู้ใช้ของหมายเลขไอพีที่แก้ไข',
'tooltip-pt-mytalk'               => 'หน้าพูดคุยของฉัน',
'tooltip-pt-anontalk'             => 'พูดคุยเกี่ยวกับการแก้ไขจากหมายเลขไอพี',
'tooltip-pt-preferences'          => 'ตั้งค่าการใช้งานส่วนตัว',
'tooltip-pt-watchlist'            => 'รายการที่เฝ้าดูการแก้ไข',
'tooltip-pt-mycontris'            => 'รายการหน้าที่ร่วมแก้ไข',
'tooltip-pt-login'                => 'ไม่จำเป็นต้องล็อกอินในการแก้ไข แต่แนะนำอย่างยิ่งให้ล็อกอิน',
'tooltip-pt-anonlogin'            => 'ไม่จำเป็นต้องล็อกอินในการแก้ไข แต่แนะนำอย่างยิ่งให้ล็อกอิน',
'tooltip-pt-logout'               => 'ล็อกเอาต์',
'tooltip-ca-talk'                 => 'พูคุยเกี่ยวกับเนื้อหา',
'tooltip-ca-edit'                 => 'หน้านี้แก้ไขได้ ก่อนทำการบันทึกให้กรุณากดปุ่มดูตัวอย่างก่อน แน่ใจว่าได้ตามที่ต้องการ',
'tooltip-ca-addsection'           => 'เพิ่มความเห็นในส่วนสนทนานี้',
'tooltip-ca-viewsource'           => 'หน้านี้ถูกล็อก แต่ยังคงดูโค้ดได้',
'tooltip-ca-history'              => 'รุ่นที่แล้วของหน้านี้',
'tooltip-ca-protect'              => 'ล็อกหน้านี้',
'tooltip-ca-delete'               => 'ลบหน้านี้',
'tooltip-ca-undelete'             => 'เรียกคืนการแก้ไขหน้านี้กลับมาเป็นรุ่นก่อนที่ถูกลบ',
'tooltip-ca-move'                 => 'เปลี่ยนชื่อหน้านี้',
'tooltip-ca-watch'                => 'เพิ่มหน้านี้เข้ารายการเฝ้าดู',
'tooltip-ca-unwatch'              => 'นำหน้านี้ออกจากรายการเฝ้าดู',
'tooltip-search'                  => 'ค้นหา {{SITENAME}}',
'tooltip-search-go'               => 'ตรงไปยังหน้าที่ตรงกับชื่อนี้ (ถ้ามี)',
'tooltip-search-fulltext'         => 'ค้นหาหน้าที่มีข้อความนี้',
'tooltip-p-logo'                  => 'หน้าหลัก',
'tooltip-n-mainpage'              => 'แวะหน้าหลัก',
'tooltip-n-portal'                => 'เรื่องเฉพาะโครงการ วิธีการใช้ วิธีการค้นหา สิ่งที่ควรทำ',
'tooltip-n-currentevents'         => 'ค้นหาเหตุการณ์ปัจจุบัน',
'tooltip-n-recentchanges'         => 'รายการปรับปรุงล่าสุดในวิกินี้',
'tooltip-n-randompage'            => 'สุ่มหน้าขึ้นมา',
'tooltip-n-help'                  => 'อธิบายการใช้งาน',
'tooltip-t-whatlinkshere'         => 'รายการหน้าวิกิที่ลิงก์มาที่นี่',
'tooltip-t-recentchangeslinked'   => 'รายการหน้าที่ลิงก์มาที่นี่ และเพิ่งถูกแก้ไข',
'tooltip-feed-rss'                => 'ฟีดชนิดอาร์เอสเอส (RSS) ของหน้านี้',
'tooltip-feed-atom'               => 'ฟีดชนิดอะตอม (Atom) ของหน้านี้',
'tooltip-t-contributions'         => 'ดูหน้าที่ผู้ใช้คนนี้เขียน',
'tooltip-t-emailuser'             => 'ส่งอีเมลหาคนนี้',
'tooltip-t-upload'                => 'อัปโหลดภาพหรือไฟล์',
'tooltip-t-specialpages'          => 'แสดงรายการหน้าพิเศษ',
'tooltip-t-print'                 => 'หน้าที่แสดงผลพร้อมสำหรับพิมพ์ออกมา',
'tooltip-t-permalink'             => 'ลิงก์มาที่เฉพาะรุ่นนี้ในหน้านี้',
'tooltip-ca-nstab-main'           => 'ดูหน้าเนื้อหา',
'tooltip-ca-nstab-user'           => 'ดูหน้าผู้ใช้',
'tooltip-ca-nstab-media'          => 'ดูหน้าสื่อ ภาพ เพลง',
'tooltip-ca-nstab-special'        => 'ไม่สามารถแก้ไขหน้านี้ได้ หน้านี้เป็นหน้าพิเศษ',
'tooltip-ca-nstab-project'        => 'ดูหน้าโครงการ',
'tooltip-ca-nstab-image'          => 'ดูหน้าภาพ',
'tooltip-ca-nstab-mediawiki'      => 'ดูข้อความระบบ',
'tooltip-ca-nstab-template'       => 'ดูหน้าแม่แบบ',
'tooltip-ca-nstab-help'           => 'ดูหน้าคำอธิบาย',
'tooltip-ca-nstab-category'       => 'ดูหน้าหมวดหมู่',
'tooltip-minoredit'               => 'กำหนดเป็นการแก้ไขเล็กน้อย',
'tooltip-save'                    => 'บันทึกการแก้ไข',
'tooltip-preview'                 => 'แสดงตัวอย่างการเปลี่ยนแปลงที่เกิดขึ้น กรุณาใช้คำสั่งนี้ก่อนทำการบันทึก!',
'tooltip-diff'                    => 'แสดงการเปลี่ยนการต่อข้อความ',
'tooltip-compareselectedversions' => 'แสดงความแตกต่างของรุ่นสองรุ่นที่เลือก',
'tooltip-watch'                   => 'เพิ่มหน้านี้เข้ารายการเฝ้าดู',
'tooltip-recreate'                => 'สร้างหน้านี้อีกครั้งแม้ว่าจะถูกลบ',
'tooltip-upload'                  => 'เริ่มอัปโหลด',

# Stylesheets
'common.css'   => '/** CSS ที่อยู่ในหน้านี้จะมีผลต่อทุกสกินในเว็บไซต์ */',
'monobook.css' => '/* CSS ที่อยู่ในหน้านี้จะมีผลต่อสกิน Monobook */',

# Scripts
'common.js'   => '/* จาวาสคริปต์ในหน้านี้จะถูกใช้งานต่อผู้ใช้ทุกคน */',
'monobook.js' => '/* ถ้าไม่เห็นด้วย ให้ใช้ [[MediaWiki:common.js]] */',

# Metadata
'nodublincore'      => 'ข้อมูลอาร์ดีเอฟของดับลินคอร์ไม่สามารถใช้งานได้ในเซิร์ฟเวอร์นี้',
'nocreativecommons' => 'ข้อมูลอาร์ดีเอฟของครีเอทีฟคอมมอนส์ไม่สามารถใช้งานได้ในเซิร์ฟเวอร์นี้',
'notacceptable'     => 'เซิร์ฟเวอร์ของวิกิไม่สามารถให้ข้อมูลในรูปแบบที่ไคลเอนต์สามารถอ่านได้',

# Attribution
'anonymous'        => 'ผู้ใช้ไม่ประสงค์ออกนามของ {{SITENAME}}',
'siteuser'         => '{{SITENAME}} ผู้ใช้ $1',
'lastmodifiedatby' => 'แก้ไขล่าสุดเมื่อเวลา $2 $1 โดย $3', # $1 date, $2 time, $3 user
'othercontribs'    => 'พัฒนาจากงานเขียนของ $1',
'others'           => 'ผู้อื่น',
'siteusers'        => '{{SITENAME}} ผู้ใช้ $1',
'creditspage'      => 'เกียรติแก่ผู้ร่วมสร้าง',
'nocredits'        => 'ไม่มีรายชื่อผู้เป็นเกียรติที่ร่วมสร้างหน้านี้',

# Spam protection
'spamprotectiontitle' => 'ตัวกรองป้องกันสแปม',
'spamprotectiontext'  => 'หน้าที่คุณต้องการบันทึกโดนบล็อกด้วยตัวกรองสแปม ซึ่งอาจเกิดจากมีลิงก์ไปยังเว็บไซต์ภายนอกที่อยู่ในบัญชีดำ',
'spamprotectionmatch' => 'ข้อความต่อไปนี้ได้ทำให้ตัวกรองสแปมของเราทำงาน: $1',
'spambot_username'    => 'กวาดล้างมีเดียวิกิสแปม',
'spam_reverting'      => 'ย้อนกลับไปรุ่นก่อนหน้าที่ไม่มีลิงก์ไปยังเว็บ $1',
'spam_blanking'       => 'รุ่นการปรับปรุงทุกรุ่นประกอบไปด้วยลิงก์ไปยังเว็บ $1 (ทำหน้าว่าง)',

# Info page
'infosubtitle'   => 'ข้อมูลของหน้า',
'numedits'       => 'จำนวนการแก้ไข (เนื้อหา): $1',
'numtalkedits'   => 'จำนวนการแก้ไข (หน้าพูดคุย): $1',
'numwatchers'    => 'จำนวนผู้เฝ้าดู: $1',
'numauthors'     => 'จำนวนผู้เขียน (เนื้อหา): $1',
'numtalkauthors' => 'จำนวนผู้เขียน (หน้าพูดคุย): $1',

# Math options
'mw_math_png'    => 'เรนเดอร์เป็น PNG เสมอ',
'mw_math_simple' => 'ใช้พื้นฐานเป็น HTML ถ้าไม่ได้ใช้ PNG',
'mw_math_html'   => 'ถ้าเป็นไปได้ใช้เป็น HTML ถ้าไม่ได้ใช้ PNG',
'mw_math_source' => 'ปล่อยข้อมูลเป็น TeX (สำหรับเว็บเบราว์เซอร์แบบข้อความ)',
'mw_math_modern' => 'แนะนำสำหรับเว็บเบราว์เซอร์สมัยใหม่',
'mw_math_mathml' => 'ถ้าเป็นไปได้ใช้ MathML (ขั้นทดลอง)',

# Patrolling
'markaspatrolleddiff'                 => 'ทำเครื่องหมายว่าตรวจสอบแล้ว',
'markaspatrolledtext'                 => 'กำหนดว่าบทความนี้ถูกตรวจสอบแล้ว',
'markedaspatrolled'                   => 'ตรวจสอบแล้ว',
'markedaspatrolledtext'               => 'รุ่นการแก้ไขที่เลือกถูกกำหนดว่าตรวจสอบแล้ว',
'rcpatroldisabled'                    => 'การตรวจสอบหน้าปรับปรุงล่าสุดปิดใช้งาน',
'rcpatroldisabledtext'                => 'ฟังก์ชันการตรวจสอบหน้าปรับปรุงล่าสุดขณะนี้ไม่เปิดการใช้งาน',
'markedaspatrollederror'              => 'ไม่สามารถทำเครื่องหมายว่าตรวจสอบแล้ว',
'markedaspatrollederrortext'          => 'คุณจำเป็นต้องระบุรุ่นการแก้ไขที่กำหนดว่าตรวจสอบแล้ว',
'markedaspatrollederror-noautopatrol' => 'คุณไม่สามารถทำเครื่องหมายการแก้ไขของคุณเองว่าตรวจสอบแล้ว',

# Patrol log
'patrol-log-page'   => 'บันทึกการตรวจสอบ',
'patrol-log-header' => 'หน้านี้คือบันทึกรุ่นการแก้ไขที่กำหนดว่าตรวจสอบแล้ว',
'patrol-log-line'   => 'ทำเครื่องหมาย $1 ของ $2 ว่าถูกตรวจสอบ $3 แล้ว',
'patrol-log-auto'   => '(อัตโนมัติ)',

# Image deletion
'deletedrevision'                 => 'รุ่นเก่าที่ถูกลบ $1',
'filedeleteerror-short'           => 'เกิดปัญหาการลบไฟล์: $1',
'filedeleteerror-long'            => 'เกิดปัญหาขณะที่ทำการลบไฟล์:

$1',
'filedelete-missing'              => 'ไม่สามารถลบไฟล์ "$1" ได้ เนื่องจากไม่มีไฟล์ชื่อนี้อยู่',
'filedelete-old-unregistered'     => 'ไฟล์ที่ระบุรุ่น "$1" ไม่มีในฐานข้อมูล',
'filedelete-current-unregistered' => 'ไฟล์ที่ระบุ "$1" ไม่มีในฐานข้อมูล',
'filedelete-archive-read-only'    => 'ไดเรกทอรีกรุชื่อ "$1" ไม่สามารถเขียนลงได้โดยเว็บเซิร์ฟเวอร์',

# Browsing diffs
'previousdiff' => '← แตกต่างก่อนหน้า',
'nextdiff'     => 'แตกต่างถัดไป →',

# Media information
'mediawarning'         => "'''คำเตือน''': ไฟล์นี้อาจจะมีโค้ดที่มีอันตรายหรือมีไวรัส<hr />",
'imagemaxsize'         => 'จำกัดภาพหรือคำอธิบายภาพไว้ที่ขนาด:',
'thumbsize'            => 'ขนาดรูปย่อ:',
'widthheightpage'      => '{{PLURAL:$3|หน้า|หน้า}} $1×$2, $3',
'file-info'            => '(ขนาดไฟล์: $1, ชนิดไมม์: $2)',
'file-info-size'       => '($1 × $2 พิกเซล, ขนาดไฟล์: $3, ชนิดไมม์: $4)',
'file-nohires'         => '<small>ไม่มีภาพความละเอียดสูงกว่านี้</small>',
'svg-long-desc'        => '(ไฟล์ SVG, $1 × $2 พิกเซล (พอเป็นพิธี), ขนาดไฟล์: $3)',
'show-big-image'       => 'ความละเอียดสูงสุด',
'show-big-image-thumb' => '<small>ขนาดของภาพแสดงผล: $1 × $2 พิกเซล</small>',

# Special:NewImages
'newimages'             => 'แกลลอรีภาพใหม่',
'imagelisttext'         => "รายชื่อไฟล์ '''$1''' รายการ เรียงตาม$2",
'newimages-summary'     => 'หน้าพิเศษนี้แสดงไฟล์ที่ถูกอัปโหลดล่าสุด',
'showhidebots'          => '($1 บอต)',
'noimages'              => 'ไม่มีให้ดู',
'ilsubmit'              => 'ค้นหา',
'bydate'                => 'วันที่',
'sp-newimages-showfrom' => 'แสดงภาพใหม่เริ่มต้นจาก $2, $1',

# Bad image list
'bad_image_list' => 'รูปแบบแสดงต่อไปนี้:

เฉพาะรายการที่แสดง (ในแถวขึ้นต้นด้วย *) โดยลิงก์แรกของแต่ละแถวเป็นลิงก์ไปยังภาพที่เสีย
โดยลิงก์ถัดไปเป็นข้อยกเว้น เช่น บทความที่ภาพถูกจัดในบรรทัดเดียวกับส่วนข้อความ',

# Metadata
'metadata'          => 'ข้อมูลแนบ',
'metadata-help'     => 'ไฟล์นี้มีข้อมูลเพิ่มเติมแนบไว้ อาจจะมาจาก กล้องดิจิทัล สแกนเนอร์ หรือเครื่องรับส่งจีพีเอส อย่างไรก็ตามข้อมูลที่เก็บไว้อาจถูกดัดแปลงถ้าไฟล์ต้นฉบับถูกแก้ไขจากซอฟต์แวร์อื่น',
'metadata-expand'   => 'แสดงข้อมูลเพิ่มเติม',
'metadata-collapse' => 'ซ่อนข้อมูลเพิ่มเติม',
'metadata-fields'   => 'ค่าเอกซิฟ (Exif) ของภาพด้านล่างจะแสดงควบคู่ไปกับภาพ
* make
* model
* datetimeoriginal
* exposuretime
* fnumber
* focallength', # Do not translate list items

# EXIF tags
'exif-imagewidth'                  => 'ความกว้าง',
'exif-imagelength'                 => 'ความสูง',
'exif-bitspersample'               => 'บิต ต่อคอมโพเนนต์',
'exif-compression'                 => 'รูปแบบการบีบอัด',
'exif-photometricinterpretation'   => 'พิกเซลคอมโพซิชัน',
'exif-orientation'                 => 'การจัดวางภาพ',
'exif-samplesperpixel'             => 'จำนวนคอมโพเนนต์',
'exif-planarconfiguration'         => 'การจัดเรียงข้อมูล',
'exif-ycbcrsubsampling'            => 'อัตราซับแซมปริง ของ Y และ C',
'exif-ycbcrpositioning'            => 'ตำแหน่ง Y และ C',
'exif-xresolution'                 => 'ความละเอียดแนวนอน',
'exif-yresolution'                 => 'ความละเอียดแนวตั้ง',
'exif-resolutionunit'              => 'หน่วยของความละเอียดของ X และ Y',
'exif-stripoffsets'                => 'ตำแหน่งข้อมูลภาพ',
'exif-rowsperstrip'                => 'จำนวนแถวต่อสตริป',
'exif-stripbytecounts'             => 'ไบต์ต่อสตริป',
'exif-jpeginterchangeformat'       => 'ออฟเซตไปที่ JPEG SOI',
'exif-jpeginterchangeformatlength' => 'ไบต์ของข้อมูล JPEG',
'exif-transferfunction'            => 'ฟังก์ชันทรานส์เฟอร์',
'exif-whitepoint'                  => 'ไวต์พอยต์โครมาติก',
'exif-primarychromaticities'       => 'โครมาติกของไพรมาริตี',
'exif-ycbcrcoefficients'           => 'สัมประสิทธิเมทริกซ์การเปลียนแปลงของสเปซสี',
'exif-referenceblackwhite'         => 'คู่จุดสีขาวและดำสำหรับอ้างอิง',
'exif-datetime'                    => 'วันที่และเวลาปรับปรุง',
'exif-imagedescription'            => 'ชื่อภาพ',
'exif-make'                        => 'ผู้ผลิตกล้อง',
'exif-model'                       => 'รุ่นกล้อง',
'exif-software'                    => 'ซอฟต์แวร์ที่ใช้',
'exif-artist'                      => 'ผู้สร้างสรรค์',
'exif-copyright'                   => 'ผู้ถือลิขสิทธิ์',
'exif-exifversion'                 => 'รุ่นเอกซิฟ (Exif)',
'exif-flashpixversion'             => 'รุ่นแฟลชพิกซ์ที่รองรับ',
'exif-colorspace'                  => 'สเปซสี',
'exif-componentsconfiguration'     => 'ความหมายของแต่ละคอมโพเนนต์',
'exif-compressedbitsperpixel'      => 'โหมดการบีบอัดภาพ',
'exif-pixelydimension'             => 'ความกว้างที่นำไปใช้ได้',
'exif-pixelxdimension'             => 'ความยาวที่นำไปใช้ได้',
'exif-makernote'                   => 'ข้อมูลเพิ่มจากผู้ผลิตกล้อง',
'exif-usercomment'                 => 'ความเห็นผู้ใช้',
'exif-relatedsoundfile'            => 'ไฟล์เสียงที่เกี่ยวข้อง',
'exif-datetimeoriginal'            => 'วันที่และเวลาที่สร้าง',
'exif-datetimedigitized'           => 'วันที่และเวลาที่ดิจิไทซ์',
'exif-subsectime'                  => 'เสี้ยววินาที วันที่ เวลา',
'exif-subsectimeoriginal'          => 'เสี้ยววินาที วันที่ เวลาต้นฉบับ',
'exif-subsectimedigitized'         => 'เสี้ยววินาที วันที่ เวลาที่ดิจิไทซ์',
'exif-exposuretime'                => 'เวลารับแสง',
'exif-exposuretime-format'         => '$1 วินาที ($2)',
'exif-fnumber'                     => 'ค่าเอฟ',
'exif-exposureprogram'             => 'โปรแกรมเอกซ์โพเชอร์',
'exif-spectralsensitivity'         => 'ความไวสเปกตรัม',
'exif-isospeedratings'             => 'อัตราความเร็ว ISO',
'exif-oecf'                        => 'อัตราเปลี่ยนออปโตอิเล็กทรอนิก',
'exif-shutterspeedvalue'           => 'ความไวชัตเตอร์',
'exif-aperturevalue'               => 'รูรับแสง',
'exif-brightnessvalue'             => 'ความสว่าง',
'exif-exposurebiasvalue'           => 'เอกซ์โพเชอร์ไบแอส',
'exif-maxaperturevalue'            => 'รูรับแสงกว้างสุด',
'exif-subjectdistance'             => 'ระยะวัตถุ',
'exif-meteringmode'                => 'โหมดมิเตอริง',
'exif-lightsource'                 => 'แสง',
'exif-flash'                       => 'แฟลช',
'exif-focallength'                 => 'ระยะโฟกัส',
'exif-subjectarea'                 => 'จุดวัตถุ',
'exif-flashenergy'                 => 'พลังงานแฟลช',
'exif-spatialfrequencyresponse'    => 'การตอบสนองความถี่ของสเปซ',
'exif-focalplanexresolution'       => 'ความละเอียระนาบโฟกัส X',
'exif-focalplaneyresolution'       => 'ความละเอียระนาบโฟกัส Y',
'exif-focalplaneresolutionunit'    => 'หน่วยความละเอียดระนาบโฟกัส',
'exif-subjectlocation'             => 'ตำแหน่งวัตถุ',
'exif-exposureindex'               => 'ดัชนีเอกซ์โพเชอร์',
'exif-sensingmethod'               => 'วิถีการวัด',
'exif-filesource'                  => 'ต้นฉบับไฟล์',
'exif-scenetype'                   => 'ชนิดซีน',
'exif-cfapattern'                  => 'รูปแบบ CFA',
'exif-customrendered'              => 'การประมวณภาพ',
'exif-exposuremode'                => 'โหมดเอกซ์โพเชอร์',
'exif-whitebalance'                => 'ไวต์บาลานซ์',
'exif-digitalzoomratio'            => 'อัตราซูมดิจิทัล',
'exif-focallengthin35mmfilm'       => 'ระยะโฟกัสในฟิล์ม 35 มม.',
'exif-scenecapturetype'            => 'ชนิดซีนแคปเจอร์',
'exif-gaincontrol'                 => 'ซีนคอนโทรล',
'exif-contrast'                    => 'ความเปรีบบต่าง',
'exif-saturation'                  => 'ความอิ่มสี',
'exif-sharpness'                   => 'ความคม',
'exif-devicesettingdescription'    => 'รายละเอียดการตั้งค่าอุปกรณ์',
'exif-subjectdistancerange'        => 'ระยะห่างวัตถุ',
'exif-imageuniqueid'               => 'รหัสภาพ',
'exif-gpsversionid'                => 'รุ่นจีพีเอสแท็ก',
'exif-gpslatituderef'              => 'ละติจูดเหนือหรือใต้',
'exif-gpslatitude'                 => 'ละติจูด',
'exif-gpslongituderef'             => 'ลองจิจูดตะวันออกหรือตะวันตก',
'exif-gpslongitude'                => 'ลองจิจูด',
'exif-gpsaltituderef'              => 'ระดับความสูงอ้างอิง',
'exif-gpsaltitude'                 => 'ระดับความสูงจากน้ำทะเล',
'exif-gpstimestamp'                => 'เวลาจีพีเอส (นาฬิกาอะตอม)',
'exif-gpssatellites'               => 'จำนวนดาวเทียมที่ใช้วัดค่า',
'exif-gpsstatus'                   => 'สถานีเครื่องรับสัญญาณ',
'exif-gpsmeasuremode'              => 'โหมดการวัดค่า',
'exif-gpsdop'                      => 'ความละเอียดการวัดค่า',
'exif-gpsspeedref'                 => 'หน่วยความเร็ว',
'exif-gpsspeed'                    => 'ความเร็วของเครื่องรับสัญญาณจีพีเอส',
'exif-gpstrackref'                 => 'จุดอ้างอิงของทิศทางการเคลื่อนไหว',
'exif-gpstrack'                    => 'ทิศทางการเคลื่อนไหว',
'exif-gpsimgdirectionref'          => 'จุดอ้างอิงของทิศทางภาพ',
'exif-gpsimgdirection'             => 'ทิศทางของภาพ',
'exif-gpsmapdatum'                 => 'ข้อมูลการสำรวจจีโอเดติกที่ถูกใช้',
'exif-gpsdestlatituderef'          => 'จุดอ้างอิงของละติจูดเป้าหมาย',
'exif-gpsdestlatitude'             => 'ละติจูดเป้าหมาย',
'exif-gpsdestlongituderef'         => 'จุดอ้างอิงของลองจิจูดเป้าหมาย',
'exif-gpsdestlongitude'            => 'ลองจิจูดเป้าหมาย',
'exif-gpsdestbearingref'           => 'จุดอ้างอิงของทิศทางเป้าหมาย',
'exif-gpsdestbearing'              => 'ทิศทางของเป้าหมาย',
'exif-gpsdestdistanceref'          => 'จุดอ้างอิงของระยะทางเป้าหมาย',
'exif-gpsdestdistance'             => 'ระยะทางของเป้าหมาย',
'exif-gpsprocessingmethod'         => 'ชื่อวิธีประมวดผลจีพีเอส',
'exif-gpsareainformation'          => 'ชื่อของพื้นที่จีพีเอส',
'exif-gpsdatestamp'                => 'วันที่จีพีเอส',
'exif-gpsdifferential'             => 'การปรับแค่ข้อแตกต่างจีพีเอส',

# EXIF attributes
'exif-compression-1' => 'ไม่ได้บีบอัด',

'exif-unknowndate' => 'ไม่ทราบวัน',

'exif-orientation-1' => 'ปกติ', # 0th row: top; 0th column: left
'exif-orientation-2' => 'ถูกสลับแนวนอน', # 0th row: top; 0th column: right
'exif-orientation-3' => 'ถูกหมุน 180°', # 0th row: bottom; 0th column: right
'exif-orientation-4' => 'ถูกสลับแนวตั้ง', # 0th row: bottom; 0th column: left
'exif-orientation-5' => 'ถูกหมุน 90° ทวนเข็มนาฬิกา และถูกสลับแนวตั้ง', # 0th row: left; 0th column: top
'exif-orientation-6' => 'ถูกหมุน 90° ตามเข็มนาฬิกา', # 0th row: right; 0th column: top
'exif-orientation-7' => 'ถูกหมุน 90° ตามเข็มนาฬิกา และถูกสลับแนวตั้ง', # 0th row: right; 0th column: bottom
'exif-orientation-8' => 'ถูกหมุน 90° ทวนเข็มนาฬิกา', # 0th row: left; 0th column: bottom

'exif-planarconfiguration-1' => 'รูปแบบชังกี',
'exif-planarconfiguration-2' => 'รูปแบบเพลนาร์',

'exif-componentsconfiguration-0' => 'ไม่มีค่า',

'exif-exposureprogram-0' => 'ไม่กำหนด',
'exif-exposureprogram-1' => 'ตั้งค่าเอง',
'exif-exposureprogram-2' => 'โปรแกรมปกติ',
'exif-exposureprogram-3' => 'กำหนดรูรับแสงเป็นหลัก (a)',
'exif-exposureprogram-4' => 'กำหนดความไวชัตเตอร์เป็นหลัก (s)',
'exif-exposureprogram-5' => 'โปรแกรมครีเอทีฟ (ความชัดตื้นหลากหลาย)',
'exif-exposureprogram-6' => 'โปรแกรมแอกชัน (ค่าชัตเตอร์สปีดเร็ว)',
'exif-exposureprogram-7' => 'พอร์เทรต (สำหรับภาพโคลสอัปที่พื้นหลังไม่โฟกัส)',
'exif-exposureprogram-8' => 'แลนด์สเคป (สำหรับภาพวิวทิวทัศน์โฟกัสพื้นหลัง)',

'exif-subjectdistance-value' => '$1 เมตร',

'exif-meteringmode-0'   => 'ไม่ทราบ',
'exif-meteringmode-1'   => 'เฉลี่ย',
'exif-meteringmode-2'   => 'เซนเตอร์',
'exif-meteringmode-3'   => 'สปอต',
'exif-meteringmode-4'   => 'มัลติสปอต',
'exif-meteringmode-5'   => 'แพตเทิร์น',
'exif-meteringmode-6'   => 'พาร์เชียล',
'exif-meteringmode-255' => 'อื่น',

'exif-lightsource-0'   => 'ไม่ทราบ',
'exif-lightsource-1'   => 'เดย์ไลต์',
'exif-lightsource-2'   => 'ฟลูออเรสเซนต์',
'exif-lightsource-3'   => 'ทังสเตน (แสดงจากหลอดไฟ)',
'exif-lightsource-4'   => 'แฟลช',
'exif-lightsource-9'   => 'อากาศปกติ',
'exif-lightsource-10'  => 'เมฆมาก',
'exif-lightsource-11'  => 'ในร่ม',
'exif-lightsource-12'  => 'เดย์ไลต์ฟลูออเรสเซนต์ (D 5700 – 7100K)',
'exif-lightsource-13'  => 'เดย์ไวต์ฟลูออเรสเซนต์ (N 4600 – 5400K)',
'exif-lightsource-14'  => 'คูลไวต์ฟลูออเรสเซนต์ (W 3900 – 4500K)',
'exif-lightsource-15'  => 'ไวต์ฟลูออเรสเซนต์ (WW 3200 – 3700K)',
'exif-lightsource-17'  => 'แสงมาตรฐาน A',
'exif-lightsource-18'  => 'แสงมาตรฐาน B',
'exif-lightsource-19'  => 'แสงมาตรฐาน C',
'exif-lightsource-24'  => 'ไอเอสโอสตูดิโอทังสเตน',
'exif-lightsource-255' => 'แสงลักษณะอื่น',

'exif-focalplaneresolutionunit-2' => 'นิ้ว',

'exif-sensingmethod-1' => 'ไม่กำหนด',
'exif-sensingmethod-2' => 'เซนเซอร์จุดเดียว',
'exif-sensingmethod-3' => 'เซนเซอร์สองจุด',
'exif-sensingmethod-4' => 'เซนเซอร์สามจุด',
'exif-sensingmethod-5' => 'เซนเซอร์ลำดับสี',
'exif-sensingmethod-7' => 'เซนเซอร์สามแนว',
'exif-sensingmethod-8' => 'เซนเซอร์สามแนวสี',

'exif-scenetype-1' => 'ภาพถ่ายโดยตรง',

'exif-customrendered-0' => 'โพลเซสส์ปกติ',
'exif-customrendered-1' => 'โพลเซสส์ตั้งค่า',

'exif-exposuremode-0' => 'เอกซ์โพเชอร์อัตโนมัติ',
'exif-exposuremode-1' => 'เอกซ์โพเชอร์ตั้งค่าเอง',
'exif-exposuremode-2' => 'แบรกเกตอัตโนมัติ',

'exif-whitebalance-0' => 'ไวต์บาลานซ์อัตโนมัติ',
'exif-whitebalance-1' => 'ไวต์บาลานซ์ตั้งค่าเอง',

'exif-scenecapturetype-0' => 'ปกติ',
'exif-scenecapturetype-1' => 'แลนด์สเคป',
'exif-scenecapturetype-2' => 'พอร์เทรต',
'exif-scenecapturetype-3' => 'ไนต์ซีน',

'exif-gaincontrol-0' => 'ไม่มี',
'exif-gaincontrol-1' => 'เกน ต่ำ-ขึ้น',
'exif-gaincontrol-2' => 'เกน สูง-ขึ้น',
'exif-gaincontrol-3' => 'เกน ต่ำ-ลง',
'exif-gaincontrol-4' => 'เกน สูง-ลง',

'exif-contrast-0' => 'ปกติ',
'exif-contrast-1' => 'ซอฟต์',
'exif-contrast-2' => 'ฮาร์ด',

'exif-saturation-0' => 'ปกติ',
'exif-saturation-1' => 'ความเข้มสีต่ำ',
'exif-saturation-2' => 'ความเข้มสีสูง',

'exif-sharpness-0' => 'ปกติ',
'exif-sharpness-1' => 'ซอฟต์',
'exif-sharpness-2' => 'ฮาร์ด',

'exif-subjectdistancerange-0' => 'ไม่ทราบ',
'exif-subjectdistancerange-1' => 'มาโคร',
'exif-subjectdistancerange-2' => 'ภาพใกล้',
'exif-subjectdistancerange-3' => 'ภาพไกล',

# Pseudotags used for GPSLatitudeRef and GPSDestLatitudeRef
'exif-gpslatitude-n' => 'ละติจูดเหนือ',
'exif-gpslatitude-s' => 'ละติจูดใต้',

# Pseudotags used for GPSLongitudeRef and GPSDestLongitudeRef
'exif-gpslongitude-e' => 'ลองจิจูดตะวันออก',
'exif-gpslongitude-w' => 'ลองจิจูดตะวันตก',

'exif-gpsstatus-a' => 'กำลังทำการวัดอยู่',
'exif-gpsstatus-v' => 'ความสามารถในการวัดตำแหน่ง',

'exif-gpsmeasuremode-2' => 'การวัดสองมิติ',
'exif-gpsmeasuremode-3' => 'การวัดสามมิติ',

# Pseudotags used for GPSSpeedRef and GPSDestDistanceRef
'exif-gpsspeed-k' => 'กิโลเมตรต่อชั่วโมง',
'exif-gpsspeed-m' => 'ไมล์ต่อชั่วโมง',
'exif-gpsspeed-n' => 'นอตส์',

# Pseudotags used for GPSTrackRef, GPSImgDirectionRef and GPSDestBearingRef
'exif-gpsdirection-t' => 'ทิศทางจริง',
'exif-gpsdirection-m' => 'ทิศทางแม่เหล็ก',

# External editor support
'edit-externally'      => 'แก้ไขไฟล์นี้โดยใช้ซอฟต์แวร์ตัวอื่น',
'edit-externally-help' => 'ดูเพิ่มที่ [http://www.mediawiki.org/wiki/Manual:External_editors วิธีการตั้งค่า]',

# 'all' in various places, this might be different for inflected languages
'recentchangesall' => 'ทั้งหมด',
'imagelistall'     => 'ทั้งหมด',
'watchlistall2'    => 'ทั้งหมด',
'namespacesall'    => 'ทั้งหมด',
'monthsall'        => 'ทั้งหมด',

# E-mail address confirmation
'confirmemail'             => 'ยืนยันอีเมล',
'confirmemail_noemail'     => 'ไม่ได้ใส่อีเมลในส่วน [[Special:Preferences|การตั้งค่าส่วนตัว]]',
'confirmemail_text'        => 'ถ้าต้องการใช้คำสั่งพิเศษในด้านอีเมสล จำเป็นต้องใส่ค่าอีเมลก่อน โดยกดที่ปุ่มด้านล่าง และทางระบบจะส่งไปที่อีเมลนี้ ในอีเมลจะมีลิงก์ซึ่งมีรหัสสำหรับยืนยันอีเมล',
'confirmemail_pending'     => '<div class="error">รหัสยืนยันได้ถูกส่งไปที่อีเมลของคุณ ถ้าได้สร้างบัญชีเร็วนี้ ให้รอซักครู่ก่อนที่จะขอรหัสอีกครั้งหนึ่ง</div>',
'confirmemail_send'        => 'ส่งรหัสยืนยันผ่านทางอีเมล',
'confirmemail_sent'        => 'อีเมลยืนยันได้ส่งเรียบร้อย',
'confirmemail_oncreate'    => 'รหัสยืนยันได้ถูกส่งไปที่อีเมล อย่างไรก็ตามรหัสนี้ไม่จำเป็นสำหรับการล็อกอิน เว้นเสียแต่ว่าต้องการใช้คำสั่งพิเศษในด้านอีเมลของวิกินี้',
'confirmemail_sendfailed'  => 'ส่งรหัสยืนยันไม่ได้ กรุณาตรวจสอบอีเมลว่าถูกต้อง

ข้อความตีกลับ: $1',
'confirmemail_invalid'     => 'รหัสยืนยันไม่ถูกต้อง หรือรหัสหมดอายุ',
'confirmemail_needlogin'   => 'ต้องทำการ $1 เพื่อยืนยันอีเมลของคุณว่าถูกต้อง',
'confirmemail_success'     => 'อีเมลคุณได้รับการยืนยันแล้ว คุณอาจจะล็อกอินและมีความสุขกับวิกิ',
'confirmemail_loggedin'    => 'อีเมลคุณได้รับการยืนยันแล้ว',
'confirmemail_error'       => 'มีปัญหาเกิดขึ้นในการยืนยันอีเมล',
'confirmemail_subject'     => '{{SITENAME}} ยืนยันการใช้งานอีเมล',
'confirmemail_body'        => 'ใครบางคนซึ่งอาจจะเป็นคนจากหมายเลขไอพี $1 ได้ลงทะเบียนในชื่อ "$2" โดยใช้อีเมลนี้ที่ {{SITENAME}}

ถ้านี่เป็นการลงทะเบียนของคุณ คุณสามารถยืนยันได้โดยการกดลิงก์ที่เว็บเบราว์เซอร์ :

$3

ถ้านี่ไม่ใช่บัญชีคุณ กรุณา*อย่า*กดลิงก์ด้านบน แต่ขอให้กดตามลิงก์ข้างล่างแทน

$5

รหัสยืนยันนี้จะหมดอายุเมื่อ $4

ขอขอบคุณในความร่วมมือของคุณ',
'confirmemail_invalidated' => 'การยืนยันทางอีเมลได้ถูกยกเลิกแล้ว',
'invalidateemail'          => 'ยกเลิกการยืนยันทางอีเมล',

# Scary transclusion
'scarytranscludedisabled' => '[ส่งค่าของอินเตอร์วิกิถูกระงับ]',
'scarytranscludefailed'   => '[ขอโทษด้วย แม่แบบไม่สามารถส่งค่าได้สำหรับ $1]',
'scarytranscludetoolong'  => '[ขอโทษด้วย ยูอาร์แอลยาวเกินไป]',

# Trackbacks
'trackbackbox'      => '<div id="mw_trackbacks">
ตามรอยหน้านี้:<br />
$1
</div>',
'trackbackremove'   => ' ([$1 ลบ])',
'trackbacklink'     => 'ตามรอย',
'trackbackdeleteok' => 'รอยที่เก็บไว้ถูกลบ',

# Delete conflict
'deletedwhileediting' => "'''คำเตือน''': หน้านี้ถูกลบไปแล้วในขณะที่คุณกำลังแก้ไข!",
'confirmrecreate'     => "ผู้ใช้ [[User:$1|$1]] ([[User talk:$1|พูดคุย]]) ได้ลบหน้านี้ในช่วงที่คุณกำลังแก้ไข ด้วยเหตุผลว่า:
: ''$2''
กรุณายืนยันว่าต้องการสร้างหน้านี้ขึ้นมาใหม่",
'recreate'            => 'สร้างใหม่',

# HTML dump
'redirectingto' => 'กำลังเปลี่ยนทางไปที่ [[:$1]]...',

# action=purge
'confirm_purge'        => 'ล้างแคชสำหรับหน้านี้หรือไม่

$1',
'confirm_purge_button' => 'ตกลง',

# AJAX search
'searchcontaining' => "ค้นหาที่มีส่วนประกอบ ''$1''",
'searchnamed'      => "ค้นหาหน้าชื่อ ''$1''",
'articletitles'    => "หน้าที่เริ่มต้นด้วย ''$1''",
'hideresults'      => 'ซ่อนผลลัพธ์',
'useajaxsearch'    => 'ใช้การค้นหาผ่านเอแจ็กซ์',

# Multipage image navigation
'imgmultipageprev' => '← หน้าก่อนหน้า',
'imgmultipagenext' => 'หน้าถัดไป →',
'imgmultigo'       => 'ไป!',
'imgmultigoto'     => 'ไปที่หน้า $1',

# Table pager
'ascending_abbrev'         => 'หน้าไปหลัง',
'descending_abbrev'        => 'หลังมาหน้า',
'table_pager_next'         => 'หน้าถัดไป',
'table_pager_prev'         => 'หน้าก่อนหน้า',
'table_pager_first'        => 'หน้าแรก',
'table_pager_last'         => 'หน้าสุดท้าย',
'table_pager_limit'        => 'แสดง $1 รายการต่อหน้า',
'table_pager_limit_submit' => 'ค้นหา',
'table_pager_empty'        => 'ไม่พบที่ต้องการ',

# Auto-summaries
'autosumm-blank'   => 'ทำหน้าว่าง',
'autosumm-replace' => "แทนทีข้อความทั้งหมดด้วย '$1'",
'autoredircomment' => 'เปลี่ยนทางไปที่ [[$1]]',
'autosumm-new'     => 'สร้างหน้าใหม่: $1',

# Size units
'size-bytes'     => '$1 ไบต์',
'size-kilobytes' => '$1 กิโลไบต์',
'size-megabytes' => '$1 เมกะไบต์',
'size-gigabytes' => '$1 กิกะไบต์',

# Live preview
'livepreview-loading' => 'กำลังโหลด…',
'livepreview-ready'   => 'กำลังโหลด… เสร็จ!',
'livepreview-failed'  => 'แสดงตัวอย่างทันทีไม่ได้ ให้ลองใช้การแสดงตัวอย่างแบบธรรมดา',
'livepreview-error'   => 'เชื่อมต่อไม่ได้: $1 "$2" ให้ลองใช้แสดงตัวอย่างแบบธรรมดา',

# Friendlier slave lag warnings
'lag-warn-normal' => 'การปรับปรุงที่ใหม่กว่า $1 วินาที อาจไม่แสดงผลในรายการนี้',
'lag-warn-high'   => 'เนื่องจากปัญหาการล่าช้าของเซิร์ฟเวอร์ฐานข้อมูล การปรับปรุงที่ใหม่กว่า $1 วินาที อาจไม่แสดงผลในรายการนี้',

# Watchlist editor
'watchlistedit-numitems'       => 'รายการเฝ้าดูมี $1 รายการ ไม่รวมหน้าพูดคุย',
'watchlistedit-noitems'        => 'ไม่มีหัวข้อใดในรายการเฝ้าดู',
'watchlistedit-normal-title'   => 'แก้ไขรายการเฝ้าดู',
'watchlistedit-normal-legend'  => 'ลบชื่อหัวข้อออกจากรายการเฝ้าดู',
'watchlistedit-normal-explain' => 'หัวข้อที่อยู่ในรายการเฝ้าดูแสดงด้านล่าง ถ้าต้องการลบออกให้เลือกที่กล่องด้านข้างแต่ละหัวข้อ และกดลบออก หรืออาจจะ[[Special:Watchlist/raw|แก้ไขรายการทั้งหมด]]',
'watchlistedit-normal-submit'  => 'ลบหัวข้อ',
'watchlistedit-normal-done'    => '$1 รายการได้ถูกนำออกจากรายการเฝ้าดู:',
'watchlistedit-raw-title'      => 'แก้ไขรายการเฝ้าดูทั้งหมด',
'watchlistedit-raw-legend'     => 'แก้ไขรายการเฝ้าดูทั้งหมด',
'watchlistedit-raw-explain'    => 'หัวข้อในรายการเฝ้าดูแสดงด้านล่าง ซึ่งสามารถเพิ่มหรือนำออกได้ หนึ่งหัวข้อต่อหนึ่งแถว เมื่อแก้ไขเสร็จแล้ว ให้กดอัปเดตรายการเฝ้าดู ซึ่งอาจแก้ไขผ่าน [[Special:Watchlist/edit|โปรแกรมพแก้ไขข้อความทั่วไป]]',
'watchlistedit-raw-titles'     => 'หัวข้อ:',
'watchlistedit-raw-submit'     => 'อัปเดตรายการเฝ้าดู',
'watchlistedit-raw-done'       => 'รายการเฝ้าดูได้ถูกอัปเดต',
'watchlistedit-raw-added'      => '$1 หัวข้อได้ถูกเพิ่มเข้าไป:',
'watchlistedit-raw-removed'    => '$1 หัวข้อได้ถูกนำออกไป:',

# Watchlist editing tools
'watchlisttools-view' => 'ดูการเปลี่ยนแปลงที่เกี่ยวข้อง',
'watchlisttools-edit' => 'ดูและแก้ไขรายการเฝ้าดู',
'watchlisttools-raw'  => 'แก้ไขรายการเฝ้าดูทั้งหมด',

# Core parser functions
'unknown_extension_tag' => 'ไม่รู้จัก tag ส่วนขยาย (extension tag) "$1"',

# Special:Version
'version'                          => 'รุ่นซอฟต์แวร์', # Not used as normal message but as header for the special page itself
'version-extensions'               => 'ส่วนขยายเพิ่ม (extension) ที่ติดตั้ง',
'version-specialpages'             => 'หน้าพิเศษ',
'version-parserhooks'              => 'ฮุกที่มีการพาร์สค่า',
'version-variables'                => 'ตัวแปร',
'version-other'                    => 'อื่นๆ',
'version-mediahandlers'            => 'ตัวจัดการเกี่ยวกับสื่อ (media handler)',
'version-hooks'                    => 'ฮุก',
'version-extension-functions'      => 'ฟังก์ชันจากส่วนขยายเพิ่ม (extension function)',
'version-parser-extensiontags'     => 'แท็กที่มีการใช้งานของพาร์สเซอร์',
'version-parser-function-hooks'    => 'ฮุกที่มีฟังก์ชันพาร์สเซอร์',
'version-skin-extension-functions' => 'ฟังก์ชันส่วนขยายเพิ่ม (extension function) สำหรับสกินหรือแบบหน้าตา',
'version-hook-name'                => 'ชื่อฮุก',
'version-hook-subscribedby'        => 'สนับสนุนโดย',
'version-version'                  => 'รุ่น',
'version-license'                  => 'สัญญาอนุญาต',
'version-software'                 => 'ซอฟต์แวร์ที่ติดตั้ง',
'version-software-product'         => 'ชื่อ',
'version-software-version'         => 'รุ่น',

# Special:FilePath
'filepath'         => 'ตำแหน่งไฟล์',
'filepath-page'    => 'ไฟล์ :',
'filepath-submit'  => 'ตำแหน่งไฟล์',
'filepath-summary' => 'หน้าพิเศษนี้คืนค่าเป็นเส้นทางเต็มของไฟล์
ไฟล์ภาพจะถูกแสดงในขนาดเต็ม และไฟล์ประเภทอื่นจะถูกเปิดด้วยโปรแกรมที่เกี่ยวข้องโดยตรง

กรุณาป้อนชื่อไฟล์โดยไม่มี "{{ns:image}}:" นำหน้า',

# Special:FileDuplicateSearch
'fileduplicatesearch'          => 'ค้นหาไฟล์ที่ซ้ำซ้อน',
'fileduplicatesearch-summary'  => 'ค้นหาไฟล์ที่ซ้ำซ้อนด้วยค่าแฮชของไฟล์

กรุณาป้อนชื่อไฟล์โดยไม่มี "{{ns:image}}:" นำหน้า',
'fileduplicatesearch-legend'   => 'ค้นหาไฟล์ที่ซ้ำกัน',
'fileduplicatesearch-filename' => 'ชื่อไฟล์ :',
'fileduplicatesearch-submit'   => 'ค้นหา',
'fileduplicatesearch-info'     => '$1 × $2 พิกเซล<br />ขนาดไฟล์: $3<br />ชนิดของไมม์: $4',
'fileduplicatesearch-result-1' => 'ไม่มีไฟล์ที่ซ้ำกับไฟล์ "$1"',
'fileduplicatesearch-result-n' => 'มี {{PLURAL:$2|ไฟล์เดียว|$2 ไฟล์}}ที่ซ้ำกับไฟล์ "$1"',

# Special:SpecialPages
'specialpages'                   => 'หน้าพิเศษ',
'specialpages-note'              => '----
* หน้าพิเศษปกติ
* <span class="mw-specialpagerestricted">หน้าพิเศษสำหรับผู้ดูแล</span>',
'specialpages-group-maintenance' => 'รายงานการเก็บกวาด',
'specialpages-group-other'       => 'หน้าพิเศษอื่น ๆ',
'specialpages-group-login'       => 'ล็อกอิน / สร้างบัญชีผู้ใช้ใหม่',
'specialpages-group-changes'     => 'ปรับปรุงล่าสุดและปูมต่าง ๆ',
'specialpages-group-media'       => 'รายงานเรื่องสื่อและการอัปโหลด',
'specialpages-group-users'       => 'ผู้ใช้และสิทธิ',
'specialpages-group-highuse'     => 'หน้าที่มีการใช้สูง',
'specialpages-group-pages'       => 'รายการหน้า',
'specialpages-group-pagetools'   => 'เครื่องมือเกี่ยวกับหน้าต่าง ๆ',
'specialpages-group-wiki'        => 'เครื่องมือและข้อมูลวิกิ',
'specialpages-group-redirects'   => 'เปลี่ยนทางหน้าพิเศษ',
'specialpages-group-spam'        => 'เครื่องมือเกี่ยวกับสแปม',

# Special:BlankPage
'blankpage'              => 'หน้าว่างเปล่า',
'intentionallyblankpage' => 'หน้านี้ถูกทิ้งว่างโดยเจตนา',

);
