<?php
/** Moksha (Мокшень)
 *
 * @ingroup Language
 * @file
 *
 * @author Khazar II
 * @author Kranch
 * @author Numulunj pilgae
 */

$fallbak = 'ru';

$messages = array(
# User preference toggles
'tog-underline'               => 'Сюлмафкснень алга китькстамс:',
'tog-highlightbroken'         => 'Латцемс синьтьф сюлмафкснень <a href="" class="new">вага ста</a> (илякс: вага ста<a href="" class="internal">?</a>).',
'tog-justify'                 => 'Тиемс сёрматфть фкакс ушедоматнень лопать кувалмова',
'tog-hideminor'               => 'Од полафтоматнень эса кяшемс ёмланя видептематне',
'tog-extendwatchlist'         => 'Келептемс мельгеваномать сембе полафтоматнень няфтемга',
'tog-usenewrc'                => 'Цебярьгофтф од илякстоптомат (JavaScript)',
'tog-numberheadings'          => 'Сёрмадома коняксс лувомтяшксне эслек путовихть',
'tog-showtoolbar'             => 'Кядьёнкс седяфксть няфтемс сёрмадомбачк (JavaScript)',
'tog-editondblclick'          => 'Кафксть люпштазь сувамс сёрматфть петнема (JavaScript)',
'tog-editsection'             => 'Няфтемс сюлмафксть [петемс] эрь пяльксонди',
'tog-editsectiononrightclick' => 'Петнемс пялькстне: люпштамс сёрмадомбяльксть лемонц лангс видешире пуняса (JavaScript)',
'tog-showtoc'                 => 'Няфтемс сёрматфть потмакс (лопатнень, конатнень эса 3 сёрмадома конякста лама)',
'tog-rememberpassword'        => 'Ванфтомс монь сувама лемозе тя содама машинаса',
'tog-editwidth'               => 'Петнема паксясь сембе вальмать келес',
'tog-watchcreations'          => 'Сувафтомс монь тефть лопатне монь мельгеваномазон',
'tog-watchdefault'            => 'Сувафтомс монь петнема лопане монь мельгеваномазон',
'tog-watchmoves'              => 'Лопать илякстоптомста сувафтомс сонь монь мельгеваномазон',
'tog-watchdeletion'           => 'Лопать нардамста сувафтомс сонь монь мельгеваномазон',
'tog-minordefault'            => 'Тяшксемс сембе петема анцяйнятне мъзярс илякс изь мярьгов',
'tog-previewontop'            => 'Няфтемс сёрматфть васень няфтемать петемань седяфксть инголе',
'tog-previewonfirst'          => 'Васень няфтема васенце петнемада меле',
'tog-nocache'                 => 'Аф мярьгома лопатнень эслек ванфневи файлснон тиемс',
'tog-enotifwatchlistpages'    => 'Кучемс электрононь сёрма монь ванома лопать илякстоптомада меле',
'tog-enotifusertalkpages'     => 'Кучемс электрононь сёрма монь тиить корхтама лопанц илякстоптомада меле',
'tog-enotifminoredits'        => 'Кучемс электрононь сёрма нъльне петема анцяйняда меле',
'tog-enotifrevealaddr'        => 'Штафтомс монь электрононь адресозе пачфтема сёрмаса',
'tog-shownumberswatching'     => 'Няфтемс мъзяра сувсида конат арафтозь лопать эсь мельгеваномазост',
'tog-fancysig'                => 'Казяма кядьтяшкст (эслек тиеви сюлмафксфтома)',
'tog-externaleditor'          => 'Нолдамс тевс ушеширень петнить мъзярс илякс изь мярьгов (аньцек тевонь содайхненди, сяс мес эрявихть башка кядьёнкст-арафнемат содама машинаса)',
'tog-externaldiff'            => 'Нолдамс тевс ушеширень програм верзиень ваксс путоманкса мъзярс илякс изь мярьгов (аньцек тевонь содайхненди, сяс мес эрявихть башка кядьёнкст-арафнемат содама машинаса)',
'tog-showjumplinks'           => 'Мярьгомс "юпадемс" сатовома сюлмафкстненди',
'tog-uselivepreview'          => 'Максомс эряй васень няфтемась (JavaScript) (Варжамань)',
'tog-forceeditsummary'        => 'Няфтемс мондине мезе сёрмадомс шава петнема вальмас сувамста',
'tog-watchlisthideown'        => 'Кяшемс монь петнематне ванома лопаста',
'tog-watchlisthidebots'       => 'Кяшемс bot петнематне ванома лопаста.',
'tog-watchlisthideminor'      => 'Кяшемс петнема анцяйнятне ванома лопаста',
'tog-ccmeonemails'            => 'Кучт тейне копия электрононь сермане конатнень кучсайне иля тиихненди.',
'tog-diffonly'                => 'Тят няфте лопань потмоц кафта верзиятнень ваксс путомать ала',
'tog-showhiddencats'          => 'Няфтемс кяшф категориет',

'underline-always'  => 'Фалу',
'underline-never'   => 'Мъзярдонга',
'underline-default' => 'Интернет полатксть кадомс апак полафтт',

'skinpreview' => '(Васень няфтема)',

# Dates
'sunday'        => 'Таргжи (Недляши)',
'monday'        => 'Видеши (Панедельник)',
'tuesday'       => 'Шавши',
'wednesday'     => 'Вержи',
'thursday'      => 'Шуваланя',
'friday'        => 'Шумордамши (Пяденця)',
'saturday'      => 'Ёткши',
'sun'           => 'Тр',
'mon'           => 'Вд',
'tue'           => 'Шв',
'wed'           => 'Вр',
'thu'           => 'Швл',
'fri'           => 'Шм',
'sat'           => 'Ёт',
'january'       => 'Январьгов',
'february'      => 'Февральков',
'march'         => 'Марков',
'april'         => 'Апрельков',
'may_long'      => 'Майгов',
'june'          => 'Июньков',
'july'          => 'Июльков',
'august'        => 'Августков',
'september'     => 'Сентябрьков',
'october'       => 'Октябрьков',
'november'      => 'Ноябрьков',
'december'      => 'Декабрьков',
'january-gen'   => 'Январьговонь',
'february-gen'  => 'Февральковонь',
'march-gen'     => 'Марковонь',
'april-gen'     => 'Апрельковонь',
'may-gen'       => 'Майговонь',
'june-gen'      => 'Июньковонь',
'july-gen'      => 'Июльковонь',
'august-gen'    => 'Августковонь',
'september-gen' => 'Сентябрьковонь',
'october-gen'   => 'Октябрьковонь',
'november-gen'  => 'Ноябрьковонь',
'december-gen'  => 'Декабрьковонь',
'jan'           => 'Янв',
'feb'           => 'Фев',
'mar'           => 'Мар',
'apr'           => 'Апр',
'may'           => 'Май',
'jun'           => 'Июн',
'jul'           => 'Июл',
'aug'           => 'Авг',
'sep'           => 'Сен',
'oct'           => 'Окт',
'nov'           => 'Нов',
'dec'           => 'Дек',

# Categories related messages
'pagecategories'                 => '{{PLURAL:$1|Категорие|Категориет}}',
'category_header'                => '"$1" категориеса лопатне',
'subcategories'                  => 'Субкатегориет',
'category-media-header'          => '"$1" категориеса медиясь',
'category-empty'                 => "''Медиа лопат тя категориеса ашет.''",
'hidden-categories'              => '{{PLURAL:$1|Кяшф категорие|Кяшф категориет}}',
'hidden-category-category'       => 'Кяшф категориет', # Name of the category where hidden categories will be listed
'category-subcat-count'          => '{{PLURAL:$2|Тя категориеса аньцек фкя субкатегорие.|Тя категориеса  {{PLURAL:$1|субкатегорие|$1 субкатегориет}}, $2-нь эста.}}',
'category-subcat-count-limited'  => 'Тя категориеса {{PLURAL:$1|субкатегорие|$1 субкатегориет}}.',
'category-article-count'         => '{{PLURAL:$2|Тя категориеса аньцек фкя лопа.|Вага {{PLURAL:$1|лопа|$1 лопат}} тя категориеса $2-нь эста.}}',
'category-article-count-limited' => 'Вага {{PLURAL:$1|лопа|$1 лопат}} тя категориеса.',
'category-file-count'            => '{{PLURAL:$2|Тя категориеса аньцек фкя файл.|Вага {{PLURAL:$1|файл|$1 файлхт}} тя категориеса $2-нь эста.}}',
'category-file-count-limited'    => 'Вага {{PLURAL:$1|файл|$1 файлхт}} тя категориеса.',
'listingcontinuesabbrev'         => 'полатксоц',

'mainpagetext'      => "<big>'''МедиаВикить арафтозь лац.'''</big>",
'mainpagedocfooter' => 'Ванк [http://meta.wikimedia.org/wiki/Help:Contents Ветямовал Тиинди] тяса ули кода содамс Вики програпнень эрявикснень колга.

== Эрявикс сюлмафксне ==

* [http://www.mediawiki.org/wiki/Manual:Configuration_settings Васьфневи арафнематнень кярькссь]
* [http://www.mediawiki.org/wiki/Manual:FAQ МедиаВикить Сидеста Кеподеви Кизефксне]
* [http://lists.wikimedia.org/mailman/listinfo/mediawiki-announce МедиаВикить од верзиятнень колга кулянь пачфтема]',

'about'          => 'Колганза',
'article'        => 'Сёрматфть потмонц лопац',
'newwindow'      => '(панчсеви од вальмаса)',
'cancel'         => 'Мърдамс меки',
'qbfind'         => 'Мук',
'qbbrowse'       => 'Ванондома',
'qbedit'         => 'Петнема',
'qbpageoptions'  => 'Тя лопась',
'qbpageinfo'     => 'Контекстсь',
'qbmyoptions'    => 'Монь лопане',
'qbspecialpages' => 'Башка тевонь лопат',
'moredotdotdot'  => 'Сяда лама...',
'mypage'         => 'Монь лопазе',
'mytalk'         => 'Монь корхтамазе',
'anontalk'       => 'Корхтамс тя IP-ть мархта',
'navigation'     => 'Навигацие',
'and'            => 'эди',

# Metadata in edit box
'metadata_help' => 'Метадата:',

'errorpagetitle'    => 'Эльбятькс',
'returnto'          => 'Мърдамс $1-с.',
'tagline'           => '{{SITENAME}}-ста',
'help'              => 'Лезкс',
'search'            => 'Вешендемс',
'searchbutton'      => 'Вешентьк',
'go'                => 'Аре',
'searcharticle'     => 'Аре',
'history'           => 'Лопань полафнемат',
'history_short'     => 'Ётай полафнемат',
'updatedmarker'     => 'мекольце сашендомазень меле полафтовсь',
'info_short'        => 'Информацие',
'printableversion'  => 'Лихтеви верзие',
'permalink'         => 'Ялань сюлмафкс',
'print'             => 'Нолдамс',
'edit'              => 'Петнеме',
'create'            => 'Тиемс',
'editthispage'      => 'Петнемс тя лопать',
'create-this-page'  => 'Тиемс тя лопать',
'delete'            => 'Нардамс',
'deletethispage'    => 'Нардамс тя лопать',
'undelete_short'    => 'Мърдафтомс {{PLURAL:$1|петнема|$1 петнемат}}',
'protect'           => 'Араламс',
'protect_change'    => 'полафтомс прянь араламать',
'protectthispage'   => 'Араламс тя лопать',
'unprotect'         => 'Валхтомс араламать',
'unprotectthispage' => 'Валхтомс тя лопать араламац',
'newpage'           => 'Од лопа',
'talkpage'          => 'Корхтамс тя лопать колга',
'talkpagelinktext'  => 'Корхтама',
'specialpage'       => 'Башка тевонь лопа',
'personaltools'     => 'Эсь кядьёнкст',
'postcomment'       => 'Кучемс арьсемат',
'articlepage'       => 'Ваномс потмакслопать',
'talk'              => 'Корхнема',
'views'             => 'Ванфт',
'toolbox'           => 'Кядьёнкс кярькс',
'userpage'          => 'Ваномс тиить лопанц',
'projectpage'       => 'Ваномс проектть лопанц',
'imagepage'         => 'Ваномс медиа лопать',
'mediawikipage'     => 'Ваномс сёрма лопать',
'templatepage'      => 'Ваномс кепотькс лопать',
'viewhelppage'      => 'Ваномс лезкс лопать',
'categorypage'      => 'Ваномс категориень лопать',
'viewtalkpage'      => 'Ваномс корхнемат',
'otherlanguages'    => 'Иля кяльса',
'redirectedfrom'    => '(Ётафтф $1-ста)',
'redirectpagesub'   => 'Ётафтфкс лопа',
'lastmodifiedat'    => 'Тя лопать мекольцеда петнезь $2, $1.', # $1 date, $2 time
'viewcount'         => 'Тя лопас сувасть {{PLURAL:$1|весть|$1-ксть}}.',
'protectedpage'     => 'Тя лопать аралаф',
'jumpto'            => 'Юпадемс тязк:',
'jumptonavigation'  => 'навигацие',
'jumptosearch'      => 'вешендема',

# All link text and link target definitions of links into project namespace that get used by other message strings, with the exception of user group pages (see grouppage) and the disambiguation template definition (see disambiguations).
'aboutsite'            => '{{SITENAME}} колга',
'aboutpage'            => 'Project:Колга',
'bugreports'           => 'Эльбятькс колга пачфтемат',
'bugreportspage'       => 'Project:Эльбятькс колга пачфтемат',
'copyright'            => 'Сёрматфсь ули кода мумс $1-са.',
'copyrightpagename'    => '{{SITENAME}} копияма видекс',
'copyrightpage'        => '{{ns:project}}:Копияма видекст',
'currentevents'        => 'Мезе тяса моли',
'currentevents-url'    => 'Project:Мезе тяса моли',
'disclaimers'          => 'Видешинь корхтаматне',
'disclaimerpage'       => 'Project:Пря видешинь корхнема',
'edithelp'             => 'Петнемань лезкс',
'edithelppage'         => 'Help:Петнема',
'faq'                  => 'Сидеста Кеподеви Кизефксне',
'faqpage'              => 'Project:Сидеста Кеподеви Кизефксне',
'helppage'             => 'Help:Лопань потмоц',
'mainpage'             => 'Пря лопа',
'mainpage-description' => 'Пря лопа',
'policy-url'           => 'Project:Политик',
'portal'               => 'Пуромксонь вальма',
'portal-url'           => 'Project:Пуромксонь вальма',
'privacy'              => 'Сёпомань политиксь',
'privacypage'          => 'Project:Сёпомань политиксь',

'badaccess'        => 'Мярьговома эльбятькс',
'badaccess-group0' => 'Тондейть аф мярьгови тиемс ся мезе тон вешеть.',
'badaccess-group1' => 'Тевсь тон вешеть мярьгови тиемс аньцек полга $1-ть тиихненди.',
'badaccess-group2' => 'Тевсь тон вешить мярьгови тиемс аньцек фкя полгань тиихненди $1ть полгатнень ёткса.',
'badaccess-groups' => 'Тевсь тон вешеть мярьгови тиемс аньцек фкя полгань тиихненди  $1-ть полгатнень йоткса.',

'versionrequired'     => 'Эряви МедиаВикить верзиенц $1',
'versionrequiredtext' => 'Тя лопать панжеманцты эрявксты МедиаВикить верзие $1. Ванк [[Special:Version|верзиень лопась]].',

'ok'                      => 'OK',
'retrievedfrom'           => '"$1"-ста сявф',
'youhavenewmessages'      => 'Тонь ули $1 ($2).',
'newmessageslink'         => 'Од сёрмат',
'newmessagesdifflink'     => 'мекольце полафтома',
'youhavenewmessagesmulti' => 'Тонь улихть од сёрмат $1-са',
'editsection'             => 'петнемс',
'editold'                 => 'петнемс',
'viewsourceold'           => 'лисьма ваномс',
'editsectionhint'         => 'Петемс пялькс: $1',
'toc'                     => 'Лопань потмоц',
'showtoc'                 => 'няфтемс',
'hidetoc'                 => 'кяшемс',
'thisisdeleted'           => 'Ваномс эли мърдафтомс $1?',
'viewdeleted'             => 'Ваномс $1?',
'restorelink'             => '{{PLURAL:$1|нардаф петнема|$1 нардаф петнемат}}',
'feedlinks'               => 'Сортса:',
'feed-invalid'            => 'Аф кондясти сёрматфтома каналть сортоц.',
'feed-unavailable'        => 'Фкяпингонь материал нолдама аш {{SITENAME}}-са',
'site-rss-feed'           => '$1 RSS линия',
'site-atom-feed'          => '$1 Atom линия',
'page-rss-feed'           => '"$1" RSS линия',
'page-atom-feed'          => '"$1" Atom линия',
'red-link-title'          => '$1 (нинге аф сёрматф)',

# Short words for each namespace, by default used in the namespace tab in monobook
'nstab-main'      => 'Лопа',
'nstab-user'      => 'Тиить лопась',
'nstab-media'     => 'Медиа лопась',
'nstab-special'   => 'Башка лопа',
'nstab-project'   => 'Проектонь лопа',
'nstab-image'     => 'Файл',
'nstab-mediawiki' => 'Сёрма',
'nstab-template'  => 'Лопа кепотькс',
'nstab-help'      => 'Лезкс лопа',
'nstab-category'  => 'Категорие',

# Main script and global functions
'nosuchaction'      => 'Тянь тиемс аш кода',
'nosuchactiontext'  => 'Аш кода морафтомс тя URL-са сёрматф кошардоматне Викить програматнень вельде.',
'nosuchspecialpage' => 'Стама башка лопа аш',
'nospecialpagetext' => "<big>'''Аш стама башка лопа.'''</big>

Ванк [[Special:SpecialPages|{{int:specialpages}}]].",

# General errors
'error'                => 'Эльбятькс',
'databaseerror'        => 'Датабаза эльбятькс',
'dberrortext'          => 'Датабазань вешендембачк лиссь синтакс эльбятькс.
Тя, улема, програмонь эльбятькс.
Мекольце датабазонь вешендема ульсь:
<blockquote><tt>$1</tt></blockquote>
функциеста "<tt>$2</tt>".
MySQL мърдафтозе эльбятьксть "<tt>$3: $4</tt>".',
'dberrortextcl'        => 'Датабазонь вешендембачк лиссь синтакс эльбятькс.
Мекольце датабазонь вешендема ульсь:
"$1"
функциеста "$2".
MySQL мърдафтозе эльбятьксть "$3: $4"',
'noconnect'            => 'Викиса тяни листь текникань проблепт ди аш кода сотнемс датабазонь серверть мархта. <br />
$1',
'nodb'                 => 'Аш кода сотомс $1 датабаза мархта',
'cachederror'          => 'Тя лопать копияц, кона, улема, сирелгодсь тяниень верзиенц коряс.',
'laggedslavemode'      => 'Шарфтк мяльце: Тя лопась, улема, сирелгодсь.',
'readonly'             => 'Датабазась пякстаф',
'enterlockreason'      => 'Сёрматк тязк пякстама туфтал тонь арьсемацень мархта эли няфтть тяса мъзярда ули кода пякстамать валхтомс.',
'readonlytext'         => 'Датабазась тяни пякстаф од сёрмадоматненди эли полафнематненди, шятьта нежедематненди, меле сон мърдай эрьшинь покаманцты.

Оцюнясь кона сонь пякстазе арьсезе сонь шарьхкотьфтемац: $1',
'missing-article'      => 'Датабазаса аф муви текст конань эряви мумс, сонь лемоц "$1" $2.

Тя сидеста лиси мъзярда молят сирелготф верзиева эли историянь сюлмафксова, кона вяти нардаф лопас.

Лисендяряй аф тяфта, тонь програмкярькссот, улема, эвондась си (эльбятькс).
Пачфтть тянь колга [[Special:ListUsers/sysop|системонь вятиксонди]] URL адресть тяштезь.',
'missingarticle-rev'   => '(верзие#: $1)',
'missingarticle-diff'  => '(Верзиенза: $1, $2)',
'readonly_lag'         => 'Датабазась эслек пякстась мъзярс кядяла датабаза серверхт сотни прясерверть мархта',
'internalerror'        => 'Потмонь эльбятькс',
'internalerror_info'   => 'Потмонь эльбятькс: $1',
'filecopyerror'        => 'Аш кода копиямс файл "$1" файл "$2"с.',
'filerenameerror'      => 'Аш кода "$1" файлти максомс од лем "$2".',
'filedeleteerror'      => 'Файл "$1" аф нардави.',
'directorycreateerror' => 'Директорие "$1" аф тиеви.',
'filenotfound'         => 'Файл "$1" аф муви.',
'fileexistserror'      => 'Файл "$1" аф сёрмадови: стама файлсь ульсь ни',
'unexpected'           => 'Аф шарьхкодеви смузьсь: "$1"="$2".',
'formerror'            => 'Эльбятькс: Формсь аф кучеви',
'badarticleerror'      => 'Тя лопаса тя аф тиеви.',
'cannotdelete'         => 'Лопась эли кочкаф файлсь аф нардави. (Сон, улема, нардафоль инголе.)',
'badtitle'             => 'Аф кондясти лем',
'badtitletext'         => 'Вешф лопань лемоц аф тяфтама эли шава, шятьта кялень-ётка эли викинь-ётка лемсна аф лац сюлмафт. Сонь эса, улема ащи фкя эли сяда лама башка тяштькстт конат коняксонди аф кондястихть.',
'perfdisabled'         => 'Ужялькс! Тя тевсь аф тиеви мъзярошка пингс сяс мес сон лоткафни датабазать эди киндиге аш кода сонь мархта сотнемс.',
'perfcached'           => 'Вешф програмонь информациесь сёрматфоль эслек ванфневи файлхнень эса ди, улема, сирелгодсь.',
'perfcachedts'         => 'Тя програмонь информациесь сёрматфоль эслек ванфневи файлхнень эса ди мекольцеда одонзаф $1.',
'querypage-no-updates' => 'Тя лопать одонзапне тяни аф тиевихть. Информациесь тяса тяни аф одонзави.',
'wrong_wfQuery_params' => 'Аф кондясти параметратне функцияса wfQuery()<br />
Функцие: $1<br />
Вешфкс: $2',
'viewsource'           => 'Ваномс лисьмоть',
'viewsourcefor'        => 'Лопа $1',
'actionthrottled'      => 'Куроксшись кирьфтаф',
'actionthrottledtext'  => 'Лудна мархта тюрема туфталонкса тя тевть ламоксть тиемась нюрьхконя ётка пингста кардаф. Эняльттяма мърдамс тя тевти мъзярошка минутода меле.',
'protectedpagetext'    => 'Тя лопас сувама пякстаф лопань петнема кардамать сюнеда.',
'viewsourcetext'       => 'Тейть ули кода ваномс эди копиямс тя лопать лисьмоц:',
'protectedinterface'   => 'Тя лопаса ащи лопать ванфонц програмонь текстоц, сон пякстаф кальдяв тевда араламать сюнеда.',
'editinginterface'     => "'''Инголе кардама:''' Тон петнесак лопать конань эса ащи лопать ванфонц програмонь текстоц. Петнематне полафтсазь сонь ванфоц кода сон няеви иля тиихненди. Ётафтома тиеманкса эняльттяма ваномс [http://translatewiki.net/wiki/Main_Page?setlang=mdf Betawiki] МедиаВикить локализациеть проектть.",
'sqlhidden'            => '(SQL вешфкс кяшф)',
'cascadeprotected'     => 'Тя лопать аралазь петнемада сяс мес сон сувафни {{PLURAL:$1|сай лопас, кона путфоль|сай лопас, конат путфольхть}} каскад араламас:
$2',
'namespaceprotected'   => "Тондейть аф мярьгови петнемс лопатне '''$1''' лепнень мархта.",
'customcssjsprotected' => 'Тондейть аф мярьгови петнемс тя лопать сяс мес тяса улихть иля тиить латцеманза.',
'ns-specialprotected'  => '{{ns:special}} лепнень мархта лопатне аф петневихть.',
'titleprotected'       => "[[User:$1|$1]] кардазь тя лемсь мархта лопа тиемать.
Туфталсь ''$2''.",

# Virus scanner
'virus-badscanner'     => 'Аф кондясти конфигурациесь: аф содаф вирусонь вешендема програмсь: <i>$1</i>',
'virus-scanfailed'     => 'програмонь вешендемась изь лисе (code $1)',
'virus-unknownscanner' => 'аф содаф антивирус:',

# Login and logout pages
'logouttitle'                => 'Тиить лисема',
'logouttext'                 => '<strong>Тон лисеть.</strong><br />
Тондейть ули кода ащемс {{SITENAME}}са апак содак эли [[Special:UserLogin|сувак тага весть]] кода сяка эли иля тиись. Кой-кона лопатне илядсть стамкс кодамкс синь ульсть тонь лисемада инголе мъзярс тонь интернет полатксце изь аруяфтов эсь ванфневи файлхнень эзда.',
'welcomecreation'            => '== Сувак, $1! ==

Тонь сёрматфтомаце анок. Тят юкста полафнемс эсь [[Special:Preferences|{{SITENAME}} латцематне]].',
'loginpagetitle'             => 'Тиить сувама лемоц',
'yourname'                   => 'Тиить лемоц:',
'yourpassword'               => 'Сувама валце:',
'yourpasswordagain'          => 'Сёрматк сувама валце омбоцекс:',
'remembermypassword'         => 'Ванфтомс монь сувама лемозе тя содама машинаса',
'yourdomainname'             => 'Тонь доменце:',
'externaldberror'            => 'Лиссь эльбятькс ушеширень датабазонь вельде кемокстакшнембачк эли тондейть аф мярьгови полафнемс тонь ушеширень сёрматфтомацень.',
'loginproblem'               => '<b>Тиись аф содаф.</b><br />',
'login'                      => 'Сувама',
'nav-login-createaccount'    => 'Сувама / сёрматфтома',
'loginprompt'                => 'Тондейть эряви нолдамс тевс cookies {{SITENAME}}с суваманди.',
'userlogin'                  => 'Сувама / сёрматфтома',
'logout'                     => 'Лисема',
'userlogout'                 => 'Лисема',
'notloggedin'                => 'Апак сувак',
'nologin'                    => 'Аш сувама лемце? $1.',
'nologinlink'                => 'Сёрматфтомс',
'createaccount'              => 'Тиемс од сёрматфтомась',
'gotaccount'                 => 'Сёрматфтыть ни? $1.',
'gotaccountlink'             => 'Сувамс',
'createaccountmail'          => 'электрононь сёрма вельде',
'badretype'                  => 'Сувама валхне тон путыть аф фкат.',
'userexists'                 => 'Тя лемсь кой-кие сявозь ни. Эняльттяма, арьсек иля лемсь.',
'youremail'                  => 'Электрононь адресце:',
'username'                   => 'Тиить лемоц:',
'uid'                        => 'Тиить идентификациесь:',
'prefs-memberingroups'       => 'Полаяй {{PLURAL:$1|полга|полга}}ста:',
'yourrealname'               => 'Афкуксонь лемце:',
'yourlanguage'               => 'Кяль:',
'yournick'                   => 'Эсь тяшкстама:',
'badsig'                     => 'Аф кондясти казяма кядьтяшксоце; ванк HTML тяштьксне.',
'badsiglength'               => 'Тяшкстамась пяк кувака; аф эряви путомс $1 {{PLURAL:$1|тяшкста|тяшкста}} лама.',
'email'                      => 'Электрононь адресце',
'prefs-help-realname'        => 'Афкуксонь лемце путомась аф лувови эрявикс. Афкуксонь лемцень тязк путомада меле тонь лемце кармай эвондама лопаса тонь петнемацень ала.',
'loginerror'                 => 'Сувама эльбятькс',
'prefs-help-email'           => 'Электрононь адресце тяса аф лувови эрявикс, интай сонь путомась лезды полафнемс сёрмаса иля тиихнень мархта тонь электрононь адресцень апак няфтек. Тондейть ули кода мярьгомс иля тиихнеди тонь мархта сюлмамс тонь тиить вельде эли тиись_корхнема лопа вельде тонць панчсемафтома.',
'prefs-help-email-required'  => 'Эряви электрононь адресце.',
'nocookiesnew'               => 'Тиить сёрматфтомаце анок, аньцек тон изеть сува. {{SITENAME}}-са тиихнень содафтоманкса функцие cookies эряви. Тяни тонь содама машинаса функцие cookies кардаф. Эняльттяма нолдамс тевс cookies, меле сувак од эсь тиить лемцень эди сувама валцень мархта.',
'nocookieslogin'             => '{{SITENAME}} лопаса тиихнень содафтоманкса функцие cookies эряви. Тяни тонь содама машинаса функцие cookies кардаф. Эняльттяма нолдамс тевс cookies, меле сувак тага весть.',
'noname'                     => 'Тон изеть пута кемокстаф тиить лемоц.',
'loginsuccesstitle'          => 'Сувамась ётась лац',
'loginsuccess'               => "'''Тон сувать {{SITENAME}}-с кода \"\$1\".'''",
'nosuchuser'                 => 'Тиись "$1" лемса аш. Ванк, улема, тон сёрмадыть лемть аф лац илякс тондейть эряви [[Special:Userlogin/signup|сёрматфтомс одукс]].',
'nosuchusershort'            => 'Тиись "<nowiki>$1</nowiki>" лемса аш. Ванк, улема, тон сёрмадыть лемть аф лац.',
'nouserspecified'            => 'Тиить лемсь эряви.',
'wrongpassword'              => 'Сувама валсь сёрматф аф лац. Варжак тага весть.',
'wrongpasswordempty'         => 'Сувама валсь кадовсь апак сёрматк. Сёрматк одукс.',
'passwordtooshort'           => 'Тонь сувама валце аф кондясти эли кувалмоц аф саты. Тяса аф эряви путомс {{PLURAL:$1|1 тяшкста|$1 тяшкста}} кържа. Сувама валонцты эряви явовомс тонь тиить лемдот.',
'mailmypassword'             => 'Кучт од сувама валозе электрононь сёрма вельде',
'passwordremindertitle'      => 'Од ёткопингонь сувама валсь {{SITENAME}}с суваманди',
'passwordremindertext'       => 'Кивок (улема, тон IP адреста $1)
вешсь од сувама валсь {{SITENAME}} ($4)с суваманди.
"$2" тиить сувама валоц тяни "$3".
Тондейть эряви сувамс эди путомс од сувама валть.

Улендяряй киге иля кучсь тя вешфксть эли тон мяляфтсак тонь сувама валцень эди тонь тяни аш мяльце сонь полафтома, тят тие мезеге тя пачфтемась самда меле ди киртть тонь ётай сувама валце.',
'noemail'                    => '"$1" тиить электрононь адресоц аш.',
'passwordsent'               => 'Од сувама валсь кучфоль "$1" тиить электрононь адресонцты.
Сувак сонь кундамда меле.',
'blocked-mailpassword'       => 'Петнемат тиемась тонь IP адрестот кардаф. Сувама валть кемокстама функциес кундама аф мярьгови кальдяв тиемада аралама туфталонкса.',
'eauthentsent'               => 'Кемокстама сёрма кучфоль тонь электрононь адресозот.
Тондейть эряви тиендемс ся сёрмастонь вятемовалть коряс эди кемокстамс тя сёрматфтомась афкукс тоннесь иля сёрматнень тонь сёрматфтомас самда инголе.',
'throttled-mailpassword'     => 'Сувама валсь кучфоль ни йотай {{PLURAL:$1|ойста (часста)|$1 ойста (часста)}}.
Кучсеви аньцек фкя сувама валсь {{PLURAL:$1|ойс (часс)|$1 ойс (часс)}} кальдяв тиемада аралама туфталонкса.',
'mailerror'                  => 'Электрононь сёрма кучема эльбятькс: $1',
'acct_creation_throttle_hit' => 'Ужялькс, тон тиеть ни $1 сёрматфтомат. Аф маштови тиемс сяда лама.',
'emailauthenticated'         => 'Тонь электрононь адресце кемокстаф $1-са.',
'emailnotauthenticated'      => 'Тонь электрононь адресце нинге изь кемокста. Викить сёрматнень коряс програмти кодамога сёрмат аф кучевихть.',
'noemailprefs'               => 'Мъзярс тон ашеть пута тонь электрононь адресце Викить сёрматнень коряс програмсь кодамога сёрмат аф кучсыне.',
'emailconfirmlink'           => 'Кемокстак тонь электрононь адресце',
'invalidemailaddress'        => 'Электрононь адресть аф пьрьняндави сяс сонь аф кондясти электрононь адресоц. Путт кондясти электрононь адресонц эли катк тя паксянять шавакс.',
'accountcreated'             => 'Сёрматфтомась тиф',
'accountcreatedtext'         => '$1 тиить сёрматфтомась тиф.',
'createaccount-title'        => 'Сёрматфнемась {{SITENAME}}-с',
'createaccount-text'         => 'Кати-кие тизе сёрматфтомась $2 {{SITENAME}} ($4)-са. "$2" -ть сувама валсь "$3". Тондейть эряви сувамс тозк эди арафтомс од сувама валть.

Улендяряль тя сёрматфтомась эльбятьксокс мезеге тят тие.',
'loginlanguagelabel'         => 'Кяль: $1',

# Password reset dialog
'resetpass'               => 'Сёрматфтомать сувама валсь полафнема',
'resetpass_announce'      => 'Тон сувать ёткопингонь сувама валть вельде кона сась электрононь адресозот. Сувама аделаманди тондейть эряви путомс тязк од сувама вал:',
'resetpass_header'        => 'Полафтомс сувама валть',
'resetpass_submit'        => 'Арафтк сувама валть эди сувак',
'resetpass_success'       => 'Тонь сувама валцень полафнемась ётась лац! Тонь сувафттядязь системс...',
'resetpass_bad_temporary' => 'Аф кондясти ётконь сувама валсь. Шятьта сонь полафтыть ни эли кучить тага фкя вешфкс од сувама валть кундаманкса.',
'resetpass_forbidden'     => '{{SITENAME}}-са сувама валхне аф полафневихть',
'resetpass_missing'       => 'Формса дата аш.',

# Edit page toolbar
'bold_sample'     => 'Эчке сёрмадома',
'bold_tip'        => 'Эчке сёрмадома',
'italic_sample'   => 'Комафтф сёрмадома',
'italic_tip'      => 'Комафтф сёрмадома',
'link_sample'     => 'Сюлмафксонь конякс',
'link_tip'        => 'Потмоширень сюлмафкс',
'extlink_sample'  => 'http://www.example.com кепотькс',
'extlink_tip'     => 'Ушеширень сюлмафкс (киртть мяльса http:// инголькс)',
'headline_sample' => 'Конякссонь валхне',
'headline_tip'    => '2-це аськолксонь конякс',
'math_sample'     => 'Сувафтомс тязк формула',
'math_tip'        => 'Математиконь формула (LaTeX)',
'nowiki_sample'   => 'Сувафтомс тязк форматфтома текст',
'nowiki_tip'      => 'Нулгодемс Викить текст латцемась',
'image_tip'       => 'Путф медиа файлсь',
'media_tip'       => 'Файлть сюлмафкссь',
'sig_tip'         => 'Тонь кядьтяшксоце пинге мархта',
'hr_tip'          => 'Туркс китькс (тевс нолдамс ванфтозь)',

# Edit pages
'summary'                          => 'Нюрьхкяня лихтема',
'subject'                          => 'Тема/конякс',
'minoredit'                        => 'Тя ёмланя видептема',
'watchthis'                        => 'Ваномс тя лопать мельге',
'savearticle'                      => 'Ванфтомс лопать',
'preview'                          => 'Васень няфтема',
'showpreview'                      => 'Максомс васень няфтема',
'showlivepreview'                  => 'Эряй васень няфтема',
'showdiff'                         => 'Няфтемс мезе полафтсь',
'anoneditwarning'                  => "'''Инголе мярьгома:''' Тон изеть сува. Тонь IP адресце кармай сувафтф тя лопать петнема историязонза.",
'missingsummary'                   => "'''Лятфтама:''' Тон изеть макса петнемацень колга нюрьхкяня лихтемась. Люпштандярят \"Ванфтомс лопать\" тага весть, тонь полафнематне кармайхть ванфтфт мяльполатксфтома.",
'missingcommenttext'               => 'Путт тонь арьсематне (мяльполатксоце) алу.',
'missingcommentheader'             => "'''Лятфтама:''' Тон изеть макса тема/конякс тя мяльполатксти. Люпштандярят \"Ванфтомс лопать\" тага весть, тонь полафнематне кармайхть ванфтфт мяльполатксфтома.",
'summary-preview'                  => 'Нюрьхкяня лихтемать сядынголень  няфтема',
'subject-preview'                  => 'Тема/конякс сядынгольдень няфтема',
'blockedtitle'                     => 'Тиить сёлгозь',
'blockedtext'                      => '\'\'\'Тонь тиить лемцень эли IP адресцень сёлгозь.\'\'\'</big>

Тонь сёлгозе $1. 
Туфталсь \'\'$2\'\'.

* Сёлгомать ушеткссь: $8
* Сёлгомать валхтсазь: $6
* Сёлкфсь: $7

Тондейть ули кода корхтамс $1 мархта эли иля [[{{MediaWiki:Grouppage-sysop}}|системонь вятикс]] сёлгомать колга.
Тондейть аш кода нолдамс тевс "кучт электрононь сёрма тя тиинди" функциесь мъзярс тонь электрононь адресце изь кемокста тонь [[Special:Preferences|тиить латцемасонза]] эли тондейть изь мярьгов кучемс сёрмат сёлгома пингста.
Тонь IP адресце тяни $3, сёлгомать ID #$5. 
Сувафтт ся анциянятне эрь кодама тонь вешфксот.',
'autoblockedtext'                  => 'Тонь IP адресце эсезонза сёлговсь сяс мес тя адресста сувась иля тиись, конась $1 сёлкфтозе.
Туфталсь:

:\'\'$2\'\'

* Сёлгомать ушеткссь: $8
* Сёлгомать валхтсазь: $6
* Сёлкфсь: $7


Тондейть ули кода корхтамс $1 эли иля [[{{MediaWiki:Grouppage-sysop}}|системонь вятиксть]] мархта сёлгомать колга.

Тят юкста тондейть аш кода нолдамс тевс "кучт электрононь сёрма тя тиинди" функциесь мъзярс тон изеть кемокста эсь электрононь адресцень тонь [[Special:Preferences|тиить латцемасонза]] эли тондейть изь мярьгов кучемс сёрмат сёлгома пингста.

Тонь ID тяни $5, сёлгомать ID #$5. 
Сувафтт ся анцяйнятне эрь кодама тонь вешфксот.',
'blockednoreason'                  => 'туфтал апак макст',
'blockedoriginalsource'            => "Ванк '''$1'''-ть лисьмоц ала:",
'blockededitsource'                => "'''$1''' лопанди '''тонь петнематнень''' текстсна ала:",
'whitelistedittitle'               => 'Петнема тиеманди эряви сувама лемсь',
'whitelistedittext'                => 'Лопань петнеманкса эряви $1.',
'confirmedittitle'                 => 'Эряви электрононь адресть кемокстама лопань петнеманкса',
'confirmedittext'                  => 'Тондейть эряви кемокстамс тонь электрононь адресцень лопань петнемада инголе. Эняльттяма, путт эди кемокстак тонь электрононь адресце тонь [[Special:Preferences|тиить арафнематне|тиить арафнематнень]] вельде.',
'nosuchsectiontitle'               => 'Аш стама секцие',
'nosuchsectiontext'                => 'Тон тяряфнеть петнемс секция конань тяса аш.  Сяс секцие $1 аш, аш васта ков тонь петнематнень ванфтовольхть.',
'loginreqtitle'                    => 'Сувама лем эряви',
'loginreqlink'                     => 'сувамс',
'loginreqpagetext'                 => 'Тондейть эряви $1 иля лопат ваноманкса.',
'accmailtitle'                     => 'Сувама вал кучф.',
'accmailtext'                      => 'Тиить "$1" сувама валоц кучф $2 адрести.',
'newarticle'                       => '(Од)',
'newarticletext'                   => "Тон сать лопас кона нинге изь тие.
Сёрматк паксяв алу тя лопать тиеманкса
(ванк [[{{MediaWiki:Helppage}}|лезкс лопа]] лездама информациенкса).
Саньдярять тяза эльбядезь, люпштак пунять '''меки''' тонь интернет полатксонь вальмасонза.",
'anontalkpagetext'                 => "----''Тя корхтама лопать тизе лемфтома тиись кона нинге аф сёрматфтф эли кона эсь сёрматфтомас аф кунци. Тяса минь нолдамс сонь лувомтяшкснень IP адресонц тиить содафтоманкса. 
Тя IP адресть вельде ули кода сашендомс иля тиихненди. 
Уляндяряйхть иля тиинь мяльполатксонза конатнень аф видекста лувозь тоннекс, тондейть пароль сай пингста [[Special:UserLogin/signup|сёрматфтомс/сувамс]] иля лемфтома тиихнень марс аф шовореманкса.''",
'noarticletext'                    => 'Тяни аш текст тя лопаса, тондейть ули кода [[Special:Search/{{PAGENAME}}|вешендемс тя лопать коняксонц]] иля лопава эли [{{fullurl:{{FULLPAGENAME}}|action=edit}} кармамс тя лопать тиема].',
'userpage-userdoesnotexist'        => 'Сёрматфтомась «$1» лемса аш. Арьсек лацкаста, афкукс тонь улендяряй мяльце тиемс эли полафтомс тя лопать.',
'clearyourcache'                   => "'''Шарфтк мяльце:''' Ванфтомада меле од полафнематнень ваноманкса тондейть эряви нардамс эслек ванфневи файлхнень тонь интернет полатксонь вальмастонза. '''Mozilla / Firefox / Safari:''' ''Shift'' кирдезь, люпштак ''Reload'', эли люпштак ''Ctrl-Shift-F5'' эли ''Ctrl-R'' (''Command-Shift-R'' Macintosh машинаса); '''Konqueror: '''люпштак ''Reload'' эли люпштак ''F5;'' '''Opera:''' програмса тондейть эрявксты нардамс сембе эслек ванфневи файлхт  ''Tools→Preferences'' вельде; '' '''Internet Explorer:''' ''Ctrl'' кирдезь люпштакшнек ''Refresh'' эли люпштак ''Ctrl-F5.''",
'usercssjsyoucanpreview'           => "<strong>Мялень максома:</strong> Ванфтомада инголе нолдак тевс 'Васень няфтема' пунять тонь од CSS эли JS файлть варжаманкса.",
'usercsspreview'                   => "Киртть мяльсот тя аньцек тонь CSS файлцень васень няфтемац. Сон нинге изь ванфтов!'''",
'userjspreview'                    => "'''Киртть мяльсот тя аньцек тонь JavaScript файлть варжамась/васень няфтемась, сон нинге изь ванфтов!'''",
'userinvalidcssjstitle'            => "'''Инголе мярьгома:''' Аш тема файл \"\$1\" мазопнеманкса. Киртть мяльсот .css эди .js лопас путови аньцек ёмла тяшкса коняксне, кепотьксонди {{ns:user}}:Foo/лем.css афи {{ns:user}}:Foo/Лем.css.",
'updated'                          => '(Одонзаф)',
'note'                             => '<strong>Шарфтк мяльце:</strong>',
'previewnote'                      => '<strong>Тя аньцек васень няфтемась; полафнематне нинге исть ванфтов!</strong>',
'previewconflict'                  => 'Текстсь тя васень няфтемаса няфтеви вярдень петнема паксяса стамкс кодамкс сон няеволь ванфтомада меле.',
'session_fail_preview'             => '<strong>Аш кода тонь петнемаце сувафтомс мекольце информациень юмафтомать сюнеда.
Тик одукс. 
Тага лисентьфтяряй - [[Special:UserLogout|листь]] лопаста ди сувак тага весть.</strong>',
'session_fail_preview_html'        => "<strong>Ужялькс! Аш кода тонь петнемацень сувафтомс мекольце информациень юмафтомать сюнеда.</strong>

''{{SITENAME}}са мярьгови казяма HTML форматсь, васень няфтемась кяшф JavaScript програпть зиянда аралама туфталонкса.''

<strong>Улендяряль тя петнемась мярьговикс, эняльттяма тянь тиемс одукс. 
Тага лисентьфтяряй - [[Special:UserLogout|листь]] лопаста ди сувак тага весть.</strong>",
'token_suffix_mismatch'            => '<strong>Тонь петнемацень кардазь сяс мес тонь програмце аф лац няфнесы китькскя тяшксне петнема паксять эса. Петнемаце кардазь текстть араламанкса. Стама колавома лисеви интернет лемфтома ётка якай серверонь эзда конань якамаса ульсть эльбятькст.</strong>',
'editing'                          => 'Петнемс $1',
'editingsection'                   => 'Петнемс $1 (пялькс)',
'editingcomment'                   => 'Петнемс $1 (мяльполаткс)',
'editconflict'                     => 'Петнема эльбятькс: $1',
'explainconflict'                  => "Кати-кие тя лопать полафтозе мъзярс тон сонь петнить.
Вярдень паксяса тон няйсак текстть стамкс конакс сон кармай няеви «Ванфтомс лопа» пунять люпштамда меле.
Тонь полафнематне няевихть ала, петнема паксять эса.
Тонь полафнематнень текстс нолдаманкса тондейть эряви синь ётафтомс алудонь петнема паксяста вярденнес.
'''Аньцек''' вярдень паксястонь текстть ванфтови \"Ванфтомс лопа\" пунять люпштамда меле\".",
'yourtext'                         => 'Тонь текстце',
'storedversion'                    => 'Ванфтф верзие',
'nonunicodebrowser'                => '<strong>ИНГОЛЕ КАРДАМА: Тонь интернет полатксце аф кирдьсы Unicode. Лопань петемста сембе аф-ASCII тяштьксне кармайхть арама синь кемготувонькърда лувксокс.</strong>',
'editingold'                       => '<strong>ИНГОЛЕ КАРДАМА: Тон петнесак лопать сирелготф верзиенц.
Сембе полафнематне тифт тя верзиеда меле кармайхть юмафтома.</strong>',
'yourdiff'                         => 'Мезьса явовихть',
'copyrightwarning'                 => 'Эняльттяма, шарфтк мяльце сянь лангс, мес сембе поладоматне ди полафтоматне {{SITENAME}}-с лувовихть нолдафокс $2 коряс (ванк $1). Улефтяряй мяльце тонь сёрмадоматнень петнелезь седи апак маряк эди срадолезь эрь кодама вастова, тяза синь тят путне.<br />
Тон стане ина максат вал сянь колга мес сембе тонь сёрмадоматне тиить тонць эли синь сявить марстонь эли иля панжада лисьмаста.
<strong>ТЯТ СУВАФНЕ КОПИЯМА ВИДЕКССА АРАЛАФ МАТЕРИАЛХТ МЯРЬГОМАФТОМА!</strong>',
'copyrightwarning2'                => 'Эняльттяма, шарфтк мяльце сянь лангс, мес сембе поладоматне {{SITENAME}} лопаса улихть кода петемс эли нардамс иля тиихненди.
Улефтяряй мяльце тонь сёрмадоматнень петнелезь, тяза синь тят путне.<br />
Тон стане ина максат вал сянь колга мес сембе тонь сёрмадоматне тиить тонць эли синь сявить марстонь эли иля панжада лисьмаста. (ванк $1).<br />
<strong>ТЯТ СУВАФНЕ КОПИЯМА ВИДЕКССА АРАЛАФ МАТЕРИАЛХТ МЯРЬГОМАФТОМА!</strong>',
'longpagewarning'                  => '<strong>ИНГОЛЕ КАРДАМА: Тя лопать кувалмоц $1 килобайтт; кодамога интернет полатксонь вальмава стакаста петнемс лопат 32 килобайтти мала эли сяда кувака.
Эняльттяма, арьсек улендяряй кода лопать явфтомс сяда ёмла пяльксова.</strong>',
'longpageerror'                    => '<strong>ЭЛЬБЯТЬКС: Тонь текстцень кувалмоц $1 килобайтт, тя максимупть $2 килобайтта лама. Сонь аш кода ванфтомс.</strong>',
'readonlywarning'                  => '<strong>ИНГОЛЕ КАРДАМА: датабазась пякстаф петема покаматнень сюнеда, тя пингста тондейть аш кода ванфтомс тонь петнематнень. Шятьта тондейть пароль синь ванфтомс текст файлс ди путомс тяза меле.</strong>',
'protectedpagewarning'             => '<strong>ИНГОЛЕ КАРДАМА:  Тя лопать пякстаф петнемада, сонь петнема мярьгови аньцек системонь вийксненди.</strong>',
'semiprotectedpagewarning'         => "'''Шарфтк мяльце:''' Тя лопась пякстаф, сонь петнемац мярьгови аньцек сёрматфтф тиихненди.",
'cascadeprotectedwarning'          => "'''ИНГОЛЕ КАРДАМА:''' Тя лопась пякстаф, сонь петнема мярьгови аньцек системонь вийксненди, сяс мес сонь сувафнезь каскад араламать ала {{PLURAL:$1|лопа|лопас}}:",
'titleprotectedwarning'            => '<strong>ИНГОЛЕ КАРДАМА:  Тя лопась пякстаф, сонь тиемац мярьгови аньцек аф лама тиихненди.</strong>',
'templatesused'                    => 'Тя лопаса тевс нолдаф кепотьксне:',
'templatesusedpreview'             => 'Тя васень няфтема вальмаса тевс нолдаф кепотьксне:',
'templatesusedsection'             => 'Тя пяльксса тевс нолдаф кепотьксне:',
'template-protected'               => '(аралаф)',
'template-semiprotected'           => '(пялес-аралаф)',
'hiddencategories'                 => 'Тя лопась {{PLURAL:$1|1 кяшф катериень|$1 кяшф категориень}} полаец:',
'nocreatetitle'                    => 'Лопань тиемац оторонзаф',
'nocreatetext'                     => '{{SITENAME}}-са од лопатнень тиемац оторонзаф.
Тондейть ули кода мърдамс меки ди петнемс тиф ни лопать, эли [[Special:UserLogin|сувамс эли сёрматфтомс одукс]].',
'nocreate-loggedin'                => 'Тондейть аф мярьгови тиемс од лопатне {{SITENAME}}-са.',
'permissionserrors'                => 'Мярьговома Эльбятькст',
'permissionserrorstext'            => 'Тондейть аф мярьгови тянь тиемс {{PLURAL:$1|туфтал|туфталхнень}} коряс:',
'permissionserrorstext-withaction' => 'Тондейть аф мярьгови сувамс $2-с {{PLURAL:$1|тя туфтал|ня туфталхнень}} инкса:',
'recreate-deleted-warn'            => "'''Инголе кардама: Тон тисак одукс инголе нардаф лопать.'''

Васенда арьсек эряви тя лопать вельмомац эли аф.
Ванк тя лопать нардама лувомац ала:",

# Parser/template warnings
'expensive-parserfunction-warning'        => 'Инголе кардама: Тя лопаса пяк лама питни синтаксонь анализаторхнень тяшкста.

Тяса эряви кирдемс $2-да кържа, тяни $1.',
'expensive-parserfunction-category'       => 'Лопат пяк лама питни синтаксонь анализаторхнень тяшкснень мархта',
'post-expand-template-inclusion-warning'  => 'Инголе кардама: Шаблононь кувалмоц вельф оцю.
Мъзярошка шаблотт кармайхть илядома апак сувафтт.',
'post-expand-template-inclusion-category' => 'Лопатне конатнень эса шаблононь кувалмось вельф оцю',
'post-expand-template-argument-warning'   => 'Инголе кардама: Тя лопать эса ули аф фкада кържа шаблононь параметра, конань кувалмоц вельф оцю. Ня параметратне нолдафольхть.',
'post-expand-template-argument-category'  => 'Лопат конатнень эса улихть нолдаф шаблоттнень параметрасна',

# "Undo" feature
'undo-success' => 'Петнемать ули кода валхтомс. Ватт верзиетне ала, мук полафнематне конат тондейть эрявихть, ванфтк лопать ня эряви полафнематнень мархта.',
'undo-failure' => 'Тя петнемать аш кода валхтомс ётконь петнематнень карань-каршек арафтомаснон сюнеда.',
'undo-norev'   => 'Тя петнемать аш кода мърдафтомс сяс мес сонь аш эли сон нардафоль.',
'undo-summary' => 'Валхтт петнемась $1 конань тизе [[Special:Contributions/$2|$2]] ([[User talk:$2|Корхнема]])',

# Account creation failure
'cantcreateaccounttitle' => 'Аш кода сёрматфтомать тиемс',
'cantcreateaccount-text' => "Сёрматфтомась тя IP адреста ('''$1''') пякстазе [[User:$3|$3]].

$3 макссь туфталсь - ''$2''",

# History pages
'viewpagelogs'        => 'Няфтемс тя лопать историянц',
'nohistory'           => 'Тя лопать петнемань историяц аш.',
'revnotfound'         => 'Верзиесь аф муви',
'revnotfoundtext'     => 'Тя лопать сире верзиец аф муви. Ватт URL конань вельде тон сувать тя лопас.',
'currentrev'          => 'Тяниень верзие',
'revisionasof'        => '$1-нь верзиесь',
'revision-info'       => '$1-нь верзие конань тизе $2',
'previousrevision'    => 'Сядынгольдень верзие',
'nextrevision'        => 'Сяда од верзие',
'currentrevisionlink' => 'Тяниень верзие',
'cur'                 => 'тян.',
'next'                => 'сай',
'last'                => 'сяд.',
'page_first'          => 'васенце',
'page_last'           => 'мекольце',
'histlegend'          => 'Верзиень кочкама: путт тяшкскат верзиетнень конякскяснон эди люпштак алудонь пунять эли Enter пунять.<br />
Шарьхкотьфтема: (тян.) = тяниень верзиеда явомась,
(сяд.) = сядынгольдень верзияда явомась, Ё = ёмла петнема.',
'deletedrev'          => '[нардаф]',
'histfirst'           => 'Кунардонь',
'histlast'            => 'Улхкомбань',
'historysize'         => '({{PLURAL:$1|1 байт|$1 байтт}})',
'historyempty'        => '(шава)',

# Revision feed
'history-feed-title'          => 'Верзиетнень историясна',
'history-feed-description'    => 'Викиса тя лопать верзиетнень историясна',
'history-feed-item-nocomment' => '$1-сь $2-са', # user at time
'history-feed-empty'          => 'Лопась, конань тон вешеть тяса аш.
Улема сонь нардазь Викиста эли сонь лемоц полафтозь.
Сувак [[Special:Вешендемас|Викиса вешендемас]] сяда мала лопатнень муманкса.',

# Revision deletion
'rev-deleted-comment'         => '(мяльполаткс нардаф)',
'rev-deleted-user'            => '(тиить лемоц нардаф)',
'rev-deleted-event'           => '(сёрматфсь нардаф)',
'rev-deleted-text-permission' => '<div class="mw-warning plainlinks">
Тя лопать верзиенц нардазь марстонь аркивста.
Шарьхкотьфнемат, шятьта, улихть
[{{fullurl:Special:Log/delete|page={{FULLPAGENAMEE}}}} нардамань лувомаса].
</div>',
'rev-deleted-text-view'       => '<div class="mw-warning plainlinks">
Тя лопать верзиенц нардазь марстонь пърдафксста.
Тондейть кода {{SITENAME}}-ть оцюнянцты ули кода ваномонза;
ванк [{{fullurl:Special:Log/delete|page={{FULLPAGENAMEE}}}} нардамань лувомаса].
</div>',
'rev-delundel'                => 'няфтемс/кяшемс',
'revisiondelete'              => 'Нардамс/мърдафтомс верзиетнень',
'revdelete-nooldid-title'     => 'Аф лац верзиень кочкама',
'revdelete-nooldid-text'      => 'Тон ашеть кочка верзие эли верзиет  конатнень мархта эряви тянь тиемс, илякс ня верзиетне ашет эли тонт тяряфнят кяшемс тяниень верзиеть.',
'revdelete-selected'          => "'''$1:'''-нь {{PLURAL:$2|Кочкаф верзиец|Кочкаф верзиенза}}",
'logdelete-selected'          => '{{PLURAL:$1|Кочкаф сёрматфтомась|кочкаф сёрматфтоматне}}:',
'revdelete-text'              => 'Нардаф верзиетне илядыхть няевикс лопать историясонза ди нардамань лувомава, интай
Сонь потмоснон пакшенза кармайхть аф сембонди сатовихть.

Иля {{SITENAME}}-нь оцюнятненди кяшф потмоснон ули кода ваномс эди мърдафтомс тяка програмонь ванфть вельде мъзярс иля кардафксне исть путов.',
'revdelete-legend'            => 'Арафтомс няемга оторхне',
'revdelete-hide-text'         => 'Кяшемс тя лопать верзиенц',
'revdelete-hide-name'         => 'Кяшемс тиемать эди туфталонц',
'revdelete-hide-comment'      => 'Кяшемс мяльполатксонь петнемать',
'revdelete-hide-user'         => 'Кяшемс петнить лемонц/IP адресонц',
'revdelete-hide-restricted'   => 'Нолдак тевс ся кардафкснень системонь вийксненди ди пякстамс тя лопать арафнемац.',
'revdelete-suppress'          => 'Кяшемс информациень системонь вятикснень эзда',
'revdelete-hide-image'        => 'Кяшемс файлхнень потмосна',
'revdelete-unsuppress'        => 'Валхтомс мърдаф верзиятнень кардамаснон',
'revdelete-log'               => 'Мяльполаткс:',
'revdelete-submit'            => 'Нолдамс тевс кочкаф верзиенди',
'revdelete-logentry'          => '[[$1]]-нь верзиенц няевомац полафтсь',
'logdelete-logentry'          => '[[$1]]-с сёрматфть няевомац полафтсь',
'revdelete-success'           => "'''Верзиеть няевомац арафтовсь лац.'''",
'logdelete-success'           => "'''Сёрматфть няевомац арафтовсь лац.'''",
'revdel-restore'              => 'Полафтомс няевомац',
'pagehist'                    => 'Лопать историяц',
'deletedhist'                 => 'Нардаф историяц',
'revdelete-content'           => 'потмоц',
'revdelete-summary'           => 'петнемс нюрьхкяня лихтемать',
'revdelete-uname'             => 'тиить лемоц',
'revdelete-restricted'        => 'нолдаф тевс кардафксне системонь вятиксненди',
'revdelete-unrestricted'      => 'системонь вятиксненди кардафксне валхтфт',
'revdelete-hid'               => '$1 кяшф',
'revdelete-unhid'             => '$1 апак кяштт',
'revdelete-log-message'       => '$1 $2 {{PLURAL:$2|верзиенди|верзиетненди}}',
'logdelete-log-message'       => '$1 $2 {{PLURAL:$2|тевти|тефненди}}',

# Suppression log
'suppressionlog'     => 'Кяшемань лувомась',
'suppressionlogtext' => 'Ала нардаматнень ди сёлгоматнень лувомась системонь вятикста кяшф потмоть мархта.
Ванк [[Special:IPBlockList|IP сёлгоматнень лувомась]] улхкомбань якафнемань кардафкснень ди сёлгоматнень мархта.',

# History merging
'mergehistory'                     => 'Шоворемс лопатнень историяснон',
'mergehistory-header'              => 'Тя лопаса мярьгови кафта башка лисьма лопатнень верзиснон фкя фкянь мархта шоворемс.
Арьсек синь шоворемада инголе афи тя лопать историяц йумай.',
'mergehistory-box'                 => 'Шоворемс кафта лопатнень верзияснон фкя фкянь мархта:',
'mergehistory-from'                => 'Лисьма лопа:',
'mergehistory-into'                => 'Сувафтома лопа:',
'mergehistory-list'                => 'Шовореви петнематнень историясна',
'mergehistory-merge'               => 'Ся [[:$1]]нь верзиенза шоворевихть [[:$2]]с. 
Нолдак тевс кочкама пунятнень палманць аньцек кочкаф ёткопингонь верзиетнень шовореманкса. 
Шарфтк мяльце тянь лангс, мес навигациень сюлмафкснень тевс нолдамда ули кода тя палманьста информацие юмафтомс.',
'mergehistory-go'                  => 'Няфтемс шовореви петнематнень',
'mergehistory-submit'              => 'Шоворемс петнематнень',
'mergehistory-empty'               => 'Шовореви верзиет ашет.',
'mergehistory-success'             => '$3 [[:$1]]-нь {{PLURAL:$3|верзиец|верзиенза}} лац шоворьфтезь [[:$2]]-с.',
'mergehistory-fail'                => 'Историясна аф шоворевихть, ванк лац эли аф кочкафольхть лопась ди пингсь.',
'mergehistory-no-source'           => 'Лисьма лопа $1 аш.',
'mergehistory-no-destination'      => 'Сувафтома лопа $1 аш.',
'mergehistory-invalid-source'      => 'Эряви лисьма лопанть кондясти лемоц.',
'mergehistory-invalid-destination' => 'Эряви сувафтома лопать кондясти лемоц.',
'mergehistory-autocomment'         => 'Шоворьфтезь [[:$1]] [[:$2]]-с',
'mergehistory-comment'             => 'Шоворьфтезь [[:$1]] [[:$2]]-с: $3',

# Merge log
'mergelog'           => 'Шоворематнень лувома',
'pagemerge-logentry' => '[[$1]] шоворевсь [[$2]]-ть мархта ($3-ть верзиети самс)',
'revertmerge'        => 'Валхтомс шоворемать',
'mergelogpagetext'   => 'Ванк ала улхкомбань лопатнень фкя фкянь мархта шоворемаснон историясна.',

# Diffs
'history-title'           => '"$1"-нь верзиетнень историясна',
'difference'              => '(Явомась верзиетнень ёткова)',
'lineno'                  => 'Линия $1:',
'compareselectedversions' => 'Путомс кочкаф верзиетнень ваксс',
'editundo'                => 'валхтомс',
'diff-multi'              => '({{PLURAL:$1|$1-нь ётконь верзиец изь няфтев|$1-нь ётконь верзиенза исть няфтев}}.)',

# Search results
'searchresults'             => 'Мезе мувсь',
'searchresulttext'          => '{{SITENAME}}-са вешендемань колга лама содаманкса ватт [[{{MediaWiki:Helppage}}|кизефтемань пялькссь]].',
'searchsubtitle'            => 'Тон вешить \'\'\'[[:$1]]\'\'\' ([[Special:Prefixindex/$1|сембе лопат "$1"ста ушедомс]] | [[Special:WhatLinksHere/$1|сембе лопат сюлмафт "$1" мархта]])',
'searchsubtitleinvalid'     => "Тон вешить '''$1'''",
'noexactmatch'              => "'''\"\$1\" конякс мархта лопа аш.''' Тондейть ули кода [[:\$1|тиемс лопать]].",
'noexactmatch-nocreate'     => "'''\"\$1\" конякс мархта лопа аш.'''",
'toomanymatches'            => 'Пяк лама вешфонди малады муфкст, эняльттяма вешентть тага весть',
'titlematches'              => 'Лопать коняксоц мувсь',
'notitlematches'            => 'Лопать коняксоц изь мув',
'textmatches'               => 'Лопаса сёрматфсь мувсь',
'notextmatches'             => 'Лопаса сёрматфсь изь мув',
'prevn'                     => 'сядынголень $1',
'nextn'                     => 'сай $1',
'viewprevnext'              => 'Ваномс ($1) ($2) ($3)',
'search-result-size'        => '$1 ({{PLURAL:$2|1 вал|$2 валхт}})',
'search-result-score'       => 'Малавиксши: $1%',
'search-redirect'           => '(йотаф $1)',
'search-section'            => '(пялькс $1)',
'search-suggest'            => 'Афкукс тонь мяльсот: $1',
'search-interwiki-caption'  => 'Сазоронь проекттне',
'search-interwiki-default'  => '$1 муфкст:',
'search-interwiki-more'     => '(сяда лама)',
'search-mwsuggest-enabled'  => 'мяль максоматнень мархта',
'search-mwsuggest-disabled' => 'мяль максоматнень ашет',
'search-relatedarticle'     => 'Мала',
'mwsuggest-disable'         => 'Лоткак AJAX мяль максоматне тевс нолдама',
'searchrelated'             => 'мала',
'searchall'                 => 'сембе',
'showingresults'            => "Ала няфтеви {{PLURAL:$1|мувсь '''1'''|мувсть '''$1'''}} '''$2'''-ста ушедомс.",
'showingresultsnum'         => "Ала няфтеви {{PLURAL:$3|мувсь '''1'''|мувсть '''$3'''}} '''$2'''-ста ушедомс.",
'showingresultstotal'       => "Няфтемс ала {{PLURAL:$3|муф '''$1''' '''$3'''-ста|муф '''$1 - $2''' '''$3'''-ста}}",
'nonefound'                 => "'''Шарфтк мяльце''': Аньцек мъзярошка лемботма кърданнекс вешендеви. Тяряфтт вешендема валда инголе путомс \"сембе\" сембе потмонь вешендеманди (корхнема лопат ди шаблотт сявомок, ди с. т) эли кундак эряви лемботмас кода валынгольксс.",
'powersearch'               => 'Сядонга вешендемс',
'powersearch-legend'        => 'Анцяйняньбес вешендема',
'powersearch-ns'            => 'Вешендемс лемботмоса:',
'powersearch-redir'         => 'Иля вастс йотафтомань лувомась',
'powersearch-field'         => 'Вешендемс',
'search-external'           => 'Ушеширень вешендема',
'searchdisabled'            => '{{SITENAME}}-са тяни вешендемась аш. Ули кода вешендемс Google эли иля вешендемань интернет програпнень вельде. Шарфтк мяльце тостонь {{SITENAME}}-нь потмонц верзиец, улема, сирелгодсь.',

# Preferences page
'preferences'              => 'Арафнематне',
'mypreferences'            => 'Монь латцемане',
'prefs-edits'              => 'Петнематнень лувсна:',
'prefsnologin'             => 'Апак сувак',
'prefsnologintext'         => 'Тондейть эряви <span class="plainlinks">[{{fullurl:Special:Userlogin|returnto=$1}} сувамс]</span> тонь арафнематнень латцеманкса.',
'prefsreset'               => 'Ингольдень арафнематне мърдасть меки.',
'qbsettings'               => 'Навигациень седяфкс',
'qbsettings-none'          => 'Аф няфтемс',
'qbsettings-fixedleft'     => 'Кержи шири киртьф',
'qbsettings-fixedright'    => 'Види шири киртьф',
'qbsettings-floatingleft'  => 'Кержи ширеса уенди',
'qbsettings-floatingright' => 'Виде ширеса уенди',
'changepassword'           => 'Сувама валть полафтомс',
'skin'                     => 'Ванфонь латцема',
'math'                     => 'Няфтемс формулат',
'dateformat'               => 'Шинь форматоц',
'datedefault'              => 'Апак полафтт',
'datetime'                 => 'Ши ди пинге',
'math_failure'             => 'Аф морафтови',
'math_unknown_error'       => 'аф содаф эльбятькс',
'math_unknown_function'    => 'аф содаф функцие',
'math_lexing_error'        => 'лексиконь эльбятькс',
'math_syntax_error'        => 'синтаксонь эльбятькс',
'math_image_error'         => 'PNG форматс сёрматфтомась изь лисев; ватт лац эли аф арафтовсть latex, dvips, gs эди convert',
'math_bad_tmpdir'          => 'Аф сёрматфтови ётконь математик директориес эди директориесь аф тиеви',
'math_bad_output'          => 'Аф сёрматфтови нолдамань математик директориес эди директориесь аф тиеви',
'math_notexvc'             => 'Нолдамань файл texvc изь мув; Ванк math/README ладямать колга.',
'prefs-personal'           => 'Тиить колга',
'prefs-rc'                 => 'Улхкомбань полафнемат',
'prefs-watchlist'          => 'Мельгеванома',
'prefs-watchlist-days'     => 'Мъзяра шит няфтемс мельгеваномаса:',
'prefs-watchlist-edits'    => 'Иньоцю полафнематнень лувкссь няфтеви келептьф мельгеваномаса:',
'prefs-misc'               => 'Калмоча',
'saveprefs'                => 'Ванфтомс',
'resetprefs'               => 'Валхтомс апак ванфтт полафнематнень',
'oldpassword'              => 'Сире сувама вал:',
'newpassword'              => 'Од сувама вал:',
'retypenew'                => 'Сёрматк од сувама вал омбоцекс:',
'textboxsize'              => 'Петнема',
'rows'                     => 'Луфт (строкат):',
'columns'                  => 'Орват (столбанят):',
'searchresultshead'        => 'Вешендема',
'resultsperpage'           => 'Муфкст фкя лопаса:',
'contextlines'             => 'Кикст (строчкат) фкя муфксса:',
'contextchars'             => 'Контекст тяштькст фкя кикса:',
'stub-threshold'           => 'Оторсь (лимитсь) <a href="#" class="stub">-нь керф сюлмафкснень</a> латцемаснонды (байтт):',
'recentchangesdays'        => 'Мъзяра шит няфтемс улхкомбань полафнемаса:',
'recentchangescount'       => 'Мъзяра петнемат няфтемс улхкомбань полафнемаса, история ди сувама лувома лопаса:',
'savedprefs'               => 'Тонь латцематне ванфтсть.',
'timezonelegend'           => 'Ойень (часонь) каркс',
'timezonetext'             => '¹Мъзяра ойда (часта) тястонь пинге яви серверонь пингта (UTC - Гринвич пинге).',
'localtime'                => 'Тястонь пинге',
'timezoneoffset'           => 'Явома',
'servertime'               => 'Серверонь пинге',
'guesstimezone'            => 'Сёрмадомс интернет полатксста',
'allowemail'               => 'Электрононь сёрматнень иля тиихнень эзда тиемс мярьговикс',
'prefs-searchoptions'      => 'Вешендема арафнемат',
'prefs-namespaces'         => 'Лемботмот',
'defaultns'                => 'Вешендемс ня лепнень потмова мъзярс илякс изь мярьгов:',
'default'                  => 'апак полафтт',
'files'                    => 'Файлхт',

# User rights
'userrights'                  => 'Тиинь видекснень вятема', # Not used as normal message but as header for the special page itself
'userrights-lookup-user'      => 'Тиихнень полгаснон вятемасна',
'userrights-user-editname'    => 'Путт тиить лемонц:',
'editusergroup'               => 'Полафтомс тиить полганзон',
'editinguser'                 => "'''[[User:$1|$1]]'''-нь тиить видексонзон полафнема ([[User talk:$1|{{int:talkpagelinktext}}]] | [[Special:Contributions/$1|{{int:contribslink}}]])",
'userrights-editusergroup'    => 'Полафтомс тиить полганзон',
'saveusergroups'              => 'Ванфтомс тиить полганзон',
'userrights-groupsmember'     => 'Сувси полгас:',
'userrights-groups-help'      => 'Тондейть ули кода полафнемс полгат конат эса ули тя тиись.
* Тяште мархта кудня няфнесы тя тиись ащи ся полгаса.
* Тяштьфтома кудня няфнесы тя тиись аш ся полгаса.
* Тяштькс * няфнесы тондейть аш кода нардамс полгать сонь поладомада меле эли меколанкт.',
'userrights-reason'           => 'Полафтома туфтал:',
'userrights-no-interwiki'     => 'Тондейть аф мярьгови полафтомс тиихнень видекссна иля Викива.',
'userrights-nodatabase'       => 'Датабаза $1 аш эли сон аф тястоконь.',
'userrights-nologin'          => 'Тондейть эряви [[Special:UserLogin|сувамс]] оцюнянь сёрматфтомать вельде тиихнень видексснон макссеманкса.',
'userrights-notallowed'       => 'Тонь сёрматфтомацень вельде аф мярьгови макссемс видекст иля тиихненди.',
'userrights-changeable-col'   => 'Полгатне конатнень тондейть ули кода полафтомс',
'userrights-unchangeable-col' => 'Полгатне, конатнень тондейть аш кода полафтомс',

# Groups
'group'               => 'Полга:',
'group-user'          => 'Тиихне',
'group-autoconfirmed' => 'Эслек кемокстаф тиихне',
'group-bot'           => 'Робот програпне',
'group-sysop'         => 'Системонь вятиксне',
'group-bureaucrat'    => 'Бюрократт',
'group-suppress'      => 'Ревизорхт',
'group-all'           => '(сембе)',

'group-user-member'          => 'Тиись',
'group-autoconfirmed-member' => 'Эслек кемокстаф тиись',
'group-bot-member'           => 'Робот програм',
'group-sysop-member'         => 'Системонь вятикс',
'group-bureaucrat-member'    => 'Бюрократ',
'group-suppress-member'      => 'Ревизор',

'grouppage-user'          => '{{ns:project}}:Тиихне',
'grouppage-autoconfirmed' => '{{ns:project}}:Эслек кемокстаф тиихне',
'grouppage-bot'           => '{{ns:project}}:Робот програпне',
'grouppage-sysop'         => '{{ns:project}}:Системонь вятиксне',
'grouppage-bureaucrat'    => '{{ns:project}}:Бюрократт',
'grouppage-suppress'      => '{{ns:project}}:Ревизорхт',

# Rights
'right-read'                 => 'Морафтомс лопат',
'right-edit'                 => 'Петнемс лопат',
'right-createpage'           => 'Тиемс лопат (конат аф корхнема лопат)',
'right-createtalk'           => 'Тиемс корхнема лопат',
'right-createaccount'        => 'Тиемс од тиить сёрматфтоматне',
'right-minoredit'            => 'Тяштемс петнемат кода йомланя видептемат',
'right-move'                 => 'Йотафтомс лопат',
'right-move-subpages'        => 'Йотафтомс лопатнень иля вастс синь сублопаснон мархта',
'right-suppressredirect'     => 'Аф тиемс йотафтома ингольдень лемста од лемс лопань йотафтомда',
'right-upload'               => 'Тонгомс файлхт',
'right-reupload'             => 'Тиемс тяниень файлть одукс',
'right-reupload-own'         => 'Тиемс одукс тяниень файлть тонкф тяка тиить эса',
'right-reupload-shared'      => 'Нулгодемс тяса файлхнень марстонь медиа репозиториста',
'right-upload_by_url'        => 'Тонгомс файл URL адресста',
'right-purge'                => 'Нардамс лопань копияма файлхт лопанди конань аш кемокстама лопанц',
'right-autoconfirmed'        => 'Петнемс пялес-аралаф лопатнень',
'right-bot'                  => 'Лувовомс автоматонь процессокс',
'right-nominornewtalk'       => 'Ашет корхнема лопатненди анцяйня видептемат конатненди ули кода курок тиемс од пачфтемат',
'right-apihighlimits'        => 'Нолдамс тевс API вешендемать вяре оторс',
'right-writeapi'             => 'Сёрмадома API тевс нолдама',
'right-delete'               => 'Нардамс лопат',
'right-bigdelete'            => 'Нардамс лопат кувака история мархта',
'right-deleterevision'       => 'Нардамс эди мърдафтомс лопатнень башка верзиеснон',
'right-deletedhistory'       => 'Няфтемс нардаф историянь сёрматфть сотф текстфтома',
'right-browsearchive'        => 'Вешендемс нардаф лопатнень',
'right-undelete'             => 'Мърдафтомс лопа',
'right-suppressrevision'     => 'Ваномс ди мърдафтомс верзиетне кяшфт системонь вятикснень эзда',
'right-suppressionlog'       => 'Няфтемс ломанень лувомаснон',
'right-block'                => 'Сёлгомс иля тиихнень петнемада',
'right-blockemail'           => 'Сёлгомс тиить электрононь сёрматнень кучемада',
'right-hideuser'             => 'Сёлгомс тиить лемоц, сонь кяшезь иля тиида',
'right-ipblock-exempt'       => 'Ётамс IP сёлгоматнень ваксс, эсь тиеви сёлгоматнень ди оцю сёлгоматнень',
'right-proxyunbannable'      => 'Ётамс ваксс эсь тиеви ётка якай серверонь сёлгоматне',
'right-protect'              => 'Полафтомс араламань куцеманянзон ди петнемс аралаф лопатнень',
'right-editprotected'        => 'Петнемс аралаф лопатнень (какскадонь араламада башка)',
'right-editinterface'        => 'Петнемс тиить лопанц арафнеманзон',
'right-editusercssjs'        => 'Петнемс иля тиихнень CSS ди JS файлснон',
'right-rollback'             => 'Куроконе мумс мекольце тиить конась петнесь лопат',
'right-markbotedits'         => 'Тяштемс мърдаф петнематнень кода робот петнематне',
'right-noratelimit'          => 'Куроксшинь оторхт ашет',
'right-import'               => 'Тонгомс лопат иля Викиста',
'right-importupload'         => 'Нолдамс тевс лопат файлонь тонгомаста',
'right-patrol'               => 'Тяштемс петнематнень кода патрулень варжафт',
'right-autopatrol'           => 'Нолдамс тевс эсь тиеви патрулень варжама тяштемась петнематненди',
'right-patrolmarks'          => 'Няфтемс улхкомбань полафнематнень патрулень тяштефкссна',
'right-unwatchedpages'       => 'Ваномс аф мельгеваномаса лопатнень лувомать',
'right-trackback'            => 'Кемокстамс меки кеворемать нолдамац',
'right-mergehistory'         => 'Шоворьфтемс историянь лопатне',
'right-userrights'           => 'Петнемс сембе тиихнень видексснон',
'right-userrights-interwiki' => 'Петнемс тиихнень видекснон иля викить лопасонза',
'right-siteadmin'            => 'Пякстамс эди панжемс датабазать',

# User rights log
'rightslog'      => 'Тиить видексонза лувомась',
'rightslogtext'  => 'Тиить видексонзон полафнемасна лувомась.',
'rightslogentry' => '$1-нь полгац полафтсь $2-ста $3-с',
'rightsnone'     => '(аш)',

# Recent changes
'nchanges'                          => '$1 {{PLURAL:$1|полафнема|полафнемат}}',
'recentchanges'                     => 'Улхкомбань полафнемат',
'recentchangestext'                 => 'Ваномс улхкомбань Викиса полафнематнень мельге тя лопаса.',
'recentchanges-feed-description'    => 'Ваномс улхкомбань Викиса полафнематнень мельге тя шудемаса.',
'rcnote'                            => "Ала {{PLURAL:$1|Мекольце '''1''' полафнема|мекольце '''$1''' полафнемат}} '''$2''' йотай  {{PLURAL:$2|шис|шис}}, $5, $4-ста.",
'rcnotefrom'                        => "Ала няфтезь полафнематне '''$2'''-ста ('''$1'''-с).",
'rclistfrom'                        => 'Няфтемс од полафнематне $1-ста ушедомс',
'rcshowhideminor'                   => '$1 ёмланя видептемат',
'rcshowhidebots'                    => '$1 робот програпт',
'rcshowhideliu'                     => '$1 суваф тиихть',
'rcshowhideanons'                   => '$1 лемфтома тиихть',
'rcshowhidepatr'                    => '$1 ванондоф петнемат',
'rcshowhidemine'                    => '$1 эсь петнемат',
'rclinks'                           => 'Няфтемс $1 ётай полафнемат мекольце $2 шис<br />$3',
'diff'                              => 'яв.',
'hist'                              => 'ист.',
'hide'                              => 'Кяшемс',
'show'                              => 'Няфтемс',
'minoreditletter'                   => 'ё',
'newpageletter'                     => 'О',
'boteditletter'                     => 'р',
'number_of_watching_users_pageview' => '[$1 ваны {{PLURAL:$1|тии|тиихть}}]',
'rc_categories'                     => 'Аньцек категориеста (явфтомс "|" вельде)',
'rc_categories_any'                 => 'Эрь кодама',
'newsectionsummary'                 => '/* $1 */ од пялькс',

# Recent changes linked
'recentchangeslinked'          => 'Сюлмаф полафнематне',
'recentchangeslinked-title'    => 'Полафнемат сюлмафт "$1" мархта',
'recentchangeslinked-noresult' => 'Сюлмаф лопава тя пингста полафнемат ашельхть.',
'recentchangeslinked-summary'  => "Тя башка лопас сувафнезь мекольце полафнемат сюлмаф лопава. Тонь ванома сёрмалувомастонь лопатне тяштезь '''эчкста'''.",
'recentchangeslinked-page'     => 'Лопать лемоц:',
'recentchangeslinked-to'       => 'Няфтемс полафтоматне лопатнень эса сотфт тя лопать мархта',

# Upload
'upload'                      => 'Тонгомс файл',
'uploadbtn'                   => 'Тонгомс файл',
'reupload'                    => 'Тонгомс тага весть',
'reuploaddesc'                => 'Валхтомс тонгомать ди мърдамс тонгома формс.',
'uploadnologin'               => 'Апак сувак',
'uploadnologintext'           => 'Тондейть эряви [[Special:UserLogin|сувамс]] файл тонгоманкса.',
'upload_directory_missing'    => 'Аш тонгома директорие ($1) ди интернет серверти аш кода сонь тиемс.',
'upload_directory_read_only'  => 'Аш кода сёрмадомс ($1) директориес web-сервер вельде.',
'uploaderror'                 => 'Тонгодема эльбятькс',
'uploadtext'                  => "Форм ала тондейть эрявксты файлонь тонгоманди ди ваноманди. 
Инголе тонкф файлхнень няфтеманкса ванк [[Special:ImageList|тонкф архтофкснень лувомась]], файлонь одукс тонгомасна тяштевихть [[Special:Log/upload|тонгома лувомас]], файлонь нардамасна тяштевихть [[Special:Log/upload|нардама лувомас]].

Архтофкс сёрматфксс сувафтоманкса эряви путомс ки:
* '''<tt><nowiki>[[</nowiki>{{ns:image}}<nowiki>:File.jpg]]</nowiki></tt>''' пяшксе файлонь верзинц тевс нолдаманди
* '''<tt><nowiki>[[</nowiki>{{ns:image}}<nowiki>:File.png|200px|thumb|left|alt text]]</nowiki></tt>''' 200 пиксель кели верзие ёмла кудняса лопань кержи ширеса тевс нолдаманди, 'alt text' вастс путозь архтофкс колга тяштемась
* '''<tt><nowiki>[[</nowiki>{{ns:media}}<nowiki>:File.ogg]]</nowiki></tt>''' файлть мархта видеста сюлмамонди ся файлть апак няфнек.",
'upload-permitted'            => 'Мярьговикс файл форматт: $1.',
'upload-preferred'            => 'Сембода пара файл форматт: $1.',
'upload-prohibited'           => 'Кардама файл форматт: $1.',
'uploadlog'                   => 'файлонь тонгома лувома',
'uploadlogpage'               => 'Файлонь тонгома лувомас',
'uploadlogpagetext'           => 'Ватт ала улхкомбань файлонь тонгома лувомась.
Ватт [[Special:NewImages|од файлхнень няфтема]] содамс кодапт синь.',
'filename'                    => 'Файлонь лем',
'filedesc'                    => 'Нюрьхкяняста файлть колга',
'fileuploadsummary'           => 'Нюрьхкяняста файлть колга:',
'filestatus'                  => 'Копияма мярьгомац:',
'filesource'                  => 'Лисьма:',
'uploadedfiles'               => 'Тонкф файлхне',
'ignorewarning'               => 'Нулгодемс инголе кардамать ди ванфтомс файлть',
'ignorewarnings'              => 'Нулгодемс сембе инголе кардаматтне',
'minlength1'                  => 'Файлонь лем эряви тиемс фкя тяштькста сембода кържа.',
'illegalfilename'             => 'Файлонь лемса "$1" улихть тяштькст конат лувовихть аф мярьговикс лопань конякснонды. Тик иля файлонь лем, меле тонк сонь тага весть.',
'badfilename'                 => 'Файлонь лемонц полафтозь "$1"-с.',
'filetype-badmime'            => 'MIME формат файлхт "$1" аф мярьговихть тонгоманди.',
'filetype-unwanted-type'      => "'''\".\$1\"'''-ть аф ярашты файл форматоц. Сяда {{PLURAL:\$3|пароль файл формат|парольхть файл форматт}} \$2.",
'filetype-banned-type'        => "'''\".\$1\"'''-ть файл форматоц аф мярьгови. Мярьговихть {{PLURAL:\$3|файл формат|файл форматт}} \$2.",
'filetype-missing'            => 'Файлть аш формат тяшксоц (кепотьксонди ".jpg").',
'large-file'                  => 'Сяда пароль файлхт улельхть аф $1-да кувака; тя файлсь $2.',
'largefileserver'             => 'Тя файлсь серверонь мярьгови кувалмода лама.',
'emptyfile'                   => 'Файлсь, конась тон тонгодеть шаволь. Тя лиссь, улема, аф лац файллем серматкшнеманц сюнеда.  Ванк ди арьсек улель эли аф тонь мялец тя файлть тонгомонза.',
'fileexists'                  => 'Тя лемса файл улсь ни. Ванк <strong><tt>$1</tt></strong> улель эли аф тонь мяльце сонь полафнемонза.',
'filepageexists'              => 'Тя лемса лопа ульсь ни, ванк <strong><tt>$1</tt></strong> улель тонь мяльце эли аф тянь полафтомс.',
'fileexists-extension'        => 'Файл тя файлть лемонцты малады ульсь ни:<br />
Тонгодеви файлть лемоц: <strong><tt>$1</tt></strong><br />
Файллем, кона ульсь ни: <strong><tt>$2</tt></strong><br />
Эняльттяма, арьсек иля лем.',
'fileexists-thumb'            => "<center>'''Тяниень файл'''</center>",
'fileexists-thumbnail-yes'    => 'Файлсь, улема, архтофксонь кирьфтаф верзиесь <i>(thumbnail)</i>. Ванк файл <strong><tt>$1</tt></strong> лангс.<br />
Дяряй файлсь конань лангс тон ваноть сяка пяшксе кувалмоса архтофкссь, тоса тага фкя миниатюр тонгомс аф эряви.',
'file-thumbnail-no'           => 'Файллемсь ушедсь <strong><tt>$1</tt></strong>. 
Архтофксть кувалмоц, улема, пяк кирьфтафоль <i>(thumbnail)</i>.
Улендяряй тонь тя файлть сяда кувака верзиец - тонк сонь, илякс полафтт файллемть.',
'fileexists-forbidden'        => 'Файл тя лемса улсь ни; мърдак меки ди тонк тя файлть иля лем мархта. [[Image:$1|thumb|center|$1]]',
'fileexists-shared-forbidden' => 'Файлсь тя лемть мархта ульсь ни марстонь файл пърдафксса. Сембе сяка улендярять мяльце тя файлть тонгомс, мърдак меки ди тонк тя файлть иля лем мархта. [[Image:$1|thumb|center|$1]]',
'file-exists-duplicate'       => 'Тя файлсь кафонзафоль {{PLURAL:$1|файл|файлхт}}:',
'successfulupload'            => 'Тонгодемась ётась лац',
'uploadwarning'               => 'Тонгодемань инголе кардама',
'savefile'                    => 'Ванфтомс файл',
'uploadedimage'               => 'тонгозь "[[$1]]"',
'overwroteimage'              => 'тонгозь "[[$1]]" од верзиенц',
'uploaddisabled'              => 'Тонгодемать лоткозь',
'uploaddisabledtext'          => 'Файл тонгодемать {{SITENAME}}-са лоткозь.',
'uploadscripted'              => 'Тя файлса ащи HTML эли програм, конат аф морафтовихть интернет полатксть вельде.',
'uploadcorrupt'               => 'Тя файлсь колавсь эли сонь аф кондясти файл формат тяшксоц. Ванк ди тонк сонь одукс.',
'uploadvirus'                 => 'Тя файлса ащи вирус програм! Информацие: $1',
'sourcefilename'              => 'Лисьма файлонь лемоц',
'destfilename'                => 'Сувафтома файлонь лемоц',
'upload-maxfilesize'          => 'Максимум файлонь кувалмоц: $1',
'watchthisupload'             => 'Ваномс тя лопать мельге',
'filewasdeleted'              => 'Файл тяка лемса тонгозь ни ди меле нардазь. Тондейть пароль ваномс $1 тя файлть тонгодемац инголе.',
'upload-wasdeleted'           => "'''Инголе кардама: Файл, кона тон тонгодьса нардафоль ни.'''

Лацкаста арьсек афкукс тонь ули мяльце сонь тонгомонза эли аф. Нардама лувома информациесь тяса:",
'filename-bad-prefix'         => 'Тон тонгодьсак файл конань лемоц ушеды <strong>"$1"</strong>-са. Стапт лепне лувовихть мезеньге аф колга азондовикс сяс мес синь эсь макссевихть тяшкскамераса тиф фотоархтофксненди (цифра камераса). Арьсек иля лем, конаса ащель информациеда лама.',

'upload-proto-error'      => 'Аф кондясти протокол',
'upload-proto-error-text' => 'Ичкоздень тонгодеманди эряви URL-т ушедыхть <code>http://</code>-са эли <code>ftp://</code>-са.',
'upload-file-error'       => 'Потмонь эльбятькс',
'upload-file-error-text'  => 'Потмонь эльбятькс лиссь ёткопингонь файл серверса тиемста. Эряви сотомс [[Special:ListUsers/sysop|системонь вятиксть]] мархта.',
'upload-misc-error'       => 'Аф содаф тонгодема эльбятькс',
'upload-misc-error-text'  => 'Аф содаф эльбятькс лиссь тонгодембачк. Ванк кондясти ди сатови эли аф URL-сь эди тик сембе одукс. Лисендяряй стама эльбятькс тага весть, сотт [[Special:ListUsers/sysop|системонь вятиксть]] мархта.',

# Some likely curl errors. More could be added from <http://curl.haxx.se/libcurl/c/libcurl-errors.html>
'upload-curl-error6'       => 'URL-сь аф сатови',
'upload-curl-error6-text'  => 'URL-сь конась тон тяштеть аф сатови.  Ванк тага весть кондясти эли аф URL-сь эди лопась.',
'upload-curl-error28'      => 'Тонгодема пингсь ётась',
'upload-curl-error28-text' => 'Лопась аф пъшкяди каршес пяк ламос. Ванк лопась няфтеви эли аф эди тик сембе одукс аф лама пингта меле. Улема, тевть пароль тиемс иля пингста, мъзярда лопас сувсида кържа.',

'license'            => 'Лицензияма:',
'nolicense'          => 'Лицензие аш',
'license-nopreview'  => '(Васень няфтемась аш)',
'upload_source_url'  => ' (кондясти, сембонди панжада URL)',
'upload_source_file' => ' (файлсь тонь содама машинасот)',

# Special:ImageList
'imagelist-summary'     => 'Тя башка тевонь лопаса няфневихть сембе тонкф файлхне.
Мъзярс апак полафтт мекольце тонкф файлхне лувомаса няфневихть вяре.
Палмань коняксонцты люпштамась полафнесы кикснень арафнемать.',
'imagelist_search_for'  => 'Вешендемс медиа лем:',
'imgfile'               => 'файл',
'imagelist'             => 'Файлхт',
'imagelist_date'        => 'Ши',
'imagelist_name'        => 'Лем',
'imagelist_user'        => 'Тии',
'imagelist_size'        => 'Кувалма',
'imagelist_description' => 'Информацие',

# Image description page
'filehist'                       => 'Файлонь историясь',
'filehist-help'                  => 'Люпштак шить/пингть лангс ся пингонь файлть верзинц няфтеманкса.',
'filehist-deleteall'             => 'нардамс сембе',
'filehist-deleteone'             => 'нардамс',
'filehist-revert'                => 'мърдафтомс',
'filehist-current'               => 'тя пингонь',
'filehist-datetime'              => 'Ши/Пинге',
'filehist-user'                  => 'Тии',
'filehist-dimensions'            => 'Кувалма',
'filehist-filesize'              => 'Файлонь кувалмоц',
'filehist-comment'               => 'Мяльполаткс',
'imagelinks'                     => 'Сюлмафкст',
'linkstoimage'                   => 'Ся {{PLURAL:$1|лопась сюлмаф|$1 лопатне сюлмафт}} вага тя файлть мархта:',
'nolinkstoimage'                 => 'Лопат сюлмафт тя файлть мархта ашет.',
'morelinkstoimage'               => 'Ванк [[Special:WhatLinksHere/$1|сяда лама сюлмафкст]] тя файлонди.',
'redirectstofile'                => 'Вага {{PLURAL:$1|файл|$1 файлхт}} йотафтсаськ тя файлонди:',
'duplicatesoffile'               => 'Вага {{PLURAL:$1|файл ащи кафонзафксокс|$1 файлхне ащихть кафонзафксокс}} тя файлонди:',
'sharedupload'                   => 'Тя файлсь тонгозь марстонь файл пърдафксс ди сонь ули кода сувафтомс иля проектс.',
'shareduploadwiki'               => 'Ванк $1 лама информацие ванома.',
'shareduploadwiki-desc'          => 'Сёрмадома сонць $1 коряс марстонь репозиториса ванк ала.',
'shareduploadwiki-linktext'      => 'файл колга информациень лопа',
'shareduploadduplicate'          => 'Тя файлсь $1-нь кафонзафкс марстонь репозиториста.',
'shareduploadduplicate-linktext' => 'тага фкя файл',
'shareduploadconflict'           => 'Тя файлть сяка лемоц кода $1 марстонь репозиториста.',
'shareduploadconflict-linktext'  => 'тага фкя файл',
'noimage'                        => 'Тя лем мархта файл аш, интай тондейть ули кода $1.',
'noimage-linktext'               => 'тонгодемс тянь',
'uploadnewversion-linktext'      => 'Тонгодемс тя файлонь од верзиенц',
'imagepage-searchdupe'           => 'Вешендемс кафонзаф файлхне',

# File reversion
'filerevert'                => 'Мърдафтомс $1',
'filerevert-legend'         => 'Мърдафтомс файл',
'filerevert-intro'          => "Тон мърдафнесак '''[[Media:$1|$1]]''' [$4 верзиенза $3, $2-с].",
'filerevert-comment'        => 'Мяльполаткс:',
'filerevert-defaultcomment' => 'Мърдаф верзиес $2, $1',
'filerevert-submit'         => 'Мърдафтомс',
'filerevert-success'        => "'''[[Media:$1|$1]]''' мърдаф [$4 верзиенза $3, $2].",
'filerevert-badversion'     => 'Тя файлть сядынгольдень верзинц вешф пингоняфкс мархта тяса аш.',

# File deletion
'filedelete'                  => 'Нардамс $1',
'filedelete-legend'           => 'Нардамс файлть',
'filedelete-intro'            => "Тон нардасак '''[[Media:$1|$1]]'''.",
'filedelete-intro-old'        => "Тон нардасак   '''[[Media:$1|$1]]'''-ть верзиенза [$4 $3, $2].",
'filedelete-comment'          => 'Нардама туфтал:',
'filedelete-submit'           => 'Нардамс',
'filedelete-success'          => "'''$1''' нардаф.",
'filedelete-success-old'      => "'''[[Media:$1|$1]]'''-ть верзиенза нардафольхть $3, $2.",
'filedelete-nofile'           => "'''$1''' {{SITENAME}}-са аш.",
'filedelete-nofile-old'       => "'''$1'''-ть пърдафтф верзиенц стама тяшкст мархта аш.",
'filedelete-iscurrent'        => 'Тон тяряфнят нардамс тя файлть сяда од верзиенц. Эняльттяма, мърдак васенда сонь сядынгольдень верзиезонза.',
'filedelete-otherreason'      => 'Иля/поладомань туфтал:',
'filedelete-reason-otherlist' => 'Иля туфтал',
'filedelete-reason-dropdown'  => '*Марстонь нардама туфтал
** Копияма видекс срафтома
** Кафтонзаф файл',
'filedelete-edit-reasonlist'  => 'Петнемс нардамань туфталхне',

# MIME search
'mimesearch'         => 'MIME вешендема',
'mimesearch-summary' => 'Тя лопась нолдасы тевс файлонь кочксема синь MIME сортснон коряс. Сёрмадомань формат: файлботмонь сортоц/файлонь форматонц, кепотьксонди <tt>image/jpeg</tt>.',
'mimetype'           => 'MIME сорт:',
'download'           => 'тонгомс',

# Unwatched pages
'unwatchedpages' => 'Аф мельгеваномаса лопатне',

# List redirects
'listredirects' => 'Ётафтфкснень лувомась',

# Unused templates
'unusedtemplates'     => 'Аф нолдаф тевс кепотьксне',
'unusedtemplatestext' => 'Тя лопаса пуроптф тя кепотьксонь лемса сембе лопатне, конатнень исть сувафне иля лопас. Киртть мяльсот: тондейть эряви ваномс иля сюлмафксне улендяряйхть тоса иля аф ся кепотьксне синь нардамаснон инголе.',
'unusedtemplateswlh'  => 'иля сюлмафксне',

# Random page
'randompage'         => 'Кона повсь лопа',
'randompage-nopages' => 'Тя лем потмоса лопат ашет.',

# Random redirect
'randomredirect'         => 'Коза повсь ётафтома',
'randomredirect-nopages' => 'Тя лем потмоса ётафтфкст ашет.',

# Statistics
'statistics'             => 'Статистик',
'sitestats'              => '{{SITENAME}} статистик',
'userstats'              => 'Тиить статистиксь',
'sitestatstext'          => "Сембоц {{PLURAL:\$1|'''1''' лопа|'''\$1''' лопат}} датабазаса.
Тяза сувсихть \"корхнема\" лопат,  {{SITENAME}} колга лопат, аф шумордаф \"керф\"
лопат, ётафтф лопат эди мъзярошка иля лопат конатнень аф сувафнезь марстонь лопань лувксс.
Сятнень башка {{PLURAL:\$2|'''1''' лопа, кона лувови|'''\$2''' лопат, конат лувовихть}} лацкастаста тифокс.

'''\$8''' {{PLURAL:\$8|файл тонкф|файлхт тонкфт}}.

Сембоц '''\$3'''-са {{PLURAL:\$3|лопа ванозь|лопат ванозь}} эди '''\$4''' {{PLURAL:\$4|лопа петнезь|лопат петнезь}}  {{SITENAME}}-нь ушедомста.
Сякобасом тя малады кучкалувкса '''\$5''' петнемати фкя лопас эди '''\$6''' ваномати фкя петнемас.

[http://www.mediawiki.org/wiki/Manual:Job_queue тефнень пулоснон] кувалмоц '''\$7'''.",
'userstatstext'          => "{{PLURAL:$1|'''1''' сёрматфтф [[Special:ListUsers|тии]]| '''$1''' сёрматфтфт [[Special:ListUsers|тиихть]]}}, '''$2'''-нь (эли '''$4%''') {{PLURAL:$2|ули|улихть}} $5-нь видексонза.",
'statistics-mostpopular' => 'Сидеста сувсеви лопат',

'disambiguations'      => 'Лама смузьса лопат',
'disambiguationspage'  => 'Template:лама смусть',
'disambiguations-text' => "Ся лопатне сюлмафт '''лама смузень лопа''' мархта. Синьдеест эрявихть сюлмамс иля башка азондомбялькст мархта.<br />Лопась лувови лама смузеннекс мъзярда сон сюлмаф [[MediaWiki:Disambiguationspage]] кепотькс мархта.",

'doubleredirects'            => 'Кафонзаф ётафтфксне',
'doubleredirectstext'        => 'Тя лопань лувомаса няфтевихть ётафтомат сюлмафт иля ётафтоматнень мархта. Эрь линияса улихть васенце ди омбоце ётафтоматнень сюлмафкссна, тяса тага ули омбоце ётафтомать васенце киксонцты сюлмафкссь, тоса ули няфтемась лопань лемонц лангс конань мархта эряволь васенце ётафтомать сюлмафтомс.',
'double-redirect-fixed-move' => '[[$1]] ётафтфоль иля вастс, сон тяни ётафтфкс [[$2]]нди',
'double-redirect-fixer'      => 'Ётафтфксонь латцема',

'brokenredirects'        => 'Синтьф ётафтфксне',
'brokenredirectstext'    => 'Ся ётафтфкст сюлмафт лопат мархта конат ашет:',
'brokenredirects-edit'   => '(петнемс)',
'brokenredirects-delete' => '(нардамс)',

'withoutinterwiki'         => 'Кялень сюлмафксфтома лопат',
'withoutinterwiki-summary' => 'Ся лопатне аф сюлмафт иля кялень верзиетнень мархта:',
'withoutinterwiki-legend'  => 'Валынголькс',
'withoutinterwiki-submit'  => 'Няфтемс',

'fewestrevisions' => 'Лопат сяда кържа верзиеснон мархта',

# Miscellaneous special pages
'nbytes'                  => '$1 {{PLURAL:$1|байт|байтт}}',
'ncategories'             => '$1 {{PLURAL:$1|категорие|категориет}}',
'nlinks'                  => '$1 {{PLURAL:$1|сюлмафкс|сюлмафкст}}',
'nmembers'                => '$1 {{PLURAL:$1|сувси|сувсихть}}',
'nrevisions'              => '$1 {{PLURAL:$1|верзие|верзиет}}',
'nviews'                  => '$1 {{PLURAL:$1|няфтема|няфтемат}}',
'specialpage-empty'       => 'Тя информациень коряс мезеге изь мув.',
'lonelypages'             => 'Уроз лопат',
'lonelypagestext'         => 'Ся лопат аф сюлмафт иля лопатнень мархта {{SITENAME}}-са.',
'uncategorizedpages'      => 'Категориефтома лопат',
'uncategorizedcategories' => 'Категориефтома категориет',
'uncategorizedimages'     => 'Категориефтома файлхт',
'uncategorizedtemplates'  => 'Категориефтома кепотькст',
'unusedcategories'        => 'Тевс апак нолдак категориет',
'unusedimages'            => 'Тевс апак нолдак файлхт',
'popularpages'            => 'Сидеста сувсеви лопат',
'wantedcategories'        => 'Вешф категориет',
'wantedpages'             => 'Вешф лопат',
'missingfiles'            => 'Йумай файлхне',
'mostlinked'              => 'Сембода ламоксть сюлмаф лопатнень мархта',
'mostlinkedcategories'    => 'Сембода ламоксть сюлмаф категориетнень мархта',
'mostlinkedtemplates'     => 'Сембода ламоксть сюлмаф кепотькснень
мархта',
'mostcategories'          => 'Сембода лама категорие мархта лопат',
'mostimages'              => 'Сембода ламоксть сюлмаф файлхнень мархта',
'mostrevisions'           => 'Сембода лама верзиетнень мархта лопат',
'prefixindex'             => 'Инголькс индекс',
'shortpages'              => 'Нюрьхкяня лопат',
'longpages'               => 'Кувака лопат',
'deadendpages'            => 'Полатксфтома лопат',
'deadendpagestext'        => 'Ся лопат аф сюлмафт иля лопатнень мархта {{SITENAME}}-са.',
'protectedpages'          => 'Аралаф лопат',
'protectedpages-indef'    => 'Аньцек апак кемокстак араламат',
'protectedpagestext'      => 'Ся лопат аралаф иля лемс ётафтомада эли петнемада',
'protectedpagesempty'     => 'Тя пингста аралаф лопат ся арафнематнень мархта ашет.',
'protectedtitles'         => 'Аралаф коняксне',
'protectedtitlestext'     => 'Ся лопа коняксне тиемада аралафт',
'protectedtitlesempty'    => 'Тя пингста аралаф лопа конякст ся арафнематнень мархта ашет.',
'listusers'               => 'Тиихне',
'newpages'                => 'Од лопат',
'newpages-username'       => 'Тиить лемоц:',
'ancientpages'            => 'Сембода сире лопат',
'move'                    => 'Ётафтт',
'movethispage'            => 'Ётафтт тя лопась иля вастс',
'unusedimagestext'        => 'Эняльттяма, шарфтк мяльце сянь лангс мес иля интернет лопат, улема, сюлмафт виде URL мархта, сяс синь сувафневихть тяза сидеста тевс нолдамафтома.',
'unusedcategoriestext'    => 'Ся категориень лопат улихть, интай ашет лопат эли иля категориет, конат синь нолдайхть тевс.',
'notargettitle'           => 'Сувафтома лопа аш',
'notargettext'            => 'Сувафтома лопа эли тии исть кочкав тя функцие тевс нолдаманкса.',
'nopagetitle'             => 'Аш стама вешеви лопа',
'nopagetext'              => 'Стама лопась тон вешеть тяса аш.',
'pager-newer-n'           => '{{PLURAL:$1|сяда од 1|сяда отт $1}}',
'pager-older-n'           => '{{PLURAL:$1|сяда сире 1|сяда сирет $1}}',
'suppress'                => 'Кяшема',

# Book sources
'booksources'               => 'Кинигань кучфтемат',
'booksources-search-legend' => 'Вешендемс кинигань кучфтемат',
'booksources-go'            => 'Аре',
'booksources-text'          => 'Сюлмафкст ала сотфт иля интернет лопатнень мархта, конат мишендихть од эди сире кинигат, ди тоса, улема, тон мусак поладомань информацие ся кинигатнень колга, конатнень тон вешендить:',

# Special:Log
'specialloguserlabel'  => 'Тиись:',
'speciallogtitlelabel' => 'Конякс:',
'log'                  => 'Сувама лувомат',
'all-logs-page'        => 'Сембе сувама лувомат',
'log-search-legend'    => 'Вешендемс сувама лувомат',
'log-search-submit'    => 'Мумс',
'alllogstext'          => 'Сембе сувама лувомат {{SITENAME}}-са.
Тондейть ули кода синь кочкафтомс сувама лувомань коряс, тиить эли суваф лопань коряс.',
'logempty'             => 'Стапт сувамот лувомаса ашет.',
'log-title-wildcard'   => 'Мумс конякст конат ушедыхть стама тяшкста',

# Special:AllPages
'allpages'          => 'Сембе лопат',
'alphaindexline'    => '$1-ста $2-с',
'nextpage'          => 'Сай лопа ($1)',
'prevpage'          => 'Сядынголень лопа ($1)',
'allpagesfrom'      => 'Няфтемс лопат ушедомс:',
'allarticles'       => 'Сембе лопат',
'allinnamespace'    => 'Сембе лопат ($1 лемботмоса)',
'allnotinnamespace' => 'Сембе лопат (аф $1 лемботмоса)',
'allpagesprev'      => 'Сядынголень',
'allpagesnext'      => 'Сай',
'allpagessubmit'    => 'Ётамс',
'allpagesprefix'    => 'Няфтемс лопат инголькс мархта:',
'allpagesbadtitle'  => 'Тя лопать коняксоц афоль кондястикс эли сонь ульсь кяльётконь эли викиётконь инголькссь. Сонь, улема, фкя эли фкяда лама тяшкст, конат коняксова аф мярьговихть.',
'allpages-bad-ns'   => '{{SITENAME}}-са аш лемботма "$1".',

# Special:Categories
'categories'                    => 'Категориет',
'categoriespagetext'            => 'Ся категориетнень эса улихть лопат эли медиат. 
[[Special:UnusedCategories|тевс апак нолдак категориятне]] тяса аф няфтевихть.
Стане ина ватт [[Special:WantedCategories|вешема категориятне]].',
'categoriesfrom'                => 'Няфтемс категориет тяста ушедозь:',
'special-categories-sort-count' => 'арафтомс луфть коряс',
'special-categories-sort-abc'   => 'арафтомс алфавитонь коряс',

# Special:ListUsers
'listusersfrom'      => 'Няфтемс тиихть ушедомс:',
'listusers-submit'   => 'Няфтемс',
'listusers-noresult' => 'Тиихть исть мув.',

# Special:ListGroupRights
'listgrouprights'          => 'Тиихнень полгаснон видексонза',
'listgrouprights-summary'  => 'Тяса тиихнень полгасна конатне сувсихть тя Викис синь сувама видексснон мархта.
Тяса ули кода мумс [[{{MediaWiki:Listgrouprights-helppage}}|поладомань информациесь]] эсь башка видекснень колга.',
'listgrouprights-group'    => 'Полга',
'listgrouprights-rights'   => 'Видексне',
'listgrouprights-helppage' => 'Help:Полгань видексонза',
'listgrouprights-members'  => '(полайафнень лувомась)',

# E-mail user
'mailnologin'     => 'Аш кучема адрес',
'mailnologintext' => 'Тондейть эряви [[Special:UserLogin|сувамс]]
ди эряви кондясти электрононь адресце тонь [[Special:Preferences|арафнемасот]] иля тиихненди электрононь сёрмат кучемаснонды.',
'emailuser'       => 'Кучемс электрононь сёрма тя тиинди',
'emailpage'       => 'Кучемс электрононь сёрма тиинди',
'emailpagetext'   => 'Путондярясь тя тиись сонь кондясти электрононь адресонц сонь латцемасонза, сон кундай фкя сёрма.
Электрононь адресцень тон путыть [[Special:Preferences|тонь тиить латцемасост]] кармай эвондама тонь сёрмасот "Киста" паксява, ди сёрмань кундаенди ули кода кучемс сонць сёрманц тя адресс.',
'usermailererror' => 'Электрононь адрес эльбятькссь:',
'defemailsubject' => '{{SITENAME}}-нь электрононь сёрма',
'noemailtitle'    => 'Аш электрононь адрес',
'noemailtext'     => 'Тя тиись изь макса кондясти электрононь адресонц эли сонь аш мялец кунцемс иля тиихнень эста сёрмасна.',
'emailfrom'       => 'Киста:',
'emailto'         => 'Кинди:',
'emailsubject'    => 'Киста',
'emailmessage'    => 'Пачфтема:',
'emailsend'       => 'Кучемс',
'emailccme'       => 'Кучт мондине монь сёрмазень копиянц.',
'emailccsubject'  => 'Тонь $1-ти сёрмацень копияц: $2',
'emailsent'       => 'Электрононь сёрма кучф',
'emailsenttext'   => 'Тонь электрононь сёрмаце кучф.',
'emailuserfooter' => 'Тя электрононь сёрмась $1 кучезе $2-с "Email user" функциеть вельде {{SITENAME}}-са.',

# Watchlist
'watchlist'            => 'Монь мельгеваномазе',
'mywatchlist'          => 'Монь мельгеваномазе',
'watchlistfor'         => "('''$1'''-нди)",
'nowatchlist'          => 'Мезеге аш тонь мельгеваномасот.',
'watchlistanontext'    => '$1 тонь ванома мельгеваномаста лопат ваноманкса эли петнеманкса.',
'watchnologin'         => 'Апак сувак',
'watchnologintext'     => 'Тондейть эряви [[Special:UserLogin|сувамс]] тонь мельгеваномацень петнеманкса.',
'addedwatch'           => 'Полатфоль ванома мельгеваномазот',
'addedwatchtext'       => "Лопась \"[[:\$1]]\" сувафнезь тонь [[Special:Watchlist|Мельгеваномасот]].
Сяда тов тя лопать ди мархтонза сюлмаф Корхнема лопать полафнематне кармайхть тякшстафтовома   тя лувомас, сяда тёждяень няевомаснонды синь тага кармайхть сёрмадовома  [[Special:RecentChanges|улхкомбань полафнематнень лувомас]] '''эчке тяшксса'''.

Улендяряй тонь мяльце тя лопать нардамс тонь мельгеваномастот, люпштак \"аф ваномс мельге\" лопань вярдень виде ужеса.",
'removedwatch'         => 'Нардаф мельгеваномаста',
'removedwatchtext'     => 'Лопась "[[:$1]]" нардафоль [[Special:Watchlist|тонь мельгеванома лувомастот]].',
'watch'                => 'Ватт мельге',
'watchthispage'        => 'Ваномс тя лопать мельге',
'unwatch'              => 'Аф ваномс тянь мельге',
'unwatchthispage'      => 'Лоткамс мельге ваномать',
'notanarticle'         => 'Аф сёрмапотмонь лопа',
'notvisiblerev'        => 'Верзиесь нардафоль',
'watchnochange'        => 'Мезеге изь полафтов тонь мельгеванома лувомастот тя пингеёткса.',
'watchlist-details'    => '{{PLURAL:$1|$1 лопа|$1 лопат}} мельгеваномацень ала корхнема лопат аф лувомок.',
'wlheader-enotif'      => '* Электрононь сёрма вельде пачфнема нолдаф тевс.',
'wlheader-showupdated' => "* Лопат конань полафтозь тонь мекольце сувсемадот меле няфтевсть '''эчке тяшкса'''.",
'watchmethod-recent'   => 'мельге ванома ала лопатнень коряс улхкомбань петнематнень ванондома',
'watchmethod-list'     => 'улхкомбань петнематнень коряс мельге ванома ала лопат ванондома',
'watchlistcontains'    => 'Тонь мельгеваномасот $1 {{PLURAL:$1|лопа|лопат}}.',
'iteminvalidname'      => "Прябала '$1'-ть мархть, лемоц аф кондясти...",
'wlnote'               => "Ала {{PLURAL:$1|мекольце полафнема|'''$1''' мекольце полафнемат}} ётай {{PLURAL:$2| ойста (часста)|'''$2''' ойста (часста)}}.",
'wlshowlast'           => 'Няфтемс мекольце $1 ойхть (част) $2 шит $3',
'watchlist-show-bots'  => 'Няфтемс робот програмонь петнематне',
'watchlist-hide-bots'  => 'Кяшемс робот програмонь петнематне',
'watchlist-show-own'   => 'Няфтемс монь петнемане',
'watchlist-hide-own'   => 'Кяшемс монь петнемане',
'watchlist-show-minor' => 'Няфтемс ёмла видептематне',
'watchlist-hide-minor' => 'Кяшемс ёмла видептематне',

# Displayed when you click the "watch" button and it is in the process of watching
'watching'   => 'Ванома...',
'unwatching' => 'Аф ванома...',

'enotif_mailer'                => '{{SITENAME}} Пачфнематнень Кучи',
'enotif_reset'                 => 'Путомс тяшкс сембе суваф лопатнень лангс',
'enotif_newpagetext'           => 'Тя од лопа.',
'enotif_impersonal_salutation' => '{{SITENAME}} тиись',
'changed'                      => 'полафтсь',
'created'                      => 'тиф',
'enotif_subject'               => '{{SITENAME}} page $PAGETITLE has been $CHANGEDORCREATED by $PAGEEDITOR',
'enotif_lastvisited'           => 'Ванк $1 тонь мекольце самдот меле сембе поланематнень няфтеманкса.',
'enotif_lastdiff'              => 'Ванк $1 тя полафнемать няфтеманкса.',
'enotif_anon_editor'           => 'лемфтома тиись $1',
'enotif_body'                  => 'Кельгома $WATCHINGUSERNAME,


$PAGEEDITDATE {{SITENAME}}-нь лопа $PAGETITLE $CHANGEDORCREATED тиись $PAGEEDITOR, ванк $PAGETITLE_URL тя пингонь верзиень ваномста.

$NEWPAGE

Петнить лихтемац: $PAGESUMMARY $PAGEMINOREDIT

Сотомс петнить мархта:
электрононь адрес: $PAGEEDITOR_EMAIL
вики: $PAGEEDITOR_WIKI

Аф кармайхть кучевома пачфтемат иля сай полафнематнень колга тонь самдот тя лопас инголе. Тондейть тага ули кода омбоцекс путомс пачфтема содафксне тонь мельгеваномазот сембе тонь мельгеванома ала лопатненди.

             Тонь ялгань {{SITENAME}}нь пачфтема системце

--
Тонь мельгеваномацень латцемасна полафтоманкса ванк
{{fullurl:{{ns:special}}:Watchlist/edit}}

Азома мекпяли ди лезкс:
{{fullurl:{{MediaWiki:Helppage}}}}',

# Delete/protect/revert
'deletepage'                  => 'Нардамс лопать',
'confirm'                     => 'Кемокстамс',
'excontent'                   => "потмосоль: '$1'",
'excontentauthor'             => "потмоц ульсь: '$1' (аньцек фкя путысь ульсь'[[Special:Contributions/$2|$2]]')",
'exbeforeblank'               => "шамдомада инголе потмоц ульсь: '$1'",
'exblank'                     => 'лопась шаволь',
'delete-confirm'              => 'Нардамс "$1"',
'delete-legend'               => 'Нардамс',
'historywarning'              => 'Инголе мярьгома: Тон ёрат нардамс лопать, конань ульсь историец:',
'confirmdeletetext'           => 'Тон сърхкать нардамс лопать сембе сонь историянц мархта.
Эняльттяма, кемокстак тон афкукс ёрат тянь тиемс, эди тон шарьхкодьсак мезе лиси тяда меле, ди тон сембе тянь тисак [[{{MediaWiki:Policy-url}}|политик]] коряс.',
'actioncomplete'              => 'Тевонь тиемась анок',
'deletedtext'                 => 'Лопась "<nowiki>$1</nowiki>" нардафоль. Ванк $2 мекольце нардаматнень няфтеманкса.',
'deletedarticle'              => 'нардаф "[[$1]]"',
'suppressedarticle'           => 'кяшф "[[$1]]"',
'dellogpage'                  => 'Нардамань лувома',
'dellogpagetext'              => 'Улхкомбань нардаматнень лувомась ала.',
'deletionlog'                 => 'нардамань лувома',
'reverted'                    => 'Мърдаф сядынголень верзиес',
'deletecomment'               => 'Нардамань туфтал:',
'deleteotherreason'           => 'Лия/поладомань туфтал:',
'deletereasonotherlist'       => 'Иля туфтал',
'deletereason-dropdown'       => '*Марстонь нардама туфталхт
** Тиить вешфкссь
** Копияма видексть сърафтома
** Колендемась',
'delete-edit-reasonlist'      => 'Петнемс нардамань туфталхне',
'delete-toobig'               => 'Тя лопать кувака петнемань историясь, $1 {{PLURAL:$1|верзиеда|верзиеда}} лама. Тяфтама лопатнень нардамась кардаф {{SITENAME}}-нь уф учсеви колавомада араламать туфталонкса.',
'delete-warning-toobig'       => 'Тя лопать кувака петнемань историясь, $1 {{PLURAL:$1|верзиеда|верзиеда}} лама. Сонь нардамаста, улема, лиси {{SITENAME}}-нь датабаза якаманц колавомась; тик тянь инголе арьсезь.',
'rollback'                    => 'Кевордамс петнематнень меки',
'rollback_short'              => 'Меки кевордама',
'rollbacklink'                => 'кевордамс меки',
'rollbackfailed'              => 'Меки кевордамась изь лисе',
'cantrollback'                => 'Аш кода петнемать мърдафтомс; мекольце путысь ульсь тя лопать анцек фкя тиикс.',
'alreadyrolled'               => 'Аш кода меки кевордамс [[:$1]]нь мекольце петнемать, конань тись [[User:$2|$2]] ([[User talk:$2|Корхнема]] | [[Special:Contributions/$2|{{int:contribslink}}]]);
иля тиись сонь петезе эли кевордазе ни.

Мекольце петнема  тизе [[User:$3|$3]] ([[User talk:$3|Корхнема]] | [[Special:Contributions/$3|{{int:contribslink}}]]).',
'editcomment'                 => 'Петнема мяльполаткс ульсь: "<i>$1</i>".', # only shown if there is an edit comment
'revertpage'                  => 'Петнематнень мърдафтозь [[Special:Contributions/$2|$2]] ([[User talk:$2|Корхнема]]) сядынгольдень верзиес мърдафтозе [[User:$1|$1]]', # Additional available: $3: revid of the revision reverted to, $4: timestamp of the revision reverted to, $5: revid of the revision reverted from, $6: timestamp of the revision reverted from
'rollback-success'            => 'Петнематнень мърдафтозе $1; сядынгольдень верзиес мърдафтозе $2.',
'sessionfailure'              => 'Улема, лиссь прябала тонь сувама пингста; програмонь якамась лотказевсь сувамать върьгятемада аралама туфталонкса. Эняльттяма, люпштак "меки" ди одонзафтт лопать, конаста тон сать, меле тик сембе одукс.',
'protectlogpage'              => 'Аралама лувома',
'protectlogtext'              => 'Ала лопань пякстама-панжема лувомась. Ванк [[Special:ProtectedPages|аралаф лопатнень лувомась]] тя пингонь системонь лопать араламанкса.',
'protectedarticle'            => 'аралаф "[[$1]]"',
'modifiedarticleprotection'   => '"[[$1]]"-нь араламань виенц полафтсь',
'unprotectedarticle'          => '"[[$1]]" аф аралаф',
'protect-title'               => '"$1"-нь араламань виец арафнема',
'protect-legend'              => 'Араламать кемокстак',
'protectcomment'              => 'Мяльполаткс:',
'protectexpiry'               => 'Шумордави:',
'protect_expiry_invalid'      => 'Шумордама пинге аф кондясти.',
'protect_expiry_old'          => 'Шумордама пингсь ётась.',
'protect-unchain'             => 'Панжемс ётафтомань мярьговомась',
'protect-text'                => 'Тондейть ули кода тяса ваномс эди полафтомс аралама виенц <strong><nowiki>$1</nowiki></strong> лопанди.',
'protect-locked-blocked'      => 'Аш кода полафтомс араламать виенц сёлгома пингста. Лопать тяниень латцеманза тясот <strong>$1</strong>:',
'protect-locked-dblock'       => 'Аш кода полафтомс араламать виенц  датабазонь пякстамать сюнеда.
Лопать тяниень латцеманза тясот <strong>$1</strong>:',
'protect-locked-access'       => 'Тонь сёрматфтомасот аф мярьгови лопать аралама виенц полафтома.
Тяса ащихть тя пингонь арафнематне <strong>$1</strong> лопанди:',
'protect-cascadeon'           => 'Тя лопась тя пингста аралаф сяс мес сонь сувафнезь {{PLURAL:$1|каскад аралама ала лопань лувомас|какскад аралама лопатнень кярьксс}}. Тондейть ули кода тя лопать аралама виенц полафтомс, аньцек какскад араламась сякокс иляды.',
'protect-default'             => '(апак полафтт)',
'protect-fallback'            => 'Эряви "$1"-ть мярьговомац',
'protect-level-autoconfirmed' => 'Сёлгомс аф сёрматф тиихнень',
'protect-level-sysop'         => 'Аньцек системонь вятиксне',
'protect-summary-cascade'     => 'каскад лаца',
'protect-expiring'            => 'шумордави $1 (UTC)',
'protect-cascade'             => 'Араламс лопатнень, конатнень сувафтозь тя лувомас (каскад араламать алу)',
'protect-cantedit'            => 'Тондейть аш кода лопать аралама виензон полафтомс, сяс мес тонь
аш петнемань мярьговомась.',
'restriction-type'            => 'Мярьговома:',
'restriction-level'           => 'Пякстама вийсь:',
'minimum-size'                => 'Минимум кувалмоц',
'maximum-size'                => 'Максимум кувалмоц:',
'pagesize'                    => '(байтт)',

# Restrictions (nouns)
'restriction-edit'   => 'Петнемс',
'restriction-move'   => 'Ётафтомс иля вастс',
'restriction-create' => 'Тиемс',
'restriction-upload' => 'Тонгомс',

# Restriction levels
'restriction-level-sysop'         => 'вииста аралаф',
'restriction-level-autoconfirmed' => 'пялес аралаф',
'restriction-level-all'           => 'кодама повсь виец',

# Undelete
'undelete'                     => 'Няфтемс нардаф лопатне',
'undeletepage'                 => 'Няфтемс эди мърдафтомс нардаф лопатне',
'undeletepagetitle'            => "'''Тоса кирдевихть [[:$1|$1]]-нь нардаф верзиенза'''.",
'viewdeletedpage'              => 'Няфтетемс нардаф лопатне',
'undeletepagetext'             => 'Ся лопатнень нардазь, интай синь тя пингса пърдафкссат эди ули кода синь мърдафтомс. Пърдафкссь аруяфтови пингста пингс.',
'undelete-fieldset-title'      => 'Мърдафтомс верзиетне',
'undeleteextrahelp'            => "Сембонь лопать историянц мърдафтоманди эряви кадомс сембе нилюжет тяштьксфтома ди люпштамс '''''Мърдафтомс'''''. Пакшень-пакшень мърдафтоманди путт тяшкст сембе нилюжева сотфт эряви верзиетнень мархта ди люпштак '''''Мърдафтомс'''''.'''''Валхтомс''''' пунять люпштамада меле мяльполатксонь пакся ди сембе нилюжетне шамдомихть.",
'undeleterevisions'            => '$1 {{PLURAL:$1|верзие аркивса|верзиет аркивса}}',
'undeletehistory'              => 'Лопать мърдафтомста тон мърдафнесак историяс сембе сонь верзиенза.
Эвондярясь иля лопа тяка лемса сонь нардамада меле, мърдафтф верзиетне повихть сядынголень историяс.',
'undeleterevdel'               => 'Мърдафтома аф тиеви мъзярда сон вяти вяре лопать эли файлонь верзиять пакшень-пакшень нардаманди. Тя тевса тондейть аф эряви улхкомба нардаф верзиетнень ваномс эли панжемс.',
'undeletehistorynoadmin'       => 'Тя лопась нардафоль. Ала тяштьф нардамань туфтал лихтемась эди лувомась, коса сёрматфт сембе кит тя лопать петнезь сонь нардамада инголе. Нардаф верзиеть текстонза мярьгови ваномс аньцек оцюнятненди.',
'undelete-revision'            => 'Нардаф $1-нь верзиец ($2 нардазе $3):',
'undeleterevision-missing'     => 'Стама верзиеть аш эли сон аф кондясти. Улема, тон ётать аф виде сюлмафксова, илякс тя верзиесь мърдафтфоль эли аркивста нардафоль.',
'undelete-nodiff'              => 'Сядынгольдень верзиет исть мув.',
'undeletebtn'                  => 'Мърдафтомс',
'undeletelink'                 => 'мърдафтома',
'undeletereset'                => 'Валхтомс',
'undeletecomment'              => 'Мяльполаткс:',
'undeletedarticle'             => 'мърдафтф "[[$1]]"',
'undeletedrevisions'           => '{{PLURAL:$1|1 верзие|$1 верзиет}} мърдафтфт',
'undeletedrevisions-files'     => '{{PLURAL:$1|1 верзие|$1 верзиет}} эди {{PLURAL:$2|1 файл|$2 файлхт}} мърдафтфт',
'undeletedfiles'               => '{{PLURAL:$1|1 файл|$1 файлхт}} мърдафтфт',
'cannotundelete'               => 'Мърдафтома изь лисев; иля тиись, улема, ульсь васенцекс кие сонь мърдафтозе.',
'undeletedpage'                => "<big>'''$1 мърдафтфоль'''</big>

Ванк [[Special:Log/delete|нардамань лувомась]] улхкомбань нардаматнень эди мърдафтоматнень няфтеманкса.",
'undelete-header'              => 'Ванк [[Special:Log/delete|нардамань лувомась]] улхкомба нардаф лопатнень няфтеманкса.',
'undelete-search-box'          => 'Ваномс нардаф лопатне',
'undelete-search-prefix'       => 'Няфтемс лопат тяста ушедомс:',
'undelete-search-submit'       => 'Вешендемс',
'undelete-no-results'          => 'Стапт лопат исть мув нардамань аркивста.',
'undelete-filename-mismatch'   => 'Аш кода мърдафтомс $1 файл верзиеть: файллепт аф фкат',
'undelete-bad-store-key'       => 'Аш кода мърдафтомс $1 файл верзиеть: файлсь юмась нардамада инголе.',
'undelete-cleanup-error'       => 'Лиссь эльбятькс аркив файл "$1" нардамста.',
'undelete-missing-filearchive' => 'Аш кода мърдафтомс файлть аркив  ID $1 сяс мес сон аф датабазаса. Сонь, улема, нардазь ни.',
'undelete-error-short'         => 'Эльбятькс нардама файл: $1',
'undelete-error-long'          => 'Листь эльбятькст мърдафтома файл:

$1',

# Namespace form on various pages
'namespace'      => 'Лемботма:',
'invert'         => 'Валхтомс кочкама',
'blanknamespace' => '(Пря)',

# Contributions
'contributions' => 'Тиить путксонза',
'mycontris'     => 'Монь путксне',
'contribsub2'   => '$1 ($2)-нди',
'nocontribs'    => 'Тя вешфксть коряс кодамога полафтомат исть мув.',
'uctop'         => '(прянь)',
'month'         => 'Ковста (ди сядынголе):',
'year'          => 'Кизоста (ди сядынголе):',

'sp-contributions-newbies'     => 'Няфтемс аньцек од сёрматфтоматнень путкссна',
'sp-contributions-newbies-sub' => 'Од сёрматфтомаста',
'sp-contributions-blocklog'    => 'Сёлгомань лувомась',
'sp-contributions-search'      => 'Вешендемс путкст',
'sp-contributions-username'    => 'IP адрес эли тиить лемоц:',
'sp-contributions-submit'      => 'Вешендема',

# What links here
'whatlinkshere'            => 'Сюлмафкст тяза',
'whatlinkshere-title'      => 'Лопат конат сюлмафт "$1" мархта',
'whatlinkshere-page'       => 'Лопа:',
'linklistsub'              => '(Сюлмафкснень лувомась)',
'linkshere'                => "Ся лопатне сюлмафт '''[[:$1]]''' мархта:",
'nolinkshere'              => "Лопат, конат сюлмафт '''[[:$1]]''' мархта ашет.",
'nolinkshere-ns'           => "Аш лопат сюлмафт '''[[:$1]]''' мархта  кочкаф лемботмоста.",
'isredirect'               => 'ётафтф лопа',
'istemplate'               => 'сувафтома',
'isimage'                  => 'архтофксонь сюлмафкссь',
'whatlinkshere-prev'       => '{{PLURAL:$1|сядынголень|сядынголень $1}}',
'whatlinkshere-next'       => '{{PLURAL:$1|сай|сай $1}}',
'whatlinkshere-links'      => '← сюлмафкст',
'whatlinkshere-hideredirs' => '$1 иля вастс йотафтомат',
'whatlinkshere-hidetrans'  => '$1 трансклюзиет',
'whatlinkshere-hidelinks'  => '$1 сюлмафкст',
'whatlinkshere-hideimages' => '$1 архтофксонь сюлмафкст',
'whatlinkshere-filters'    => 'Фильтрат',

# Block/unblock
'blockip'                         => 'Пякстамс тиить',
'blockip-legend'                  => 'Кардамс тиить',
'blockiptext'                     => 'Эряви нолдамс тевс форм ала башка IP адресста эли тиить лем вельде  сёрмадомань сувамать сёлгоманкса.
Тя эряви тиемс аньцек колендемада аралама туфталонкса ди [[{{MediaWiki:Policy-url}}|политик]]-ть коряс.
Путт туфталть алу (кепотьксонди, лятфнек лопатне конатнень эса колендесть).',
'ipaddress'                       => 'IP адрес:',
'ipadressorusername'              => 'IP адрес эли тиить лемоц:',
'ipbexpiry'                       => 'Сирелгоды:',
'ipbreason'                       => 'Туфтал:',
'ipbreasonotherlist'              => 'Иля туфтал',
'ipbreason-dropdown'              => '* Кърдань сёлгома туфталхт
** Аф виде информациень путнема
** Лопаста сёрматфть нардама
** Аф виде ушеширень интернет сюлмафкснень макссема
** Ёньфтома/смузьфтома информациень лопас путнема
** Кальдяв прянь вятема/сялгодома
** Лама сёрматфтоматнень покордама
** Аф пара тиить лемоц',
'ipbanononly'                     => 'Сёлгомс аньцек лемфтома тиихнень',
'ipbcreateaccount'                => 'Кардамс сёрматфтомась тиема',
'ipbemailban'                     => 'Кардамс тиинди кучемс электрононь сёрмат',
'ipbenableautoblock'              => 'Эсезонза сёлгомс тя тиить мекольце IP адресть эди иля IP адрест конань эста сон тяряфни петнемат тиемс',
'ipbsubmit'                       => 'Сёлгомс тя тиить',
'ipbother'                        => 'Иля пинге:',
'ipboptions'                      => '2 ойхть (част):2 hours,1 ши:1 day,3 шит:3 days,1 тарга (недля):1 week,2 таргат (недлят):2 weeks,1 ков:1 month,3 кофт:3 months,6 кофт:6 months,1 киза:1 year,пефтома:infinite', # display1:time1,display2:time2,...
'ipbotheroption'                  => 'иля',
'ipbotherreason'                  => 'Иля/поладомань туфтал:',
'ipbhidename'                     => 'Кяшемс тиить лемоц сёлгома лувомаста, тяниень сёлгома лувомать ди тиинь лувомать',
'ipbwatchuser'                    => 'Ваномс тя тиить лопанц ди сонь корхнема лопанц мельге.',
'badipaddress'                    => 'Аф кондясти IP адрес',
'blockipsuccesssub'               => 'Сёлгома ётась лац',
'blockipsuccesstext'              => '[[Special:Contributions/$1|$1]] сёлгозь.<br />
Ванк [[Special:IPBlockList|IP сёлгома лувомать]] сёлгомат ваноманкса.',
'ipb-edit-dropdown'               => 'Полафтомс сёлгома туфталхт',
'ipb-unblock-addr'                => 'Валхтомс $1-нь сёлгома',
'ipb-unblock'                     => 'Тиинь эли IP адресонь сёлгома валхтомс',
'ipb-blocklist-addr'              => 'Ваномс тяниень $1-нь сёлгоманза',
'ipb-blocklist'                   => 'Ваномс тяниень сёлгомат',
'unblockip'                       => 'Валхтомс сёлгома тииста',
'unblockiptext'                   => 'Нолдак тевс форм ала инголе сёлкф тиить суваманц сёлкф IP адрес эли тиинь лемоц вельде мърдафтоманкса.',
'ipusubmit'                       => 'Валхтомс сёлгома тя адресста',
'unblocked'                       => '[[User:$1|$1]]-ть сёлгомац валхтф',
'unblocked-id'                    => '$1-нь сёлгомац валхтф',
'ipblocklist'                     => 'Сёлкф IP адреснень эди тиинь лепнень лувомась',
'ipblocklist-legend'              => 'Мумс сёлкф тиить',
'ipblocklist-username'            => 'Тиить лемоц эли IP адрес:',
'ipblocklist-submit'              => 'Вешендема',
'blocklistline'                   => '$1, $2 сёлгозь $3 ($4)',
'infiniteblock'                   => 'пефтома',
'expiringblock'                   => 'шумордави $1',
'anononlyblock'                   => 'аньцек лемфтома',
'noautoblockblock'                => 'эслек сёлгома лоткаф',
'createaccountblock'              => 'сёрматфтомась тиема сёлкф',
'emailblock'                      => 'электрононь адрес сёлкф',
'ipblocklist-empty'               => 'Сёлгома лувомась шава.',
'ipblocklist-no-results'          => 'Вешф IP адрес эли тиить лемоц аф сёлкф.',
'blocklink'                       => 'сёлгома',
'unblocklink'                     => 'панжемс',
'contribslink'                    => 'путкс.',
'autoblocker'                     => 'Эслек сёлкф сяс мес тонь IP адресцень нолдась тевс "[[User:$1|$1]]". $1-нь сёлгомац туфтал: "$2"',
'blocklogpage'                    => 'Сёлгомань лувома',
'blocklogentry'                   => '[[$1]] сёлкф $2 $3 пингс',
'blocklogtext'                    => 'Тя лувомас сувсихть тиихнень сембе пякстамань ди панжемань тефне.
Эсь сёлгови IP адресне тязк аф сувсихть.
Ванк [[Special:IPBlockList|IP пякстаматнень лувомать]] тяниень якамань кардафкснень ди пякстаматнень мархта.',
'unblocklogentry'                 => 'кардафкста нолдазь $1',
'block-log-flags-anononly'        => 'аньцек лемфтома тиихне',
'block-log-flags-nocreate'        => 'од сёрматфтомась аф тиеви',
'block-log-flags-noautoblock'     => 'эсь тиеви пякстама аф тиеви',
'block-log-flags-noemail'         => 'электрононь адрессь пякстазь',
'block-log-flags-angry-autoblock' => 'келептьф авто-пякстафтомась нолдафоль',
'range_block_disabled'            => 'Тяни оцю пякстафксне аф тиевихть системонь вятикснень эса.',
'ipb_expiry_invalid'              => 'Аф кондясти сирелгодома пинге.',
'ipb_expiry_temp'                 => 'Кяшф тиинь лемть сёлгоматне мъзярдонга аф полафтовихть.',
'ipb_already_blocked'             => '"$1" сёлкфоль ни',
'ipb_cant_unblock'                => 'Эльбятькс: ID $1-нь кардафксоц аф муви. Улема, тя кардафкссь валхтфоль ни.',
'ipb_blocked_as_range'            => 'Эльбятькс: IP $1 аф кардаф видеста ди соннеда аш кода кардафкссь валхтомс.
Сон, интай улема, кардафоль кода  $2-нь потмонц пакшец, конань эзда ули кода кардафксонь валхтомс.',
'ip_range_invalid'                => 'Аф кондясти IP потмоц.',
'blockme'                         => 'Кардамань монь',
'proxyblocker'                    => 'Ётка якаень сёлгома',
'proxyblocker-disabled'           => 'Тя функциесь аф тиеви.',
'proxyblockreason'                => 'Тонь IP адрес пякстафоль сонь панжада прокси-серверонь эзда.
Тондейть эряви сотомс тонь интернет ладяйть эли текникань нежедемать мархта ди пачфтемс тя прябалать колга.',
'proxyblocksuccess'               => 'Тиф.',
'sorbsreason'                     => 'Тонь IP адресце лувови панжада ётка якай сервероннекс DNSBL-са, конась нолдаф тевс {{SITENAME}}са.',
'sorbs_create_account_reason'     => 'Тонь IP адресце лувови панжада ётка якань сервероннекс DNSBL-са конась нолнезь тевс {{SITENAME}}са.
Тондейть аш кода сёрматфтомать тиемс',

# Developer tools
'lockdb'              => 'Пякстамс датабазать',
'unlockdb'            => 'Панжемс датабазать',
'lockdbtext'          => 'Датабазонь пякстамась кардасы иля тиихнень лопатнень петнема, синь арафнемаснон полафнема, синь мельгеваномаснон петнема, ди ля тефнень датабазонь мархта тиема.
Кемокстак тон афкукс тянь мялецоль тиемс эди тон датабазать панжесак тонь латцема тевдот меле.',
'unlockdbtext'        => 'Датабазаста пякстамать валхтомада меле сембе тиихненди ули кода петнемс лопат, полафтомс синь арафнемаснон, петнемс синь мельгеваномаснон ди иля тефнень датабазонь мархта тиема.
Кемокстак тон афкукс тянь мялецоль тиемс.',
'lockconfirm'         => 'Ина, монь афкукс мялезе пякстамс датабазать.',
'unlockconfirm'       => 'Ина, монь афкукс мялезе панжемс датабазать.',
'lockbtn'             => 'Пякстамс датабазать',
'unlockbtn'           => 'Панжемс датабазать',
'locknoconfirm'       => 'Тон изеть варжа кемокстамань парготь.',
'lockdbsuccesssub'    => 'Датабазать пякстамась мольсь лац',
'unlockdbsuccesssub'  => 'Датабазонь пякстамать панжевсь',
'lockdbsuccesstext'   => 'Датабазать пякстазь.<br />
Киртть мяльсот тейть эряви [[Special:UnlockDB|пякстамать панжемс]] тонь латцематнень шумордамда меле.',
'unlockdbsuccesstext' => 'Датабазать пякстамась панжевсь.',
'lockfilenotwritable' => 'Датабазонь пякстама файл аф сёрмадови.
Датабазонь панжема-пякстама инголе эряви тянь тиемс web-серверса сёрмадовикс.',
'databasenotlocked'   => 'Датабазась аф пякстаф.',

# Move page
'move-page'               => 'Йотафтомс $1 од вастс',
'move-page-legend'        => 'Йотафтомс лопа иля вастс',
'movepagetext'            => "Форм ала тевс нолдамста тон лопать одс лемдесак, сембе сонь историяц ули ётафтф мархтонза од лем лопас.
Сире лемоц арай од лем лопас ётафтфксокс.
Лемть мархта ётафтфксне улихть кода эслек одонзамс. Улефтяряй мяльце синь эслек одонзальхть, эряви нама варжамс[[Special:DoubleRedirects|кафонзаф]] эли [[Special:BrokenRedirects|синтьф ётафтфксне]].
Тондейть сави лацкаста варжамс сюлмафксне илядсть арафнефокс виде ёну.

Шарфтк мяльце улендярясь ни тя од лемса иля сёрматфсь, лопась '''аф''' ётафтови мъзярс од вастсь арай шавакс эли ётафтфксокс эди тоса аш ётай петнема история. Сякокс тондейть ули кода ётафтомс лопать меки коса сон инголе ульсь, эди тондейть аш кода тага весть тиемс лопать кона ули ни.

'''ИНГОЛЕ МЯРЬГОМА!'''
Одс лемдемась канни содаф лопанди апак учт эди вакска аф ётави полафтомась;
эняльттяма арьсек тевда инголе мес тон шарьхкодят мезе лиси тонь тиемада меле.",
'movepagetalktext'        => "Сотф корхнема лопась ули эслек ётафтф мархтонза '''кафта тевда башка:'''
*Аф шава корхнема лопась ульсь ни иля лемса, эли
*Тон изеть пута тяшкскя паксяс ала.

Ся тефнень сюнеда тондейть сави кядьвельде лопать ётафтомс эли шоворемс кода эряви.",
'movearticle'             => 'Ётафтомс лопать иля вастс:',
'movenotallowed'          => 'Тондейть аф мярьгови ётафтомс лопат од вастс {{SITENAME}}са.',
'newtitle'                => 'Од лемс:',
'move-watch'              => 'Ваномс тя лопать мельге',
'movepagebtn'             => 'Ётафтомс лопась иля вастс',
'pagemovedsub'            => 'Ётафтомась ётась лац',
'movepage-moved'          => '<big>\'\'\'"$1"сь ётафтфоль "$2"с\'\'\'</big>', # The two titles are passed in plain text as $3 and $4 to allow additional goodies in the message.
'articleexists'           => 'Тя лем мархта лопась ульсь ни эли лемсь, кона тон кочкать аф кондясти.
Арьсек иля лем.',
'cantmove-titleprotected' => 'Аш кода ётафтомс лопать тя вастс сяс мес тя од конякссь тиемада аралаф',
'talkexists'              => "'''Тя лопать ётафтомац анок, аньцек сонь корхнема лопац аф ётафтови, сяс мес од лемса  фкя лопа ульсь ни. Эняльттяма, шоворьфть синь кядьвельде.'''",
'movedto'                 => 'ётафтфоль',
'movetalk'                => 'Ётафтт сотф мархтонза корхнема лопась',
'move-subpages'           => 'Ётафтт сембе суб-лопатне кда эрявихть',
'move-talk-subpages'      => 'Ётафтт сембе корхнема лопатнень суб-лопасна кда эрявихть',
'movepage-page-exists'    => 'Лопась $1 ульсь ни и сон эслек одукс аф сёрмадови.',
'movepage-page-moved'     => 'Лопась $1 ётафтфоль $2-с.',
'movepage-page-unmoved'   => 'Лопать $1 аш кода ётафтомс $2-с.',
'movepage-max-pages'      => 'Сембода лама $1 {{PLURAL:$1|лопа|лопат}} йотафтфольхть иля вастс и фкявок сяда тов аф кармай эслек ётафтовома.',
'1movedto2'               => '[[$1]] ётафтфоль [[$2]]с',
'1movedto2_redir'         => '[[$1]] ётафтфоль [[$2]]с иля вастс ётафтфтома вельде',
'movelogpage'             => 'Иля вастс ётафтомань лувомась',
'movelogpagetext'         => 'Ала од вастс ётафтф лопатнень лувомась.',
'movereason'              => 'Туфтал:',
'revertmove'              => 'веляфтомс',
'delete_and_move'         => 'Нардамс эди од вастс ётафтомс',
'delete_and_move_text'    => '==Нардамась вешф==
Эрявкстовсь лопа "[[:$1]]" ульсь ни.
Мяльце нардамонза од вастс ётафтомань шумордаманкса?',
'delete_and_move_confirm' => 'Ина, нардак лопать',
'delete_and_move_reason'  => 'Нардаф од вастс ётафтомань шумордамонкса',
'selfmove'                => 'Лисема вастонь ди од вастонь коняксне фкат;
аш кода ётафтомс лопать тяка вастс кона сон ащесь ни.',
'immobile_namespace'      => 'Лисема эли од вастонь конякссь явови иля конякста;
аш кода ётафтомс лопат инголень вастста од вастс тя лемботмоса.',
'imagenocrossnamespace'   => 'Аш кода йотафтомс архтофкссь аф архтофксонь лемботмос',
'imagetypemismatch'       => 'Файлть од келептемац явови сонь сортодонза',
'imageinvalidfilename'    => 'Вешеви файллемсь аф кондясти',
'fix-double-redirects'    => 'Одонзамс сембе ётафтфксне конат сюлмафт ушедомань лем мархта',

# Export
'export'            => 'Вимс лопатнень файлс',
'exporttext'        => 'Тондейть ули кода ускомс текстть ди кодамога лопань эли лопатнень кярьксснон петнема историять XML форматса.
Тянь ули кода ускомс иля Викис MediaWiki-ть тевс нолдамда [[Special:Import|ускома лопать]] вельде.

Лопатнень ускоманди путт конякст текстонь кудняс ала, фкя конякс киксс, ди кочкак кда мяльце тяниень верзиеть, стане ина сембе сире верзиет лопань историять киксонзон мархта эли аньцек тяниень верзиеть мекольце петнемань информациенц мархта.

Мекольце вариантса тондейть ули кода кундамс сюлмафксть, кепотьксонди [[{{ns:special}}:Export/{{MediaWiki:Mainpage}}]] "[[{{MediaWiki:Mainpage}}]]" лопанди.',
'exportcuronly'     => 'Сувафтомс аньцек тяниень верзиеть, аф сембе историянзон',
'exportnohistory'   => "----
'''Шарфтт мяльце:''' Пяшксе историянь лопатнень тонгомась тя формть вельде кардазь лац якафтомань туфталонкса.",
'export-submit'     => 'Лихтемс',
'export-addcattext' => 'Поладомс лопат категорияста:',
'export-addcat'     => 'Поладомс',
'export-download'   => 'Ванфтомс кода файл',
'export-templates'  => 'Сувафтомс шаблотт',

# Namespace 8 related
'allmessages'               => 'Системонь пачфтематне',
'allmessagesname'           => 'Лем',
'allmessagesdefault'        => 'Апак полафтт текст',
'allmessagescurrent'        => 'Тяниень текст',
'allmessagestext'           => 'Тя MediaWiki-са васьфневи системонь пачфтематнень лувомась.
Эняльттяма, сувак [http://www.mediawiki.org/wiki/Localisation MediaWiki Локализациес] ди [http://translatewiki.net Betawiki-с] кда тонь мяльце тиемс эсь путксце марстонь MediaWiki локализациес.',
'allmessagesnotsupportedDB' => "Тя лопас аш кода кунцемс сяс мес '''\$wgUseDatabaseMessages'''лоткафоль.",
'allmessagesfilter'         => 'Пачфтемань лепнень фильтрась:',
'allmessagesmodified'       => 'Няфтемс аньцек полафтф',

# Thumbnails
'thumbnail-more'           => 'Оцюлгофтомс',
'filemissing'              => 'Файлсь аф муви',
'thumbnail_error'          => 'Миниатюр тиема эльбятькс: $1',
'djvu_page_error'          => 'DjVu лопась аф сатови',
'djvu_no_xml'              => 'Аш кода латцемс XML DjVu файлти',
'thumbnail_invalid_params' => 'Аф кондясти миниатюронь арафнеманза',
'thumbnail_dest_directory' => 'Аш кода ушедомс од вастонь директориесь',

# Special:Import
'import'                     => 'Ускомс лопат',
'importinterwiki'            => 'Трансвикинь ускома',
'import-interwiki-text'      => 'Кочкак Викись ди лопань коняксонц эрявихть ускоманди.
Верзиень шисна ди петнихнень лемсна улихть ванфтфт.
Сембе ётковикинь ускома тефне тяшневихть [[Special:Log/import|ускомань лувомас]].',
'import-interwiki-history'   => 'Копияфтомс тя лопать сембе историянь верзиенза',
'import-interwiki-submit'    => 'Ускомс',
'import-interwiki-namespace' => 'Ётафтомс лопатнень тя лемботмос:',
'importtext'                 => 'Эняльттяма ускт файлть Вики лисьмаста [[Special:Export|ускома лезкссь]] тевс нолдазь, ванфтт тянь тонь содама машинаса ди тонк тязк.',
'importstart'                => 'Лопатне усксевихть...',
'import-revision-count'      => '$1 {{PLURAL:$1|илякстоптома|илякстоптомат}}',
'importnopages'              => 'Ашет лопат ускоманди.',
'importfailed'               => 'Ускомась колавсь: <nowiki>$1</nowiki>',
'importunknownsource'        => 'Аф содаф ускома лисьмоть сортоц',
'importcantopen'             => 'Аш кода панжемс ускома файлть',
'importbadinterwiki'         => 'Аф кондясти интервикинь сюлмафкссь',
'importnotext'               => 'Шава эли аш текст',
'importsuccess'              => 'Ускомась аделавсь!',
'importhistoryconflict'      => 'Туркс моли историянь илякстоптома сь (улема, тя лопась ускфоль инголе)',
'importnosources'            => 'Трансвикинь ускома лисьмот ашет ди историянь видеста тонгомась лоткафоль.',
'importnofile'               => 'Фкявок ускома файл изь тонгов.',
'importuploaderrorsize'      => 'Ускома файлть тонгомась изь лисев. Файлсь мярьгови тонгома кувалмода лама.',
'importuploaderrorpartial'   => 'Ускома файлонь тонгомась изь лисев. Аньцек файлть пакшец тонкфоль.',
'importuploaderrortemp'      => 'Ускома файлть тонгомась изь лисев. Пингонь паргоня изь мув.',
'import-parse-failure'       => 'XML ускома анализонь эльбятькссь',
'import-noarticle'           => 'Ашет лопат ускоманди!',
'import-nonewrevisions'      => 'Сембе илякстоптоматне ускфольхть сядынголе.',
'xml-error-string'           => '$1 $2-це киксса, палмань $3 ($4 байтт): $5',
'import-upload'              => 'Тонгомс XML информациесь',

# Import log
'importlogpage'                    => 'Сувафтомань лувома',
'importlogpagetext'                => 'Администрациеса лопань ускоматне петнемань историяснон мархта иля Викиста.',
'import-logentry-upload'           => 'ускф [[$1]] файлонь тонгомать вельде',
'import-logentry-upload-detail'    => '$1 {{PLURAL:$1|илякстоптома|илякстоптомат}}',
'import-logentry-interwiki'        => 'ётафтф Викитнень ёткса $1',
'import-logentry-interwiki-detail' => '$1 {{PLURAL:$1|илякстоптома|илякстоптомат}} $2-ста',

# Tooltip help for the actions
'tooltip-pt-userpage'             => 'Монь тиинь лопазе',
'tooltip-pt-anonuserpage'         => 'Тиить лопанц IP потмоса, конань эса тон петнесак кода',
'tooltip-pt-mytalk'               => 'Монь корхтама лопазе',
'tooltip-pt-anontalk'             => 'Корхнемась тя IP адресста тиф петнематнень колга',
'tooltip-pt-preferences'          => 'Монь латцемане',
'tooltip-pt-watchlist'            => 'Лопатне конатнень мельге тон ванат полафнематнень коряс',
'tooltip-pt-mycontris'            => 'Монь путкснень лувомась',
'tooltip-pt-login'                => 'Тяса ули кода сёрматфтомс аньцек тя аф эрявикс.',
'tooltip-pt-anonlogin'            => 'Тонь анайхть сувамс лопас, интай тя аф кошардомась.',
'tooltip-pt-logout'               => 'Лисемс',
'tooltip-ca-talk'                 => 'Лопапотмонь колга корхнема',
'tooltip-ca-edit'                 => 'Тя лопать петневи. Эняльттяма, нолдак тевс васень няфтема пуня лопать ванфтомада инголе.',
'tooltip-ca-addsection'           => 'Путт мяльполатксце тя корхнеманди.',
'tooltip-ca-viewsource'           => 'Тя лопась аралаф. Ули кода ваномс лисьмонц лангс.',
'tooltip-ca-history'              => 'Тя лопать ётай верзиенза.',
'tooltip-ca-protect'              => 'Аралак тя лопать',
'tooltip-ca-delete'               => 'Нардамс тя лопать',
'tooltip-ca-undelete'             => 'Мърдафтомс петнематне тифольхть тя лопаса сонь нардамадонза инголе',
'tooltip-ca-move'                 => 'Ётафтт тя лопать иля вастс',
'tooltip-ca-watch'                => 'Сувафтт тя лопать тонь мельгеваномазот',
'tooltip-ca-unwatch'              => 'Нардамс тя лопать тонь мельгеваномастот',
'tooltip-search'                  => 'Вешендемс {{SITENAME}}-ста',
'tooltip-search-go'               => 'Архт лопас тя лемть мархта кда сон ули',
'tooltip-search-fulltext'         => 'Вешендемс тя текссть лопава',
'tooltip-p-logo'                  => 'Пря лопа',
'tooltip-n-mainpage'              => 'Сувак Пря лопас',
'tooltip-n-portal'                => 'Проектть колга, мезьса лездомс, коста мумс мезь',
'tooltip-n-currentevents'         => 'Ванк мезе молихть тя пингста',
'tooltip-n-recentchanges'         => 'Улхкомбань Викиса полафнематнень лувомась.',
'tooltip-n-randompage'            => 'Макст кодама повсь лопа',
'tooltip-n-help'                  => 'Коста вешендемс.',
'tooltip-t-whatlinkshere'         => 'Сембе Викинь лопатне конат сюлмафт тя лопать мархта',
'tooltip-t-recentchangeslinked'   => 'Улхкомбань полафнемат лопатнень эса сюлмафт тя лопать мархта',
'tooltip-feed-rss'                => 'RSS лезкс тя лопанди',
'tooltip-feed-atom'               => 'Atom лезкс тя лопанди',
'tooltip-t-contributions'         => 'Няфтемс тя тиить путксонзон лувомась',
'tooltip-t-emailuser'             => 'Кучемс сёрма тя тиинди',
'tooltip-t-upload'                => 'Тонгомс файлхт',
'tooltip-t-specialpages'          => 'Сембе башка лопатнень лувомась',
'tooltip-t-print'                 => 'Тя лопать печатлави верзиец',
'tooltip-t-permalink'             => 'Ялань сюлмафкссь тя лопать верзиянзонды',
'tooltip-ca-nstab-main'           => 'Няфтемс потмонц лопац',
'tooltip-ca-nstab-user'           => 'Няфтемс тиить лопанц',
'tooltip-ca-nstab-media'          => 'Няфтемс медиать лопанц',
'tooltip-ca-nstab-special'        => 'Тя башка тевонь лопась, тондейть аш кода петнемс лопать',
'tooltip-ca-nstab-project'        => 'Няфтемс проектть лопанц',
'tooltip-ca-nstab-image'          => 'Ваномс файлонь лопать',
'tooltip-ca-nstab-mediawiki'      => 'Няфтемс системонь пачфтемать',
'tooltip-ca-nstab-template'       => 'Няфтемс кепотьксть',
'tooltip-ca-nstab-help'           => 'Няфтемс лезкс лопать',
'tooltip-ca-nstab-category'       => 'Ваномс категориень лопать',
'tooltip-minoredit'               => 'Тяштькстт тя кода ёмланя видептема',
'tooltip-save'                    => 'Ванфтомс мезе полафтыть',
'tooltip-preview'                 => 'Ванк тонь полафнематнень лангс васень няфтема вальмаса, эняльттяма нолдак тянь тевс ванфтомада инголе!',
'tooltip-diff'                    => 'Няфтемс мезе полафтыть текстса.',
'tooltip-compareselectedversions' => 'Ванк мезьса явовихть ся лопать кафта верзиенза.',
'tooltip-watch'                   => 'Сувафтомс тя лопать тонь мельгеваномазот',
'tooltip-recreate'                => 'Мърдафтомс лопать сонь нардаманц лангс аф ваномок',
'tooltip-upload'                  => 'Ушедомс тонгомать',

# Metadata
'nodublincore'      => 'Dublin Core RDF метадатась аф нолдави тевс тя серверонди.',
'nocreativecommons' => 'Creative Commons RDF информациесь аф нолдави тевс тя серверонди.',
'notacceptable'     => 'Вики серверонди аш кода максомс информациесь стама форматса конань эса тонь клиентти ули кода сонь морафтомс.',

# Attribution
'anonymous'        => '{{SITENAME}}-нь лемфтома тии(хть)',
'siteuser'         => '{{SITENAME}}-нь тиись $1',
'lastmodifiedatby' => 'Тя лопать мекольцеда петнезь $3 $2, $1', # $1 date, $2 time, $3 user
'othercontribs'    => 'Тиф $1-нь покаманц коряс.',
'others'           => 'илят',
'siteusers'        => '{{SITENAME}}-нь тии(хть) $1',
'creditspage'      => 'Лопань полайаманза',
'nocredits'        => 'Аш полайамань информациесь тя лопанди.',

# Spam protection
'spamprotectiontitle' => 'Луднада араламань педямась',
'spamprotectiontext'  => 'Лопать тонь мялецоль ванфтомс пякстафоль луднада араламань педямаса.
Тя, улема, лиссь ушеширень равжа лувомать лопань сюлмафксонц эзда.',
'spamprotectionmatch' => 'Тя текстть эзда нолдавсь минек луднада араламань педяманьке: $1',
'spambot_username'    => 'MediaWiki-ть луднада аруяфтомась',
'spam_reverting'      => 'Мърдафни мекольце $1-ти сюлмафкстома верзиес',
'spam_blanking'       => 'Сембе илякстоптомат $1-ти сюлмафкснень мархта, лотксема',

# Info page
'infosubtitle'   => 'Лопать информациесь',
'numedits'       => 'Петнематнень лувксоц (лопа): $1',
'numtalkedits'   => 'Петнематнень лувксоц (корхнема лопа): $1',
'numwatchers'    => 'Мельге ваныхнень лувксоц: $1',
'numauthors'     => 'Содаф лопань тиихнень лувксоц (лопа): $1',
'numtalkauthors' => 'Содаф лопань тиихнень лувксоц (корхнема лопа): $1',

# Math options
'mw_math_png'    => 'Фалу ладямс PNG',
'mw_math_simple' => 'HTML кда пяк тёждя илякс PNG',
'mw_math_html'   => 'HTML кда ули кода илякс PNG',
'mw_math_source' => 'Катк тянь кода TeX (текстонь вальманди)',
'mw_math_modern' => 'Пароль тяниень пингонь содама машинатнень вальмаснонды',
'mw_math_mathml' => 'MathML коса ули кода (экспериментокс)',

# Patrolling
'markaspatrolleddiff'                 => 'Тяштемс кода патрулень варжаф',
'markaspatrolledtext'                 => 'Тяштемс тя лопать кода патрулень варжаф',
'markedaspatrolled'                   => 'Тяштьф кода патрулень варжаф',
'markedaspatrolledtext'               => 'Кочкаф илякстоптомась тяштьфоль кода патрулень варжаф.',
'rcpatroldisabled'                    => 'Улхкомбань полафнематненди патрульсь тевс аф нолдави',
'rcpatroldisabledtext'                => 'Улхкомбань полафнематнень патрульть функциесь тяни тевс аф нолдави.',
'markedaspatrollederror'              => 'Аш кода тяштемс кода патрулень варжаф',
'markedaspatrollederrortext'          => 'Тондейть эряви васенда кочкамс илякстоптомась патрулень варжафксокс тяштеманди.',
'markedaspatrollederror-noautopatrol' => 'Тондейть аф мярьгови тяштемс эсь полфнемацень кода патрулень варжафт.',

# Patrol log
'patrol-log-page'   => 'Патрулень лувомась',
'patrol-log-header' => 'Патруль ала верзиетнень лувомась.',
'patrol-log-line'   => 'тяштьфольхть $2-ста $1 патрулень варжафксокс $3',
'patrol-log-auto'   => '(эсь тиеви)',

# Image deletion
'deletedrevision'                 => 'Нардаф сире илякстоптома $1',
'filedeleteerror-short'           => 'Лиссь эльбятькс нардамста файл: $1',
'filedeleteerror-long'            => 'Лиссть эльбятькст нардамста файл:

$1',
'filedelete-missing'              => 'Файлть "$1" аш кода нардамс сяс мес сонь аш.',
'filedelete-old-unregistered'     => 'Кочкаф файлть илякстоптома "$1" датабазаса аш.',
'filedelete-current-unregistered' => 'Кочкаф файлсь "$1" датабазаса аш.',
'filedelete-archive-read-only'    => 'Аркивонь директориесь "$1" аф сёрмадови web-серверса.',

# Browsing diffs
'previousdiff' => 'Сядынгольдень верзиец',
'nextdiff'     => 'Од верзиец →',

# Media information
'mediawarning'         => "'''Инголе кардама''': Тя файлть, улема, пелькс код, сонь нолдаманза  тон коласак тонь системацень.<hr />",
'imagemaxsize'         => 'Оторонзамс архтофкснень лувксонц файл информациень лопава:',
'thumbsize'            => 'Миниатюронь кувалмоц:',
'widthheightpage'      => '$1×$2, $3 {{PLURAL:$3|лопа|лопат}}',
'file-info'            => '(файлонь кувалмоц: $1, MIME сортоц: $2)',
'file-info-size'       => '($1 × $2 пикселхть, файлть кувалмоц: $3, MIME сорт: $4)',
'file-nohires'         => '<small>Сяда лама анцяйнятнень мархта архтофкс аш.</small>',
'svg-long-desc'        => '(SVG файл, $1 × $2 пиксельхть, file файлть кувалмоц: $3)',
'show-big-image'       => 'Няфтемс пяшксе кувалмонц',
'show-big-image-thumb' => '<small>Сядынголе ваномать кувалмоц: $1 × $2 пикселхть</small>',

# Special:NewImages
'newimages'             => 'Од файлхнень пърдафкс',
'imagelisttext'         => "Ала'''$1''' {{PLURAL:$1|файлонь|файлхнень}} лувомась кочкаф $2.",
'newimages-summary'     => 'Тя башка тевонь лопась няфнесыне мекольце тонкф файлхт.',
'showhidebots'          => '($1 робот програпт)',
'noimages'              => 'Мезеге аш.',
'ilsubmit'              => 'Вешендемс',
'bydate'                => 'ши коряс',
'sp-newimages-showfrom' => 'Няфтемс од файлхт $1-ста,  $2 ушедомс',

# Bad image list
'bad_image_list' => 'Форматсь вага стамсь:

Аньцек лувк пакшкянза (киксне, конат ушедовихть * тяшкста) кармайхть лувовома. Васенце киксонь сюлмафксонцты эряви улемс аф кондясти архтофксонь сюлмафксокс.
Эрь кона сай  сюлмафксне тя киксса кармайхть лувовома кода синнеда башкат, илякс мярьгомс кода лопат коза ули кода архтофкснень сувафнемс.',

# Metadata
'metadata'          => 'Метадата',
'metadata-help'     => 'Тя файлса ащи информациень полаткс, улема, цифрань камерста эли сканерста кона тон нолдайхть тевс архтофксть латцеманкса. Полафнендярять тя архтофксть васенце верзиенц, кодамога анцяйнятне, улема, кармайхть аф няевикс мекольцень няйфсонза.',
'metadata-expand'   => 'Няфтемс сембе анцяйнянза',
'metadata-collapse' => 'Кяшемс келептьф анцяйнятнень няфтемась',
'metadata-fields'   => 'EXIF метадатань паксятне конат лувфт тяса ала кармайхть няфтевома архтофксонь лопаса мъзярда метадатань лувома пурдай. Илят улихть кяшфт мъзярс илякс изь мярьгов.
* make
* model
* datetimeoriginal
* exposuretime
* fnumber
* focallength', # Do not translate list items

# EXIF tags
'exif-imagewidth'                  => 'Келец',
'exif-imagelength'                 => 'Серец',
'exif-bitspersample'               => 'Битт фкя компонентс',
'exif-compression'                 => 'Компрезиень арафтомац',
'exif-photometricinterpretation'   => 'Пикселень композициесна',
'exif-orientation'                 => 'Ориентацие',
'exif-samplesperpixel'             => 'Компонентонь лувкссна',
'exif-planarconfiguration'         => 'Информациень латцемась',
'exif-ycbcrsubsampling'            => 'Y-ста C-с латцемань арафтомась',
'exif-ycbcrpositioning'            => 'Y ди C арафтомасна',
'exif-xresolution'                 => 'Горизонталень сидец',
'exif-yresolution'                 => 'Вертикалень сидец',
'exif-resolutionunit'              => 'X ди Y сидеснон ункстама тяшксне',
'exif-stripoffsets'                => 'Архтома информациеть вастоц',
'exif-rowsperstrip'                => 'Курнятнень лувкссна фкя киксс',
'exif-stripbytecounts'             => 'Байтт фкя компрезияфтф китьксс',
'exif-jpeginterchangeformat'       => 'JPEG SOI-нди офсетсь',
'exif-jpeginterchangeformatlength' => 'JPEG информациень байтт',
'exif-transferfunction'            => 'Ётафтома функциесь',
'exif-whitepoint'                  => 'Акша коряс ункстамась',
'exif-primarychromaticities'       => 'Васень тюснень ункстамась',
'exif-ycbcrcoefficients'           => 'Тюс ёткнень илякстомома кепотьксть коефициентоц',
'exif-referenceblackwhite'         => 'Кафта акша ди равжа ваксс путови питнесна',
'exif-datetime'                    => 'Файлсь полафнесыне шись ди пингсь',
'exif-imagedescription'            => 'Архтофксть коняксоц',
'exif-make'                        => 'Камерань нолдайсь',
'exif-model'                       => 'Камерань модельсь',
'exif-software'                    => 'Тевс нолдаф програпне',
'exif-artist'                      => 'Арсись',
'exif-copyright'                   => 'Копийама видексонь кирдись',
'exif-exifversion'                 => 'Exif верзиесь',
'exif-flashpixversion'             => 'Нежедеви Flashpix верзиесь',
'exif-colorspace'                  => 'Тюсонь ёткась',
'exif-componentsconfiguration'     => 'Эрь компонентонь асуц',
'exif-compressedbitsperpixel'      => 'Архтофксонь компрезийамась',
'exif-pixelydimension'             => 'Кондясти архтофксонь келец',
'exif-pixelxdimension'             => 'Кондясти архтофксонь серец',
'exif-makernote'                   => 'Нолдайть тяштьксонза',
'exif-usercomment'                 => 'Тиить тяштьксонза',
'exif-relatedsoundfile'            => 'Сотф аудио файлсь',
'exif-datetimeoriginal'            => 'Шинь тиевомать шись ди пингсь',
'exif-datetimedigitized'           => 'Цифрайафтомань шись ди пингсь',
'exif-subsectime'                  => 'Ши ди пинге полафнема фавонь (секундонь) пакшкатне',
'exif-subsectimeoriginal'          => 'Оригиналонь ши ди пинге фавонь (секундонь) пакшкатне',
'exif-subsectimedigitized'         => 'Цифраяфтомань ши ди пинге фавонь (секундонь) пакшкатне',
'exif-exposuretime'                => 'Экспозициень пингсь',
'exif-exposuretime-format'         => '$1 сек ($2)',
'exif-fnumber'                     => 'F номерсь',
'exif-exposureprogram'             => 'Экспозициень програмсь',
'exif-spectralsensitivity'         => 'Спектрань марьсемась',
'exif-isospeedratings'             => 'ISO куроксшинь пялькснемась',
'exif-oecf'                        => 'Оптоэлектрононь конверзиеть факторсь',
'exif-shutterspeedvalue'           => 'Эрьхтема таватксонь куроксшись',
'exif-aperturevalue'               => 'Апертурсь',
'exif-brightnessvalue'             => 'Валдоксши',
'exif-exposurebiasvalue'           => 'Экспозициень сортсь',
'exif-maxaperturevalue'            => 'Максимум апертурась',
'exif-subjectdistance'             => 'Объекста ёткась',
'exif-meteringmode'                => 'Уекстамань режимсь',
'exif-lightsource'                 => 'Валдань лисьмоц',
'exif-flash'                       => 'Кьфчадефкс',
'exif-focallength'                 => 'Линзатнень фокусснон ётканза',
'exif-subjectarea'                 => 'Субъектонь вастсь',
'exif-flashenergy'                 => 'Кьфчядефксонь эрьгац',
'exif-spatialfrequencyresponse'    => 'Ушепотма сидешинь карактеристиксь',
'exif-focalplanexresolution'       => 'Фокусонь ён X сидец',
'exif-focalplaneyresolution'       => 'Фокусонь ён Y сидец',
'exif-focalplaneresolutionunit'    => 'Фокусонь ён сиденц ункстамась',
'exif-subjectlocation'             => 'Объектть вастоц',
'exif-exposureindex'               => 'Экспозициень индекссь',
'exif-sensingmethod'               => 'Марьсема методсь',
'exif-filesource'                  => 'Файлонь лисьмоц',
'exif-scenetype'                   => 'Эрьхтефксонь няйфсь',
'exif-cfapattern'                  => 'CFA шаблон',
'exif-customrendered'              => 'Кърдань эрьхтефксонь латцемась',
'exif-exposuremode'                => 'Экспозициень режимсь',
'exif-whitebalance'                => 'Акша тюсонь балансоц',
'exif-digitalzoomratio'            => 'Цифрань ламолгафтома ункснемась',
'exif-focallengthin35mmfilm'       => 'Фокусонь кувалмоц 35 мм фильмса',
'exif-scenecapturetype'            => 'Эрьхтефксонь тиевомац',
'exif-gaincontrol'                 => 'Эрьхтемань няевомась',
'exif-contrast'                    => 'Контрастсь',
'exif-saturation'                  => 'Тустолмась',
'exif-sharpness'                   => 'Оржаксшись',
'exif-devicesettingdescription'    => 'Камера арафнематнень колга  тяштемат',
'exif-subjectdistancerange'        => 'Объектста ёткась',
'exif-imageuniqueid'               => 'Эрьхтефксонь эсь кодоц',
'exif-gpsversionid'                => 'GPS кодонь верзиесь',
'exif-gpslatituderef'              => 'Кельмеширень эли лямбеширень келец',
'exif-gpslatitude'                 => 'Келец',
'exif-gpslongituderef'             => 'Шистямаширень эли шивалгомширень кувалмоц',
'exif-gpslongitude'                => 'Кувалмоц',
'exif-gpsaltituderef'              => 'Серенц сюлмафксоц',
'exif-gpsaltitude'                 => 'Серец',
'exif-gpstimestamp'                => 'GPS пинге (атомонь ойхть)',
'exif-gpssatellites'               => 'Спутникне нолнеф тевс ункстаманди',
'exif-gpsstatus'                   => 'Ресиверть статуссь',
'exif-gpsmeasuremode'              => 'Ункстамань режимсь',
'exif-gpsdop'                      => 'Ункстамань оржашись',
'exif-gpsspeedref'                 => 'Куроксшинь ункстамась',
'exif-gpsspeed'                    => 'GPS ресиверть куроксшись',
'exif-gpstrackref'                 => 'Шаштома ёнть ункснемась',
'exif-gpstrack'                    => 'Шаштомань ёнць',
'exif-gpsimgdirectionref'          => 'Лезкс эрьхтефксонь ёнонзоды',
'exif-gpsimgdirection'             => 'Эрьхтефксонь ёнсь',
'exif-gpsmapdatum'                 => 'Геодезиень информациесь кундаф тевс',
'exif-gpsdestlatituderef'          => 'Вастонь келенц ункснеманц лезкссь',
'exif-gpsdestlatitude'             => 'Келенц ёноц',
'exif-gpsdestlongituderef'         => 'Вастонь кувалмонц ункснема лезкссь',
'exif-gpsdestlongitude'            => 'Ёнонь келец',
'exif-gpsdestbearingref'           => 'Ёттнень ункстама лезкссь',
'exif-gpsdestbearing'              => 'Ёттнень ункстама',
'exif-gpsdestdistanceref'          => 'Ёнста ёткань ункстама лезкссь',
'exif-gpsdestdistance'             => 'Вастста ёткась',
'exif-gpsprocessingmethod'         => 'GPS ладяма методонь лемоц',
'exif-gpsareainformation'          => 'GPS районть лемоц',
'exif-gpsdatestamp'                => 'GPS ши',
'exif-gpsdifferential'             => 'GPS диференциень петнема',

# EXIF attributes
'exif-compression-1' => 'Аф компрезияф',

'exif-unknowndate' => 'Аф содаф шись',

'exif-orientation-1' => 'Апак полафтт', # 0th row: top; 0th column: left
'exif-orientation-2' => 'Шарфтф горизонталь коряс', # 0th row: top; 0th column: right
'exif-orientation-3' => 'Шарфтф 180° градусс', # 0th row: bottom; 0th column: right
'exif-orientation-4' => 'Шарфтф вертикаль коряс', # 0th row: bottom; 0th column: left
'exif-orientation-5' => 'Шарфтф 90° градусс ойхть каршес ди вертикаль коряс', # 0th row: left; 0th column: top
'exif-orientation-6' => 'Шарфтф 90° градусс ойхть коряс', # 0th row: right; 0th column: top
'exif-orientation-7' => 'Шарфтф 90° градусс ойхть коряс ди  вертикаль коряс', # 0th row: right; 0th column: bottom
'exif-orientation-8' => 'Шарфтф 90° градусс ойхть каршес', # 0th row: left; 0th column: bottom

'exif-planarconfiguration-1' => 'нюрьхкяня форматсь',
'exif-planarconfiguration-2' => 'лапш форматсь',

'exif-componentsconfiguration-0' => 'аш',

'exif-exposureprogram-0' => 'Апак содак',
'exif-exposureprogram-1' => 'Кядьвельде',
'exif-exposureprogram-2' => 'Кърдань програм',
'exif-exposureprogram-3' => 'Диафрагмань приоретсь',
'exif-exposureprogram-4' => 'Кирдемань приоритетсь',
'exif-exposureprogram-5' => 'Шкам програм (эряви оржашинь кърхкалмать коряс)',
'exif-exposureprogram-6' => 'Спортонь програм (сяда ёмла кирдемась)',
'exif-exposureprogram-7' => 'Портретонь режимсь (мала эрьхтеманди фокусфтома фон мархта)',
'exif-exposureprogram-8' => 'Ландшафтонь режимсь (ландшафтонь эрьхтеманди ди фон фокус мархта)',

'exif-subjectdistance-value' => '$1 метрат',

'exif-meteringmode-0'   => 'Аф содаф',
'exif-meteringmode-1'   => 'Кучкастонь',
'exif-meteringmode-2'   => 'Кучкаста ункстаф',
'exif-meteringmode-3'   => 'Путьку',
'exif-meteringmode-4'   => 'Лама путьку',
'exif-meteringmode-5'   => 'Шаблон',
'exif-meteringmode-6'   => 'Пакшень-пакш',
'exif-meteringmode-255' => 'Иля',

'exif-lightsource-0'   => 'Аф содаф',
'exif-lightsource-1'   => 'Шивалда',
'exif-lightsource-2'   => 'Флуоресцент',
'exif-lightsource-3'   => 'Толвалда (электрашинь валда)',
'exif-lightsource-4'   => 'Кьфчядефкс',
'exif-lightsource-9'   => 'Мани',
'exif-lightsource-10'  => 'Сюнерькс',
'exif-lightsource-11'  => 'Эше',
'exif-lightsource-12'  => 'Шивалдонь флуоресцент (D 5700 – 7100K)',
'exif-lightsource-13'  => 'Шинь акша флуоресцент (N 4600 – 5400K)',
'exif-lightsource-14'  => 'Кельме акша флуоресцент (W 3900 – 4500K)',
'exif-lightsource-15'  => 'Акша флуресцент валда (WW 3200 – 3700K)',
'exif-lightsource-17'  => 'Стандарт валда A',
'exif-lightsource-18'  => 'Стандарт валда B',
'exif-lightsource-19'  => 'Стандарт валда C',
'exif-lightsource-24'  => 'студиянь толвалда ISO',
'exif-lightsource-255' => 'Иля валдонь лисьма',

'exif-focalplaneresolutionunit-2' => 'вакспет',

'exif-sensingmethod-1' => 'Апак няфтть',
'exif-sensingmethod-2' => 'Фкя-пиндол тюсонь ётка сенсор',
'exif-sensingmethod-3' => 'Кафта-пиндол тюсонь ётка сенсор',
'exif-sensingmethod-4' => 'Колма-пиндол тюсонь ётка сенсор',
'exif-sensingmethod-5' => 'Тюс латцема ётка сенсор',
'exif-sensingmethod-7' => 'Колма-линиянь сенсор',
'exif-sensingmethod-8' => 'Тюс латцема линиянь сенсор',

'exif-scenetype-1' => 'Виде эрьхтема вельде тиф архтофкссь',

'exif-customrendered-0' => 'Нормань процесс',
'exif-customrendered-1' => 'Кърдань процесс',

'exif-exposuremode-0' => 'Эсь тиеви экспозициесь',
'exif-exposuremode-1' => 'Кядьвельдень экспозициесь',
'exif-exposuremode-2' => 'Эсь тиеви кадрыяфтома',

'exif-whitebalance-0' => 'Эсь тиеви акша тюсонь баланс',
'exif-whitebalance-1' => 'Кядьвельдень акша тюсонь баланс',

'exif-scenecapturetype-0' => 'Стандарт',
'exif-scenecapturetype-1' => 'Ландшафт',
'exif-scenecapturetype-2' => 'Портрет',
'exif-scenecapturetype-3' => 'Вень картина',

'exif-gaincontrol-0' => 'Фкявок аш',
'exif-gaincontrol-1' => 'Ёмла ламолгафтома',
'exif-gaincontrol-2' => 'Оцю ламолгафтома',
'exif-gaincontrol-3' => 'Аф оцю ёмлалгафтома',
'exif-gaincontrol-4' => 'Оцю ёмлалгафтома',

'exif-contrast-0' => 'Кърдань',
'exif-contrast-1' => 'Ляпе',
'exif-contrast-2' => 'Калгода',

'exif-saturation-0' => 'Кърдань',
'exif-saturation-1' => 'Лафча тустолма',
'exif-saturation-2' => 'Вишке тустолма',

'exif-sharpness-0' => 'Кърдань',
'exif-sharpness-1' => 'Ляпе',
'exif-sharpness-2' => 'Калгода',

'exif-subjectdistancerange-0' => 'Аф содаф',
'exif-subjectdistancerange-1' => 'Макро кодсь',
'exif-subjectdistancerange-2' => 'Сёлгомс няфтемать',
'exif-subjectdistancerange-3' => 'Ичкоздень няфтемась',

# Pseudotags used for GPSLatitudeRef and GPSDestLatitudeRef
'exif-gpslatitude-n' => 'Кельмеширень келесь',
'exif-gpslatitude-s' => 'Лямбеширень келесь',

# Pseudotags used for GPSLongitudeRef and GPSDestLongitudeRef
'exif-gpslongitude-e' => 'Шистямаширень кувалмась',
'exif-gpslongitude-w' => 'Шивалгомширень кувалмась',

'exif-gpsstatus-a' => 'Ункстамац моли',
'exif-gpsstatus-v' => 'Ункстамань фкя-фкянь мархта йаксема',

'exif-gpsmeasuremode-2' => '2-кърдань ункстама',
'exif-gpsmeasuremode-3' => '3-кърдань ункстама',

# Pseudotags used for GPSSpeedRef and GPSDestDistanceRef
'exif-gpsspeed-k' => 'Вайгяльбет ойс',
'exif-gpsspeed-m' => 'Милят ойс',
'exif-gpsspeed-n' => 'Сюлмот',

# Pseudotags used for GPSTrackRef, GPSImgDirectionRef and GPSDestBearingRef
'exif-gpsdirection-t' => 'Виде ён',
'exif-gpsdirection-m' => 'Магнитонь ён',

# External editor support
'edit-externally'      => 'Петнемс тя файлть ушеширень програмонь вельде',
'edit-externally-help' => 'Ванк [http://www.mediawiki.org/wiki/Manual:External_editors арафнемань вятемовал] сяда лама содаманкса.',

# 'all' in various places, this might be different for inflected languages
'recentchangesall' => 'сембе',
'imagelistall'     => 'сембе',
'watchlistall2'    => 'сембе',
'namespacesall'    => 'сембе',
'monthsall'        => 'сембе',

# E-mail address confirmation
'confirmemail'             => 'Кемостамс электрононь адресть',
'confirmemail_noemail'     => 'Тонь аш кондясти электрононь адрес тяштьф тонь [[Special:Preferences|тиить арафнематнень]] эса.',
'confirmemail_text'        => '{{SITENAME}} веши тонь электрононь адресцень кемокстамац электрононь адресть арафнематнень тевс нолдамада инголе.
Люпштак пунять ала кемокстамань сёрмать тонь электрононь адресозот кучеманди.
Сёрмаса ули сюлмафкссь кодть мархта;
нолдак сюлмафкстьтонь содама машинацень вальмасонза тонь электрононь адресцень кемокстаманди.',
'confirmemail_pending'     => '<div class="error">Кемокстамань кодсь кучфоль ни тонь электрононь адресозот;
кда тон тиеть тон сёрматфтомацень улхкомба ди тондейть, улема, эряви учемс мъзярошка минутт мъзярс сон латцеви тага фкя весть од кодть аф вешезь.</div>',
'confirmemail_send'        => 'Кучемс кемокстамань кодсь',
'confirmemail_sent'        => 'Кемокстамань сёрмась кучф.',
'confirmemail_oncreate'    => 'Кемокстамань кодсь кучфоль тон электрононь адресот.
Тя кодсь аф эрявксты суваманди, интай тондейть эряви сонь путомс эрь кодама электрононь адресть сотф Викить арафнематнень тевс нолдамада инголе.',
'confirmemail_sendfailed'  => '{{SITENAME}}-ти аш кода кучемс кемокстамань сёрмацень.
Варжак, шятьта адрессот ульсть аф кондясти тяшксне.

Сермась мърдась: $1',
'confirmemail_invalid'     => 'Аф кондясти кемокстамань кодсь.
Кодсь, улема, сирелгодсь.',
'confirmemail_needlogin'   => 'Тондейть эряви $1 кемокстамс тонь электрононь адресце.',
'confirmemail_success'     => 'Тонь электрононь адресце кемокстафоль.
Тондейть тяни ули кода сувамс Викис.',
'confirmemail_loggedin'    => 'Тонь электрононь адресце тяни кемокстаф.',
'confirmemail_error'       => 'Мезеге мольсь аф лац тонь кемокстаманц ванфтомать ёткста.',
'confirmemail_subject'     => '{{SITENAME}} электрононь адресть кемокстамась',
'confirmemail_body'        => 'Кати-кие, улема, тон $1 IP адресста ушедсь сёрматфтомась "$2" тя электрононь адресть мархта {{SITENAME}}-са.

Кемокстамс ся сёрматфтомась афкукс тоннеть ди нолдамс тевс электрононь адресть {{SITENAME}}-са эряви панжемс тя сюлмафксть тонь содама машинацень вальмасонза:

$3

Кда тон *ашеть* ушеда сёрматфтомать, кундамс тя сюлмафксс электрононь адресть кемокстаманц лоткаманди:

$5

Тя кемокстамань кодсь сирелгоды $4.',
'confirmemail_invalidated' => 'Электрононь адресть кемокстамась валхтозь',
'invalidateemail'          => 'Валхтомс электрононь кемокстамать',

# Scary transclusion
'scarytranscludedisabled' => '[Interwiki transcluding лоткаф]',
'scarytranscludefailed'   => '[Шаблон латцема $1-нди изь лисев]',
'scarytranscludetoolong'  => '[URL вельф кувака]',

# Trackbacks
'trackbackbox'      => '<div id="mw_trackbacks">Тя лопанди меки кеворемат:<br />
$1
</div>',
'trackbackremove'   => ' ([$1 Нардафкс])',
'trackbacklink'     => 'Меки кеворема',
'trackbackdeleteok' => 'Меки кеворемать нардамась мольсь лац.',

# Delete conflict
'deletedwhileediting' => "'''Инголе кардама''': Тя лопась нардафоль ёт тон кармать петнеманза!",
'confirmrecreate'     => "Тиись [[User:$1|$1]] ([[User talk:$1|корхнема]]) нардазе тя лопать мъзярда тон кармать петнемонза тя туфталонкса:
: ''$2''
Кемокстак тонь афкукс мяльце тя лопать мърдафтомс.",
'recreate'            => 'Тиемс одукс',

# HTML dump
'redirectingto' => 'Ётафневи [[:$1]]-с...',

# action=purge
'confirm_purge'        => 'Нардамс тя лопать копияфтома пингонь файлснон?

$1',
'confirm_purge_button' => 'ОК',

# AJAX search
'searchcontaining' => "Вешендемс лопатне конатнень ули ''$1''.",
'searchnamed'      => "Вешендемс лопат ''$1'' лемса.",
'articletitles'    => "Лопатне ''$1''-ста ушедомс",
'hideresults'      => 'Кяшемс муфкст',
'useajaxsearch'    => 'Нолдак тевс AJAX вешендема',

# Multipage image navigation
'imgmultipageprev' => '← сядынгольдень лопась',
'imgmultipagenext' => 'сай лопась →',
'imgmultigo'       => 'Аре!',
'imgmultigoto'     => 'Архт $1 лопас',

# Table pager
'ascending_abbrev'         => 'касом.',
'descending_abbrev'        => 'тум.',
'table_pager_next'         => 'Сай лопа',
'table_pager_prev'         => 'Сядынгольдень лопа',
'table_pager_first'        => 'Васенце лопа',
'table_pager_last'         => 'Мекольце лопа',
'table_pager_limit'        => 'Няфтемс $1 тефт фкя лопас',
'table_pager_limit_submit' => 'Аре',
'table_pager_empty'        => 'Муфкст ашет',

# Auto-summaries
'autosumm-blank'   => 'Нардакшневи сембе лопаста',
'autosumm-replace' => "Нардакшневи лопать '$1' мархта",
'autoredircomment' => 'Ётафневи [[$1]]с',
'autosumm-new'     => 'Од лопа: $1',

# Live preview
'livepreview-loading' => 'Аноклакшни…',
'livepreview-ready'   => 'Аноклакшни… Анок!',
'livepreview-failed'  => 'Эряк васень няфтемась колавсь! Тяряфтт кундамс кърдань васень няфтемас.',
'livepreview-error'   => 'Аш кода сотомс: $1 "$2" мархта. Тяряфтт кундамс кърдань васень няфтемас.',

# Friendlier slave lag warnings
'lag-warn-normal' => 'Полафнематне $1 {{PLURAL:$1|фавда|фавда}} од аш кода няфтемс лувомаса.',
'lag-warn-high'   => 'Серверонь вельф стака яксеманкса $1 {{PLURAL:$1|фавда|фавда}} од полафнематне аш кода няфтемс тя лувомаса.',

# Watchlist editor
'watchlistedit-numitems'       => 'Тонь мельгеваномазост {{PLURAL:$1|1 конякс|$1 конякст}} корхнема лопатнень башка.',
'watchlistedit-noitems'        => 'Тонь мельгеваномазост конякст ашет.',
'watchlistedit-normal-title'   => 'Петнемс мельгеваномать',
'watchlistedit-normal-legend'  => 'Нардамс конякст мельгеваномаста',
'watchlistedit-normal-explain' => 'Тонь мельгеваномаса коняксне няфтьфт ала.
Коняксонь нардаманди, путт тяште кудняс сонь ваксса ди люпштак Нардамс конякст.
Тондейть ули кода [[Special:Watchlist/raw|петнемс ише лувомать]].',
'watchlistedit-normal-submit'  => 'Нардамс коняксне',
'watchlistedit-normal-done'    => '{{PLURAL:$1|1 нардаф|$1 нардафт}} тонь мельгеваномастот:',
'watchlistedit-raw-title'      => 'Петнемс ише мельгеваномать',
'watchlistedit-raw-legend'     => 'Петнемс ише мельгеваномать',
'watchlistedit-raw-explain'    => 'Коняксне тонь мельгеваномастот няфтьфт ала, синь улихть кода петнемс лувомас поладомать эли лувомаста нардамать вельде;
фкя конякс киксс.
Аделамда меле люпштак Одонзамс Мельгеваномать.
Тондейть тага ули кода  [[Special:Watchlist/edit|кунцемс кърдань петнема лезксть]].',
'watchlistedit-raw-titles'     => 'Конякст:',
'watchlistedit-raw-submit'     => 'Одонзамс мельгеваномать',
'watchlistedit-raw-done'       => 'Тонь мельгованомацень одонзафоль.',
'watchlistedit-raw-added'      => '{{PLURAL:$1|1 конякс полатф|$1 конякст полатфт}}:',
'watchlistedit-raw-removed'    => '{{PLURAL:$1|1 конякс нардаф|$1 конякст нардафт}}:',

# Watchlist editing tools
'watchlisttools-view' => 'Няфтемс полафнематне лувомастонь лопапотмова',
'watchlisttools-edit' => 'Няфтемс эди петнемс мельгеваномать',
'watchlisttools-raw'  => 'Петнемс казяма мельгеваномать',

# Core parser functions
'unknown_extension_tag' => 'Аф содаф келептема тяштькссь "$1"',

# Special:Version
'version'                          => 'MediaWiki-ть верзиец', # Not used as normal message but as header for the special page itself
'version-extensions'               => 'Нолдаф тевс келепнематне',
'version-specialpages'             => 'Башка тевонь лопат',
'version-parserhooks'              => 'Синтакс анализаторонь кярьмодихне',
'version-variables'                => 'Пингоннет',
'version-other'                    => 'Иля',
'version-mediahandlers'            => 'Медиа файлхнень ладямат',
'version-hooks'                    => 'Кярьмодихне',
'version-extension-functions'      => 'Келептема функциенза',
'version-parser-extensiontags'     => 'Анализаторонь келептема кодонза',
'version-parser-function-hooks'    => 'Синтаксонь анализаторть функциензон кярьмодихне',
'version-skin-extension-functions' => 'Темонь келептема функциесна',
'version-hook-name'                => 'Кярьмодинь лемоц',
'version-hook-subscribedby'        => 'Сёрматфтсь',
'version-version'                  => 'Верзие',
'version-license'                  => 'Лицензие',
'version-software'                 => 'Нолдаф програпне',
'version-software-product'         => 'Нолдафкс',
'version-software-version'         => 'Верзие',

# Special:FilePath
'filepath'         => 'Файлти ян',
'filepath-page'    => 'Файл:',
'filepath-submit'  => 'Ян',
'filepath-summary' => 'Тя башка тевонь лопась няфнесы сембе янць файлти.
Архтофксне няфневихть сембе синь кувалмосост, иля файлонь сортсна нолдавихть видеста програпнень вельде конат сотфт мархтост.

Путт файллемть "{{ns:image}}:" валынгольксфтома',

# Special:FileDuplicateSearch
'fileduplicatesearch'          => 'Вешендемс кафонзаф файлхне',
'fileduplicatesearch-summary'  => 'Вешендемс кафонзаф файлхнень хэш-кодонь лувкс коряс.

Сёрматт файллем "{{ns:image}}:" валынгольксфтома.',
'fileduplicatesearch-legend'   => 'Вешендемс кафонзафкс',
'fileduplicatesearch-filename' => 'Файллем:',
'fileduplicatesearch-submit'   => 'Вешендемс',
'fileduplicatesearch-info'     => '$1 × $2 пиксель<br />Файл кувалмоц: $3<br />MIME сорт: $4',
'fileduplicatesearch-result-1' => 'Файлть "$1" ашет тяконь кафонзамонза.',
'fileduplicatesearch-result-n' => 'Файлть "$1" {{PLURAL:$2|1 тяконь кафонзамац|$2 тяконь кафонзаманза}}.',

# Special:SpecialPages
'specialpages'                   => 'Башка лопат',
'specialpages-note'              => '----
* Кърдань башка лопат.
* <span class="mw-specialpagerestricted">Кардаф башка лопат.</span>',
'specialpages-group-maintenance' => 'Латцема лувоматне',
'specialpages-group-other'       => 'Иля башка тевонь лопатне',
'specialpages-group-login'       => 'Сувамс / сёрматфтомс',
'specialpages-group-changes'     => 'Улхкомбань полафнематне ди лувоматне',
'specialpages-group-media'       => 'Медиа пачфтематне ди тонгоматне',
'specialpages-group-users'       => 'Тиихне ди видексне',
'specialpages-group-highuse'     => 'Пяк эрявикс лопат',
'specialpages-group-pages'       => 'Лопатнень кярькссь',
'specialpages-group-pagetools'   => 'Лопань кядьёнкст',
'specialpages-group-wiki'        => 'Викинь дата ди кядьёнксне',
'specialpages-group-redirects'   => 'Башка лопатнень иля вастс ётафтома',
'specialpages-group-spam'        => 'Лудна пачфтематнень каршес кядьёнксне',

# Special:BlankPage
'blankpage'              => 'Шава лопа',
'intentionallyblankpage' => 'Тя лопать арьсезефоль кадомс шавакс',

);
