<?php
/** Macedonian (Македонски)
 *
 * @ingroup Language
 * @file
 *
 * @author Brainmachine
 * @author Brest
 * @author Brest2008
 * @author FlavrSavr
 * @author Glupav
 * @author INkubusse
 * @author Misos
 * @author לערי ריינהארט
 */

$skinNames = array(
	'standard'    => 'Класика',
	'nostalgia'   => 'Носталгија',
	'cologneblue' => 'Келнско сино',
	'monobook'    => 'Monobook',
	'myskin'      => 'Моја маска',
	'chick'       => 'Шик'
);

$magicWords = array(
	'redirect'              => array( 0, '#redirect', '#пренасочување', '#види' ),
	'notoc'                 => array( 0, '__NOTOC__', '__БЕЗСОДРЖИНА__' ),
	'forcetoc'              => array( 0, '__FORCETOC__', '__СОСОДРЖИНА__' ),
	'toc'                   => array( 0, '__TOC__', '__СОДРЖИНА__' ),
	'noeditsection'         => array( 0, '__NOEDITSECTION__' , '__БЕЗ_УРЕДУВАЊЕ_НА_СЕКЦИИ__'),
	'currentmonth'          => array( 1, 'CURRENTMONTH', 'СЕГАШЕНМЕСЕЦ' ),
	'currentmonthname'      => array( 1, 'CURRENTMONTHNAME', 'СЕГАШЕНМЕСЕЦИМЕ' ),
	'currentmonthnamegen'   => array( 1, 'CURRENTMONTHNAMEGEN', 'СЕГАШЕНМЕСЕЦИМЕРОД' ),
	'currentmonthabbrev'    => array( 1, 'CURRENTMONTHABBREV', 'СЕГАШЕНМЕСЕЦСКР' ),
	'currentday'            => array( 1, 'CURRENTDAY', 'СЕГАШЕНДЕН' ),
	'currentdayname'        => array( 1, 'CURRENTDAYNAME', 'СЕГАШЕНДЕНИМЕ' ),
	'currentyear'           => array( 1, 'CURRENTYEAR', 'СЕГАШНАГОДИНА' ),
	'currenttime'           => array( 1, 'CURRENTTIME', 'СЕГАШНОВРЕМЕ' ),
	'numberofarticles'      => array( 1, 'NUMBEROFARTICLES', 'БРОЈСТАТИИ' ),
	'pagename'              => array( 1, 'PAGENAME', 'СТРАНИЦА' ),
	'pagenamee'             => array( 1, 'PAGENAMEE', 'СТРАНИЦАИ' ),
	'namespace'             => array( 1, 'NAMESPACE', 'ИМЕПРОСТОР' ),
	'subst'                 => array( 0, 'SUBST:', 'ЗАМЕСТ:' ),
	'msgnw'                 => array( 0, 'MSGNW:', 'ИЗВЕШТNW:' ),
	'img_thumbnail'         => array( 1, 'thumbnail', 'thumb', 'мини' ),
	'img_right'             => array( 1, 'right', 'десно', 'д' ),
	'img_left'              => array( 1, 'left', 'лево', 'л' ),
	'img_none'              => array( 1, 'none', 'н' ),
	'img_width'             => array( 1, '$1px', '$1пкс' , '$1п' ),
	'img_center'            => array( 1, 'center', 'centre', 'центар', 'ц' ),
	'img_framed'            => array( 1, 'framed', 'enframed', 'frame', 'рамка', 'ворамка' ),
	'sitename'              => array( 1, 'SITENAME', 'ИМЕНАСАЈТ' ),
	'localurl'              => array( 0, 'LOCALURL:', 'ЛОКАЛНААДРЕСА:' ),
	'localurle'             => array( 0, 'LOCALURLE:', 'ЛОКАЛНААДРЕСАИ:' ),
	'server'                => array( 0, 'SERVER', 'СЕРВЕР' ),
	'grammar'               => array( 0, 'GRAMMAR:', 'ГРАМАТИКА:' ),
	'notitleconvert'        => array( 0, '__NOTITLECONVERT__', '__NOTC__'),
	'nocontentconvert'      => array( 0, '__NOCONTENTCONVERT__', '__NOCC__'),
	'currentweek'           => array( 1, 'CURRENTWEEK', 'СЕГАШНАСЕДМИЦА'),
);

$namespaceNames = array(
	NS_MEDIA          => 'Медија',
	NS_SPECIAL        => 'Специјални',
	NS_MAIN           => '',
	NS_TALK           => 'Разговор',
	NS_USER           => 'Корисник',
	NS_USER_TALK      => 'Разговор_со_корисник',
	# NS_PROJECT set by $wgMetaNamespace
	NS_PROJECT_TALK   => 'Разговор_за_$1',
	NS_IMAGE          => 'Слика',
	NS_IMAGE_TALK     => 'Разговор_за_слика',
	NS_MEDIAWIKI      => 'МедијаВики',
	NS_MEDIAWIKI_TALK => 'Разговор_за_МедијаВики',
	NS_TEMPLATE       => 'Шаблон',
	NS_TEMPLATE_TALK  => 'Разговор_за_шаблон',
	NS_HELP           => 'Помош',
	NS_HELP_TALK      => 'Разговор_за_помош',
	NS_CATEGORY       => 'Категорија',
	NS_CATEGORY_TALK  => 'Разговор_за_категорија',
);

$linkTrail = '/^([a-zабвгдѓежзѕијклљмнњопрстќуфхцчџш]+)(.*)$/sDu';
$separatorTransformTable = array(',' => '.', '.' => ',' );

$messages = array(
# User preference toggles
'tog-underline'               => 'Потцртување на врски:',
'tog-highlightbroken'         => 'Формат на неправилни врски <a href="" class="new">на овој начин</a> (алтернативно: вака<a href="" class="internal">?</a>).',
'tog-justify'                 => 'Двостранично порамнување на параграфите',
'tog-hideminor'               => 'Сокриј ситни уредувања во скорешни промени',
'tog-extendwatchlist'         => 'Прошири листа на набљудувања со приказ на сите можни промени',
'tog-usenewrc'                => 'Подобрени скорешни промени (JavaScript)',
'tog-numberheadings'          => 'Автоматско нумерирање на заглавија',
'tog-showtoolbar'             => 'Прикажи алатник за уредување (JavaScript)',
'tog-editondblclick'          => 'Уредување на страници при двојно кликнување (JavaScript)',
'tog-editsection'             => 'Овозможи уредување на секција преку [уреди] врски',
'tog-editsectiononrightclick' => 'Овозможи уредување на секција со десен клик на наслов на секција (JavaScript)',
'tog-showtoc'                 => 'Покажи содржина (за страници со повеќе од 3 заглавија)',
'tog-rememberpassword'        => 'Запомни ја лозинката меѓу сесии',
'tog-editwidth'               => 'Максимална ширина на кутијата за уредување',
'tog-watchcreations'          => 'Додади ги страниците што јас ги креирам во мојата листа на набљудувања',
'tog-watchdefault'            => 'Додади ги страниците што јас ги уредувам во мојата листа на набљудувања',
'tog-watchmoves'              => 'Додади ги страниците што јас ги преместувам во мојата листа на набљудувања',
'tog-watchdeletion'           => 'Додади ги страниците што јас ги бришам во мојата листа на набљудувања',
'tog-minordefault'            => 'Обележи ги сите уредувања како ситни по основно',
'tog-previewontop'            => 'Прикажи го прегледот пред кутијата за уредување',
'tog-previewonfirst'          => 'Прикажи преглед на првото уредување',
'tog-nocache'                 => 'Оневозможи кеширање на страниците',
'tog-enotifwatchlistpages'    => 'Испрати ми е-пошта при промена на страница од мојата листа на набљудувања',
'tog-enotifusertalkpages'     => 'Испрати ми е-пошта при промена на мојата страница за разговор',
'tog-enotifminoredits'        => 'Испрати ми, исто така, е-пошта за ситни промени на страници',
'tog-enotifrevealaddr'        => 'Откриј ја мојата е-поштенска адреса во пораките за известување',
'tog-shownumberswatching'     => 'Прикажи го бројот на корисници кои набљудуваат',
'tog-fancysig'                => 'Чист потпис (без автоматска врска)',
'tog-externaleditor'          => 'Користи надворешен уредувач по основно (само за експерти, потребно е специфично нагодување на вашиот компјутер)',
'tog-externaldiff'            => 'Користи надворешна програма за разлики по основно (само за експерти, потребно е специјално нагодување на вашиот компјутер)',
'tog-showjumplinks'           => 'Овозможи „скокни до“ врски на пристапност',
'tog-uselivepreview'          => 'Користи преглед во живо (JavaScript) (Експериментално)',
'tog-forceeditsummary'        => 'Извести ме кога нема опис на промените',
'tog-watchlisthideown'        => 'Сокриј мои уредувања од листата на набљудувања',
'tog-watchlisthidebots'       => 'Сокриј бот уредувања во листата на набљудувања',
'tog-watchlisthideminor'      => 'Сокриј ситни уредувања во листата на набљудувања',
'tog-nolangconversion'        => 'Оневозможи различни конверзии',
'tog-ccmeonemails'            => 'Праќај ми копии од е-пораките што ги праќам до други корисници',
'tog-diffonly'                => 'Не ја покажувај содржината на страницата под разликите',
'tog-showhiddencats'          => 'Прикажи скриени категории',

'underline-always'  => 'Секогаш',
'underline-never'   => 'Никогаш',
'underline-default' => 'Според нагодувањата на прелистувачот',

'skinpreview' => '(Прегледај)',

# Dates
'sunday'        => 'Недела',
'monday'        => 'Понеделник',
'tuesday'       => 'Вторник',
'wednesday'     => 'Среда',
'thursday'      => 'Четврток',
'friday'        => 'Петок',
'saturday'      => 'Сабота',
'sun'           => 'нед',
'mon'           => 'пон',
'tue'           => 'вто',
'wed'           => 'сре',
'thu'           => 'чет',
'fri'           => 'пет',
'sat'           => 'саб',
'january'       => 'јануари',
'february'      => 'февруари',
'march'         => 'март',
'april'         => 'април',
'may_long'      => 'мај',
'june'          => 'јуни',
'july'          => 'јули',
'august'        => 'август',
'september'     => 'септември',
'october'       => 'октомври',
'november'      => 'ноември',
'december'      => 'декември',
'january-gen'   => 'јануари',
'february-gen'  => 'февруари',
'march-gen'     => 'март',
'april-gen'     => 'април',
'may-gen'       => 'мај',
'june-gen'      => 'јуни',
'july-gen'      => 'јули',
'august-gen'    => 'август',
'september-gen' => 'септември',
'october-gen'   => 'октомври',
'november-gen'  => 'ноември',
'december-gen'  => 'декември',
'jan'           => 'јан',
'feb'           => 'фев',
'mar'           => 'мар',
'apr'           => 'апр',
'may'           => 'мај',
'jun'           => 'јун',
'jul'           => 'јул',
'aug'           => 'авг',
'sep'           => 'сеп',
'oct'           => 'окт',
'nov'           => 'ное',
'dec'           => 'дек',

# Categories related messages
'pagecategories'                 => '{{PLURAL:$1|Категорија|Категории}}',
'category_header'                => 'Статии во категоријата "$1"',
'subcategories'                  => 'Подкатегории',
'category-media-header'          => 'Медии во категорија „$1“',
'category-empty'                 => "''Оваа категорија моментално не содржи страници или медија.''",
'hidden-categories'              => '{{PLURAL:$1|Скриена категорија|Скриени категории}}',
'hidden-category-category'       => 'Скриени категории', # Name of the category where hidden categories will be listed
'category-subcat-count'          => '{{PLURAL:$2|Оваа категорија ја содржи само следнава поткатегорија.|Оваа категорија {{PLURAL:$1|ја содржи следнава поткатегорија|ги содржи следниве $1 поткатегории}}, од вкупно $2.}}',
'category-subcat-count-limited'  => 'Оваа категорија {{PLURAL:$1|ја содржи следнава поткатегорија|ги содржи следниве $1 поткатегории}}.',
'category-article-count'         => '{{PLURAL:$2|Оваа категорија ја содржи само следнава страница.|{{PLURAL:$1|Следнава страница е|Следниве $1 страници се}} во оваа категорија, од вкупно $2.}}',
'category-article-count-limited' => '{{PLURAL:$1|Следнава страница е|Следниве $1 страници се}} во оваа категорија.',
'category-file-count'            => '{{PLURAL:$2|Оваа категорија ја содржи само следнава датотека.|{{PLURAL:$1|Следнава датотека е|Следниве $1 датотеки се}} во оваа категорија, од вкупно $2.}}',
'category-file-count-limited'    => '{{PLURAL:$1|Следнава датотека е|Следниве $1 датотеки се}} во оваа категорија.',
'listingcontinuesabbrev'         => 'продолжува',

'mainpagetext'      => 'Вики софтверот е успешно инсталиран.',
'mainpagedocfooter' => 'Ве молиме, видете ја [http://meta.wikimedia.org/wiki/MediaWiki_localisation документацијата] и [http://meta.wikimedia.org/wiki/MediaWiki_User%27s_Guide водичот] за подетална информација односно МедијаВики. Актуелната верзија на македонската јазична датотека можете да најдете на [http://meta.wikimedia.org/wiki/LanguageMk.php Мета].',

'about'          => 'За',
'article'        => 'Статија',
'newwindow'      => '(се отвара во нов прозорец)',
'cancel'         => 'Откажи',
'qbfind'         => 'Најди',
'qbbrowse'       => 'Прелистај',
'qbedit'         => 'Уреди',
'qbpageoptions'  => 'Оваа страница',
'qbpageinfo'     => 'Информации за страницата',
'qbmyoptions'    => 'Мои страници',
'qbspecialpages' => 'Специјални страници',
'moredotdotdot'  => 'Повеќе...',
'mypage'         => 'Моја страница',
'mytalk'         => 'Мои разговори',
'anontalk'       => 'Разговор за оваа IP адреса',
'navigation'     => 'Навигација',
'and'            => 'и',

# Metadata in edit box
'metadata_help' => 'Метаподатоци:',

'errorpagetitle'    => 'Грешка',
'returnto'          => 'Врати се на $1.',
'tagline'           => 'Од {{SITENAME}}',
'help'              => 'Помош',
'search'            => 'Пребарај',
'searchbutton'      => 'Пребарај',
'go'                => 'Оди',
'searcharticle'     => 'Оди',
'history'           => 'Историја на страницата',
'history_short'     => 'Историја',
'updatedmarker'     => 'ажурирано од мојата последна посета',
'info_short'        => 'Информација',
'printableversion'  => 'Верзија за печатење',
'permalink'         => 'Перманентна врска',
'print'             => 'Печати',
'edit'              => 'Уреди',
'create'            => 'Креирај',
'editthispage'      => 'Уреди ја оваа страница',
'create-this-page'  => 'Креирај ја оваа страница',
'delete'            => 'Избриши',
'deletethispage'    => 'Избриши ја оваа страница',
'undelete_short'    => 'Враќање на {{PLURAL:$1|едно избришано уредување|$1 избришани уредувања}}',
'protect'           => 'Заштити',
'protect_change'    => 'промена',
'protectthispage'   => 'Заштити ја оваа страница',
'unprotect'         => 'Отстрани заштита',
'unprotectthispage' => 'Отстрани заштита на страница',
'newpage'           => 'Нова страница',
'talkpage'          => 'Дискутирај за оваа страница',
'talkpagelinktext'  => 'Разговор',
'specialpage'       => 'Специјална страница',
'personaltools'     => 'Лични алатки',
'postcomment'       => 'Испрати коментар',
'articlepage'       => 'Поглед на содржина',
'talk'              => 'Разговор',
'views'             => 'Погледи',
'toolbox'           => 'Алатник',
'userpage'          => 'Поглед на корисничка страница',
'projectpage'       => 'Поглед на проект',
'imagepage'         => 'Поглед на медија',
'mediawikipage'     => 'Поглед на порака',
'templatepage'      => 'Поглед на шаблон',
'viewhelppage'      => 'Види ја страницата за помош',
'categorypage'      => 'Види ја страницата за категорија',
'viewtalkpage'      => 'Видете го разговорот',
'otherlanguages'    => 'Други јазици',
'redirectedfrom'    => '(Пренасочено од $1)',
'redirectpagesub'   => 'Страница за пренасочување',
'lastmodifiedat'    => 'Оваа страница последен пат е изменета на $2, $1.', # $1 date, $2 time
'viewcount'         => 'Оваа страница била посетена {{PLURAL:$1|еднаш|$1 пати}}.',
'protectedpage'     => 'Заштитена страница',
'jumpto'            => 'Скокни на:',
'jumptonavigation'  => 'навигација',
'jumptosearch'      => 'барај',

# All link text and link target definitions of links into project namespace that get used by other message strings, with the exception of user group pages (see grouppage) and the disambiguation template definition (see disambiguations).
'aboutsite'            => 'За {{SITENAME}}',
'aboutpage'            => 'Project:За {{SITENAME}}',
'bugreports'           => 'Извештаи за грешки',
'bugreportspage'       => 'Project:Извештаи за грешки',
'copyright'            => 'Сите текстови се достапни под условите на $1.',
'copyrightpagename'    => '{{SITENAME}} авторски права',
'copyrightpage'        => '{{ns:project}}:Авторски права',
'currentevents'        => 'Тековни настани',
'currentevents-url'    => 'Project:Тековни настани',
'disclaimers'          => 'Услови на употреба',
'disclaimerpage'       => 'Project:Услови на употреба',
'edithelp'             => 'Помош за уредување',
'edithelppage'         => 'Help:Како се уредуваат страници',
'faq'                  => 'ЧПП',
'faqpage'              => 'Project:ЧПП',
'helppage'             => 'Help:Содржина',
'mainpage'             => 'Главна страница',
'mainpage-description' => 'Главна страница',
'policy-url'           => 'Project:Начела',
'portal'               => 'Портал',
'portal-url'           => 'Project:Портал на заедницата',
'privacy'              => 'Заштита на личните податоци',
'privacypage'          => 'Project:Заштита на личните податоци',

'badaccess'        => 'Грешка во пермисии',
'badaccess-group0' => 'Немате дозвола да ја извршите бараната акција.',
'badaccess-group1' => 'Акцијата што ја баравте е ограничена само на корисниците во групата $1.',
'badaccess-group2' => 'Акцијата што ја баравте е ограничена само на корисниците во една од групите $1.',
'badaccess-groups' => 'Акцијата што ја баравте е ограничена само на корисниците во една од групите $1.',

'versionrequired'     => 'Верзијата $1 од МедијаВики е задолжителна',
'versionrequiredtext' => 'Мора да имате верзија $1 на МедијаВики за да ја користите оваа страница. 
Види [[Special:Version|страница за верзија]].',

'ok'                      => 'ОК',
'pagetitle'               => '$1 - Википедија',
'retrievedfrom'           => 'Преземено од "$1"',
'youhavenewmessages'      => 'Имате $1 ($2).',
'newmessageslink'         => 'нови пораки',
'newmessagesdifflink'     => 'скорешна промена',
'youhavenewmessagesmulti' => 'Имате нови пораки на $1',
'editsection'             => 'уреди',
'editsection-brackets'    => '[$1]',
'editold'                 => 'уреди',
'viewsourceold'           => 'види код',
'editsectionhint'         => 'Уредување на секција: $1',
'toc'                     => 'Содржина',
'showtoc'                 => 'прикажи',
'hidetoc'                 => 'сокриј',
'thisisdeleted'           => 'Погледни или врати $1?',
'viewdeleted'             => 'Види $1?',
'restorelink'             => '{{PLURAL:$1|едно избришано уредување|$1 избришани уредувања}}',
'feedlinks'               => 'Фид:',
'feed-invalid'            => 'Лош тип на фид пријава',
'feed-unavailable'        => 'RSS/Atom фидови не се достапни на {{SITENAME}}',
'site-rss-feed'           => '$1 RSS фид',
'site-atom-feed'          => '$1 Atom фид',
'page-rss-feed'           => '„$1“ RSS фид',
'page-atom-feed'          => '„$1“ Atom фид',
'feed-atom'               => 'Atom',
'feed-rss'                => 'RSS',
'red-link-title'          => '$1 (страницата не постои)',

# Short words for each namespace, by default used in the namespace tab in monobook
'nstab-main'      => 'Страница',
'nstab-user'      => 'Страница на корисник',
'nstab-media'     => 'Страница на медија',
'nstab-special'   => 'Специјална',
'nstab-project'   => 'Страница на проект',
'nstab-image'     => 'Податотека',
'nstab-mediawiki' => 'Порака',
'nstab-template'  => 'Шаблон',
'nstab-help'      => 'Страница за помош',
'nstab-category'  => 'Категорија',

# Main script and global functions
'nosuchaction'      => 'Не постои таа функција',
'nosuchactiontext'  => 'Акцијата наведена во URL низата не е препозната од викито',
'nosuchspecialpage' => 'Не постои таква специјална страница',
'nospecialpagetext' => 'Баравте невалидна [[Special:SpecialPages|специјална страница]].
За листа на валидни специјални страници погледни: [[Special:SpecialPages|{{int:specialpages}}]].',

# General errors
'error'                => 'Грешка',
'databaseerror'        => 'Грешка во базата',
'dberrortext'          => 'Грешка во прашалникот кон базата. 
Ова може да значи грешка во софтверот.
Последниот прашалник кон базата беше:
<blockquote><tt>"$1"</tt></blockquote>
од функцијата "<tt>$2</tt>".
MySQL ја врати следната грешка "<tt>$3: $4</tt>".',
'dberrortextcl'        => 'Грешка во прашалникот кон базата. 
Последниот прашалник кон базата беше: 
"$1" 
од функцијата "$2". 
MySQL ја врати следната грешка "$3: $4".',
'noconnect'            => 'Извинете! Викито има некои технички проблеми и не може да пристапи кон базата на податоци на серверот.<br />
$1',
'nodb'                 => 'Не можам да изберам база $1',
'cachederror'          => 'Следува кеширана копија на бараната страница, која можеби е застарена.',
'laggedslavemode'      => 'Предупредување: Страницата може да не ги содржи скорешните ажурирања.',
'readonly'             => 'Базата е заклучена',
'enterlockreason'      => 'Внесете причина за заклучувањето, вклучувајќи и приближно време на отклучување',
'readonlytext'         => 'Базата е моментално затворена за нови статии и други модификации, најверојатно за рутинска проверка, по која ќе се врати во нормалната состојба. Администраторот кој ја заклучи го понуди следното објаснување: <p>$1',
'missing-article'      => 'Базата на податоци не го пронајде текстот на страницата кој требаше да го пронајде, именуван „$1“ $2.

Ова најчесто е предизвикано од застарена разл. или врска до историја на страница која била избришана.

Ако ова не е случајот, можеби сте нашле софтверска грешка (баг).
Ве молиме пријавете го ова на некој [[Special:ListUsers/sysop|администратор]], давајќи врска до URL-то.',
'missingarticle-rev'   => '(измена#: $1)',
'missingarticle-diff'  => '(разлика: $1, $2)',
'readonly_lag'         => 'Базата е автоматски заклучена додека помошните сервери не се синхронизираат',
'internalerror'        => 'Внатрешна грешка',
'internalerror_info'   => 'Внатрешна грешка: $1',
'filecopyerror'        => 'Не можам да ја копирам датотеката "$1" во "$2".',
'filerenameerror'      => 'Не можам да ја преименувам датотеката "$1" во "$2".',
'filedeleteerror'      => 'Не можам да ја избришам датотеката "$1".',
'directorycreateerror' => 'Не можеше да се креира директориумот „$1“.',
'filenotfound'         => 'Не можам да ја најдам датотеката "$1".',
'fileexistserror'      => 'Не може да се направи запис во „$1“: датотеката постои',
'unexpected'           => 'Неочекувана вредност: "$1"="$2".',
'formerror'            => 'Грешка: не можам да го испратам формуларот',
'badarticleerror'      => 'Ова дејство не може да се спроведе на наведената страница.',
'cannotdelete'         => 'Не можам да ја избришам страницата или сликата. (Можеби е веќе избришана од некој друг.)',
'badtitle'             => 'Лош наслов',
'badtitletext'         => 'Бараниот наслов е грешен, празен или погрешно поврзан меѓујазичен или интер-вики наслов. Може да содржи еден или повеќе знаци што не можат да се користат во наслови.',
'perfdisabled'         => 'Извинете! Оваа можност е привремено исклучена бидејќи ја успорува базата до ниво на кое никој не може да го користи викито.',
'perfcached'           => 'Следните податоци се кеширани и може да не бидат целосно ажурирани:',
'perfcachedts'         => 'Следните податоци се кеширани, и последен пат ажурирани на $1.',
'querypage-no-updates' => 'Ажурирања на оваа страница се оневозможени. Податоците овде нема постојано да се обновуваат.',
'wrong_wfQuery_params' => 'Грешни параметри до wfQuery()<br /> Функција: $1<br /> Прашалник: $2',
'viewsource'           => 'Видете го кодот',
'viewsourcefor'        => 'за $1',
'actionthrottled'      => 'Дејството е успорено',
'actionthrottledtext'  => 'Како анти-спам мерка, ограничени сте од вршење на ова дејство премногу пати во краток временски период, а го преминавте ограничувањето.
Ве молиме обидете се повторно за неколку минути.',
'protectedpagetext'    => 'Оваа страница е заклучена за уредувања.',
'viewsourcetext'       => 'Можете да го погледнете и копирате кодот на оваа страница:',
'protectedinterface'   => 'Оваа страница содржи текст од интерфејсот на софтверот и е заклучена заради можна злоупотреба.',
'editinginterface'     => "'''Предупредување:''' Уредувате страница која се користи за приказ на текст од врска со програмата. Промените на оваа страница ќе се одразат на изгледот на страницата кај сите корисници.",
'sqlhidden'            => '(Скриен SQL прашалник)',
'cascadeprotected'     => 'Оваа страница е заштитена од уредување, бидејќи е вметната во {{PLURAL:$1|следнава страница, којашто е заштитена|следниве страници, коишто се заштитени}} со „преносна заштита“:
$2',
'namespaceprotected'   => "Немате дозвола за уредување страници во именскиот простор '''$1'''.",
'customcssjsprotected' => 'Немате дозвола за уредување на оваа страница, бидејќи содржи лични нагодувања на друг корисник.',
'ns-specialprotected'  => 'Страниците во именскиот простор {{ns:special}} не може да се уредуваат.',
'titleprotected'       => "Овој наслов е заштитен од креирање од [[User:$1|$1]].
Даденото образложение е ''$2''.",

# Virus scanner
'virus-badscanner'     => 'Лоша конфигурација: непознат скенер за вируси: <i>$1</i>',
'virus-scanfailed'     => 'неуспешно скенирање (код $1)',
'virus-unknownscanner' => 'непознат антивирус:',

# Login and logout pages
'logouttitle'                => 'Одјавување на корисник',
'logouttext'                 => '<strong>Сега сте одјавени.</strong>

Можете да продолжите да го користите {{SITENAME}} анонимно или можете [[Special:UserLogin|повтроно да се најавите]] под исто или различно корисничко име. Да напоменеме дека некои страници може да продолжат да се прикажуваат како да сте најавени, се додека не го исчистите кеш-от на вашиот веб прелистувач.',
'welcomecreation'            => '== Добредојдовте, $1! ==
Вашата корисничка сметка е креирана.
Не заборавајте да ги промените вашите [[Special:Preferences|{{SITENAME}} нагодувања]].',
'loginpagetitle'             => 'Најавување на корисник',
'yourname'                   => 'Корисничко име:',
'yourpassword'               => 'Лозинка:',
'yourpasswordagain'          => 'Повторете ја лозинката:',
'remembermypassword'         => 'Запомни го моето најавување на овој компјутер',
'yourdomainname'             => 'Вашиот домен:',
'externaldberror'            => 'Настана грешка при надворешното најавување на базата или немате дозвола да ја ажурирате вашата надворешна сметка.',
'loginproblem'               => '<b>Има проблем со вашето најавување.</b><br />Обидете се повторно!',
'login'                      => 'Најавување',
'nav-login-createaccount'    => 'Најавување / креирање на корисничка сметка',
'loginprompt'                => 'Морате да користите колачиња за да се најавите на {{SITENAME}}.',
'userlogin'                  => 'Најавување / креирање на корисничка сметка',
'logout'                     => 'Одјавување',
'userlogout'                 => 'Одјавување',
'notloggedin'                => 'Не сте најавени',
'nologin'                    => 'Немате корисничка сметка? $1.',
'nologinlink'                => 'Креирање нова корисничка сметка',
'createaccount'              => 'Креирање корисничка сметка',
'gotaccount'                 => 'Веќе имате корисничка сметка? $1.',
'gotaccountlink'             => 'Најавување',
'createaccountmail'          => 'по е-пошта',
'badretype'                  => 'Внесените лозинки не се исти.',
'userexists'                 => 'Корисничкото име што го внесовте веќе се користи. 
Ве молиме изберете друго име.',
'youremail'                  => 'Е-пошта:',
'username'                   => 'Корисничко име:',
'uid'                        => 'Кориснички ID:',
'prefs-memberingroups'       => 'Член на {{PLURAL:$1|групата|групите}}:',
'yourrealname'               => 'Вистинско име:',
'yourlanguage'               => 'Јазик:',
'yourvariant'                => 'Варијанта:',
'yournick'                   => 'Потпис:',
'badsig'                     => 'Грешка во потписот.
Проверете ги HTML таговите.',
'badsiglength'               => 'Потписот е предолг.
Мора да биде под $1 {{PLURAL:$1|знак|знаци}}.',
'email'                      => 'Е-пошта',
'prefs-help-realname'        => "'''Вистинското име''' е опционо. 
Доколку изберете да го впишете вашето име, тоа може да се искористи за давање на заслуги за вашата работа.",
'loginerror'                 => 'Грешка при најавување',
'prefs-help-email'           => 'Е-пошта е опција, која ви овозможува нова лозинка да биде пратена по е-пошта доколку ја заборавите вашата стара лозинка.
Може исто така да изберете другите корисници да контактираат со вас преку вашата корисничка страница или страница за разговор, без да биде потребно да го откриете вашиот идентитет.',
'prefs-help-email-required'  => 'Е-поштенска адреса е задолжително да се наведе.',
'nocookiesnew'               => 'Корисничката сметка е креирана, но не сте најавени. 
{{SITENAME}} користи колачиња за најавување на корисници. 
Вие имате оневозможено користењето на колачиња во вашиот веб прелистувач. 
Ве молиме овозможете ја оваа опција, па потоа најавете се со вашето корисничко име и лозинка.',
'nocookieslogin'             => '{{SITENAME}} користи колачиња за најавување на корисници. 
Вие го имате оневозможено користењето на колачиња во вашиот веб прелистувач. 
Ве молиме активирајте ги и обидете се повторно.',
'noname'                     => 'Внесовте погрешно корисничко име.',
'loginsuccesstitle'          => 'Успешно најавување',
'loginsuccess'               => 'Сега сте најавени на {{SITENAME}} како "$1".',
'nosuchuser'                 => 'Нема корисник со името "$1". 
Проверете да не сте направиле грешка во пишувањето, или [[Special:Userlogin/signup|креирајте нова корисничка сметка]].',
'nosuchusershort'            => 'Нема корисник со името "<nowiki>$1</nowiki>".
Проверете дали правилно сте напишале.',
'nouserspecified'            => 'Мора да назначите корисничко име.',
'wrongpassword'              => 'Внесовте погрешна лозинка. Обидете се повторно.',
'wrongpasswordempty'         => 'Внесената лозинка е празна. Обидете се повторно.',
'passwordtooshort'           => 'Вашата лозинка е погрешна или прекратка. 
Мора да има најмалку {{PLURAL:$1|1 знак|$1 знаци}} и да биде различна од вашето корисничко име.',
'mailmypassword'             => 'Испрати нова лозинка по е-пошта',
'passwordremindertitle'      => 'Нова привремена лозинка за {{SITENAME}}',
'passwordremindertext'       => 'Некој (најверојатно вие, од IP адреса $1) побара да ви испратиме нова лозинка за {{SITENAME}} ($4).
Креирана е привремена лозинка "$3". за корисничката сметка "$2".
Ако тоа беше вашата намера, потребно е да се најавите и да ја промените лозинката сега.

Ако некој друг го направил ова барање или ако сте се сетиле на вашата лозинка и веќе не сакате да ја промените, може слободно да ја игнорирате оваа порака и да продолжите да придонесувате користејќи се со старата лозинка.',
'noemail'                    => 'Не е внесена е-поштенска адреса за корисник "$1".',
'passwordsent'               => 'Нова лозинка е испратена на е-поштенската адреса регистрирана за "$1". 
Ве молиме најавете се повторно откако ќе ја примите пораката.',
'blocked-mailpassword'       => 'Вашата IP адреса е блокирана за уредување, истовремено е ставена забрана за користење на функцијата за обнова на лозинка за да се спречи можноста за злоупотреба.',
'eauthentsent'               => 'Е-пошта за потврда е испратена на назначената е-поштенска адреса. 
Пред било која е-пошта да се прати на корисничката сметка, ќе морате да ги следите инструкциите во самата е-пошта, за да потврдите дека таа корисничка сметка е навистина ваша.',
'throttled-mailpassword'     => 'Потсетување за лозинката е веќе пратено во {{PLURAL:$1|изминатиов час|изминативе $1 часа}}.
За да се спречи злоупотреба, само едно потсетување може да се праќа на {{PLURAL:$1|секој час|секои $1 часа}}.',
'mailerror'                  => 'Грешка при испраќање на е-поштата: $1',
'acct_creation_throttle_hit' => 'Извинете, веќе имате создадено $1 сметки. Не можете да создавате повеќе.',
'emailauthenticated'         => 'Автентичноста на вашата е-поштенска адреса е проверена на $1.',
'emailnotauthenticated'      => 'Вашата е-поштенска адреса сеуште не е автентицирана. 
Нема да биде испратена е-пошта во ниту еден од следниве случаи.',
'noemailprefs'               => 'Наведете е-поштенска адреса за да функционираат следниве својства.',
'emailconfirmlink'           => 'Потврдете ја вашата е-поштенска адреса',
'invalidemailaddress'        => 'Е-поштенската адреса не може да биде прифатена бидејќи има неважечки формат. 
Ве молиме, внесете важечки формат или испразнете го тоа поле.',
'accountcreated'             => 'Корисничката сметка е направена',
'accountcreatedtext'         => 'Корисничката сметка за $1 беше направена.',
'createaccount-title'        => 'Правење сметка за {{SITENAME}}',
'createaccount-text'         => 'Некој направил сметка со вашата е-поштенска адреса на {{SITENAME}} ($4) со име „$2“ и  лозинка „$3“.
Би требало сега да се пријавите и да ја промените вашата лозинка.

Можете да ја занемарите оваа порака ако сметката била направена по грешка.',
'loginlanguagelabel'         => 'Јазик: $1',

# Password reset dialog
'resetpass'               => 'Смени ја лозинката',
'resetpass_announce'      => 'Најавени сте со привремена лозинка пратена по е-пошта.
За да го завршите пријавувањето, мора да поставите нова лозинка овде:',
'resetpass_text'          => '<!-- Додадете текст тука -->',
'resetpass_header'        => 'Ресетирај ја лозинката',
'resetpass_submit'        => 'Поставете лозинка и најавете се',
'resetpass_success'       => 'Вашата лозинка беше успешно променета! Најавувањето е во тек...',
'resetpass_bad_temporary' => 'Неважечка привремена лозинка.
Можно е веќе да сте ја промениле вашата лозинка или да сте побарале нова привремена лозинка.',
'resetpass_forbidden'     => 'На {{SITENAME}} не може да се менуваат лозинките.',
'resetpass_missing'       => 'Формуларот не содржи податоци.',

# Edit page toolbar
'bold_sample'     => 'Задебелен текст',
'bold_tip'        => 'Замастен текст',
'italic_sample'   => 'Закосен текст',
'italic_tip'      => 'Закосен текст',
'link_sample'     => 'Наслов на врска',
'link_tip'        => 'Внатрешна врска',
'extlink_sample'  => 'http://www.example.com наслов на врска',
'extlink_tip'     => 'Надворешна врска (користи http:// префикс)',
'headline_sample' => 'Наслов',
'headline_tip'    => 'Ниво 2 наслов',
'math_sample'     => 'Овде вметни формула',
'math_tip'        => 'Математичка формула (LaTeX)',
'nowiki_sample'   => 'Овде внесете неформатиран текст',
'nowiki_tip'      => 'Игнорирај вики форматирање',
'image_sample'    => 'пример.jpg',
'image_tip'       => 'Вметната слика',
'media_sample'    => 'Пример.mp3',
'media_tip'       => 'Врска кон мултимедијална датотека',
'sig_tip'         => 'Вашиот потпис со време',
'hr_tip'          => 'Хоризонтална линија',

# Edit pages
'summary'                          => 'Опис',
'subject'                          => 'Наслов',
'minoredit'                        => 'Ова е ситна промена',
'watchthis'                        => 'Набљудувај ја оваа страница',
'savearticle'                      => 'Зачувај ја страницата',
'preview'                          => 'Преглед',
'showpreview'                      => 'Прикажи преглед',
'showlivepreview'                  => 'Преглед во живо',
'showdiff'                         => 'Прикажи промени',
'anoneditwarning'                  => "'''Предупредување:''' Не сте најавени. Вашата IP адреса ќе биде забележана во историјата на страницата.",
'missingsummary'                   => "'''Потсетник:''' Не внесовте опис на измените. Ако притиснете Зачувај повторно, вашите измени ќе се зачуваат без опис.",
'missingcommenttext'               => 'Ве молиме внесете коментар подолу.',
'missingcommentheader'             => "'''Потсетување:''' Не внесовте наслов за овој коментар. Ако повторно кликнете на Зачувај, вашето уредување ќе биде запамтено без наслов.",
'summary-preview'                  => 'Изглед на описот',
'subject-preview'                  => 'Преглед на предметот/насловот',
'blockedtitle'                     => 'Корисникот е блокиран',
'blockedtext'                      => "<big>'''Вашето корисничко име или IP адреса се блокирани.'''</big>

Блокирањето е направено од страна на $1. 
Даденото образложение е ''$2''.

* Почеток на блокирањето: $8
* Истекување на блокирањето: $6
* Корисникот што требало да биде блокиран: $7

Може да контактирате со $1 или некој друг [[{{MediaWiki:Grouppage-sysop}}|администратор]] за да разговарате во врска со блокирањето.
Можете да ја искористите можноста „Е-пошта до овој корисник“ ако е назначена важечка е-поштенска адреса во [[Special:Preferences|вашите нагодувања]] и не ви е забрането да ја користите.
Вашата сегашна IP адреса е $3, а ID-то на блокирањето е #$5. 
Ве молиме наведете ги сите детали прикажани погоре, во вашата евентуална реакција.",
'autoblockedtext'                  => "Вашата IP адреса е автоматски блокирана бидејќи била користена од страна на друг корисник, кој бил блокиран од $1.
Даденото образложение е следново:

:''$2''

* Почеток на блокирањето: $8
* Истекување на блокирањето: $6
* Со намера да се блокира: $7

Може да контактирате со $1 или некој друг [[{{MediaWiki:Grouppage-sysop}}|администратор]] за да разговарате во врска со ова блокирање.

Имајте во предвид дека можеби нема да можете да ја искористите можноста „Е-пошта до овој корисник“ доколку не е назначена важечка е-поштенска адреса во [[Special:Preferences|вашите нагодувања]] и ви е забрането користитење на истата.

Вашата IP адреса е $3, a ID-то на блокирањеto е $5.
Ве молиме наведете ги овие детали доколку реагирате на блокирањето.",
'blockednoreason'                  => 'не е дадено образложение',
'blockedoriginalsource'            => "Кодот на '''$1''' е прикажан подолу:",
'blockededitsource'                => "Текстот на '''вашите уредувања''' на '''$1''' е прикажан подолу:",
'whitelistedittitle'               => 'Мора да сте најавени доколку сакате да уредувате',
'whitelistedittext'                => 'Мора да сте $1 за да уредувате страници.',
'confirmedittitle'                 => 'Потребна е потврда за е-поштенската адреса за уредување',
'confirmedittext'                  => 'Морате да ја потврдите вашата е-поштенска адреса пред да уредувате страници. 
Поставете ја и валидирајте ја вашата е-поштенска адреса преку вашите [[Special:Preferences|нагодувања]].',
'nosuchsectiontitle'               => 'Нема такваа секција',
'nosuchsectiontext'                => 'Се обидовте да уредувате секција која не постои. Бидејќи не постои секција $1, нема каде да се зачуваат вашите уредувања.',
'loginreqtitle'                    => 'Потребно најавување',
'loginreqlink'                     => 'најавување',
'loginreqpagetext'                 => 'Морате да се $1 за да ги видите другите страници.',
'accmailtitle'                     => 'Лозинката е испратена.',
'accmailtext'                      => "Лозинката за '$1' е испратена на $2.",
'newarticle'                       => '(нова)',
'newarticletext'                   => "Следевте врска која води до страница која сеуште не постои. За да ја креирате страницата, почнете со типкање во долното прозорче (видете ја страницата за [[{{MediaWiki:Helppage}}|помош]] за повеќе информации). Ако сте овде по грешка, само притиснете го копчето '''назад''' во вашиот прелистувач.",
'anontalkpagetext'                 => "''Ова е страница за разговор со анонимен корисник кој сеуште не регистрирал корисничка сметка или не ја користи. Затоа мораме да ја користиме неговата нумеричка [[IP адреса]] за негова идентификација. Една IP адреса може да биде делена од повеќе корисници. Ако сте анонимен корисник и сметате дека кон вас се упатени ирелевантни коментари, ве молиме [[Special:UserLogin|креирајте корисничка сметка]] или [[Special:UserLogin|најавете се]] за да избегнете поистоветување со други анонимни корисници.''",
'noarticletext'                    => 'Моментално нема текст на оваа страница, можете да го [[Special:Search/{{PAGENAME}}|побарате овој наслов]] во други страници или да ја [{{fullurl:{{FULLPAGENAME}}|action=edit}} уредите оваа страница].',
'userpage-userdoesnotexist'        => 'Корисничката сметка „$1“ не е регистрирана. 
Ве молиме размислете дали навистина сакате да ја создадете/уредите оваа страница.',
'clearyourcache'                   => "'''Забелешка - По зачувување морате да го исчистите кешот на вашиот веб прелистувач за да ги видите промените.'''
'''Mozilla / Firefox / Safari:''' држете ''Shift'' додека кликате на ''Reload'' или одеднаш притиснете ''Ctrl-F5'' или ''Ctrl-R'' (''Command-R'' на Мекинтош);
'''Konqueror:''' кликнете на ''Reload'' или притиснете ''F5'';
'''Opera:''' избришете го кешот во ''Tools → Preferences'';
'''Internet Explorer:''' држете ''Ctrl'' додека притискате на ''Refresh'' или притиснете ''Ctrl-F5''.",
'usercssjsyoucanpreview'           => "<strong>Совет:</strong> Користете го копчето '''Прегледај''' за да го испробате новиот CSS/JS код пред зачувувањето.",
'usercsspreview'                   => "'''Запомнете дека ова е само преглед на вашиот кориснички CSS код, страницата сеуште не е зачувана!'''",
'userjspreview'                    => "'''Запомнете дека ова е само преглед на вашиот JavaScript код, страницата сеуште не е зачувана!'''",
'userinvalidcssjstitle'            => "'''Предупредување:''' Нема маска \"\$1\". 
Запамтете дека сопствените .css и .js страници имаат имиња со мали букви, пр. {{ns:user}}:Некој/monobook.css наместо {{ns:user}}:Некој/Monobook.css.",
'updated'                          => '(Ажурирано)',
'note'                             => '<strong>Забелешка:</strong>',
'previewnote'                      => '<strong>Ова е само преглед, страницата сеуште не е зачувана!</strong>',
'previewconflict'                  => 'Овој преглед прикажува како ќе изгледа текстот внесен во горниот дел откако ќе се зачува страницата.',
'session_fail_preview'             => '<strong>Извинете! Не можевме да го процесираме вашето уредување заради губење на сесиски податоци.
Обидете се повторно. Ако сеуште не функционира, пробајте да се одјавите и повторно да се најавите.</strong>',
'session_fail_preview_html'        => "<strong>Извинете! Не можеше да се процесира вашето уредување заради губење на сесиските податоци.</strong>

''Поради тоа што {{SITENAME}} има овозможено HTML, прегледот е скриен од причини на безбедност од страна на JavaScript напади.''

<strong>Ако е ова е дозволен обид за уредување, ве молиме обидете се повторно. Ако сеуште не работи, пробајте да се [[Special:UserLogout|одјавите]] и повторно да се најавите.</strong>",
'token_suffix_mismatch'            => '<strong>Вашето уредување е одбиено затоа што вашиот веб-пребарувач направил проблеми со интерпукциските знаци во токенот за уредување.
Уредувањето не е прифатено за да се спречи несакана промена на текстот на страницата.
Ова понекогаш се случува кога користите неисправен веб-базиран анонимен прокси-сервис.</strong>',
'editing'                          => 'Уредување на $1',
'editingsection'                   => 'Уредување на $1 (секција)',
'editingcomment'                   => 'Уредување на $1 (коментар)',
'editconflict'                     => 'Конфликтни уредувања: $1',
'explainconflict'                  => "Некој друг ја променил страницата откако почнавте да ја уредувате.
Горниот дел за текст ја содржи страницата како што сега постои.
Вашите промени се прикажани во долниот дел.
Ќе морате да ги внесете вашите промени со постоечкиот текст.
'''Само''' текстот во горниот дел ќе биде зачуван кога ќе притиснете на \"Зачувај\".",
'yourtext'                         => 'Вашиот текст',
'storedversion'                    => 'Зачувана верзија',
'nonunicodebrowser'                => '<strong>ПРЕДУПРЕДУВАЊЕ: Вашиот прелистувач не е Уникод компатибилен, ве молиме променете го пред да уредувате статија.</strong>',
'editingold'                       => '<strong>ПРЕДУПРЕДУВАЊЕ: Менувате застарена верзија на оваа страница.
Ако ја зачувате, сите промени по оваа верзија ќе бидат изгубени.</strong>',
'yourdiff'                         => 'Разлики',
'copyrightwarning'                 => '<div style="display:block;vertical-align: top;width:100%; background:blue; color:#fff; text-align:center; font-weight:bold; font-size:100%;margin-bottom:5px;margin-top:0;margin-left:-5px;margin-right:-4px;">НЕ ПРАЌАЈТЕ ТЕКСТОВИ ЗАШТИТЕНИ СО АВТОРСКИ ПРАВА БЕЗ ДОЗВОЛА!</div><br />
Имајте во предвив дека сите придонеси кон {{SITENAME}} се смета дека се издадени под $2 (видете $1 за детали). Ако не сакате вашите текстови да бидат слободно уредувани и разменувани, не ги праќајте овде.<br />
Исто така потврдувате дека вие сте автори на текстот, или сте го копирале од некој слободен извор.',
'copyrightwarning2'                => 'Ве молиме, имајте во предвид дека сите придонеси кон {{SITENAME}} можат да бидат уредувани, менувани или отстранети од други корисници. Ако не сакате вашиот текст да биде менуван и редистрибуиран слободно, не го испраќајте овде.<br />
Исто така потврдувате дека текстот сте го напишале сами, или сте го копирале од јавен домен или сличен слободен извор (видетe $1 за детали).<br />
<strong>НЕ ПРАЌАЈТЕ ТЕКСТОВИ ЗАШТИТЕНИ СО АВТОРСКИ ПРАВА БЕЗ ДОЗВОЛА!</strong>',
'longpagewarning'                  => '<strong>ПРЕДУПРЕДУВАЊЕ: Оваа страница има $1 килобајти;
некои прелистувачи може да имаат проблеми со уредување на страниците поголеми од 32kb.
Размислете за разделување на страницата во помали делови.</strong>',
'longpageerror'                    => '<strong>ГРЕШКА: Текстот што го внесовте е голем $1 килобајти, што е повеќе од максималните $2 килобајти. Не може да се зачува.</strong>',
'readonlywarning'                  => '<strong>ПРЕДУПРЕДУВАЊЕ: Базата е заклучена заради одржување, па нема да можете да ги зачувате вашите промени сега.
Пробајте да го зачувате текстот локално и да го пратите подоцна.</strong>',
'protectedpagewarning'             => '<strong>ПРЕДУПРЕДУВАЊЕ:  Оваа страница е заклучена, така што само корисници со администраторски привилегии можат да ја менуваат.</strong>',
'semiprotectedpagewarning'         => "'''Забелешка:''' Оваа страница е заклучена и само регистрирани корисници може да ја уредуваат.",
'cascadeprotectedwarning'          => "'''Предупредување:''' Оваа страница е заклучена, така што можат да ја уредуваат само корисници со администраторски привилегии, бидејќи е вклучена во {{PLURAL:$1|следнава „преносно-заштитена“ страница|следниве „преносно-заштитени“ страници}}:",
'titleprotectedwarning'            => '<strong>ПРЕДУПРЕДУВАЊЕ:  Оваа страница е заклучена и само некои корисници можат да ја создадат.</strong>',
'templatesused'                    => 'Шаблони користени на оваа страница:',
'templatesusedpreview'             => 'Шаблони користени во овој преглед:',
'templatesusedsection'             => 'Шаблони користени во оваа секција:',
'template-protected'               => '(заштитен)',
'template-semiprotected'           => '(полу-заштитен)',
'hiddencategories'                 => 'Оваа страница припаѓа на {{PLURAL:$1|1 скриена категорија|$1 скриени категории}}:',
'edittools'                        => '<!-- Овој текст ќе се прикаже под формите за уредување и подигнување датотеки. -->',
'nocreatetitle'                    => 'Креирањето на нови страници е ограничено',
'nocreatetext'                     => '{{SITENAME}} ја има ограничена можноста за креирање нови страници.
Можете да се вратите назад и да уредувате постоечка страница или [[Special:UserLogin|најавете се или креирајте нова корисничка сметка]].',
'nocreate-loggedin'                => 'Немате дозвола да создавате нови страници на {{SITENAME}}.',
'permissionserrors'                => 'Грешки во правата',
'permissionserrorstext'            => 'Немате дозвола да го направите тоа, заради {{PLURAL:$1|следнава причина|следниве причини}}:',
'permissionserrorstext-withaction' => 'Немате дозвола за $2, заради {{PLURAL:$1|следнава причина|следниве причини}}:',
'recreate-deleted-warn'            => "'''Внимание: Создавате страница што претходно била бришена.'''

Размислете дали е правилно да продолжите со уредување на оваа страница.
Погледнете го дневникот на бришења за оваа страница заради преглед:",

# Parser/template warnings
'expensive-parserfunction-category'       => 'Страници со премногу повикувања на parser функции',
'post-expand-template-inclusion-warning'  => 'Предупредување: Големината на вклучените шаблони е преголема.
Некои шаблони нема да бидат вклучени.',
'post-expand-template-inclusion-category' => 'Страници каде што големината на вклучените шаблони е пречекорена',
'post-expand-template-argument-warning'   => 'Предупредување: Оваа страница содржи најмалку еден аргумент на шаблон кој е со преголема должина.
Таквите аргументи ќе бидат изземени при парсирањето.',
'post-expand-template-argument-category'  => 'Страници кои содржат изземени аргументи на шаблони',

# "Undo" feature
'undo-success' => 'Уредувањето може да се откаже. 
Ве молиме споредете ги промените со претходната верзија за да проверите дали тоа е сигурно она што сакате да го направите, а потоа зачувајте ги промените за да го завршите откажувањето на претходното уредување.',
'undo-failure' => 'Уредувањето не можеше да се откаже заради други конфликтни уредувања кои настанале во меѓувреме.',
'undo-norev'   => 'Измената не можеше да биде вратена бидејќи не постои или била избришана.',
'undo-summary' => 'Откажано уредување $1 од ([[Special:Contributions/$2|$2]] | [[Разговор со корисник:$2|Разговор]])',

# Account creation failure
'cantcreateaccounttitle' => 'Не може да се создаде корисничка сметка',
'cantcreateaccount-text' => "Создавањето на корисничка сметка од оваа IP адреса ('''$1''') е блокирано од страна на [[User:$3|$3]].

Образложението дадено од страна на $3 е ''$2''",

# History pages
'viewpagelogs'        => 'Види историја на оваа страница',
'nohistory'           => 'Не постои историја на уредување за оваа страница.',
'revnotfound'         => 'Верзијата не е пронајдена',
'revnotfoundtext'     => 'Старата верзија на оваа страница не може да се пронајде.
Проверете ја URL адресата што ја користевте за пристап до оваа страница.',
'currentrev'          => 'Тековна ревизија',
'revisionasof'        => 'Ревизија од $1',
'revision-info'       => 'Ревизии од $1; $2',
'previousrevision'    => '← Претходна ревизија',
'nextrevision'        => 'Следна ревизија →',
'currentrevisionlink' => 'Последна ревизија',
'cur'                 => 'мом',
'next'                => 'след',
'last'                => 'посл',
'page_first'          => 'прв',
'page_last'           => 'последен',
'histlegend'          => 'Diff селекција: селектирајте ги ревизиите кои сакате да ги споредите и притиснете ентер или копчето на дното од страницата.<br />
Легенда: (мом) = разлика со последната ревизија,(посл) = разлика со претходната верзија, С = ситна промена.',
'deletedrev'          => '[избришано]',
'histfirst'           => 'Први',
'histlast'            => 'Последни',
'historysize'         => '({{PLURAL:$1|1 бајт|$1 бајти}})',
'historyempty'        => '(празно)',

# Revision feed
'history-feed-title'          => 'Историја на ревизиите',
'history-feed-description'    => 'Историја на ревизиите за оваа страница на викито',
'history-feed-item-nocomment' => '$1 на $2', # user at time
'history-feed-empty'          => 'Бараната страница не постои.
Може била избришана од викито или преименувана.
Обидете се да [[Special:Search|пребарате низ викито]] за релевантни нови страници.',

# Revision deletion
'rev-deleted-comment'         => '(избришан коментар)',
'rev-deleted-user'            => '(избришано корисничко име)',
'rev-deleted-event'           => '(избришан запис на акција)',
'rev-deleted-text-permission' => '<div class="mw-warning plainlinks">
Ревизијата на оваа страница е избришана од јавните архиви.
Можеби има детали во [{{fullurl:Special:Log/delete|page={{PAGENAMEE}}}} дневникот на бришења].
</div>',
'rev-deleted-text-view'       => '<div class="mw-warning plainlinks">
Ревизијата на оваа страница беше избришана од јавните архиви.
Како администратор на {{SITENAME}} вие можете да ја погледнете;
можеби има повеќе детали во [{{fullurl:Special:Log/delete|page={{PAGENAMEE}}}} дневникот на бришења].
</div>',
'rev-delundel'                => 'прикажи/сокриј',
'revisiondelete'              => 'Избриши/врати ревизии',
'revdelete-nooldid-title'     => 'Бараната измена не постои',
'revdelete-nooldid-text'      => 'Не сте посочиле измена (измени) за да се изврши оваа функција или посочената измена не постои или се обидувате да ја сокриете моменталната измена.',
'revdelete-selected'          => '{{PLURAL:$2|Избрана ревизија|Избрани ревизии}} од [[:$1]]:',
'logdelete-selected'          => '{{PLURAL:$1|Одбран запис од дневникот|Одбрани записи од дневникот}}:',
'revdelete-text'              => 'Избришаните измени и настани сѐ уште ќе се појавуваат во историјата на страницата и дневниците, но делови од нивната содржина ќе бидат недостапни за јавноста.

Други администратори на {{SITENAME}} сѐ уште ќе имаат пристап до скриената содржина и ќе можат да ја вратат преку истиот интерфејс, освен ако не се поставени дополнителни ограничувања.',
'revdelete-legend'            => 'Постави ограничувања на верзијата',
'revdelete-hide-text'         => 'Сокриј го текстот на верзијата',
'revdelete-hide-comment'      => 'Сокриј го описот на измената',
'revdelete-hide-user'         => 'Сокриј име/адреса на уредувачот',
'revdelete-hide-restricted'   => 'Постави ги овие ограничувања и за администраторите и заклучи го овој интерфејс',
'revdelete-hide-image'        => 'Сокриј содржина на податотека',
'revdelete-log'               => 'Коментар за лог:',
'revdelete-submit'            => 'Примени на следните верзии:',
'revdelete-logentry'          => 'променет приказ на верзија за [[$1]]',
'logdelete-logentry'          => 'променета видливост на настан од [[$1]]',
'logdelete-success'           => 'Успешно поставена видливост на настанот.',
'pagehist'                    => 'Историја на страница',
'deletedhist'                 => 'Историја на бришења',
'revdelete-content'           => 'содржина',
'revdelete-summary'           => 'опис на уредувањето',
'revdelete-uname'             => 'корисничко име',
'revdelete-hid'               => 'сокриј $1',
'revdelete-unhid'             => 'прикажи $1',
'revdelete-log-message'       => '$1 од $2 {{PLURAL:$2|ревизија|ревизии}}',
'logdelete-log-message'       => '$1 од $2 {{PLURAL:$2|настан|настани}}',

# History merging
'mergehistory-autocomment' => 'Споено [[:$1]] со [[:$2]]',
'mergehistory-comment'     => 'Споено [[:$1]] со [[:$2]]: $3',

# Merge log
'mergelog'           => 'Дневник на спојувања',
'pagemerge-logentry' => 'споено [[$1]] со [[$2]] (ревизии до $3)',
'revertmerge'        => 'Одвојување',

# Diffs
'history-title'           => 'Историја на верзии за „$1“',
'difference'              => '(Разлика меѓу верзии)',
'lineno'                  => 'Линија $1:',
'compareselectedversions' => 'Споредете ги избраните верзии',
'editundo'                => 'откажи',
'diff-multi'              => '({{PLURAL:$1|Не е прикажана една меѓуверзија|Не се прикажани $1 меѓуверзии}})',

# Search results
'searchresults'             => 'Резултати од пребарувањето',
'searchresulttext'          => 'За повеќе информации во врска со пребарување на {{SITENAME}}, погледнете [[{{MediaWiki:Helppage}}|{{int:help}}]].',
'searchsubtitle'            => 'Пребарувате \'\'\'[[:$1]]\'\'\' на ([[Special:Prefixindex/$1|сите страници кои започнуваат со "$1"]] | [[Special:WhatLinksHere/$1|сите страници кои водат до "$1"]])',
'searchsubtitleinvalid'     => "Пребарувавте '''$1'''",
'noexactmatch'              => "'''Нема страница насловена како „$1“.''' 
Можете да ја [[:$1|креирате оваа страница]].",
'noexactmatch-nocreate'     => "'''Не постои страница насловена како \"\$1\".'''",
'toomanymatches'            => 'Премногу резултати од пребарувањето, ве молиме обидете се со различен упит',
'titlematches'              => 'Насловот на статијата одговара',
'notitlematches'            => 'Ниеден наслов на страница не одговара',
'textmatches'               => 'Текстот на статијата одговара',
'notextmatches'             => 'Ниеден текст во статиите не одговара',
'prevn'                     => 'претходни $1',
'nextn'                     => 'следни $1',
'viewprevnext'              => 'Види ($1) ($2) ($3).',
'search-result-size'        => '$1 ({{PLURAL:$2|1 збор|$2 збора}})',
'search-result-score'       => 'Релевантност: $1%',
'search-redirect'           => '(пренасочување $1)',
'search-section'            => '(секција $1)',
'search-suggest'            => 'Дали мислевте на: $1',
'search-interwiki-caption'  => 'Сестрински проекти',
'search-interwiki-default'  => '$1 резултати:',
'search-interwiki-more'     => '(уште)',
'search-mwsuggest-enabled'  => 'со сугестии',
'search-mwsuggest-disabled' => 'без сугестии',
'search-relatedarticle'     => 'Поврзано',
'mwsuggest-disable'         => 'Оневозможи AJAX сугестии',
'searchrelated'             => 'поврзано',
'searchall'                 => 'се',
'showingresults'            => "Подолу {{PLURAL:$1|е прикажан '''1''' резултат|се прикажани '''$1''' резултати}} почнувајќи од #'''$2'''.",
'showingresultsnum'         => "Подлу {{PLURAL:$3|е прикажан '''1''' резултат|се прикажани '''$3''' резултати}} почнувајќи од бројот '''$2'''.",
'nonefound'                 => "'''Напомена''': По основно, пребарувањето се врши само низ некои именски простори. 
Обидете се со додавање на префиксот ''се:'' за да пребарувате низ сите содржини (вклучувајќи страници за разговор, шаблони, итн) или користете го бараниот именски простор како префикс.",
'powersearch'               => 'Напредно пребарување',
'powersearch-legend'        => 'Напредно пребарување',
'powersearch-ns'            => 'Пребарување цо именски простори:',
'powersearch-redir'         => 'Листа на пренасочувања',
'powersearch-field'         => 'Пребарување на',
'search-external'           => 'Надворешно пребарување',
'searchdisabled'            => '{{SITENAME}} пребарувањето е оневозможено. 
Во меѓувреме, можете да пребарувате преку Google.
Да напоменеме дека нивното индексирање на {{SITENAME}} содржините може да биде застарено.',

# Preferences page
'preferences'              => 'Нагодувања',
'mypreferences'            => 'мои нагодувања',
'prefs-edits'              => 'Број на уредувања:',
'prefsnologin'             => 'Не сте најавени',
'prefsnologintext'         => 'Мора да бидете <span class="plainlinks">[{{fullurl:Special:Userlogin|returnto=$1}} најавени]</span> за промена на вашите кориснички нагодувања.',
'prefsreset'               => 'Воспоставени се стандардните нагодувања.',
'qbsettings'               => 'Лента за брз избор',
'qbsettings-none'          => 'Без мени',
'qbsettings-fixedleft'     => 'Фиксирано лево',
'qbsettings-fixedright'    => 'Фиксирано десно',
'qbsettings-floatingleft'  => 'Пловечко лево',
'qbsettings-floatingright' => 'Пловечки десно',
'changepassword'           => 'Промени лозинка',
'skin'                     => 'Маска',
'math'                     => 'Математика',
'dateformat'               => 'Формат на датум',
'datedefault'              => 'Небитно',
'datetime'                 => 'Датум и време',
'math_failure'             => 'Неможам да парсирам',
'math_unknown_error'       => 'непозната грешка',
'math_unknown_function'    => 'непозната функција',
'math_lexing_error'        => 'лексичка грешка',
'math_syntax_error'        => 'синтаксна грешка',
'math_image_error'         => 'неуспешна PNG конверзија',
'math_bad_tmpdir'          => 'Невозможно е создавањето на привремен директориум за математичките операции',
'math_bad_output'          => 'Невозможно е создавањето на аутпут директориум за математичките операции',
'math_notexvc'             => 'Недостасува извршната датотека texvc; ве молиме видете math/README за подесувања.',
'prefs-personal'           => 'Кориснички податоци',
'prefs-rc'                 => 'Скорешни промени',
'prefs-watchlist'          => 'Листа на набљудувања',
'prefs-watchlist-days'     => 'Број на денови прикажани во листата на набљудувања:',
'prefs-watchlist-edits'    => 'Максимален број на промени прикажани во проширената листа на набљудувања:',
'prefs-misc'               => 'Разно',
'saveprefs'                => 'Зачувај нагодувања',
'resetprefs'               => 'Избриши незачувани измени',
'oldpassword'              => 'Стара лозинка:',
'newpassword'              => 'Нова лозинка:',
'retypenew'                => 'Повторно внеси нова лозинка:',
'textboxsize'              => 'Уредување',
'rows'                     => 'Редови:',
'columns'                  => 'Колони:',
'searchresultshead'        => 'Пребарување',
'resultsperpage'           => 'Резултати по страница:',
'contextlines'             => 'Линии по резултат:',
'contextchars'             => 'Карактери од содржината по линија',
'stub-threshold'           => 'Минимална големина за <a href="#" class="stub">никулци</a> (бајти):',
'recentchangesdays'        => 'Денови за прикажување во скорешни промени:',
'recentchangescount'       => 'Број на уредувања кои ќе се прикажуват во скорешни промени, историја и дневници:',
'savedprefs'               => 'Вашите нагодувања се зачувани.',
'timezonelegend'           => 'Временска зона',
'timezonetext'             => '¹Број на часови за колку се разликува вашето локално време од серверското време (UTC).',
'localtime'                => 'Локално време',
'timezoneoffset'           => 'Отстапка¹',
'servertime'               => 'Серверско време',
'guesstimezone'            => 'Пополни од веб прелистувачот',
'allowemail'               => 'Дозволи е-пошта од други корисници',
'prefs-searchoptions'      => 'Опции за пребарување',
'prefs-namespaces'         => 'Именски простори',
'defaultns'                => 'Пребарувај во овие именски простори по основно:',
'default'                  => 'по основно',
'files'                    => 'Податотеки',

# User rights
'userrights'               => 'Управување со кориснички права', # Not used as normal message but as header for the special page itself
'userrights-lookup-user'   => 'Управување со кориснички групи',
'userrights-user-editname' => 'Внеси корисничко име:',
'editusergroup'            => 'Уреди кориснички групи',
'editinguser'              => "Менување на корисничките права на корисникот '''[[User:$1|$1]]''' ([[User talk:$1|{{int:talkpagelinktext}}]] | [[Special:Contributions/$1|{{int:contribslink}}]])",
'userrights-editusergroup' => 'Уреди ги корисничките групи',
'saveusergroups'           => 'Зачувај ги корисничките групи',
'userrights-groupsmember'  => 'Член на:',

# Groups
'group'               => 'Група:',
'group-user'          => 'Корисници',
'group-autoconfirmed' => 'Автопотврдени корисници',
'group-bot'           => 'Ботови',
'group-sysop'         => 'Администратори',
'group-bureaucrat'    => 'Бирократи',
'group-all'           => '(сите)',

'group-user-member'          => 'корисник',
'group-autoconfirmed-member' => 'автопотврден корисник',
'group-bot-member'           => 'Бот',
'group-sysop-member'         => 'Администратор',
'group-bureaucrat-member'    => 'Бирократ',

'grouppage-user'          => '{{ns:project}}:Корисници',
'grouppage-autoconfirmed' => '{{ns:project}}:Автопотврдени корисници',
'grouppage-bot'           => '{{ns:project}}:Ботови',
'grouppage-sysop'         => '{{ns:project}}:Администратори',
'grouppage-bureaucrat'    => '{{ns:project}}:Бирократи',

# User rights log
'rightslog'      => 'Историја на корисничките права',
'rightslogtext'  => 'Ова е дневник на промени на кориснички права.',
'rightslogentry' => 'променето групно членство за $1 од $2 во $3',
'rightsnone'     => '(нема)',

# Recent changes
'nchanges'                          => '$1 {{PLURAL:$1|промена|промени}}',
'recentchanges'                     => 'Скорешни промени',
'recentchangestext'                 => 'Забележете ги најновите промени на викито на оваа страница.',
'recentchanges-feed-description'    => 'Следење на скорешните промени на викито во овој фид.',
'rcnote'                            => "Долу {{PLURAL:$1|е прикажана '''1''' промена|се прикажани скорешните '''$1''' промени}} {{PLURAL:$2|денес|во последниве '''$2''' дена}}, почнувајќи од $5, $4.",
'rcnotefrom'                        => 'Подолу се промените од <b>$2</b> (се прикажуваат до <b>$1</b>).',
'rclistfrom'                        => 'Прикажи нови промени почнувајќи од $1',
'rcshowhideminor'                   => '$1 ситни промени',
'rcshowhidebots'                    => '$1 ботови',
'rcshowhideliu'                     => '$1 најавени корисници',
'rcshowhideanons'                   => '$1 анонимни корисници',
'rcshowhidepatr'                    => '$1 проверени уредувања',
'rcshowhidemine'                    => '$1 мои уредувања',
'rclinks'                           => 'Прикажи скорешни $1 промени во последните $2 дена<br />$3',
'diff'                              => 'разл',
'hist'                              => 'ист',
'hide'                              => 'Сокриј',
'show'                              => 'Прикажи',
'minoreditletter'                   => 'с',
'newpageletter'                     => 'Н',
'boteditletter'                     => 'б',
'sectionlink'                       => '→',
'number_of_watching_users_pageview' => '[$1 {{PLURAL:$1|корисник кој набљудува|корисници кои набљудуваат}}]',
'rc_categories'                     => 'Ограничи на категории (раздели со "|")',
'rc_categories_any'                 => 'Било кои',
'rc-change-size'                    => '$1',
'newsectionsummary'                 => '/* $1 */ нова секција',

# Recent changes linked
'recentchangeslinked'          => 'Поврзани промени',
'recentchangeslinked-title'    => 'Промени поврзани со "$1"',
'recentchangeslinked-noresult' => 'Нема промени на поврзаните страници во зададениот период.',
'recentchangeslinked-summary'  => "Ова е листа на промени направени на страниците поврзани преку специфицираната страница (или до членови на специфицираната категорија).
Страниците во [[Special:Watchlist|вашата листа на набљудувања]] се прикажани '''болдирано'''.",
'recentchangeslinked-page'     => 'Име на страница:',
'recentchangeslinked-to'       => 'Прикажи ги промените на страниците поврзани со дадената страница',

# Upload
'upload'                      => 'Подигни податотека',
'uploadbtn'                   => 'Подигни податотека',
'reupload'                    => 'Повторно подигни',
'reuploaddesc'                => 'Прекини подигнување и врати се во формуларот за подигнување',
'uploadnologin'               => 'Не сте најавени',
'uploadnologintext'           => 'Морате да бидете [[Special:UserLogin|најавени]] за да подигнувате податотеки.',
'upload_directory_missing'    => 'Именикот за подигнување на слики ($1) не постои и не може да биде креиран на вебсерверот.',
'upload_directory_read_only'  => 'Веб серверот не може да запишува во именикот за подигнување ($1).',
'uploaderror'                 => 'Грешка во подигнувањето',
'uploadtext'                  => "Користете го долниот формулар за подигнување на податотеки.
За преглед или пребарување на претходно подигнати податотеки погледнете ја [[Special:ImageList|листата на подигнати податотеки]], повторните подигнувања се ажурирани во [[Special:Log|дневникот на подигнувања]], бришењата се ажурирани во [[Special:Log/delete|дневникот на бришења]].

За да вклучите слика во страница, користете врска во некој од следниве формати:
* '''<tt><nowiki>[[</nowiki>{{ns:image}}<nowiki>:File.jpg]]</nowiki></tt>''' за верзија на сликата во целосна големина
* '''<tt><nowiki>[[</nowiki>{{ns:image}}<nowiki>:File.png|200px|thumb|left|alt text]]</nowiki><tt>''' за верзија на сликата со големина од 200 пиксели рендерирана во соодветна кутија, со опис како што е наведено во '''alt text'''
* '''<tt><nowiki>[[</nowiki>{{ns:media}}<nowiki>:File.ogg]]</nowiki><tt>''' за директно поврзување со податотеката без нејзино прикажување",
'upload-permitted'            => 'Дозволени видови на податотеки: $1.',
'upload-preferred'            => 'Преферирани типови на податотеки: $1.',
'upload-prohibited'           => 'Забранети типови на податотеки: $1.',
'uploadlog'                   => 'дневник на подигнувањата',
'uploadlogpage'               => 'Дневник на подигнувањата',
'uploadlogpagetext'           => 'Подолу е листа на најновите подигнувања на податотеки.
Погледнете ја [[Special:NewImages|галеријата на нови податотеки]] за визуелен преглед.',
'filename'                    => 'Име на податотеката',
'filedesc'                    => 'Опис',
'fileuploadsummary'           => 'Опис:',
'filestatus'                  => 'Copyright статус:',
'filesource'                  => 'Извор:',
'uploadedfiles'               => 'Подигнати податотеки',
'ignorewarning'               => 'Игнорирај ги предупредувањата и зачувај ја податотеката',
'ignorewarnings'              => 'Игнорирај ги сите предупредувања',
'minlength1'                  => 'Името на податотеката мора да содржи барем една буква.',
'illegalfilename'             => 'Името на податотеката "$1" содржи знаци што не се дозволени во наслов на страници. 
Ве молиме преименувајте ја податотеката и обидете се да ја подигнете повторно.',
'badfilename'                 => 'Името на податотеката е променето во "$1".',
'filetype-badmime'            => 'Податотеки од MIME тип „$1“ не е дозволено да се подигнуваат.',
'filetype-unwanted-type'      => "'''\".\$1\"''' не е посакуван тип на податотека.
{{PLURAL:\$3|Префериран тип на податотека е|Преферирани типови на податотеки се}} \$2.",
'filetype-banned-type'        => "'''\".\$1\"''' не е допуштен тип на податотека.
{{PLURAL:\$3|Допуштен тип на податотека е|Допуштени типови на податотеки се}} \$2.",
'filetype-missing'            => 'Податотеката нема наставка (пример ".jpg").',
'large-file'                  => 'Се препорачува податотеките да не бидат поголеми од $1; оваа податотека е $2.',
'largefileserver'             => 'Големината на податотеката е поголема од максимално дозволената големина.',
'emptyfile'                   => 'Податотеката што ја подигнавте изгледа дека е празна. 
Ова може да е поради грешка во името на податотеката. 
Ве молиме проверете дали навистина сакате да ја подигнете оваа податотека.',
'fileexists'                  => 'Податотека со ова име веќе постои, проверете <strong><tt>$1</tt></strong> ако не сте сигурни дали сакате да го промените.',
'filepageexists'              => 'Страницата за опис на оваа податотека веќе е креирана на <strong><tt>$1</tt></strong>, но не постои податотека со тоа име.
Описот кој го внесовте нема да се појави на страницата за опис.
Доколку сакате описот да се појаву тука, мора мануелно да извршите уредување.',
'fileexists-extension'        => 'Податотека со слично име веќе постои:<br />
Име на податотека која се подигнува: <strong><tt>$1</tt></strong><br />
Име на постоечка податотека: <strong><tt>$2</tt></strong><br />
Ве молиме изберете друго име за податотеката.',
'fileexists-thumb'            => "'''<center>Постоечка податотека</center>'''",
'fileexists-thumbnail-yes'    => 'Податотеката изгледа дека е слика со намалена големина <i>(thumbnail)</i>.
Ве молиме проверете ја податотеката <strong><tt>$1</tt></strong>.<br />
Ако податотеката која ја проверувате е истата слика во својата оригинална големина тогаш не мора да ја подигнувате дополнително.',
'file-thumbnail-no'           => 'Името на податотеката почнува со <strong><tt>$1</tt></strong>. 
Изгледа дека е со намалена големина <i>(мини, thumbnail)</i>.
Ако ја имате оваа слика во оригинална големина, подигнете ја неа, во спротивно сменете го името на податотеката.',
'fileexists-forbidden'        => 'Податотека со тоа име веќе постои.
Ако и понатаму сакате да ја подигнете податотеката, ве молиме вратете се назад и подигнете ја оваа податотека под друго име.
[[Image:$1|thumb|center|$1]]',
'fileexists-shared-forbidden' => 'Податотека со ова име веќе постои во заедничката ризница.
Ако и понатаму сакате да ја подигнете податотеката, ве молиме вратете се и повторно подигнете ја податотеката со ново име. [[Image:$1|thumb|center|$1]]',
'file-exists-duplicate'       => 'Оваа податотека е дупликат со {{PLURAL:$1|следнава податотека|следниве податотеки}}:',
'successfulupload'            => 'Успешно подигнување',
'uploadwarning'               => 'Предупредување при подигнување',
'savefile'                    => 'Зачувај податотека',
'uploadedimage'               => 'подигнато "[[$1]]"',
'overwroteimage'              => 'подигнато нова верзија на "[[$1]]"',
'uploaddisabled'              => 'Забрана за подигнувања',
'uploaddisabledtext'          => 'Подигнувања на податотеки не се допуштени на {{SITENAME}}.',
'uploadscripted'              => 'Податотеката содржи HTML или скриптен код што може да биде погрешно интерпретира од страна на веб прелистувачите.',
'uploadcorrupt'               => 'Податотеката е оштетена или има неточна наставка. 
Ве молиме проверете ја податотеката и подигнете ја повторно.',
'uploadvirus'                 => 'Оваа податотека содржи вирус! Повеќе детали: $1',
'sourcefilename'              => 'Изворно име на податотеката:',
'destfilename'                => 'Целно име на податотеката:',
'upload-maxfilesize'          => 'Максимална големина на податотека: $1',
'watchthisupload'             => 'Набљудувај ја оваа страница',
'filewasdeleted'              => 'Податотека со ова име претходно била подигната и потоа избришана. 
Проверете во $1 пред да продолжите со повтроно подигнување.',
'upload-wasdeleted'           => "'''Внимание: Подигнувате податотека што претходно била бришена.'''

Размислете дали е правилно да продолжите со подигнување на оваа податотека.
Дневникот на бришење за оваа податотека може да го прегледате овде заради ваша информација:",
'filename-bad-prefix'         => 'Името на податотеката која ја подигнувате започнува со <strong>"$1"</strong>, типично за имиња автоматски креирани од страна на дигиталните камери, што не е доволно описно име .
Ве молиме одберете подобро описно име за вашата податотека.',
'filename-prefix-blacklist'   => ' #<!-- leave this line exactly as it is --> <pre>
# Syntax is as follows:
#   * Било што посче знакот "#" па до крајот на линијата претставува коментар
#   * Секој ред означува префикс на типични имиња доделувани од страна на дигиталните камери
CIMG # Casio
DSC_ # Nikon
DSCF # Fuji
DSCN # Nikon
DUW # некои мобилни телефони
IMG # генерички
JD # Jenoptik
MGP # Pentax
PICT # misc.
 #</pre> <!-- leave this line exactly as it is -->',

'upload-proto-error' => 'Погрешен протокол',
'upload-file-error'  => 'Внатрешна грешка',

'license'            => 'Лиценца:',
'nolicense'          => 'Нема',
'license-nopreview'  => '(Прегледот не е достапен)',
'upload_source_url'  => ' (валидна, јавно достапна адреса (URL))',
'upload_source_file' => ' (датотека на вашиот компјутер)',

# Special:ImageList
'imagelist_search_for'  => 'Побарај име на медија:',
'imgfile'               => 'датотека',
'imagelist'             => 'Листа на слики',
'imagelist_date'        => 'Датум',
'imagelist_name'        => 'Име',
'imagelist_user'        => 'Корисник',
'imagelist_size'        => 'Големина (бајти)',
'imagelist_description' => 'Опис',

# Image description page
'filehist'                       => 'Историја на податотеката',
'filehist-help'                  => 'Кликнете на датум/време за да ја видите податотеката како изгледала тогаш.',
'filehist-current'               => 'моментална',
'filehist-datetime'              => 'Датум/Време',
'filehist-user'                  => 'Корисник',
'filehist-dimensions'            => 'Димензии',
'filehist-filesize'              => 'Големина',
'filehist-comment'               => 'Коментар',
'imagelinks'                     => 'Врски',
'linkstoimage'                   => 'До оваа податотека има {{PLURAL:$1|врска од следнава страница|врски од следниве $1 страници}}:',
'nolinkstoimage'                 => 'Нема страници кои ја користат оваа податотека.',
'morelinkstoimage'               => 'Погледни [[Special:WhatLinksHere/$1|други врски]] кон оваа податотека.',
'sharedupload'                   => 'Оваа датотека е заедничка и може да се користи од други проекти.',
'shareduploadwiki'               => 'Ве молиме видете $1 за понатамошна информација.',
'shareduploadwiki-desc'          => 'Описот на нејзината $1 на ризницата е прикажан подолу.',
'shareduploadwiki-linktext'      => 'страница за опис',
'shareduploadduplicate'          => 'Оваа датотека е дупликат на $1 од ризницата.',
'shareduploadduplicate-linktext' => 'друга датотека',
'shareduploadconflict'           => 'Оваа датотека има исто име како $1 од ризницата.',
'shareduploadconflict-linktext'  => 'друга датотека',
'noimage'                        => 'Не постои податотека со тоа име, проверете $1',
'noimage-linktext'               => 'подигни',
'uploadnewversion-linktext'      => 'Подигни нова верзија на оваа податотека',
'imagepage-searchdupe'           => 'Барај дупликат податотеки',

# File reversion
'filerevert'                => 'Врати $1',
'filerevert-backlink'       => '← $1',
'filerevert-legend'         => 'Врати податотека',
'filerevert-intro'          => "Ја враќате '''[[Media:$1|$1]]''' на [$4 верзијата од $3, $2].",
'filerevert-comment'        => 'Коментар:',
'filerevert-defaultcomment' => 'Вратена на верзија од $2, $1',
'filerevert-submit'         => 'Врати',
'filerevert-success'        => "'''[[Media:$1|$1]]''' е вратен на [$4 верзијата од $3, $2].",
'filerevert-badversion'     => 'Нема претходна локална верзија на оваа податотека со даденото време.',

# File deletion
'filedelete'                  => 'Бриши $1',
'filedelete-backlink'         => '← $1',
'filedelete-legend'           => 'Бриши податотека',
'filedelete-intro'            => "Вие ја бришете '''[[Media:$1|$1]]'''.",
'filedelete-intro-old'        => "Вие ја бришете верзијата на '''[[Media:$1|$1]]''' од [$4 $3, $2].",
'filedelete-comment'          => 'Причина за бришењето:',
'filedelete-submit'           => 'Бриши',
'filedelete-success'          => "'''$1''' беше избришана.",
'filedelete-success-old'      => "Верзијата на '''[[Media:$1|$1]]''' од $3, $2 беше избришана.",
'filedelete-nofile'           => "'''$1''' не постои на {{SITENAME}}.",
'filedelete-nofile-old'       => "Не постојат архивирани верзии на '''$1''' со атрибути како што се наведени.",
'filedelete-otherreason'      => 'Друга/дополнителна причина:',
'filedelete-reason-otherlist' => 'Друга причина',
'filedelete-reason-dropdown'  => '*Вообичаени причини за бришење
** Прекршување на Copyright
** Дуплирање на податотеки',
'filedelete-edit-reasonlist'  => 'Уреди причини за бришење',

# MIME search
'mimesearch' => 'MIME пребарување',
'mimetype'   => 'MIME тип:',
'download'   => 'преземи',

# Unwatched pages
'unwatchedpages' => 'Ненабљудувани страници',

# List redirects
'listredirects' => 'Листа на пренасочувања',

# Unused templates
'unusedtemplates'     => 'Неискористени шаблони',
'unusedtemplatestext' => 'Оваа страница ги прикажува сите страници во шаблонскиот именски простор кои не се вклучени во некоја друга страница. Не заборавајте да ги проверите другите врски во шаблоните пред да ги избришете.',
'unusedtemplateswlh'  => 'други врски',

# Random page
'randompage'         => 'Случајна страница',
'randompage-nopages' => 'Нема страници во овој именски простор.',

# Random redirect
'randomredirect'         => 'Случајно пренасочување',
'randomredirect-nopages' => 'Нема пренасочувања во овој именски простор.',

# Statistics
'statistics'             => 'Статистики',
'sitestats'              => 'Статистики за {{SITENAME}}',
'userstats'              => 'Статистики за корисници',
'sitestatstext'          => "Има {{PLURAL:$1|'''1''' страница|вкупно '''$1''' страници}} во базата на податоци.
Вброени се и „страници за разговор“, страници за {{SITENAME}}, минимални „никулци“, пренасочувања, и други коишто веројатно не се сметаат за важечки статии.
Без нив, има {{PLURAL:$2|'''1''' страница што веројатно е важечка статија|'''$2''' страници што веројатно се важечки статии}}.

'''$8''' {{PLURAL:$8|датотека е подигната|датотеки се подигнати}}.

Има вкупно '''$3''' {{PLURAL:$3|преглед|прегледи}} и '''$4''' {{PLURAL:$4|промена на страниците|промени на страниците}}, откако страницата {{SITENAME}} е пуштена.
Со тоа, во просек има '''$5''' уредувања по страница и '''$6''' прегледи по уредување.

Должината на [http://www.mediawiki.org/wiki/Manual:Job_queue редицата за работи] изнесува '''$7'''.",
'userstatstext'          => "Има вкупно {{PLURAL:$1|'''1''' регистриран [[Special:ListUsers|корисник]]|'''$1''' регистрирани [[Special:ListUsers|корисници]]}}, од кои '''$2''' (или '''$4%''') {{PLURAL:$2|има|имаат}} кориснички права на „$5“.",
'statistics-mostpopular' => 'Најгледани страници',

'disambiguations'      => 'Страници за појаснување',
'disambiguationspage'  => 'Template:Врски до страници за појаснување',
'disambiguations-text' => "Следните страници покажуваат до '''страница за појаснување'''.
Тие треба да покажуваат кон соодветната тема.<br />
Страница се третира како појаснувачка ако користи шаблон кој е наведен во [[MediaWiki:Disambiguationspage]]",

'doubleredirects'     => 'Двојни пренасочувања',
'doubleredirectstext' => 'Секој ред содржи врски кон првото и второто пренасочување, којшто обично ја посочува <i>вистинската</i> целна страница кон кое првото пренасочување би требало да насочува.',

'brokenredirects'        => 'Прекинати пренасочувања',
'brokenredirectstext'    => 'Следните пренасочувања покажуваат кон непостоечка статија.',
'brokenredirects-edit'   => '(уреди)',
'brokenredirects-delete' => '(бриши)',

'withoutinterwiki' => 'Страници без интервики (јазични) врски',

'fewestrevisions' => 'Статии со најмалку ревизии',

# Miscellaneous special pages
'nbytes'                  => '$1 {{PLURAL:$1|бајт|бајти}}',
'ncategories'             => '$1 {{PLURAL:$1|категорија|категории}}',
'nlinks'                  => '$1 {{PLURAL:$1|врска|врски}}',
'nmembers'                => '$1 {{PLURAL:$1|член|членови}}',
'nrevisions'              => '$1 {{PLURAL:$1|измена|измени}}',
'nviews'                  => '$1 {{PLURAL:$1|преглед|прегледи}}',
'lonelypages'             => 'Осамени страници',
'lonelypagestext'         => 'Следните страници не се поврзани од други страници на ова вики.',
'uncategorizedpages'      => 'Некатегоризирани страници',
'uncategorizedcategories' => 'Некатегоризирани категории',
'uncategorizedimages'     => 'Некатегоризирани податоци',
'uncategorizedtemplates'  => 'Некатегоризирани преуредувања',
'unusedcategories'        => 'Неискористени категории',
'unusedimages'            => 'Неискористени слики',
'popularpages'            => 'Популарни страници',
'wantedcategories'        => 'Барани категории',
'wantedpages'             => 'Барани страници',
'mostlinked'              => 'Најмногу врски до страници',
'mostlinkedcategories'    => 'Најмногу врски до категории',
'mostlinkedtemplates'     => 'Најповеќе линкови кон шаблони',
'mostcategories'          => 'Статии со најмногу категории',
'mostimages'              => 'Најмногу поврзувања до податоци',
'mostrevisions'           => 'Статии со најмногу верзии',
'prefixindex'             => 'Список на префикси',
'shortpages'              => 'Кратки страници',
'longpages'               => 'Долги страници',
'deadendpages'            => 'Ќорсокак страници',
'deadendpagestext'        => 'Следните страници немаат врски кон ниту една друга страница на ова вики.',
'protectedpages'          => 'Заштитени страници',
'protectedpagestext'      => 'Следните страници се заштитени во поглед на преместување и уредување',
'protectedpagesempty'     => 'Во моментов нема заштитени страници со параметрите кои ги зададовте.',
'protectedtitlesempty'    => 'Во овој момент нема заштитени наслови кои ги задоволуваат наведените критериуми.',
'listusers'               => 'Листа на корисници',
'newpages'                => 'Нови страници',
'newpages-username'       => 'Корисничко име:',
'ancientpages'            => 'Најстари статии',
'move'                    => 'Премести',
'movethispage'            => 'Премести ја оваа страница',
'unusedimagestext'        => 'Имајте во предвид дека други веб страници може да имаат врска кон податок со директен URL, па може сеуште да се прикажуваат иако активно се користат.',
'unusedcategoriestext'    => 'Следните категории постојат и покрај тоа што ниедна статија и категорија не ги користи.',
'notargettitle'           => 'Нема цел',
'notargettext'            => 'Не одредивте целна страница или корисник на кој би се применила функцијата.',

# Book sources
'booksources'      => 'Печатени извори',
'booksources-go'   => 'Оди',
'booksources-text' => 'Ова е листа на врски кон други сајтови кои продаваат нови и користени книги, и кои може
да имаат повеќе информации за книгите кои ги баравте:',

# Special:Log
'specialloguserlabel'  => 'Корисник:',
'speciallogtitlelabel' => 'Наслов:',
'log'                  => 'Дневници',
'all-logs-page'        => 'Сите дневници',
'log-search-legend'    => 'Пребарување на log записи',
'log-search-submit'    => 'Оди',
'alllogstext'          => 'Комбиниран приказ на дневници на подигнувања, бришења, заштита, блокирање и администраторски. Можете да го стесните прегледот преку избор на вид на дневник, име на корисник, или односната страница.',
'logempty'             => 'Нема одговарачки записи во дневникот.',
'log-title-wildcard'   => 'Пребарај наслови кои почнуваат со овој текст',

# Special:AllPages
'allpages'          => 'Сите страници',
'alphaindexline'    => '$1 во $2',
'nextpage'          => 'Следна страница ($1)',
'prevpage'          => 'Претходна страница ($1)',
'allpagesfrom'      => 'Прикажи страници кои започнуваат од:',
'allarticles'       => 'Сите статии',
'allinnamespace'    => 'Сите страници (именски простор $1)',
'allnotinnamespace' => 'Сите страници (кои не се во именскиот простор $1)',
'allpagesprev'      => 'Претходна',
'allpagesnext'      => 'Следна',
'allpagessubmit'    => 'Оди',
'allpagesprefix'    => 'Прикажи страници со префикс:',
'allpagesbadtitle'  => 'Дадениот наслов е невалиден или има интер-јазичен или интер-вики префикс. Може да содржи повеќе карактери кои несмеат да се користат во наслови.',
'allpages-bad-ns'   => 'Википедија не содржи именски простор „$1“.',

# Special:Categories
'categories'                    => 'Категории',
'categoriespagetext'            => 'Следниве категории содржат страници или медија.
[[Special:UnusedCategories|Неискористените категории]] не се прикажани овде.
Исто така види [[Special:WantedCategories|барани категории]].',
'categoriesfrom'                => 'Приказ на категории почнувајќи од:',
'special-categories-sort-count' => 'нумеричко подредување',
'special-categories-sort-abc'   => 'алфанумеричко подредување по',

# Special:ListUsers
'listusersfrom'      => 'Прикажни корисници почнувајќи од:',
'listusers-submit'   => 'Прикажи',
'listusers-noresult' => 'Не е пронајден корисник.',

# E-mail user
'mailnologin'     => 'Нема адреса за праќање',
'mailnologintext' => 'Мора да бидете [[Special:UserLogin|најавени]] и да имате валидна е-поштенска адреса во вашите [[Special:Preferences|наагодувања]] за да испратите е-пошта до други корисници.',
'emailuser'       => 'Е-пошта до овој корисник',
'emailpage'       => 'Е-пошта до корисникот',
'emailpagetext'   => 'Ако овој корисник внесол валидна е-поштенска адреса во неговите или нејзините нагодувања, долниот формулар ќе прати една порака. Е-поштенската адреса што ја внесовте во вашите нагодувања ќе се прикаже во "Од" полето на пораката, со што примачот ќе може да ви одговори.',
'usermailererror' => 'Настана следната грешка:',
'defemailsubject' => '{{SITENAME}} е-пошта',
'noemailtitle'    => 'Нема е-поштенска адреса',
'noemailtext'     => 'Овој корисник нема наведено валидна е-поштенска адреса, или избрал да не прима е-пошта од други корисници.',
'emailfrom'       => 'Од:',
'emailto'         => 'До:',
'emailsubject'    => 'Предмет:',
'emailmessage'    => 'Порака:',
'emailsend'       => 'Прати',
'emailccme'       => 'Прати ми копија од пораката по е-пошта.',
'emailccsubject'  => 'Копија од вашата порака до $1: $2',
'emailsent'       => 'Е-поштата е пратена',
'emailsenttext'   => 'Вашата е-пошта е пратена.',
'emailuserfooter' => 'Оваа е-порака беше пратена од $1 до $2 со помош на функцијата Е-пошта на {{SITENAME}}.',

# Watchlist
'watchlist'            => 'набљудувања',
'mywatchlist'          => 'Мои набљудувања',
'watchlistfor'         => "(за '''$1''')",
'nowatchlist'          => 'Немате ништо во вашата листа на набљудувања.',
'watchlistanontext'    => 'Ве молиме $1 за преглед или уредување на вашата листа на набљудувања.',
'watchnologin'         => 'Не сте најавени',
'watchnologintext'     => 'Мора да бидете [[Special:UserLogin|најавени]] за модифицирање на вашата листа на набљудувања.',
'addedwatch'           => 'Додадено во листата на набљудувања',
'addedwatchtext'       => "Страницата \"<nowiki>\$1</nowiki>\" е додадена во вашата [[Special:Watchlist|листа на набљудувања]]. Идните промени на оваа страница и поврзаните со неа страници за разговор ќе бидат прикажани овде и страницата ќе се прикаже '''задебелена''' во [[Special:RecentChanges|листата на скорешни промени]] за да можете полесно да ја изберете.",
'removedwatch'         => 'Отстрането од листата на набљудувања',
'removedwatchtext'     => 'Страницата "<nowiki>$1</nowiki>" е отстранета од [[Special:Watchlist|вашата листа на набљудувања]].',
'watch'                => 'Набљудувај',
'watchthispage'        => 'Набљудувај ја оваа страница',
'unwatch'              => 'Престани со набљудување',
'unwatchthispage'      => 'Престани набљудување',
'notanarticle'         => 'Не е статија',
'notvisiblerev'        => 'Ревизијата била избришана',
'watchnochange'        => 'Ниедно од вашите набљудувања не беше уредувано во прикажаниот период.',
'watchlist-details'    => '{{PLURAL:$1|$1 страница|$1 страници}} во вашата листа на набљудувања, неброејќи ги страниците за разговор.',
'wlheader-enotif'      => '* Известување по е-пошта е овозможено.',
'wlheader-showupdated' => "* Страници кои се променети од вашата последна посета се прикажани со '''задебелени''' букви",
'watchmethod-recent'   => 'Проверка на скорешните уредувања на набљудуваните страници',
'watchmethod-list'     => 'Проверерка на набљудуваните страници во скорешните уредувања',
'watchlistcontains'    => 'Вашата листа на набљудувања содржи $1 {{PLURAL:$1|страница|страници}}.',
'iteminvalidname'      => "Проблем со елементот '$1', неважечко име...",
'wlnote'               => "Подолу {{PLURAL:$1|е прикажана последната промена|се прикажани последните '''$1''' промени}} во {{PLURAL:$2|последниов час|последниве '''$2''' часа}}.",
'wlshowlast'           => 'Прикажи ги последните $1 часа $2 денови $3',
'watchlist-show-bots'  => 'Прикажи бот уредувања',
'watchlist-hide-bots'  => 'Сокриј бот уредувања',
'watchlist-show-own'   => 'Прикажи мои уредувања',
'watchlist-hide-own'   => 'Сокриј мои уредувања',
'watchlist-show-minor' => 'Прикажи мали уредувања',
'watchlist-hide-minor' => 'Сокриј мали измени',

# Displayed when you click the "watch" button and it is in the process of watching
'watching'   => 'Набљудување...',
'unwatching' => 'Откажување на набљудување...',

'enotif_mailer'                => '{{SITENAME}} Систем за известување',
'enotif_reset'                 => 'Означи ги сите страници како посетени',
'enotif_newpagetext'           => 'Ова е нова страница.',
'enotif_impersonal_salutation' => 'Википедија корисник',
'changed'                      => 'променет',
'created'                      => 'создадена',
'enotif_subject'               => '{{SITENAME}} страницата $PAGETITLE беше $CHANGEDORCREATED од $PAGEEDITOR',
'enotif_lastvisited'           => 'Видете $1 за сите промени од вашата последна посета.',
'enotif_lastdiff'              => 'Видете $1 за да ја видите оваа промена.',
'enotif_anon_editor'           => 'анонимен корисник $1',
'enotif_body'                  => 'Драги $WATCHINGUSERNAME,

Страницата $PAGETITLE на {{SITENAME}} беше $CHANGEDORCREATED на $PAGEEDITDATE од страна на $PAGEEDITOR, видете $PAGETITLE_URL за сегашната верзија.

$NEWPAGE

Резиме: $PAGESUMMARY $PAGEMINOREDIT

Контактирајте го уредувачот:
е-пошта: $PAGEEDITOR_EMAIL
вики: $PAGEEDITOR_WIKI

Веќе нема да има известувања за следните промени освен ако не ја посетите оваа страница. Исто така треба да ги ресетирате знаменцата за известување за сите ваши набљудувани страни во вашата листа на набљудувања.

             Вашиот пријателски {{SITENAME}} систем за известување

--
За да ги промените нагодувањата на вашата листа на набљудувања, посетете
{{fullurl:Special:Watchlist/edit}}

Фидбек и помош:
{{fullurl:Help:Содржина}}',

# Delete/protect/revert
'deletepage'                  => 'Избриши страница',
'confirm'                     => 'Потврди',
'excontent'                   => "содржината беше: '$1'",
'excontentauthor'             => "содржината беше: '$1' (и единствениот автор беше '$2')",
'exbeforeblank'               => "содржината пред бришењето беше: '$1'",
'exblank'                     => 'страницата беше празна',
'delete-confirm'              => 'Бриши "$1"',
'delete-backlink'             => '← $1',
'delete-legend'               => 'Бриши',
'historywarning'              => 'Предупредување: Страницата која сакате да ја избришете има историја:',
'confirmdeletetext'           => 'На пат сте трајно да избришете страница или слика заедно со нејзината историја од базата на податоци. Ве молиме потврдете дека имате намера да го направите ова, дека ги разбирате последиците од тоа, дека го правите ова во согласност со [[Project:Википедија политика|нашата политика на однесување]].',
'actioncomplete'              => 'Дејството беше извршено',
'deletedtext'                 => '"<nowiki>$1</nowiki>" беше избришана. Видете $2 за досие на скорешните бришења.',
'deletedarticle'              => 'избришано "[[$1]]"',
'suppressedarticle'           => 'suppressed "[[$1]]"',
'dellogpage'                  => 'Дневник на бришења',
'dellogpagetext'              => 'Подолу е листата на последните бришења.',
'deletionlog'                 => 'дневник на бришењата',
'reverted'                    => 'Вратено на претходната ревизија',
'deletecomment'               => 'Причина за бришење:',
'deleteotherreason'           => 'Друга/дополнителна причина:',
'deletereasonotherlist'       => 'Друга причина',
'deletereason-dropdown'       => '*Вообичаени причини
** На барање на авторот
** Прекршување на авторски права
** Страница создадена по грешка
** Несоодветен наслов

*Спам
**Спам',
'delete-edit-reasonlist'      => 'Уредување на причини за бришење',
'delete-toobig'               => 'Оваа страница има долга историја на уредување, преку $1 {{PLURAL:$1|ревизија|ревизии}}.
Бришењето на ваквии страници е забрането со цел да се заштити {{SITENAME}} од оштетувања.',
'delete-warning-toobig'       => 'Оваа страница има долга историја на уредување, преку $1 {{PLURAL:$1|ревизија|ревизии}}.
Бришењето може да предизвика проблеми при со базата на податоци на {{SITENAME}};
продолжете доколку сте сигруни дека треба тоа да го сторите.',
'rollback'                    => 'Врати промени',
'rollback_short'              => 'Врати',
'rollbacklink'                => 'Врати',
'rollbackfailed'              => 'Неуспешно враќање',
'cantrollback'                => 'Не може да се врати последната промена, последниот автор е истовремено и единствен.',
'alreadyrolled'               => 'Не може да се врати последната верзија [[:$1]] на [[User:$2|$2]] ([[User talk:$2|Разговор]]); некој веќе ја уредил или ги вратил промените на страницата.

Последното уредување беше на [[User:$3|$3]] ([[User talk:$3|Разговор]]).',
'editcomment'                 => 'Коментарот на уредувањето беше: "<i>$1</i>".', # only shown if there is an edit comment
'revertpage'                  => 'Отстрането уредувањето на [[Special:Contributions/$2|$2]] ([[User talk:$2|разговор]]), вратено на последната верзија на [[User:$1|$1]]', # Additional available: $3: revid of the revision reverted to, $4: timestamp of the revision reverted to, $5: revid of the revision reverted from, $6: timestamp of the revision reverted from
'rollback-success'            => 'Откажани уредувањата на $1; вратено на последната верзија на $2.',
'sessionfailure'              => 'Има проблем со вашата сесија;
оваа акција е откажана како превентива против преземање сесии.
Притиснете го копчето „назад“ и повторно вчитајте ја страницата од која дојдовте и обидете се повторно.',
'protectlogpage'              => 'Дневник на заштитата',
'protectlogtext'              => 'Подолу е листа на отклучувања/заклучувања на страницата. Видете [[Project:Заштитена страница]] за повеќе информации.',
'protectedarticle'            => 'заштитена "[[$1]]"',
'modifiedarticleprotection'   => 'сменето ниво на заштита за „[[$1]]“',
'unprotectedarticle'          => 'отстранета заштита на "[[$1]]"',
'protect-title'               => 'Заштитување "$1"',
'protect-legend'              => 'Потврдете ја заштитата',
'protectcomment'              => 'Причина за заштитување',
'protectexpiry'               => 'Истекува:',
'protect_expiry_invalid'      => 'Времето на истекување не е добро дефинирано.',
'protect_expiry_old'          => 'Времето на истекување е постаро од тековното време.',
'protect-unchain'             => 'Отклучи ја можноста за преместување',
'protect-text'                => 'Овде можете да го погледнете или смените нивото на заштита за страницата <strong><nowiki>$1</nowiki></strong>.',
'protect-locked-blocked'      => 'Не можете да ја менувате заштитата додека сте блокирани. Овде се
дадени актуелните нагодувања за страницата <strong>$1</strong>:',
'protect-locked-dblock'       => 'Нивото на заштита не може да биде променето, бидејќи базата на податоци е заклучена.
Овде се дадени тековните нагодувања на страницата <strong>$1</strong>:',
'protect-locked-access'       => 'Вашата корисничка сметка нема дозвола за менување на нивото на заштита.
Овде се дадени тековните нагодувања за оваа страница <strong>$1</strong>:',
'protect-cascadeon'           => 'Оваа страница во овој момент е заштитена бидејќи е вклучена во {{PLURAL:$1|следнава страница, за која е|следниве страници, за кои е}} вклучена каскадна заштита.
Можете да го промените нивото на заштита, но тоа нема да влијае на каскадната заштита.',
'protect-default'             => '(по основно)',
'protect-fallback'            => 'Бара "$1" пермисија',
'protect-level-autoconfirmed' => 'Блокирај нерегистрирани корисници',
'protect-level-sysop'         => 'Само администратори',
'protect-summary-cascade'     => 'каскада',
'protect-expiring'            => 'истекува на $1 (UTC)',
'protect-cascade'             => 'Заштитени страници вклучени во оваа страница (каскадна заштита)',
'protect-cantedit'            => 'Не можете да го промените нивото на заштита на оваа страница, бидејќи немате пермисии за тоа.',
'restriction-type'            => 'Пермисии:',
'restriction-level'           => 'Ниво на заштита:',
'minimum-size'                => 'Минимална големина',
'maximum-size'                => 'Максимална големина',
'pagesize'                    => '(бајти)',

# Restrictions (nouns)
'restriction-edit' => 'Уреди',
'restriction-move' => 'Премести',

# Undelete
'undelete'                 => 'Врати ја избришаната страница',
'undeletepage'             => 'Погледај и врати ги избришаните страници',
'viewdeletedpage'          => 'Прегледај ги избришаните страници',
'undeletepagetext'         => 'Следните страници се избришани, но сеуште се во архивата и можат да бидат обновени. Архивата може периодично да се чисти.',
'undeleteextrahelp'        => "За да ја вратите целата страница, одселектирајте ги сите полиња и притиснете на '''''Врати'''''.
За да извршите селективно враќање, селектирајте ги полињата до соодветните верзии за враќање и притиснете на '''''Врати'''''.
Со притиснување на '''''Ресетирај''''' ги бришете коментарот и сите полиња за штиклирање.",
'undeleterevisions'        => '{{PLURAL:$1|$1 измена е архивирана|$1 измени се архивирани}}',
'undeletehistory'          => 'Ако ја обновите страницата, сите поправки ќе бидат вратени во историјата.
Ако нова страница со исто име е создадена по бришењето, обновените поправки ќе се појават во претходната историја.
Уште една забелешка дека ограничувањата на поправката на податоците се губат по поправките',
'undeletehistorynoadmin'   => 'Оваа статија беше избришана. Причината за бришењето е наведена подолу,
заедно со информации за корисникот кој ја уредувал страницата пред бришењето. Целиот текст
од избришаните верзии е достапен само за администраторите.',
'undeletebtn'              => 'Обнови!',
'undeletereset'            => 'Ресетирај',
'undeletecomment'          => 'Коментар:',
'undeletedarticle'         => 'обновена "[[$1]]"',
'undeletedrevisions'       => '{{PLURAL:$1|1 измена е обновена|$1 измени се обновени}}',
'undeletedrevisions-files' => '{{PLURAL:$1|1 измена|$1 измени}} и {{PLURAL:$2|1 датотека|$2 датотеки}} се вратени',
'undeletedfiles'           => '{{PLURAL:$1|1 датотека е вратена|$1 датотеки се вратени}}',
'cannotundelete'           => 'Враќањето не успеа, некој друг можеби ја вратил страницата претходно.',
'undeletedpage'            => "<big>'''$1 е обновена'''</big>

Видете ја [[Special:Log/delete|историјата на бришења]] за листа на скоро избришани и обновени страници.",

# Namespace form on various pages
'namespace'      => 'Именски простор:',
'invert'         => 'Обратен избор',
'blanknamespace' => '(Главна)',

# Contributions
'contributions' => 'Придонеси',
'mycontris'     => 'Мои придонеси',
'contribsub2'   => 'За $1 ($2)',
'nocontribs'    => 'Не се пронајдени промени што одговараат на овој критериум.',
'uctop'         => ' (врв)',
'month'         => 'Од месец (и порано):',
'year'          => 'Од година (и порано):',

'sp-contributions-newbies'     => 'Прикажи придонеси само на нови корисници',
'sp-contributions-newbies-sub' => 'За новајлии',
'sp-contributions-blocklog'    => 'Дневник на блокирања',
'sp-contributions-search'      => 'Пребарување на придонеси',
'sp-contributions-username'    => 'IP адреса или корисничко име:',
'sp-contributions-submit'      => 'Пребарај',

# What links here
'whatlinkshere'            => 'Што води овде',
'whatlinkshere-title'      => 'Страници со врски што водат до "$1"',
'whatlinkshere-page'       => 'Страница:',
'linklistsub'              => '(Листа на врски)',
'linkshere'                => "Следните страници имаат врска до '''[[:$1]]''':",
'nolinkshere'              => "Нема страници со врска кон '''[[:$1]]'''.",
'nolinkshere-ns'           => "Нема страници со врска кон '''[[:$1]]''' во избраниот именски простор.",
'isredirect'               => 'пренасочувачка страница',
'istemplate'               => 'вклучување',
'isimage'                  => 'врска кон слика',
'whatlinkshere-prev'       => '{{PLURAL:$1|претходна|претходни $1}}',
'whatlinkshere-next'       => '{{PLURAL:$1|следна|следни $1}}',
'whatlinkshere-links'      => '← врски',
'whatlinkshere-hideredirs' => '$1 пренасочувања',
'whatlinkshere-hidetrans'  => '$1 трансклузии',
'whatlinkshere-hidelinks'  => '$1 врски',
'whatlinkshere-hideimages' => '$1 врски кон слика',
'whatlinkshere-filters'    => 'Филтри',

# Block/unblock
'blockip'                         => 'Блокирај корисник',
'blockip-legend'                  => 'Блокирај корисник',
'blockiptext'                     => 'Користете го долниот формулар да го забраните пристапот за пишување од одредена IP адреса или корисничко име.
Ова единствено треба да се прави за да се спречи вандализам, во согласност со [[{{MediaWiki:Policy-url}}|политиката на википедија]].
Изберете конкретна причина подолу (пример: цитирање на конкретни страници што биле вандализирани).',
'ipaddress'                       => 'IP адреса',
'ipadressorusername'              => 'IP адреса или корисничко име:',
'ipbexpiry'                       => 'Истек на рокот:',
'ipbreason'                       => 'Причина:',
'ipbreasonotherlist'              => 'Друга причина',
'ipbreason-dropdown'              => '*Вообичаени причини за блокирање
** Вметнување лажни информации
** Бришење на содржини од страниците
** Спем врски кон надворешни веб места
** Вметнување глупости во страниците
** Непристојно однесување
** Навредување на други корисници
** Неприфатливо корисничко име',
'ipbanononly'                     => 'Блокирај само анонимни корисници',
'ipbcreateaccount'                => 'Оневозможи креирање кориснички сметки',
'ipbemailban'                     => 'Оневозможи го корисникот да праќа е-пошта',
'ipbenableautoblock'              => 'Автоматски блокирај ја последната IP адреса што ја користел корисникот и сите понатамошни адреси од кои ќе се обиде да уредува',
'ipbsubmit'                       => 'Блокирај го овој корисник',
'ipbother'                        => 'Друг рок:',
'ipboptions'                      => '2 часа:2 hours,1 ден:1 day,3 дена:3 days,1 седмица:1 week,2 седмици:2 weeks,1 месец:1 month,3 месеци:3 months,6 месеци:6 months,1 година:1 year,бесконечно:infinite', # display1:time1,display2:time2,...
'ipbotheroption'                  => 'друго',
'ipbotherreason'                  => 'Друга, дополнителна причина:',
'ipbhidename'                     => 'Сокриј го корисничкото име во дневникот на блокирања, активната листа на блокирања и листата на корисници',
'ipbwatchuser'                    => 'Набљудувај ја корисничката страница и страницата за разговор на овој корисник',
'badipaddress'                    => 'Невалидна IP адреса',
'blockipsuccesssub'               => 'Успешно блокирање',
'blockipsuccesstext'              => '[[Special:Contributions/$1|$1]] беше блокиран.<br />
Види [[Special:IPBlockList|листа на блокирани IP адреси]] за преглед на блокирањата.',
'ipb-edit-dropdown'               => 'Наведи причина за блокирање',
'ipb-unblock-addr'                => 'Одблокирај го $1',
'ipb-unblock'                     => 'Одблокирај корисник или  IP адреса',
'ipb-blocklist-addr'              => 'Погледни блокирања за $1',
'ipb-blocklist'                   => 'Погледни активни блокирања',
'unblockip'                       => 'Деблокирај корисник',
'unblockiptext'                   => 'Користете го долниот формулар да го обновите правото на пишување на претходно блокирана IP адреса или корисничко име.',
'ipusubmit'                       => 'Деблокирај ја оваа адреса',
'unblocked'                       => '[[User:$1|$1]] беше одблокиран',
'unblocked-id'                    => 'Блокирањето $1 беше отстрането',
'ipblocklist'                     => 'Блокирани IP адреси и кориснички имиња',
'ipblocklist-legend'              => 'Најди блокиран корисник',
'ipblocklist-username'            => 'Корисничко име или IP адреса:',
'ipblocklist-submit'              => 'Пребарај',
'blocklistline'                   => '$1, $2 го блокираше $3 (блокиран до $4)',
'infiniteblock'                   => 'бесконечно',
'expiringblock'                   => 'истекува на $1',
'anononlyblock'                   => 'само анон.',
'noautoblockblock'                => 'оневозможено автоблокирање',
'createaccountblock'              => 'блокирано креирање сметки',
'emailblock'                      => 'блокирана е-пошта',
'ipblocklist-empty'               => 'Листата на блокирања е празна.',
'ipblocklist-no-results'          => 'Бараната IP адреса или корисничка сметка не е блокирана.',
'blocklink'                       => 'блокирај',
'unblocklink'                     => 'деблокирај',
'contribslink'                    => 'придонеси',
'autoblocker'                     => 'Автоматски сте блокирани бидејќи вашата IP адреса била скоро користена од "[[User:$1|$1]]".
Причината за блокирање на $1 била: "$2"',
'blocklogpage'                    => 'Дневник на блокирања',
'blocklogentry'                   => 'блокирано [[$1]] со рок на истекување до $2, $3',
'blocklogtext'                    => 'Ова е дневник на блокирањата и деблокирањата, за овој корисник.
Автоматски блокираните IP адреси не се наведени.
Видете [[Special:IPBlockList|листата на блокирани IP адреси]] за листа на тековни забрани и блокирања.',
'unblocklogentry'                 => 'деблокиран "$1"',
'block-log-flags-anononly'        => 'само анонимни корисници',
'block-log-flags-nocreate'        => 'оневозможено креирање на кориснички сметки',
'block-log-flags-noautoblock'     => 'автоблокирање исклучено',
'block-log-flags-noemail'         => 'блокирана е-поштенска адреса',
'block-log-flags-angry-autoblock' => 'овозможено проширено автоблокирање',
'range_block_disabled'            => 'Администраторската можност да блокираат IP групи е исклучена.',
'ipb_expiry_invalid'              => 'Погрешен рок на истекување.',
'ipb_expiry_temp'                 => 'Скриените блокирања на корисникот мора да бидат перманентни.',
'ipb_already_blocked'             => '„$1“ е веќе блокиран',
'ipb_cant_unblock'                => 'Грешка: Блокирањето $1 не постои. 
Можеби веќе е одблокиран.',
'ipb_blocked_as_range'            => 'Грешка: IP адресата $1 не е директно блокирана и не може да се деблокира.
Таа е блокирана како дел од блокот адреси $2, кој не може да се деблокира.',
'ip_range_invalid'                => 'Неважечки IP дијапазон на адреси.',
'blockme'                         => 'Блокирај ме',
'proxyblocker'                    => 'Прокси блокирач',
'proxyblocker-disabled'           => 'Оваа функција е оневозможена.',
'proxyblockreason'                => 'Вашата IP адреса е блокирана бидејќи е отворен прокси. 
Ве молиме контактирајте со вашиот доставувач на Интернет услуги или техничката поддршка и информирајте ги за овој сериозен безбедносен проблем.',
'proxyblocksuccess'               => 'Готово.',
'sorbs'                           => 'DNSBL',
'sorbsreason'                     => 'Вашата IP адреса е запишана како отворен прокси во DNSBL кој го користи {{SITENAME}}..',
'sorbs_create_account_reason'     => 'Вашата IP адреса е наведена како отворен прокси во DNSBL користена од {{SITENAME}}.
Не можете да креирате корисничка сметка.',

# Developer tools
'lockdb'              => 'Заклучи база на податоци',
'unlockdb'            => 'Отклучи база на податоци',
'lockdbtext'          => 'Заклучувањето на базата на податоци ќе им ја укине можноста на сите корисници да уредуваат страници, да ги менуваат нивните нагодувања, да ги уредуваат нивните листи на набљудувања и се останато што бара промени во базата. 
Ве молиме потврдете дека ова е вашата намера и дека ќе ја отклучите базата кога ќе ја завршите работата околу нејзиното одржување.',
'unlockdbtext'        => 'Отклучувањето на базата ќе им ја врати можноста на сите корисници да уредуваат страници, да ги менуваат нивните нагодувања, да ги уредуваат нивните листи на набљудувања и се останато што бара промени во базата.
Ве молиме потврдете дека ова е вашата намера.',
'lockconfirm'         => 'Да, навистина сакам да ја заклучам базата на податоци.',
'unlockconfirm'       => 'Да, навистина сакам да ја отклучам базата на податоци.',
'lockbtn'             => 'Заклучи база на податоци',
'unlockbtn'           => 'Отклучи база на податоци',
'locknoconfirm'       => 'Не ја потврдивте вашата намера.',
'lockdbsuccesssub'    => 'Успешно заклучување на базата на податоци',
'unlockdbsuccesssub'  => 'Базата е отклучена',
'lockdbsuccesstext'   => 'Базата е заклучена. <br />
Сетете се да ја [[Special:UnlockDB|отклучите]] кога ќе завршите со нејзиното одржување.',
'unlockdbsuccesstext' => 'Базата е отклучена.',
'lockfilenotwritable' => 'Податотеката за заклучување на базата не е отворена за пишување. 
За да ја заклучите или отклучите базата, податотеката мора да биде достапна за пишување од страна на веб серверот.',
'databasenotlocked'   => 'Базата не е заклучена.',

# Move page
'move-page'               => 'Премести $1',
'move-page-backlink'      => '← $1',
'move-page-legend'        => 'Премести страница',
'movepagetext'            => "Со користењето на овој формулар можете да преименувате страница, преместувајќи ја целата нејзина историја под ново име. 
Стариот наслов ќе стане страница за пренасочување кон новиот наслов.
Автоматски можете да ги ажурирате пренасочувањата кои покажуваат кон првобитниот наслов.
Ако не изберете автоматско ажурирање, проверете на [[Special:DoubleRedirects|двојни]] или [[Special:BrokenRedirects|прекинати пренасочувања]].
На вас е одговорноста да се осигурате дека врските ќе продолжат да насочуваат таму за каде се предвидени. 

Имајте во предвид дека страницата '''НЕМА''' да биде преместена ако веќе постои страница со новиот наслов, освен ако е празна или ако е пренасочување и нема историја на минати уредувања. Тоа значи дека можете да ја преименувате страницата како што била претходно доколку сте направиле грешка без да ја прекриете постоечката страница.

'''ПРЕДУПРЕДУВАЊЕ!'''
Ова може да биде драстична и неочекувана промена за популарна страница;
осигурајте се дека сте ги разбрале последиците од ова пред да продолжите.",
'movepagetalktext'        => 'Соодветната страница за разговор, доколку постои, ќе биде автоматски преместена заедно со неа, освен ако:
*Непразна страница за разговор веќе постои за новиот наслов, или
*Не сте го одштиклирале долното поле. 

Во тие случаи, вие ќе треба да ја преместите или споите страницата рачно, доколку сакате.',
'movearticle'             => 'Премести страница:',
'movenotallowed'          => 'Немате доволно привилегии за преместување на страници.',
'newtitle'                => 'Кон новиот наслов:',
'move-watch'              => 'Набљудувај ја оваа страница',
'movepagebtn'             => 'Премести страница',
'pagemovedsub'            => 'Успешно преместување',
'movepage-moved'          => '<big>\'\'\'"$1" беше преместена во "$2"\'\'\'</big>', # The two titles are passed in plain text as $3 and $4 to allow additional goodies in the message.
'articleexists'           => 'Страница со тоа име веќе постои или името што го избравте не е валидно.
Ве молиме изберете друго име.',
'cantmove-titleprotected' => 'Не може да ја преместите страницата на таа локација бидејќи има забрана за креирање на страница со нов наслов како што наведовте.',
'talkexists'              => "'''Самата страница беше преместена успешно, но страницата за разговор не можеше да биде преместена бидејќи веќе постои таква на новиот наслов. 
Ве молиме спојте ги рачно.'''",
'movedto'                 => 'преместена како',
'movetalk'                => 'Премести ја и страницата за разговор, ако е возможно.',
'move-subpages'           => 'Премести ги сите подстраници, ако е можно',
'move-talk-subpages'      => 'Премести ги сите подстраници и страници за разговор, ако е можно',
'movepage-page-exists'    => 'Страницата $1 веќе постои и не може автоматски да биде заменета.',
'movepage-page-moved'     => 'Страницата $1 беше преместена како $2.',
'movepage-page-unmoved'   => 'Страницата $1 не може да биде преместена во $2.',
'movepage-max-pages'      => 'Максимално $1 {{PLURAL:$1|страница|страници}} беа преместени, повеќе не може да бидат автоматски преместени.',
'1movedto2'               => '[[$1]] преместена како [[$2]]',
'1movedto2_redir'         => '[[$1]] преместена како [[$2]] преку пренасочување',
'movelogpage'             => 'Дневник на преместувања',
'movelogpagetext'         => 'Подолу е листа на преместени страници.',
'movereason'              => 'Причина:',
'revertmove'              => 'врати',
'delete_and_move'         => 'Избриши и премести',
'delete_and_move_text'    => '==Потребно бришење== 
Целната статија "[[:$1]]" веќе постои. 
Дали сакате да ја избришете за да ослободите место за преместувањето?',
'delete_and_move_confirm' => 'Да, избриши ја страницата',
'delete_and_move_reason'  => 'Избришано за да се ослободи место за преместувањето',
'selfmove'                => 'Страницата не може да биде преместена бидејќи целниот наслов се совпаѓа со првобитниот наслов;
не може да се премести страница во самата себе.',
'immobile_namespace'      => 'Изворниот или целниот наслов е од специјален тип; 
не може да се преместуваат страници во тој именски простор.',
'imagenocrossnamespace'   => 'Не може да се преместува податотека во именски простор кој не е наменет за податотеки',
'imagetypemismatch'       => 'Новата наставка на податотеката не соодветствува на нејзиниот тип.',
'imageinvalidfilename'    => 'Целниот наслов на податотеката е невалиден',
'fix-double-redirects'    => 'Ажурирајте ги сите пренасочувања кои покажуваат на првобитниот наслов',

# Export
'export'          => 'Извезување на страници',
'exporttext'      => 'Можете да го извезете текстот и историјата на уредување на избрана страница или група на страници во XML формат.
Овие податоци може да бидат вчитани на некое друго вики кое се користи со МедијаВики преку [[Special:Import|увезување на страница]].

За извезување на страници, внесете ги насловите во полето прикажано подолу, еден наслов на статија во ред, потоа изберете дали сакате да ја извезете само последната ревизија или и сите постари ревизии.

Ако ја сакате само тековната верзија, би можеле да искористите врска од видот [[{{ns:special}}:Export/{{MediaWiki:Mainpage}}]] за страницата "[[{{MediaWiki:Mainpage}}]]".',
'exportcuronly'   => 'Вклучи ја само тековната верзија, не целосната историја',
'exportnohistory' => "----
'''Забелешка:''' извезувањето на целата историја на страниците преку овој формулар е оневозможено заради подобри перформанси.",
'export-submit'   => 'Извези',

# Namespace 8 related
'allmessages'               => 'Системски пораки',
'allmessagesname'           => 'Име',
'allmessagesdefault'        => 'Текст по основно',
'allmessagescurrent'        => 'Сегашен текст',
'allmessagestext'           => 'Ова е листа на системските пораки достапни во именскиот простор „МедијаВики“.
Ве молиме одете на [http://www.mediawiki.org/wiki/Localisation Локализација на МедијаВики] и [http://translatewiki.net Бетавики] ако сакате да придонесете кон генеричката локализацијата на МедијаВики.',
'allmessagesnotsupportedDB' => "Оваа страница не може да се користи бидејќи '''\$wgUseDatabaseMessages''' е исклучено.",
'allmessagesfilter'         => 'Филтер за регуларни изрази:',
'allmessagesmodified'       => 'Прикажи само изменети',

# Thumbnails
'thumbnail-more'  => 'Зголеми',
'filemissing'     => 'Датотеката недостасува',
'thumbnail_error' => 'Грешка во креирањето на мини-слика: $1',

# Special:Import
'import'                     => 'Увезување на страници',
'importinterwiki'            => 'Трансвики увезување',
'import-interwiki-text'      => 'Изберете вики и наслов на страница за внесување.
Времињата и авторите на ревизиите ќе се зачуваат.
Сите трансвики акции за внесување се бележат во [[Special:Log/import|историјата за внесување]].',
'import-interwiki-history'   => 'Копирај ги сите постари верзии за оваа страница',
'import-interwiki-submit'    => 'Внеси',
'import-interwiki-namespace' => 'Премести страница во именски простор:',
'importtext'                 => 'Ве молиме извезете ја датотеката од изворното вики со користење на алатката Special:Export, зачувајте ја на вашиот диск и подигнете ја овде.',
'importstart'                => 'Внесувам страници...',
'import-revision-count'      => '$1 {{PLURAL:$1|ревизија|ревизии}}',
'importnopages'              => 'Нема страници за внесување.',
'importfailed'               => 'Увозот не успеа: $1',
'importunknownsource'        => 'Непознат тип за внесување',
'importcantopen'             => 'Не можеше да се отвори датотеката за внесување',
'importbadinterwiki'         => 'Лоша интервики врска',
'importnotext'               => 'Празно или без текст',
'importsuccess'              => 'Увозот успеа!',
'importhistoryconflict'      => 'Постои конфликтна историја на верзиите (можно е страницата веќе да била внесена)',
'importnosources'            => 'Нема дефинирано трансвики извори за увезување и директните подигнувања на историја се оневозможени.',
'importnofile'               => 'Нема подигнато увозна датотека.',

# Import log
'importlogpage'                    => 'Дневник на внесувања',
'importlogpagetext'                => 'Административно внесување на страници со историја од други викија.',
'import-logentry-upload'           => 'внесена $1 со подигнување',
'import-logentry-upload-detail'    => '$1 {{PLURAL:$1|ревизија|ревизии}}',
'import-logentry-interwiki'        => 'трансвикифиран $1',
'import-logentry-interwiki-detail' => '$1 {{PLURAL:$1|ревизија|ревизии}} од $2',

# Tooltip help for the actions
'tooltip-pt-userpage'             => 'Мојата корисничка страница',
'tooltip-pt-anonuserpage'         => 'Корисничка страница за IP адресата од која уредувате',
'tooltip-pt-mytalk'               => 'Мојата страница за разговор',
'tooltip-pt-anontalk'             => 'Разговор за уредувањата од оваа IP адреса',
'tooltip-pt-preferences'          => 'Мои нагодувања',
'tooltip-pt-watchlist'            => 'Листа на страници кои сте избрале да ги набљудувате.',
'tooltip-pt-mycontris'            => 'Листа на моите придонеси',
'tooltip-pt-login'                => 'Ве охрабруваме да се најавите, иако тоа не е задолжително.',
'tooltip-pt-anonlogin'            => 'Ве охрабруваме да се најавите, иако тоа не е задолжително.',
'tooltip-pt-logout'               => 'Одјавете се',
'tooltip-ca-talk'                 => 'Разговор за страницата',
'tooltip-ca-edit'                 => 'Можете да ја уредите оваа страница. Ве молиме користете го копчето за преглед пред зачувување.',
'tooltip-ca-addsection'           => 'Додадете коментар во овој разговор.',
'tooltip-ca-viewsource'           => 'Оваа страница е заштитена. Можете да го видите изворниот код.',
'tooltip-ca-history'              => 'Претходни верзии на оваа страница.',
'tooltip-ca-protect'              => 'Заштитете ја оваа страница',
'tooltip-ca-delete'               => 'Избриши ја оваа страница',
'tooltip-ca-undelete'             => 'Обнови ги уредувањата направени на оваа страница пред да биде избришана',
'tooltip-ca-move'                 => 'Премести ја оваа страница',
'tooltip-ca-watch'                => 'Додади ја оваа страница во листата на набљудувања',
'tooltip-ca-unwatch'              => 'Отстрани ја оваа страница од листата на набљудувања',
'tooltip-search'                  => 'Пребарај низ {{SITENAME}}',
'tooltip-search-go'               => 'Оди на страница со ова име доколку постои',
'tooltip-search-fulltext'         => 'Пребарај го овој текст низ странците',
'tooltip-p-logo'                  => 'Главна страница',
'tooltip-n-mainpage'              => 'Посети ја главната страница',
'tooltip-n-portal'                => 'За проектот, што можете да направите, каде да најдете некои работи',
'tooltip-n-currentevents'         => 'Најдете информации за тековните настани',
'tooltip-n-recentchanges'         => 'Листа на скорешни промени на викито.',
'tooltip-n-randompage'            => 'Вчитај случајна страница',
'tooltip-n-help'                  => 'Место каде што може да се информирате.',
'tooltip-t-whatlinkshere'         => 'Листа на сите вики страници поврзани овде',
'tooltip-t-recentchangeslinked'   => 'Скорешни промени поврзани од оваа страница',
'tooltip-feed-rss'                => 'RSS feed за оваа страница',
'tooltip-feed-atom'               => 'Atom feed за оваа страница',
'tooltip-t-contributions'         => 'Погледни листа на придонеси на овој корисник',
'tooltip-t-emailuser'             => 'Прати е-пошта на овој корисник',
'tooltip-t-upload'                => 'Подигнување податотеки',
'tooltip-t-specialpages'          => 'Листа на сите специјални страници',
'tooltip-t-print'                 => 'Верзија за печатење на оваа страница',
'tooltip-t-permalink'             => 'Перманентна врска до оваа верзија од страницата',
'tooltip-ca-nstab-main'           => 'Поглед на содржината',
'tooltip-ca-nstab-user'           => 'Поглед на корисничката страница',
'tooltip-ca-nstab-media'          => 'Поглед на медија страницата',
'tooltip-ca-nstab-special'        => 'Ова е специјална страница, не можете да ја уредувате',
'tooltip-ca-nstab-project'        => 'Поглед на проектната страница',
'tooltip-ca-nstab-image'          => 'Поглед на страницата на податотеката',
'tooltip-ca-nstab-mediawiki'      => 'Поглед на системската порака',
'tooltip-ca-nstab-template'       => 'Поглед на шаблонот',
'tooltip-ca-nstab-help'           => 'Поглед на страницата за помош',
'tooltip-ca-nstab-category'       => 'Поглед на страницата на категоријата',
'tooltip-minoredit'               => 'Обележете ја промената како ситна',
'tooltip-save'                    => 'Зачувајте ги вашите промени',
'tooltip-preview'                 => 'Прегледајте ги вашите промени, ве молиме користете го ова пред зачувување!',
'tooltip-diff'                    => 'Покажи кои промени ги направи во текстот.',
'tooltip-compareselectedversions' => 'Види разлика помеѓу двете избрани верзии на оваа страница.',
'tooltip-watch'                   => 'Додади ја оваа страница во својата листа на набљудувања',
'tooltip-recreate'                => 'Повторно креирај ја страницата иако беше избришана',
'tooltip-upload'                  => 'Започни со подигнување',

# Stylesheets
'common.css'   => '/** CSS кодот на оваа страница ќе се примени на сите маски */',
'monobook.css' => '/* преку уредување на оваа датотека можете да ја прилагодите Monobook маската за целиот сајт */',

# Metadata
'nodublincore'      => 'Dublin Core RDF метаподатоци се оневозможени за овој сервер.',
'nocreativecommons' => 'Creative Commons RDF метаподатоци се оневозможени за овој сервер.',
'notacceptable'     => 'Вики серверот не може да генерира податоци во формат погоден за вашиот клиент.',

# Attribution
'anonymous'        => 'Анонимен корисник од {{SITENAME}}',
'siteuser'         => '{{SITENAME}} корисник $1',
'lastmodifiedatby' => 'Оваа страница последен пат била модифицирана на $1:$2 од $3.', # $1 date, $2 time, $3 user
'othercontribs'    => 'Засновано на делото на $1.',
'others'           => 'други',
'siteusers'        => 'корисници на {{SITENAME}} $1',
'creditspage'      => 'Библиографија и извори',
'nocredits'        => 'Не постојат библиографија и извори за оваа страница.',

# Spam protection
'spamprotectiontitle' => 'Филтер за заштита од спам',
'spamprotectiontext'  => 'Страницата која сакавте да ја зачувате беше блокирана од филтерот за спам. 
Ова најверојатно е предизвикано од врска кон надворешно веб место кое се наоѓа на црната листа.',
'spamprotectionmatch' => 'Следниот текст е она што го предизвика нашиот филтер за спам: $1',
'spambot_username'    => 'МедијаВики чистач на спам',
'spam_reverting'      => 'Враќам на последната верзија што не содржи врска до $1',
'spam_blanking'       => 'Сите верзии содржеа врски до $1, бришам',

# Info page
'infosubtitle'   => 'Информација за страница',
'numedits'       => 'Број на уредувања (страница): $1',
'numtalkedits'   => 'Број на уредувања (страница за разговор): $1',
'numwatchers'    => 'Број на набљудувачи: $1',
'numauthors'     => 'Број на различни автори (страница): $1',
'numtalkauthors' => 'Број на различни автори (страница за разговор): $1',

# Math options
'mw_math_png'    => 'Секогаш исцртувај во PNG',
'mw_math_simple' => 'HTML ако е многу едноставно ако не во PNG',
'mw_math_html'   => 'HTML ако е можно ако не PNG',
'mw_math_source' => 'Остави го како TeX (за текст веб прелистувачи)',
'mw_math_modern' => 'Препорачливо за современи веб прелистувачи',
'mw_math_mathml' => 'MathML ако е можно (експериментално)',

# Patrolling
'markaspatrolleddiff'                 => 'Означи како проверена верзија',
'markaspatrolledtext'                 => 'Означи ја верзијата како проверена',
'markedaspatrolled'                   => 'Означено како проверено',
'markedaspatrolledtext'               => 'Избраната ревизија е означена како проверена.',
'rcpatroldisabled'                    => 'Оневозможено проверка на скорешни промени',
'rcpatroldisabledtext'                => 'Патролирањето на Скорешните промени е деактивирано.',
'markedaspatrollederror'              => 'Не можам да означам како проверена',
'markedaspatrollederrortext'          => 'Морате да внесете верзија за да ја означите како проверена.',
'markedaspatrollederror-noautopatrol' => 'Не можете да ги означите своите промени како проверени.',

# Patrol log
'patrol-log-auto' => '(автоматски)',

# Image deletion
'deletedrevision'                 => 'Избришана стара верзија $1.',
'filedeleteerror-short'           => 'Грешка при бришење на податотека: $1',
'filedeleteerror-long'            => 'Се појавија грешки при бришењето на податотеката:

$1',
'filedelete-missing'              => 'Податотеката "$1" не може да се избрише, бидејќи не постои.',
'filedelete-old-unregistered'     => 'Наведената ревизија на податотеката "$1" не се наоѓа во базата на податоци.',
'filedelete-current-unregistered' => 'Наведената податотека "$1" не се наоѓа во базата на податоци.',

# Browsing diffs
'previousdiff' => '← Постаро уредување',
'nextdiff'     => 'Поново уредување →',

# Media information
'mediawarning'         => "'''Предупредување''': Оваа податотека може да содржи штетен код, нејзиното извршување може да му наштети на вашиот систем<hr />",
'imagemaxsize'         => 'Ограничи ги сликите на нивните описни страници до:',
'thumbsize'            => 'Големина на мини-слика:',
'widthheight'          => '$1×$2',
'widthheightpage'      => '$1×$2, $3 {{PLURAL:$3|страница|страници}}',
'file-info'            => '(големина: $1, MIME тип: $2)',
'file-info-size'       => '($1 × $2 пиксели, големина: $3, MIME тип: $4)',
'file-nohires'         => '<small>Не е достапна поголема резолуција.</small>',
'svg-long-desc'        => '(SVG податотека, номинално $1 × $2 писели, големина: $3)',
'show-big-image'       => 'Вистинска големина',
'show-big-image-thumb' => '<small>Големина на овој приказ: $1 × $2 пиксели</small>',

# Special:NewImages
'newimages'             => 'Галерија на нови слики',
'imagelisttext'         => "Следи листа на '''$1''' {{PLURAL:$1|податотека|податотеки}} подредени $2.",
'newimages-summary'     => 'Оваа специјална страница ги покажува скоро подигнатите податотеки.',
'showhidebots'          => '($1 ботови)',
'noimages'              => 'Нема ништо.',
'ilsubmit'              => 'Барај',
'bydate'                => 'по датум',
'sp-newimages-showfrom' => 'Прикажи нови податотеки од $2, $1',

# Video information, used by Language::formatTimePeriod() to format lengths in the above messages
'video-dims'     => '$1, $2×$3',
'seconds-abbrev' => 's',
'minutes-abbrev' => 'm',
'hours-abbrev'   => 'h',

# Bad image list
'bad_image_list' => 'Форматот е следниот:

Само набројувањата (редици кои започнуваат со *) се земаат во предвид.
Првата врска во редицата мора да биде врска кон погрешна податотека.
Сите следни врски во истата редица се претпоставува дека се исклучоци, т.е. страници каде податотеката може да се појави inline.',

/*
Short names for language variants used for language conversion links.
To disable showing a particular link, set it to 'disable', e.g.
'variantname-zh-sg' => 'disable',
Variants for Chinese language
*/
'variantname-zh-hans' => 'hans',
'variantname-zh-hant' => 'hant',
'variantname-zh-cn'   => 'cn',
'variantname-zh-tw'   => 'tw',
'variantname-zh-hk'   => 'hk',
'variantname-zh-mo'   => 'mo',
'variantname-zh-sg'   => 'sg',
'variantname-zh-my'   => 'my',
'variantname-zh'      => 'zh',

# Variants for Serbian language
'variantname-sr-ec' => 'sr-ec',
'variantname-sr-el' => 'sr-el',
'variantname-sr'    => 'sr',

# Variants for Kazakh language
'variantname-kk-kz'   => 'kk-kz',
'variantname-kk-tr'   => 'kk-tr',
'variantname-kk-cn'   => 'kk-cn',
'variantname-kk-cyrl' => 'kk-cyrl',
'variantname-kk-latn' => 'kk-latn',
'variantname-kk-arab' => 'kk-arab',
'variantname-kk'      => 'kk',

# Variants for Kurdish language
'variantname-ku-arab' => 'ku-Arab',
'variantname-ku-latn' => 'ku-Latn',
'variantname-ku'      => 'ku',

# Variants for Tajiki language
'variantname-tg-cyrl' => 'tg-Cyrl',
'variantname-tg-latn' => 'tg-Latn',

# Metadata
'metadata'          => 'Метаподатоци',
'metadata-help'     => 'Оваа датотека содржи дополнителни информации, најверојатно додадени од фото апарат користен за нивното креирање. Ако датотеката се промени, некои детали може да не одговараат на променетата слика.',
'metadata-expand'   => 'Прикажи ги проширените информации',
'metadata-collapse' => 'Сокриј ги проширените информации',
'metadata-fields'   => 'EXIF мета полињата прикажани во оваа порака ќе бидат вклучени на страницата на сликата кога мета табелата ќе биде затворена.
Останатите ќе бидат сокриени по основно.
* make
* model
* datetimeoriginal
* exposuretime
* fnumber
* focallength', # Do not translate list items

# EXIF tags
'exif-imagewidth'                  => 'Ширина',
'exif-imagelength'                 => 'Висина',
'exif-bitspersample'               => 'Битови по компонента',
'exif-compression'                 => 'Шема на компресијата',
'exif-photometricinterpretation'   => 'Колор модел',
'exif-orientation'                 => 'Ориентација',
'exif-samplesperpixel'             => 'Број на колор компоненти',
'exif-planarconfiguration'         => 'Принцип на распоредот на податоците',
'exif-ycbcrsubsampling'            => 'Однос на компонентата Y спрема C',
'exif-ycbcrpositioning'            => 'Распоред на компонентите Y и C',
'exif-xresolution'                 => 'Хоризонтална резолуција',
'exif-yresolution'                 => 'Вертикална резолуција',
'exif-resolutionunit'              => 'Единица за резолуција',
'exif-stripoffsets'                => 'Положба на блокот на податоци',
'exif-rowsperstrip'                => 'Број на редови во блокот',
'exif-stripbytecounts'             => 'Големина на компресираниот блок',
'exif-jpeginterchangeformat'       => 'Оддалеченост на JPEG прегледот од почетокот на фајлот',
'exif-jpeginterchangeformatlength' => 'Количина на бајтови во JPEG прегледот',
'exif-transferfunction'            => 'Функција на преобликување на колор просторот',
'exif-whitepoint'                  => 'Хромацитет на белата точка',
'exif-primarychromaticities'       => 'Хроматичност на примарните бои',
'exif-ycbcrcoefficients'           => 'Матрични коефициенти на трансформација на колор просторот',
'exif-referenceblackwhite'         => 'Место на белата и црната точка',
'exif-datetime'                    => 'Датум на последната промена на датотеката',
'exif-imagedescription'            => 'Име на сликата',
'exif-make'                        => 'Производител на камерата',
'exif-model'                       => 'Модел на камерата',
'exif-software'                    => 'Користен софтвер',
'exif-artist'                      => 'Автор',
'exif-copyright'                   => 'Носител на авторските права',
'exif-exifversion'                 => 'Exif верзија',
'exif-flashpixversion'             => 'Поддржана верзија на Flashpix',
'exif-colorspace'                  => 'Простор на бојата',
'exif-componentsconfiguration'     => 'Значење на секоја од компонентите.',
'exif-compressedbitsperpixel'      => 'Мод на компресирање на сликата',
'exif-pixelydimension'             => 'Полна висина на сликата',
'exif-pixelxdimension'             => 'Полна ширина на сликата',
'exif-makernote'                   => 'Забелешки на производителот',
'exif-usercomment'                 => 'Коментар на корисникот',
'exif-relatedsoundfile'            => 'Поврзана звучна датотека',
'exif-datetimeoriginal'            => 'Датум и време на сликање',
'exif-datetimedigitized'           => 'Датум и време на дигитализација',
'exif-subsectime'                  => 'Дел од секундата во кој е сликано',
'exif-subsectimeoriginal'          => 'Дел од секундата во кој е фотографирано',
'exif-subsectimedigitized'         => 'Дел од секундата во кој е дигитализирано',
'exif-exposuretime'                => 'Експозиција',
'exif-fnumber'                     => 'F број на отворот на блендата',
'exif-exposureprogram'             => 'Програм за експозиција',
'exif-spectralsensitivity'         => 'Спектрална осетливост',
'exif-isospeedratings'             => 'ИСО вредност',
'exif-oecf'                        => 'Оптоелектронски фактор на конверзија',
'exif-shutterspeedvalue'           => 'Брзина на затворачот',
'exif-aperturevalue'               => 'Отвор на блендата',
'exif-brightnessvalue'             => 'Светлост',
'exif-exposurebiasvalue'           => 'Компензација на експозицијата',
'exif-maxaperturevalue'            => 'Минимален број на отворот на блендата',
'exif-subjectdistance'             => 'Оддалеченост до објектот',
'exif-meteringmode'                => 'Режим на мерачот на времето',
'exif-lightsource'                 => 'Светлосен извор',
'exif-flash'                       => 'Блиц',
'exif-focallength'                 => 'Фокусна далечина на леќата',
'exif-subjectarea'                 => 'Положба и површина на објектот',
'exif-flashenergy'                 => 'Енергија на блицот',
'exif-spatialfrequencyresponse'    => 'Просторна фреквенциска карактеристика',
'exif-focalplanexresolution'       => 'Хоризонтална резолуција на фокусната рамнина',
'exif-focalplaneyresolution'       => 'Вертикална резолуција на фокусната рамнина',
'exif-focalplaneresolutionunit'    => 'Единица за резолуција на фокусната рамнина',
'exif-subjectlocation'             => 'Положба на субјектот',
'exif-exposureindex'               => 'Индекс на експозицијата',
'exif-sensingmethod'               => 'Тип на сензори',
'exif-filesource'                  => 'Извор на датотеката',
'exif-scenetype'                   => 'Тип на сцена',
'exif-cfapattern'                  => 'CFA шаблон',
'exif-customrendered'              => 'Додатна обработка на сликата',
'exif-exposuremode'                => 'Режим за избор на експозицијата',
'exif-whitebalance'                => 'Баланс на белата боја',
'exif-digitalzoomratio'            => 'Однос на дигиталниот зум',
'exif-focallengthin35mmfilm'       => 'Еквивалент на фокусната далечина за 35 mm филм',
'exif-scenecapturetype'            => 'Тип на сцена на снимката',
'exif-gaincontrol'                 => 'Контрола на осветленоста',
'exif-contrast'                    => 'Контраст',
'exif-saturation'                  => 'Сатурација',
'exif-sharpness'                   => 'Острина',
'exif-devicesettingdescription'    => 'Опис на подесувањата на апаратот',
'exif-subjectdistancerange'        => 'Распон на оддалеченоста на субјектот',
'exif-imageuniqueid'               => 'Единствен идентификатор на сликата',
'exif-gpsversionid'                => 'Верзија на блокот на GPS информации',
'exif-gpslatituderef'              => 'Северна или Јужна ширина',
'exif-gpslatitude'                 => 'Ширина',
'exif-gpslongituderef'             => 'Источна или западна должина',
'exif-gpslongitude'                => 'Должина',
'exif-gpsaltituderef'              => 'Висина под или над морето',
'exif-gpsaltitude'                 => 'Висина',
'exif-gpstimestamp'                => 'GPS време (атомски часовник)',
'exif-gpssatellites'               => 'Употребени сателити',
'exif-gpsstatus'                   => 'Статус на приемникот',
'exif-gpsmeasuremode'              => 'Режим на мерењето',
'exif-gpsdop'                      => 'Прецизност на мерењето',
'exif-gpsspeedref'                 => 'Единица за брзината',
'exif-gpsspeed'                    => 'Брзина на GPS приемникот',
'exif-gpstrackref'                 => 'Тип на азимутот на приемникот (вистински или магнетен)',
'exif-gpstrack'                    => 'Азимут на приемникот',
'exif-gpsimgdirectionref'          => 'Тип на азимутот на сликата (вистински или магнетен)',
'exif-gpsimgdirection'             => 'Азимут на сликата',
'exif-gpsmapdatum'                 => 'Користен геодетски координатен систем',
'exif-gpsdestlatituderef'          => 'Индекс за географската ширина на објектот',
'exif-gpsdestlatitude'             => 'Географска ширина на објектот',
'exif-gpsdestlongituderef'         => 'Индекс за географската должина на објектот',
'exif-gpsdestlongitude'            => 'Географска должина на објектот',
'exif-gpsdestbearingref'           => 'Индекс на азимутот на објектот',
'exif-gpsdestbearing'              => 'Азимут на објектот',
'exif-gpsdestdistanceref'          => 'Мерна единица за оддалеченоста на објектот',
'exif-gpsdestdistance'             => 'Оддалеченост на објектот',
'exif-gpsprocessingmethod'         => 'Име на методот за обработка на GPS податоците',
'exif-gpsareainformation'          => 'Има на GPS зоната',
'exif-gpsdatestamp'                => 'GPS датум',
'exif-gpsdifferential'             => 'GPS диференцијална корекција',

# EXIF attributes
'exif-compression-1' => 'Некомпресиран',

'exif-orientation-1' => 'Нормално', # 0th row: top; 0th column: left
'exif-orientation-2' => 'Обратно по хоризонтала', # 0th row: top; 0th column: right
'exif-orientation-3' => 'Ротирано 180°', # 0th row: bottom; 0th column: right
'exif-orientation-4' => 'Обратно по вертикала', # 0th row: bottom; 0th column: left
'exif-orientation-5' => 'Ротирано 90° спротивно од правецот на стрелките на часовникот и обратно по вертикала', # 0th row: left; 0th column: top
'exif-orientation-6' => 'Ротирано 90° во правец на стрелките на часовникот', # 0th row: right; 0th column: top
'exif-orientation-7' => 'Ротирано 90° во правец на стрелките на часовникот и обратно по вертикала', # 0th row: right; 0th column: bottom
'exif-orientation-8' => 'Ротирано 90° спротивно од правецот на стрелките на часовникот', # 0th row: left; 0th column: bottom

'exif-planarconfiguration-1' => 'делумен формат',
'exif-planarconfiguration-2' => 'планарен формат',

'exif-componentsconfiguration-0' => 'не постои',

'exif-exposureprogram-0' => 'Недефинирано',
'exif-exposureprogram-1' => 'Рачно',
'exif-exposureprogram-2' => 'Нормална програма',
'exif-exposureprogram-3' => 'Приоритет на отворот на блендата',
'exif-exposureprogram-4' => 'Приоритет на затворачот',
'exif-exposureprogram-5' => 'Уметничка програма (на база на нужната длабочина на полето)',
'exif-exposureprogram-6' => 'Спортска програма (на база на што побрз затворач)',
'exif-exposureprogram-7' => 'Портретен режим (за крупни кадри со неоцтра позадина)',
'exif-exposureprogram-8' => 'Пејсажен режим (за слики на пејсажи со остра позадина)',

'exif-subjectdistance-value' => '$1 метри',

'exif-meteringmode-0'   => 'Непознато',
'exif-meteringmode-1'   => 'Просек',
'exif-meteringmode-2'   => 'Просек со тежиште на средина',
'exif-meteringmode-3'   => 'Точка',
'exif-meteringmode-4'   => 'Повеќе точки',
'exif-meteringmode-5'   => 'Матричен',
'exif-meteringmode-6'   => 'Делумен',
'exif-meteringmode-255' => 'Друго',

'exif-lightsource-0'   => 'Непознато',
'exif-lightsource-1'   => 'Дневна светлина',
'exif-lightsource-2'   => 'Флуоресцентно',
'exif-lightsource-3'   => 'Волфрам (светло)',
'exif-lightsource-4'   => 'Блиц',
'exif-lightsource-9'   => 'Убаво време',
'exif-lightsource-10'  => 'Облачно време',
'exif-lightsource-11'  => 'Сенка',
'exif-lightsource-12'  => 'Флуоресцентна светлина (D 5700 – 7100K)',
'exif-lightsource-13'  => 'Флуоресцентна светлина (N 4600 – 5400K)',
'exif-lightsource-14'  => 'Флуоресцентна светлина (W 3900 – 4500K)',
'exif-lightsource-15'  => 'Бела флуоресцентност (WW 3200 – 3700K)',
'exif-lightsource-17'  => 'Стандардна светлина A',
'exif-lightsource-18'  => 'Стандардна светлина B',
'exif-lightsource-19'  => 'Стандардна светлина C',
'exif-lightsource-24'  => 'ISO студиски волфрам',
'exif-lightsource-255' => 'Друг светлосен извор',

'exif-focalplaneresolutionunit-2' => 'инчи',

'exif-sensingmethod-1' => 'Недефинирано',
'exif-sensingmethod-2' => 'Еднокристален матричен сензор',
'exif-sensingmethod-3' => 'Двокристален матричен сензор',
'exif-sensingmethod-4' => 'Трокристален матричен сензор',
'exif-sensingmethod-5' => 'Секвенцијален матричен сензор',
'exif-sensingmethod-7' => 'Тробоен линеарен сензор',
'exif-sensingmethod-8' => 'Секвенцијален линеарен сензор',

'exif-filesource-3' => 'Дигитален фотоапарат',

'exif-scenetype-1' => 'Директно фотографирана слика',

'exif-customrendered-0' => 'Нормален процес',
'exif-customrendered-1' => 'Нестандарден процес',

'exif-exposuremode-0' => 'Автоматска експозиција',
'exif-exposuremode-1' => 'Рачна експозиција',
'exif-exposuremode-2' => 'Автоматски со зададен распон',

'exif-whitebalance-0' => 'Автоматски',
'exif-whitebalance-1' => 'Рачно',

'exif-scenecapturetype-0' => 'Стандардно',
'exif-scenecapturetype-1' => 'Пејсаж',
'exif-scenecapturetype-2' => 'Портрет',
'exif-scenecapturetype-3' => 'Ноќна сцена',

'exif-gaincontrol-0' => 'Нема',
'exif-gaincontrol-1' => 'Мало зголемување',
'exif-gaincontrol-2' => 'Големо зголемување',
'exif-gaincontrol-3' => 'Мало смалување',
'exif-gaincontrol-4' => 'Големо смалување',

'exif-contrast-0' => 'Нормално',
'exif-contrast-1' => 'Меко',
'exif-contrast-2' => 'Грубо',

'exif-saturation-0' => 'Нормално',
'exif-saturation-1' => 'Ниска сатурација',
'exif-saturation-2' => 'Висока сатурација',

'exif-sharpness-0' => 'Нормално',
'exif-sharpness-1' => 'Меко',
'exif-sharpness-2' => 'Тврдо',

'exif-subjectdistancerange-0' => 'Непознато',
'exif-subjectdistancerange-1' => 'Крупен кадар (макро)',
'exif-subjectdistancerange-2' => 'Близок кадар',
'exif-subjectdistancerange-3' => 'Далечен кадар',

# Pseudotags used for GPSLatitudeRef and GPSDestLatitudeRef
'exif-gpslatitude-n' => 'Север',
'exif-gpslatitude-s' => 'Југ',

# Pseudotags used for GPSLongitudeRef and GPSDestLongitudeRef
'exif-gpslongitude-e' => 'Исток',
'exif-gpslongitude-w' => 'Запад',

'exif-gpsstatus-a' => 'Мерење во тек',
'exif-gpsstatus-v' => 'Подготвен за пренос',

'exif-gpsmeasuremode-2' => 'Дводимензионално мерење',
'exif-gpsmeasuremode-3' => 'Тродимензионално мерење',

# Pseudotags used for GPSSpeedRef and GPSDestDistanceRef
'exif-gpsspeed-k' => 'Километри на час',
'exif-gpsspeed-m' => 'Милји на час',
'exif-gpsspeed-n' => 'Јазли',

# Pseudotags used for GPSTrackRef, GPSImgDirectionRef and GPSDestBearingRef
'exif-gpsdirection-t' => 'Вистински правец',
'exif-gpsdirection-m' => 'Магнетен правец',

# External editor support
'edit-externally'      => 'Уреди ја оваа податотека со надворешна апликација',
'edit-externally-help' => 'Видете [http://www.mediawiki.org/wiki/Manual:External_editors setup instructions] за повеќе информации.',

# 'all' in various places, this might be different for inflected languages
'recentchangesall' => 'сите',
'imagelistall'     => 'сите',
'watchlistall2'    => 'сите',
'namespacesall'    => 'сите',
'monthsall'        => 'сите',

# E-mail address confirmation
'confirmemail'            => 'Потврди е-поштенска адреса',
'confirmemail_noemail'    => 'Немате наведено валидна е-поштенска адреса во вашите [[Special:Preferences|нагодувања]].',
'confirmemail_text'       => '{{SITENAME}} бара да ја потврдите вашата е-поштенска адреса пред да ги користите можностите за е-пошта.
Притиснете на копчето подолу за да пратите потврдувачка порака на вашата адреса.
Во оваа порака е вклучена врска којашто содржи код;
отворете ја врската во вашиот прелистувач за да потврдите дека вашата е-поштенска адреса е важечка.',
'confirmemail_send'       => 'Прати код за потврда',
'confirmemail_sent'       => 'Пораката за потврда е пратена.',
'confirmemail_oncreate'   => 'Код за потврда е пратен на вашата е-поштенска адреса.
Овој код не е потребен за најавување, но ќе треба да го внесете пред да
ги вклучите е-поштенските можности во викито.',
'confirmemail_sendfailed' => 'Не можеше да се прати пораката за потврда.
Проверете дали адресата содржи неважечки знаци.

Испраќачот врати: $1',
'confirmemail_invalid'    => 'Неточен код за потврда. Кодот можеби е истечен.',
'confirmemail_needlogin'  => 'Морате да $1 за да ја потврдите вашата е-поштенска адреса.',
'confirmemail_success'    => 'Вашата е-поштенска адреса сега е потврдена. Можете да се најавите и да уживате во викито.',
'confirmemail_loggedin'   => 'Вашата е-поштенска адреса сега е потврдена.',
'confirmemail_error'      => 'Нешто тргна наопаку при снимањето на вашата потврда.',
'confirmemail_subject'    => '{{SITENAME}} потврда за е-поштенска адреса',
'confirmemail_body'       => 'Некој, веројатно вие, од IP адресата $1,
ја регистрирал сметката „$2“ со оваа е-поштенска адреса на {{SITENAME}}.

За да потврдите дека оваа сметка навистина ви припаѓа вам и да ја активирате
можноста за е-пошта на {{SITENAME}}, отворете ја оваа врска во вашиот пребарувач:

$3

Ако *не* сте ја регистрирале сметката вие, следете ја оваа врска
за да го откажете потврдувањето на е-поштенската адреса:

$5

Овој код за потврда ќе истече на $4.',

# Scary transclusion
'scarytranscludedisabled' => '[Интервики вклучувањето е оневозможено]',
'scarytranscludefailed'   => '[Преземањето на шаблонот за $1 не успеа]',
'scarytranscludetoolong'  => '[Адресата е предолга; жалиме]',

# Trackbacks
'trackbackbox'      => '<div id="mw_trackbacks">
Враќања за оваа статија:<br />
$1
</div>',
'trackbackremove'   => ' ([$1 Бришење])',
'trackbacklink'     => 'Враќање',
'trackbackdeleteok' => 'Враќањето беше успешно избришано.',

# Delete conflict
'deletedwhileediting' => 'Предупредување: Оваа страница беше избришана откако почнавте со уредување!',
'confirmrecreate'     => "Корисникот [[User:$1|$1]] ([[User talk:$1|talk]]) ја избриша оваа статија откако почнавте да ја уредувате заради:
: ''$2''
Потврдете дека навистина сакате повторно да ја креирате оваа статија.",
'recreate'            => 'Повторно направи',

'unit-pixel' => 'п',

# HTML dump
'redirectingto' => 'Пренасочувам на [[:$1]]...',

# action=purge
'confirm_purge'        => 'Да се исчисти кешот на оваа страница?

$1',
'confirm_purge_button' => 'Да',

# AJAX search
'searchcontaining' => "Барам статии што содржат ''$1''.",
'searchnamed'      => "Статии со име: ''$1''.",
'articletitles'    => "Статии кои почнуваат со ''$1''",
'hideresults'      => 'Сокриј резултати',

# Multipage image navigation
'imgmultipageprev' => '&larr; претходна страница',
'imgmultipagenext' => 'следна страница &rarr;',
'imgmultigo'       => 'Оди!',
'imgmultigoto'     => 'Оди на страница $1',

# Table pager
'ascending_abbrev'         => 'раст',
'descending_abbrev'        => 'опаѓ',
'table_pager_next'         => 'Следна страница',
'table_pager_prev'         => 'Претходна страница',
'table_pager_first'        => 'Прва страница',
'table_pager_last'         => 'Последна страница',
'table_pager_limit'        => 'Прикажи $1 записи по страница',
'table_pager_limit_submit' => 'Оди',
'table_pager_empty'        => 'Нема резултати',

# Auto-summaries
'autosumm-blank'   => 'Ја бришам целата содржина на страницата',
'autosumm-replace' => "Ја заменувам страницата со '$1'",
'autoredircomment' => 'Пренасочување кон [[$1]]',
'autosumm-new'     => 'Нова страница: $1',

# Size units
'size-bytes'     => '$1 B',
'size-kilobytes' => '$1 KB',
'size-megabytes' => '$1 MB',
'size-gigabytes' => '$1 GB',

# Live preview
'livepreview-loading' => 'Се вчитува…',
'livepreview-ready'   => 'Се вчитува… готово!',
'livepreview-failed'  => 'Неуспешно прегледување!
Пробајте со нормален преглед.',
'livepreview-error'   => 'Неуспешно поврзување: $1 "$2"
Пробај со нормален преглед.',

# Friendlier slave lag warnings
'lag-warn-normal' => 'Промените во {{PLURAL:$1|последната секунда|$1 последни секунди}} можеби нема да бидат прикажани во листата.',
'lag-warn-high'   => 'Поради преоптовареност на податочниот сервер, промените понови од $1 {{PLURAL:$1|секунда|секунди}}
можеби нема да бидат прикажани во листата.',

# Watchlist editor
'watchlistedit-numitems'       => 'Вашата листа на набљудувања содржи {{PLURAL:$1|еден наслов|$1 наслови}}, без страниците за разговор.',
'watchlistedit-noitems'        => 'Вашата листа на набљудувања не содржи ниту еден наслов.',
'watchlistedit-normal-title'   => 'Уредување на листа на набљудувања',
'watchlistedit-normal-legend'  => 'Бришење на наслови од листа на набљудување',
'watchlistedit-normal-explain' => "Насловите во вашата листа на набљудувања се прикажани подолу.
За бришење на наслов, маркирајте го квадратчето лево од насловот, и кликнете на копчето '''Бриши Налов'''.
Исто така можете да ја ажурирате листата со [[Special:Watchlist/raw|напредно уредување на листата]].",
'watchlistedit-normal-submit'  => 'Бриши Наслови',
'watchlistedit-normal-done'    => '{{PLURAL:$1|1 наслов беше|$1 наслови беа}} избришани од вашата листа на набљудувања:',
'watchlistedit-raw-title'      => 'Напредно уредување на листата на набљудувања',
'watchlistedit-raw-legend'     => 'Уредување на листа на набљудувања',
'watchlistedit-raw-explain'    => 'Насловите во вашата листа на набљудувања се прикажани подолу, може да се уредува со додавање или бришење на наслови од листата; еден наслов во линија. Кога ќе завршите, кликнете на Ажурирај. 
Исто така за ова може да [[Special:Watchlist/edit|користите стандарден уредувач на текст]].',
'watchlistedit-raw-titles'     => 'Наслови:',
'watchlistedit-raw-submit'     => 'Ажурирај',
'watchlistedit-raw-done'       => 'Вашата листа на набљудувања ќе биде ажурирана.',
'watchlistedit-raw-added'      => '{{PLURAL:$1|1 наслов беше|$1 наслови беа}} додадени:',
'watchlistedit-raw-removed'    => '{{PLURAL:$1|1 наслов беше избришан|$1 наслови беа избришани}}:',

# Watchlist editing tools
'watchlisttools-view' => 'Погледни релевантни промени',
'watchlisttools-edit' => 'Погледни и уреди листа на набљудувања',
'watchlisttools-raw'  => 'Напредно уредување на листа на набљудувања',

# Iranian month names
'iranian-calendar-m1' => 'Farvardin',

# Special:Version
'version'                  => 'Верзија', # Not used as normal message but as header for the special page itself
'version-version'          => 'Верзија',
'version-license'          => 'Лиценца',
'version-software'         => 'Инсталиран софтвер',
'version-software-product' => 'Производ',
'version-software-version' => 'Верзија',

# Special:FilePath
'filepath'         => 'Патека до податотека',
'filepath-page'    => 'Податотека:',
'filepath-submit'  => 'Пат',
'filepath-summary' => 'Оваа специјална страница го враќа целосниот пат на податотеката.
Сликите се прикажани во оригинална големина, другите типови на податотеки се отвораат со соодветно асоцираните програми, директно.

Внесете го името на податотеката без префиксот "{{ns:image}}:".',

# Special:FileDuplicateSearch
'fileduplicatesearch'          => 'Барање на дупликат податотеки',
'fileduplicatesearch-summary'  => 'Пребарување на дуплирани податотеки врз база на нивната hash вредност.

Внесете име на податотека без префиксот "{{ns:image}}:".',
'fileduplicatesearch-legend'   => 'Барање на дупликат',
'fileduplicatesearch-filename' => 'Име на податотека:',
'fileduplicatesearch-submit'   => 'Барај',
'fileduplicatesearch-info'     => '$1 × $2 пиксели<br />Големина на податотека: $3<br />MIME тип: $4',
'fileduplicatesearch-result-1' => 'Податотеката "$1" нема идентичен дупликат.',
'fileduplicatesearch-result-n' => 'Податотеката "$1" има {{PLURAL:$2|еден идентичен дупликат|$2 идентични дупликати}}.',

# Special:SpecialPages
'specialpages'                   => 'Специјални страници',
'specialpages-note'              => '----
* Нормални специјални страници.
* <span class="mw-specialpagerestricted">Специјални страници со ограничен пристап.</span>',
'specialpages-group-maintenance' => 'Извештаи за одржување на википедија',
'specialpages-group-other'       => 'Други специјални страници',
'specialpages-group-login'       => 'Најавување',
'specialpages-group-changes'     => 'Скорешни промени и дневници',
'specialpages-group-media'       => 'Извештаи за мултимедијални содржини и подигнувања',
'specialpages-group-users'       => 'Корнисници и кориснички права',
'specialpages-group-highuse'     => 'Најкористени страници',
'specialpages-group-pages'       => 'Листа на страници',

);
