<?php
/** Yakut (Саха тыла)
 *
 * @ingroup Language
 * @file
 *
 * @author Bert Jickty
 * @author HalanTul
 */

$messages = array(
# User preference toggles
'tog-underline'               => 'Бу ыйынньыктары бэлиэтээ:',
'tog-highlightbroken'         => 'Кураанах ыйынньыктары <a href="" class="new">маннык</a> (эбэтэр: маннык<a href="" class="internal">?</a>) көрдөр.',
'tog-justify'                 => 'Сирэй кэтитинэн тарҕат',
'tog-hideminor'               => 'Кыра көннөрүүлэри көрдөрбөккө',
'tog-extendwatchlist'         => 'Кэтээһин тупсарыллыбыт испииһэгэ',
'tog-usenewrc'                => 'Саҥа уларытыылар тупсарыллыбыт испииһэктэрэ (JavaScript)',
'tog-numberheadings'          => 'Бас тыллары нүөмэрдээ',
'tog-showtoolbar'             => 'Көннөрүү үстүрүмүөннэрин көрдөр (JavaScript)',
'tog-editondblclick'          => 'Хоһулатан иккитэ баттаан сирэйи уларытыы (JavaScript)',
'tog-editsection'             => '[Көннөрүү] диэн ыйынньыгынан сиэксийэны көннөрүү',
'tog-editsectiononrightclick' => 'Сиэксийэ баһыгар уҥа тимэҕинэн<br />баттаан сиэксийэни көннөрүү (JavaScript)',
'tog-showtoc'                 => 'Иһинээҕитин көрдөр (ыстатыйа үстэн ордук бас тыллаах буоллаҕына)',
'tog-rememberpassword'        => 'Ааппын бу компьютерга сигээ',
'tog-editwidth'               => 'Көннөрүү түннүгэ муҥутуур кэтиттээх буоллун',
'tog-watchcreations'          => 'Суруйбут ыстатыйаларбын кэтээн көрүүгэ киллэрэн ис',
'tog-watchdefault'            => 'Уларыппыт сирэйдэрбин кэтээн көрүү испииһэгэр киллэрэн ис',
'tog-watchmoves'              => 'Аатын уларыппыт сирэйдэрбин кэтээн көрүү испииһэгэр киллэрэн ис',
'tog-watchdeletion'           => 'Соппут сирэйдэрбин кэтээн көрүү испииһэгэр киллэрэн ис',
'tog-minordefault'            => 'Уларытыылары атын этиллибэтэҕинэ кыра уларытыы курдук бэлиэтээ',
'tog-previewontop'            => 'Хайдах буоларын уларытар түннүк үрдүнэн (иннигэр) көрдөр',
'tog-previewonfirst'          => 'Хайдах буоларын тута көрдөр',
'tog-nocache'                 => 'Сирэйи кэштыыры боп',
'tog-enotifwatchlistpages'    => 'Кэтиир сирэйдэрим уларыйдахтарына e-mail көмөтүнэн биллэр',
'tog-enotifusertalkpages'     => 'Ырытар сирэйим уларыйдаҕына эл. почтанан биллэр',
'tog-enotifminoredits'        => 'Кыра да уларытыы киирдэҕинэ эл. почтанан биллэр',
'tog-enotifrevealaddr'        => 'Мин почтам аадырыһын биллэриилэргэ көрдөр',
'tog-shownumberswatching'     => 'Сирэйи кэтээн көрөр дьон ахсаанын көрдөр',
'tog-fancysig'                => 'Көннөрү илии баттааһын (ыйынньыга суох)',
'tog-externaleditor'          => 'Атын этиллибэтэҕинэ тас эрэдээктэри туһан (билэр дьоҥҥо аналлаах)',
'tog-externaldiff'            => 'Атын этиллибэтэҕинэ версиялары тэҥниир тас программаны туһан (билэр дьоҥҥо аналлаах)',
'tog-showjumplinks'           => '"Манна бар" ыйынньыктары көрдөр',
'tog-uselivepreview'          => 'Тутатына хайдах буоларын көрүү (JavaScript, тургутуу быһыытынан)',
'tog-forceeditsummary'        => 'Тугу уларыппытым туһунан суруйбатахпына сэрэт',
'tog-watchlisthideown'        => 'Кэтээн көрүү испииһэгэр бэйэм уларытыыларбын көрдөрүмэ',
'tog-watchlisthidebots'       => 'Кэтээн көрүү испииһэгэр робот уларытыытын көрдөрүмэ',
'tog-watchlisthideminor'      => 'Кыра уларытыылары кэтээмэ',
'tog-nolangconversion'        => 'Сурук систематын уларытары боп',
'tog-ccmeonemails'            => 'Атын кыттааччыларга суруйбут суруктарбын бэйэбэр эмиэ ыыт',
'tog-diffonly'                => 'Икки версияны тэҥнииргэ сирэй иһин көрдөрүмэ',
'tog-showhiddencats'          => 'Кистэммит категориялары көрдөр',

'underline-always'  => 'Куруук',
'underline-never'   => 'Хаһан да',
'underline-default' => 'Браузер настройкатынан',

'skinpreview' => '(Хайдах буолара)',

# Dates
'sunday'        => 'Өрөбүл',
'monday'        => 'Бэнидиэнньик',
'tuesday'       => 'Оптуорунньук',
'wednesday'     => 'Сэрэдэ',
'thursday'      => 'Чэппиэр',
'friday'        => 'Бээтинсэ',
'saturday'      => 'Субуота',
'sun'           => 'Өрө',
'mon'           => 'Бэн',
'tue'           => 'Опт',
'wed'           => 'Сэр',
'thu'           => 'Чэп',
'fri'           => 'Бэт',
'sat'           => 'Суб',
'january'       => 'Тохсунньу',
'february'      => 'Олунньу',
'march'         => 'Кулун тутар',
'april'         => 'Муус устар',
'may_long'      => 'Ыам ыйа',
'june'          => 'Бэс ыйа',
'july'          => 'От ыйа',
'august'        => 'Атырдьах ыйа',
'september'     => 'Балаҕан ыйа',
'october'       => 'Алтынньы',
'november'      => 'Сэтинньи',
'december'      => 'Ахсынньы',
'january-gen'   => 'Тохсунньу',
'february-gen'  => 'Олунньу',
'march-gen'     => 'Кулун тутар',
'april-gen'     => 'Муус устар',
'may-gen'       => 'Ыам ыйын',
'june-gen'      => 'Бэс ыйын',
'july-gen'      => 'От ыйын',
'august-gen'    => 'Атырдьах ыйын',
'september-gen' => 'Балаҕан ыйын',
'october-gen'   => 'Алтынньы',
'november-gen'  => 'Сэтинньи',
'december-gen'  => 'Ахсынньы',
'jan'           => 'Тхс',
'feb'           => 'Олн',
'mar'           => 'Клн',
'apr'           => 'МсУ',
'may'           => 'Ыам',
'jun'           => 'Бэс',
'jul'           => 'ОтЫ',
'aug'           => 'Атр',
'sep'           => 'Блҕ',
'oct'           => 'Алт',
'nov'           => 'Сэт',
'dec'           => 'Ахс',

# Categories related messages
'pagecategories'                 => '{{PLURAL:$1|Категория|Категориялар}}',
'category_header'                => '"$1" категория ыстатыйалара',
'subcategories'                  => 'Субкатегориялар',
'category-media-header'          => '"$1" категория билэлэрэ',
'category-empty'                 => "''Бу категорияҕа билигин туох да суох.''",
'hidden-categories'              => '{{PLURAL:$1|Кистэммит категория|Кистэммит категориялар}}',
'hidden-category-category'       => 'Кистэммит категориялар', # Name of the category where hidden categories will be listed
'category-subcat-count'          => '{{PLURAL:$2|Бу категория манна көстүбүт субкатегориялаах.|$2 категорияттан {{PLURAL:$1|субкатегорията|$1 субкатегориялара}} көрдөрүлүннүлэр.}}',
'category-subcat-count-limited'  => 'Бу категория {{PLURAL:$1|субкатегориялаах|$1 субкатегориялардаах}}.',
'category-article-count'         => '{{PLURAL:$2|Бу категория манна эрэ көстүбүт субкатегориялаах.|$2 категорияттан {{PLURAL:$1|субкатегорията|$1 субкатегориялара}} көрдөрүлүннүлэр.}}',
'category-article-count-limited' => 'Бу категорияҕа $1 сирэй баар.',
'category-file-count'            => '{{PLURAL:$2|Бу категория манна эрэ көстүбүт билэлээх.|$2 категорияттан {{PLURAL:$1|билэтэ|$1 билэлэрэ}} көрдөрүлүннүлэр.}}',
'category-file-count-limited'    => 'Бу категорияҕа  {{PLURAL:$1|биир билэ|$1 билэ}} баар.',
'listingcontinuesabbrev'         => '(салгыыта)',

'mainpagetext'      => "<big>'''«MediaWiki» сөпкө туруорулунна.'''</big>",
'mainpagedocfooter' => 'Биики программатын туһунан [http://meta.wikimedia.org/wiki/Help:Contents справочникка] көрүөххүн сөп.

== Саҕаланыыта ==

* [http://www.mediawiki.org/wiki/Manual:Configuration_settings Конфигурация уларытыытын параметрдара]
* [http://www.mediawiki.org/wiki/Manual:FAQ MediaWiki FAQ]
* [http://lists.wikimedia.org/mailman/listinfo/mediawiki-announce MediaWiki релизтарын почтовай испииһэгэ]',

'about'          => 'Бу туһунан',
'article'        => 'Ыстатыйа',
'newwindow'      => '(атын түннүккэ арыллар)',
'cancel'         => 'Алҕас',
'qbfind'         => 'Бул',
'qbbrowse'       => 'Көр',
'qbedit'         => 'Уларыт',
'qbpageoptions'  => 'Бу сирэй',
'qbpageinfo'     => 'Ис хоһооно',
'qbmyoptions'    => 'Мин сирэйдэрим',
'qbspecialpages' => 'Аналлаах сирэйдэр',
'moredotdotdot'  => 'Өссө...',
'mypage'         => 'Бэйэм туспунан',
'mytalk'         => 'Кэпсэтэр сирим',
'anontalk'       => 'Бу IP-га ырытыы',
'navigation'     => 'Навигация',
'and'            => 'уонна',

# Metadata in edit box
'metadata_help' => 'Мета дааннайдар:',

'errorpagetitle'    => 'Сыыһа',
'returnto'          => 'Төттөрү $1 сирэйгэ.',
'tagline'           => '{{SITENAME}} диэн сиртэн ылыллыбыт',
'help'              => 'Көмө',
'search'            => 'Көрдөөһүн',
'searchbutton'      => 'Бул',
'go'                => 'Бар',
'searcharticle'     => 'Көрдөр',
'history'           => 'Историята',
'history_short'     => 'История',
'updatedmarker'     => 'Кэнники киириим кэнниттэн уларыйыылар',
'info_short'        => 'Информация',
'printableversion'  => 'Бэчээттииргэ анаан көрүү',
'permalink'         => 'Куруук баар ыйынньык',
'print'             => 'Бэчээттээ',
'edit'              => 'Уларыт',
'create'            => 'Саҥаны айыы',
'editthispage'      => 'Бу сирэйи уларыт',
'create-this-page'  => 'Бу сирэйи ай',
'delete'            => 'Соттор',
'deletethispage'    => 'Бу сирэйи соттор',
'undelete_short'    => 'Төттөрү аҕал {{PLURAL:$1|биир уларытыыны|$1 уларытыылары}}',
'protect'           => 'Уларыппат гын',
'protect_change'    => 'уларытыы',
'protectthispage'   => 'Бу сирэйи уларыппат гын',
'unprotect'         => 'уларытары көҥүллээ',
'unprotectthispage' => 'Бу сирэйи уларытары көҥүллээ',
'newpage'           => 'Саҥа сирэй',
'talkpage'          => 'Бу сирэйи ырыт',
'talkpagelinktext'  => 'Ырытыы',
'specialpage'       => 'Анал сирэй',
'personaltools'     => 'Тус бэйэ туттар туруоруулара',
'postcomment'       => 'Ырытыыга сурук',
'articlepage'       => 'Ыстатыйаны көр',
'talk'              => 'Ырытыы',
'views'             => 'Көрүүлэр',
'toolbox'           => 'Үнүстүрүмүөннэр',
'userpage'          => 'Кыттааччы туһунан сирэй',
'projectpage'       => 'Бырайыак сирэйэ',
'imagepage'         => 'Медиа-билэ сирэйэ',
'mediawikipage'     => 'Сурук сирэйэ',
'templatepage'      => 'Халыып сирэйэ',
'viewhelppage'      => 'Көмө сирэйэ',
'categorypage'      => 'Категория сирэйэ',
'viewtalkpage'      => 'Ырытыы',
'otherlanguages'    => 'Атын омук тылынан',
'redirectedfrom'    => '(Мантан: $1  көстө)',
'redirectpagesub'   => 'Утаарар сирэй',
'lastmodifiedat'    => 'Бу сирэй бүтэһигин $2, $1 уларыйбыта.', # $1 date, $2 time
'viewcount'         => 'Бу сирэй {{PLURAL:$1|биирдэ|$1 төгүл}} көрүллүбүт.',
'protectedpage'     => 'Уларытыллыбат сирэй',
'jumpto'            => 'Манна көс:',
'jumptonavigation'  => 'навигация',
'jumptosearch'      => 'көрдөөһүн',

# All link text and link target definitions of links into project namespace that get used by other message strings, with the exception of user group pages (see grouppage) and the disambiguation template definition (see disambiguations).
'aboutsite'            => '{{SITENAME}} туһунан',
'aboutpage'            => 'Project:туһунан',
'bugreports'           => 'Сыыһалар тустарынан хобо',
'bugreportspage'       => 'Project:сыыһаларын туһунан хобо',
'copyright'            => 'Маны туһанары $1 көҥүллүүр.',
'copyrightpagename'    => '{{SITENAME}} бас билиитэ',
'copyrightpage'        => '{{ns:project}}:бас билиитэ',
'currentevents'        => 'Оҥоһулла турар дьайыылар',
'currentevents-url'    => 'Project:Оҥоһулла турааччылар',
'disclaimers'          => 'Бүк охсунуу',
'disclaimerpage'       => 'Project:Бүк охсунуу',
'edithelp'             => 'Уларытааччыларга көмө',
'edithelppage'         => 'Help:Уларытарга көмө',
'faqpage'              => 'Project:FAQ',
'helppage'             => 'Help:Көмө',
'mainpage'             => 'Сүрүн сирэй',
'mainpage-description' => 'Сүрүн сирэй',
'policy-url'           => 'Project:Сиэрэ',
'portal'               => 'Түмсүү сирэ',
'portal-url'           => 'Project:Кистээһин сиэрэ',
'privacy'              => 'Кистээһин сиэрэ',
'privacypage'          => 'Project:Кистээһин сиэрэ',

'badaccess'        => 'Сатаан киирбэтэ',
'badaccess-group0' => 'Эн бу дьайыыны оҥорор кыаҕыҥ суох.',
'badaccess-group1' => '$1 бөлөх кыттыылаахтара бу дьайыыга хааччахтаахтар',
'badaccess-group2' => '$1 бөлөхтөртөн биирдэстэрин кыттааччыларыгар бу дьайыы хааччахтаах .',
'badaccess-groups' => '$1 бөлөхтөртөн биирдэстэрин кыттааччыларыгар бу дьайыы хааччахтаах',

'versionrequired'     => 'MediaWiki $1 -с биэрсийэтэ наада',
'versionrequiredtext' => 'Бу сирэйи туттарга MediaWiki $1 -с биэрсийэтэ наада. [[Special:Version|version page]] көр.',

'ok'                      => 'Сөп',
'retrievedfrom'           => '"$1" -н кэллэ',
'youhavenewmessages'      => '$1 ($2) кэллэ',
'newmessageslink'         => 'саҥа суруктар',
'newmessagesdifflink'     => 'кэлиҥҥи уларытыы',
'youhavenewmessagesmulti' => '$1, саҥа суруктар кэллилэр',
'editsection'             => 'уларыт',
'editold'                 => 'уларыт',
'viewsourceold'           => 'исходнигын көрүү',
'editsectionhint'         => '$1 секцияны уларыт',
'toc'                     => 'Ис хоһооно',
'showtoc'                 => 'көрдөр',
'hidetoc'                 => 'көрдөрүмэ',
'thisisdeleted'           => '$1 көрдөрөбүн эбэтэр хостуубун дуу?',
'viewdeleted'             => '$1 көрдөрөбүн?',
'restorelink'             => '{{PLURAL:$1|биир сотторуллубут көннөрүү|$1 сотторуллубут көннөрүүлэр}}',
'feedlinks'               => 'Маннык:',
'feed-invalid'            => 'Суруттарыыга анаммыт ханаал сыыһа тииптээх.',
'feed-unavailable'        => 'Манна синдикация лиэнтэлэрэ туттуллубаттар',
'site-rss-feed'           => '$1 RSS биэрии',
'site-atom-feed'          => '$1 Atom биэрии',
'page-rss-feed'           => '"$1" RSS биэрии',
'page-atom-feed'          => '"$1" Atom биэрии',
'red-link-title'          => '$1 (өссө сурулла илик)',

# Short words for each namespace, by default used in the namespace tab in monobook
'nstab-main'      => 'Ыстатыйа',
'nstab-user'      => 'Кыттааччы',
'nstab-media'     => 'Мэлдьимиэдийэ',
'nstab-special'   => 'Аналлаах сирэй',
'nstab-project'   => 'Бырайыак туһунан',
'nstab-image'     => 'Билэ',
'nstab-mediawiki' => 'Сурук',
'nstab-template'  => 'Халыып',
'nstab-help'      => 'Көмө',
'nstab-category'  => 'Категория',

# Main script and global functions
'nosuchaction'      => 'Маннык дьайыы суох',
'nosuchactiontext'  => 'Бу URL-га баар дьайыыны биики бырагырааммата кыайан аахпата',
'nosuchspecialpage' => 'Маннык анал сирэй суох',
'nospecialpagetext' => 'Аналлаах сирэйи сыыһа көрдөөтүҥ,  [[Special:SpecialPages|манна]] аналлаах сирэйдэр испииһэктэрин булуоххун сөп.',

# General errors
'error'                => 'Алҕас',
'databaseerror'        => 'Билии олоҕор сыыһа',
'dberrortext'          => 'Билии олоҕор ыйытык синтаксиһа сыыһа.
Бырагырааммаҕар баар сыыһаны көрдөрүөн сөп.
Бүтэһик билии олоҕор ыйытык:
<blockquote><tt>$1</tt></blockquote>
(бу пуунсуйаттан тахсыбыт "<tt>$2</tt>").
MySQL маннык сыыһаны төнүннэрдэ "<tt>$3: $4</tt>".',
'dberrortextcl'        => 'Билии олоҕор ыйытык синтаксиһын сыыһата буолла.
Бүтэһик билии олоҕор ыйытык:
"$1"
"$2" пуунсуйаттан тахсыбыт.
MySQL маннык сыыһаны төнүннэрдэ "$3: $4"',
'noconnect'            => 'Бу биики тиэхникэ моһуогуруутуттан билии олоҕун сиэрбэрин кытта ситимэ быстыбыт.<br />
$1',
'nodb'                 => '$1 билии олоҕун кыайан талбатым',
'cachederror'          => 'Бу көрдөөбүт сирэйиҥ кээскэ быраҕыллыбыт куоппуйата, баҕар эргэрбитэ буолуо.',
'laggedslavemode'      => 'Болҕой: Бу сирэй бүтэһик уларытыылара суох буолуон сөп',
'readonly'             => 'Билии олоҕун уларытар бобуллубут',
'enterlockreason'      => 'Уларытыыны бобуу төрүөтүн уонна төһө өр бобулларын ый.',
'readonlytext'         => 'Билии олоҕор билигин саҥа киллэриилэр уонна атын уларытыылар бобуллубуттар, бука былааннаммыт көрүү-истии үлэлэр буолалларыттан.
Ону боппут сүрүннээччи маннык сурук хаалларбыт: $1',
'missing-article'      => 'Көрдөөбүт тиэкиһиҥ манна көстүбэтэ: «$1» $2.

Маннык үксүн сотуллубут сирэй историятыгар тиэрдэр эргэрбит сигэнииттэн тахсааччы. 

Атын биричиинэ дии саныыр буоллаххына бырагыраамма сыыһата буолуон сөп.
Оччоҕо [[Special:ListUsers/sysop|администраатарга]] биллэрэриҥ буоллар (URLын умнаайаҕын).',
'missingarticle-rev'   => '(#-с торум: $1)',
'missingarticle-diff'  => '(Уратыта: $1, $2)',
'readonly_lag'         => 'Билии олоҕун хос сиэрбэрдэрэ сүрүн сиэрбэри кытта мэнэйдэһэр кэмнэригэр билии олоҕо хатанна',
'internalerror'        => 'Ис алҕас (внутренняя ошибка)',
'internalerror_info'   => 'Ис алҕас: $1',
'filecopyerror'        => '"$1" диэн билэ "$2"-а кыайан төгүллэммэт.',
'filerenameerror'      => '"$1" диэн билэ аатын "$2" диэҥҥэ кыайан уларытыллыбат.',
'filedeleteerror'      => '"$1" диэн билэ кыайан сотторуллубат.',
'directorycreateerror' => '"$1" диэн ыйдарыы кыайан оҥоһуллубата.',
'filenotfound'         => '"$1" диэн билэни кыайан булбатым.',
'fileexistserror'      => '"$1" билэ сатаан суруллубата: маннык билэ баар эбит',
'unexpected'           => 'Барсыбат суолталаах: "$1"="$2".',
'formerror'            => 'Сыыһа: халыып кыайан ылыллыбата',
'badarticleerror'      => 'Бу дьайыы бу сирэйгэ кыайан оҥоһуллубат.',
'cannotdelete'         => 'Ыйыллыбыт билэни кыайан сотторботум. (Ким эрэ инники сотторбут буолуон сөп)',
'badtitle'             => 'Табыллыбат аат',
'badtitletext'         => 'Ыйытыллыбыт сирэй аата сыыһа, иччитэх, эбэтэр сыыһа ыйынньыктаах тыллар ыккардыларынааҕы дуу, биикилэр ыккардыларынааҕы дуу аат.',
'perfdisabled'         => 'Бука диэн баалаамаҥ, маны оҥоруу билии олоҕун күүрдэрин иһин билигин бобуллан турар.',
'perfcached'           => 'Бу билии кээстэн ылыллыбыт онон бүтэһик уларыйыылары аахсымыан сөп.',
'perfcachedts'         => 'Бу билии кээстэн ылыллыбыт, бүтэһигин $1 уларыйбыт.',
'querypage-no-updates' => 'Бу сирэй уларыйыыта бобуллан турар. Билиитэ билигин кыайан уларыйбат.',
'wrong_wfQuery_params' => 'wfQuery() сыыһа киллэриилээх<br />
Пуунсуйата: $1<br />
Ыйытыга: $2',
'viewsource'           => 'Көрүү',
'viewsourcefor'        => '$1 сирэй',
'actionthrottled'      => 'Түргэнин хааччахтааһын',
'actionthrottledtext'  => 'Бу дьайыыны кылгас кэм иһигэр элбэхтик оҥорор бобуллар. Бу быраабыла спаамы утары охсуһарга көмөлөһөр. Аҕыйах мүнүүтэннэн өссө боруобалаар.',
'protectedpagetext'    => 'Бу сирэй уларытыллыбат.',
'viewsourcetext'       => 'Эн бу сирэй төрдүн көрүөххүн уонна төгүллүөххүн сөп:',
'protectedinterface'   => 'Бу сирэй бырагыраамма холбуурун хааччыйар, онон моһуогурууттан халытан хатанан турар',
'editinginterface'     => "'''Болҕой:''' Быраҕыраамма тас көстүүтүн (интерфейсын) хааччыйар тиэкиһи уларытаары гынан эрэҕин. Бу сирэйи уларыттаххына атын кыттааччылар көрөллөрүгэр бырагыраамма көстүүтэ уларыйыа. Тылбаастыыр буоллаххына Медиавики бырайыактарын сахалыы тылбааһын [http://translatewiki.net/wiki/Main_Page?setlang=sah Betawiki] туһан.",
'sqlhidden'            => '(SQL ыйытык кистэммит)',
'cascadeprotected'     => 'Бу сирэй уларыйар кыаҕа суох, тоҕо диэтэххэ уларыйара бобуллубут (каскаднай көмүскэл холбоммут) {{PLURAL:$1|сирэй бөлөҕөр|сирэйдэр бөлөхтөрүгэр}} киирэр:
$2',
'namespaceprotected'   => "Эн '''$1''' аат эйгэтигэр киирэр сирэйдэри уларытар кыаҕыҥ суох.",
'customcssjsprotected' => 'Эн бу сирэйи уларытар кыаҕыҥ суох, тоҕо диэтэххэ онтуҥ атын киһи тус бэйэтин туруорууларын таарыйар.',
'ns-specialprotected'  => '{{ns:special}} ааттаах сирэйдэр уларытыллыбаттар.',
'titleprotected'       => "Бу бас тыл оҥоһулларын [[User:$1|$1]] боппут.
Төрүөтэ - ''$2''",

# Virus scanner
'virus-badscanner'     => 'Сатаммата. Вирус сканера биллибэтэ: <i>$1</i>',
'virus-scanfailed'     => 'скан сыыһата (куода $1)',
'virus-unknownscanner' => 'биллибэт антивирус:',

# Login and logout pages
'logouttitle'                => 'Тахсыы',
'logouttext'                 => '<strong>Эн систематтан таҕыстыҥ.</strong> 

{{SITENAME}} саайка билигин ааккынан буолбакка IP-аадырыһынан эрэ көстөҕүн. Аата суох үлэлиэххин сөп, эбэтэр саҥаттан урукку ааккынан дуу, атын аатынан дуу [[Special:UserLogin|киириэххин]] сөп. Сорох сирэйдэр өссө даҕаны эйигин ааккынан көрдөрүөхтэрин сөп, ону суох гыныаххын баҕардаххына интэриниэт көрдөрөөччүҥ кээһин ыраастаа.',
'welcomecreation'            => '== Нөрүөн нөргүй, $1! ==
Эн манна бэлиэтэнниҥ.
[[Special:Preferences|{{SITENAME}} туруорууларын]] бэйэҕэр сөп түбэһэр гына уларытаргын умнума.',
'loginpagetitle'             => 'Аатыҥ',
'yourname'                   => 'Кыттааччы аатыҥ:',
'yourpassword'               => 'Киирии тыла:',
'yourpasswordagain'          => 'Киирии тылгын хатылаа:',
'remembermypassword'         => 'Миигин бу компьютерга сигээ',
'yourdomainname'             => 'Эн дөмүөнүҥ:',
'externaldberror'            => 'Тас киирии билиитин олоҕун сыыһата буолла, эбэтэр тас киирии билииҥ олоҕун саҥардар кыаҕыҥ суох.',
'loginproblem'               => '<span style="color:red">Эн аатыҥ ылыныллыбата.</span> Өссө суруйан көр!',
'login'                      => 'Киир',
'nav-login-createaccount'    => 'Киир / бэлиэтэн',
'loginprompt'                => '{{SITENAME}} саайтыгар киирэргэ «cookies» туттары көҥүллээ.',
'userlogin'                  => 'Киир / бэлиэтэн',
'logout'                     => 'Таҕыс',
'userlogout'                 => 'Таҕыс',
'notloggedin'                => 'Ааккын эппэтиҥ',
'nologin'                    => 'Бэлиэтэнэ иликкин дуо? $1.',
'nologinlink'                => 'Бэлиэтэнии',
'createaccount'              => 'Бэлиэтэнии',
'gotaccount'                 => 'Бэлиэтэммитиҥ дуо? $1.',
'gotaccountlink'             => 'Аатыҥ',
'createaccountmail'          => 'e-mail-ынан',
'badretype'                  => 'Киирии тылларыҥ сөп түбэспэтилэр.',
'userexists'                 => 'Суруйбут аатыҥ бэлиэр баар. 
Атын аатта тал.',
'youremail'                  => 'E-mail-ыҥ:',
'username'                   => 'Бэлиэтэммит аатыҥ:',
'uid'                        => 'Кыттааччы ID-та:',
'prefs-memberingroups'       => 'Бу {{PLURAL:$1|бөлөххө|бөлөхтөргө}} киирэр:',
'yourrealname'               => 'Докумуонунан аатыҥ:',
'yourlanguage'               => 'Омугуҥ тыла:',
'yourvariant'                => 'Барыйаан:',
'yournick'                   => 'Илии баттааһын:',
'badsig'                     => 'Сыыһа илии баттааһын; HTML тиэгтэрин көр.',
'badsiglength'               => 'Наһаа уһун илии баттааһын.
$1 бэлиэттэн (буукубаттан) ордук буолуо суохтаах.',
'email'                      => 'Почта',
'prefs-help-realname'        => 'Сурукка киирбит аатыҥ (булгуччута суох): ким бу сирэйи уларыппытын көрдөрөргө туттуллар',
'loginerror'                 => 'Ааккын система билбэтэ',
'prefs-help-email'           => 'Электроннай аадырыһыҥ булгуччута суох, ол эрээри киирии тылгын умуннаххына санатарга көмөлөһүө.
Эбиитин атын кыттааччылар эйиэхэ бэйэҕин билбэккэ эрэ сурук суруйалларын көҥүллүөххүн сөп.',
'prefs-help-email-required'  => 'E-mail баар буолуохтаах.',
'nocookiesnew'               => 'Маннык ааттаах кыттааччы баар буолла гынан баран, кыайан системаҕа киирбэтиҥ. {{SITENAME}} «cookies» туттар, оттон эн компьютергар ону туһанар бобуллубут. Бука диэн «cookies» холбоо, онтон өссө киирэн көр.',
'nocookieslogin'             => '{{SITENAME}} дьону билэргэ «cookies» туттар. Эн компьютергар «cookies» бобуллубут. Ону холбоон баран өссө киирэн көр.',
'noname'                     => 'Эн тиһилик билэр аатын киллэрбэтэххин.',
'loginsuccesstitle'          => 'Киирдиҥ',
'loginsuccess'               => "'''Билигин бу аатынан үлэлиигин: \"\$1\".'''",
'nosuchuser'                 => 'Маннык - "$1" - ааттаах кыттааччы суох. Аатыҥ сөпкө суруллубутун көр эбэтэр [[Special:Userlogin/signup|саҥаттан киир]].',
'nosuchusershort'            => 'Маннык - "<nowiki>$1</nowiki>" - ааттаах кыттааччы суох. Аатыҥ сөпкө суруллубутун көр.',
'nouserspecified'            => 'Кыттааччы аатын киллэриэхтээххин.',
'wrongpassword'              => 'Киирии тылыҥ сыыһалаах. Өссө киллэрэн көр.',
'wrongpasswordempty'         => 'Киирии тылгын суруйбатаххын. Өссө киирэн көр.',
'passwordtooshort'           => 'Киирии тылыҥ сатаммат бэлиэлэрдээх эбэтэр наһаа кылгас. 
Кырата $1 {{PLURAL:$1|1 бэлиэлээх|$1 бэлиэлээх}} буолуохтаах уонна кыттааччы аатын кытта биир буолуо суохтаах.',
'mailmypassword'             => 'Саҥа киирии тылла ыыттар',
'passwordremindertitle'      => '{{SITENAME}} киирии тылын санатыы',
'passwordremindertext'       => 'Ким эрэ (бадаҕа эн бу IP-аадырыстан: $1), {{SITENAME}} ($4) киирии тылын саҥаттан ыытыҥ диэбит.
"$2" кыттааччы саҥа быстах киирии тыла билигин маннык: "$3".
Өскө эн көрдөөбүт буоллаххына, систиэмэҕэ саҥаттан киирэҥҥин киирии тылгын уларытыаххын наада.

Өскөтүн киирии тылы саҥаттан көрдөөбөтөх буоллаххына, 
эбэтэр урукку киирии тылгын өйдөөн кэлбит буоллаххына, 
бу суругу ааххайыма уонна урукку киирии тылгын салгыы туһан.',
'noemail'                    => '"$1" ааттаах киһиэхэ эл. почтата ыйыллыбатах.',
'passwordsent'               => 'Саҥа киирии тыл "$1" эл. почтатыгар ыытылынна.
Системаҕа саҥа киирии тылы туһанан киир.',
'blocked-mailpassword'       => 'Эн IP аадырыскыттан манна тугу эмэ уларытар бобуллубут,
онон киирии тылы өйдөтөр кыах эмиэ суох.',
'eauthentsent'               => 'Быстах кэмҥэ туттуллар киирии тыл саҥа кыттааччы эл. почтатыгар ыытылынна.
Бу аадырыс эйиэнэ буоларын бигэргэтэргэ өссө тугу гыныахтааҕыҥ туһунан сурукка кэпсэниллэр.',
'throttled-mailpassword'     => 'Киирии тылы өйдөтөр систиэма бүтэһик {{PLURAL:$1|чаас|$1 чаас}} иһигэр туттулла сылдьыбыт. 
Киирии тылы {{PLURAL:$1|чааска|$1 чааска}} биирдэ эрэ ыйытыахха сөп.',
'mailerror'                  => 'Сурук ыытарга алҕас таҕыста: $1',
'acct_creation_throttle_hit' => 'Эн номнуо $1 экаунт оҥорбуккун. Онон өссө оҥорор кыаҕыҥ суох.',
'emailauthenticated'         => 'Эн почтаҥ аадырыһа бу аакка сурулла сылдьар: $1.',
'emailnotauthenticated'      => 'Эл. почтаҥ аадырыһа бигэргэтиллэ илик.
Онон вики-движок эн почтаҕын кытта үлэлиир кыаҕа суох.',
'noemailprefs'               => 'Эл. почтаҥ ыйыллыбатах, онон вики-движок аадырыскын туһанар кыаҕа суох.',
'emailconfirmlink'           => 'Эл. аадырыскын бигэргэтэргэ',
'invalidemailaddress'        => 'Киллэрбит аадырыһыҥ эл. почта аадырыһыгар майгыннаабат.
Сөпкө суруй эбэтэр кураанах хааллар.',
'accountcreated'             => 'Саҥа аат иҥэрилиннэ',
'accountcreatedtext'         => 'Кыттааччы $1 диэн ааттанна.',
'createaccount-title'        => '{{SITENAME}} бырайыакка саҥа аат оҥоруу',
'createaccount-text'         => 'Ким эрэ {{SITENAME}} бырайыакка ($4) саҥа $2 ааты бэлиэтээбит. "$2" киирии тыла "$3". Билигин киирэн киирии тылгын уларытыаххын наада.

Саҥа аат сыыһа оҥоһуллубут буоллаҕына тугу да гыныа суоххун сөп.',
'loginlanguagelabel'         => 'Омугун тыла: $1',

# Password reset dialog
'resetpass'               => 'Киирии тылы саҥаттан киллэр',
'resetpass_announce'      => 'Бу быстах кэмҥэ туттуллар киирии тылынан киирдиҥ. Түмүккэ саҥа киирии тылла суруй:',
'resetpass_text'          => '<!-- Тиэкиһи манна эбэн суруйуҥ -->',
'resetpass_header'        => 'Киирии тылы уларыт',
'resetpass_submit'        => 'Киирии тылы уларыт уонна киир',
'resetpass_success'       => 'Your password has been changed successfully! Now logging you in...
Киирии тылыҥ этэҥҥэ уларыйда. Сотору кэминэн киириэҥ...',
'resetpass_bad_temporary' => 'Быстах кэмҥэ туттуллар киирии тыл эргэрбит. Арааһа саҥа киирии тылы олохтообуккун быһылаах.
Киирии тылы саҥаттан көрдөөн ылыаххын сөп.',
'resetpass_forbidden'     => 'Киирии тылы уларытар сатаммат',
'resetpass_missing'       => 'Формаҕа туох да суох.',

# Edit page toolbar
'bold_sample'     => 'Модьу бичик',
'bold_tip'        => 'Модьу бичик',
'italic_sample'   => 'Иҥнэри бичик',
'italic_tip'      => 'Иҥнэри бичик',
'link_sample'     => 'Ыйынньык баһа',
'link_tip'        => 'Ис ыйынньык',
'extlink_sample'  => 'http://www.example.com ыйынньык баһа',
'extlink_tip'     => 'Тас ыйынньык (http:// префиксы умнума)',
'headline_sample' => 'Бас тыл',
'headline_tip'    => '2-с таһым бас тыла',
'math_sample'     => 'Формуланы манна киллэр',
'math_tip'        => 'Математика формулата (LaTeX)',
'nowiki_sample'   => 'Манна форматтамматах суругу киллэриҥ',
'nowiki_tip'      => 'Биики формаатын билинимэ',
'image_sample'    => 'Холобур.jpg',
'image_tip'       => 'Ойууну олордуу',
'media_sample'    => 'Холобур.ogg',
'media_tip'       => 'Медиа билэҕэ сигэнии',
'sig_tip'         => 'Илии баттааһыныҥ уонна хаһан илии баттаабытыҥ',
'hr_tip'          => 'Туора сурааһын (наһаа элбэхтик туттума)',

# Edit pages
'summary'                          => 'Уларытыыҥ ис хоһооно',
'subject'                          => 'Тиэмэтэ/бас тыла',
'minoredit'                        => 'Бу суолтата суох уларытыы',
'watchthis'                        => 'Бу сирэйи кэтээн көрөргө',
'savearticle'                      => 'Уларытыыны бигэргэтии',
'preview'                          => 'Эрдэ көрүү',
'showpreview'                      => 'Уларытыах иннинэ көрүү',
'showlivepreview'                  => 'Түргэнник эрдэ көрүү',
'showdiff'                         => 'Уларытыылар',
'anoneditwarning'                  => "'''Болҕой:''' Системаҕа киирбэтэххин. Онон аатыҥ оннугар IP аадаырыһыҥ бу сирэй историятыгар киириэ.",
'missingsummary'                   => "'''Санатыы:''' Уларыппытыҥ кылгас быһаарыытын суруйбатаххын. Уларытыыны бигэргэттэххинэ улартытыыҥ хос быһаарыыта суох барыа.",
'missingcommenttext'               => 'Манна хос быһаарыыны суруй.',
'missingcommentheader'             => "'''Санатыы:''' Хос быһаарыы аатын суруйбатаххын. Бигэргэттэххинэ быһаарыыҥ аата суох барыа.",
'summary-preview'                  => 'Хос быһаарыыны көрүү',
'subject-preview'                  => 'Аатын көрүү',
'blockedtitle'                     => 'Кыттааччы уларытар кыаҕа быһылынна',
'blockedtext'                      => "<big>'''Эн аатыҥ эбэтэр IP-аадырыһыҥ бобулуннулар.'''</big>

Боппут киһи $1. 
Төрүөтэ: ''«$2»''.

*Бобуллубут: $8
*Бобуу болдьоҕо: $6
*Бобулунна: $7

Эн $1 диэн киһиэхэ эбэтэр атын [[{{MediaWiki:Grouppage-sysop}}|администраатарга]] суруйан быһаарсыаххын сөп.
Болҕой, өскө регистрацияламматах буоллаххына, эбэтэр эл. аадырыскын [[Special:Preferences|бигэргэппэтэх]] буоллаххына, эбэтэр сурук суруйарыҥ бобуллубут буоллаҕына администраатарга суруйар кыаҕыҥ суох.
Эн IP-аадырыһыҥ — $3, бобуу нүөмэрэ — #$5. 
Ону суруккар киллэрээр.",
'autoblockedtext'                  => "Эн IP-аадырыскын ханнык эрэ бу бырайыакка кыттара бобуллубут киһи туһана сылдьыбыт, онон бу IP-аадырыс бобуулаах. Боппут администраатар ($1) ол төрүөтүн маннык суруйбут:

:''$2''

*Бобуллубут: $8
*Бобуу болдьоҕо: $6
*Бобулунна: $7

Эн $1 диэн киһиэхэ эбэтэр атын [[{{MediaWiki:Grouppage-sysop}}|администраатарга]] сурук суруйан быһаарсыаххын сөп.

Болҕой, өскө регистрацияламматах буоллаххына, эбэтэр эл. аадырыскын [[Special:Preferences|бигэргэппэтэх]]  буоллаххына, эбэтэр сурук суруйарыҥ бобуллубут буоллаҕына администраатарга суруйар кыаҕыҥ суох.

IP-аадырыһыҥ $3, бобуу нүөмэрэ — #$5. 
Ону суруккар киллэрээр.",
'blockednoreason'                  => 'биир да биричиинэ сөп түбэспэт',
'blockedoriginalsource'            => "Манна бу сирэй '''$1''' көрдөрүлүннэ:",
'blockededitsource'                => "Манна '''$1''' сирэйгэ '''эн уларытыыларыҥ''' көрдөрүлүннулэр:",
'whitelistedittitle'               => 'Уларытарга киириэххин наада',
'whitelistedittext'                => 'Улатыаххын баҕарар буоллаххына маны $1 гын.',
'confirmedittitle'                 => 'Эл. почтаҥ аадырыһын бигэргэт',
'confirmedittext'                  => 'Уларытарга эл. почтаҥ аадырыһын бигэргэтиэхтээххин. Бастаан [[Special:Preferences|манна]] киирэн бэйэн ааккын уонна эл. почтаҕын суруй. Онтон эл. аадырыскын бигэргэт.',
'nosuchsectiontitle'               => 'Маннык раздел суох',
'nosuchsectiontext'                => 'Эн эппит сирэйиҥ суох. $1 диэн сирэй суох буолан, уларытыыгын ханна да эбэр кыах суох.',
'loginreqtitle'                    => 'Бэйэҕин билиһиннэр',
'loginreqlink'                     => 'Ааккын эт',
'loginreqpagetext'                 => 'Атын сирэйдэри көрөргө маны оҥоруохтааххын: $1.',
'accmailtitle'                     => 'Киирии тыл ыытылынна.',
'accmailtext'                      => '"$1" киирии тыла манна $2 ыытылынна.',
'newarticle'                       => '(Саҥа ыстатыйа)',
'newarticletext'                   => 'Эн суох сирэйгэ киирэ сатаатыҥ.
Маннык ааттаах саҥа ыстатыйаны оҥорор буоллаххына, аллара баар түннүккэ суруй
(сиһ. [[{{MediaWiki:Helppage}}|көмөнү]] көрүөххүн сөп).
Өскө манна сыыһа киирбит буоллаххына интэриниэтиҥ бырагыраамматын "төнүн" диэххин сөп.',
'anontalkpagetext'                 => "----''Бу аатын эппэтэх кыттааччы ырытар сирэйэ.
IP-аадырыһа эрэ көстөр.
Биир IP-аадырыс хас да киһиэхэ бэриллиэн сөп. Өскө атын киһиэхэ суруллубут суругу алҕас туппут буоллаххына, бэйэҥ [[Special:UserLogin/signup|ааккын билиһиннэр]] эбэтэр [[Special:UserLogin|киир]], оччоҕо кэлин да булкуур тахсыа суоҕа.''",
'noarticletext'                    => 'Билигин бу сирэй кураанах. Бу аат атын ыстатыйалга туттулларын [[Special:Search/{{PAGENAME}}|булуоххутун сөп]] эбэтэр маннык ааттаах [{{fullurl:{{FULLPAGENAME}}|action=edit}} саҥа ыстатыйаны суруйуоххутун] сөп.',
'userpage-userdoesnotexist'        => '"$1" аат бэлиэтэммэтэх. Бу сирэйи оҥорор/уларытар баҕалааххын дуо?',
'clearyourcache'                   => "'''Болҕой - Уларыппыт сирэйгин сөпкө көрөргө интэриниэт бырагыраамматын кээһин ыраастаа.''' '''Mozilla / Firefox / Safari:''' ''Shift'' кнопканы тутан туран ''Reload'' баттаа, эбэтэр ''Ctrl-F5'', ''Ctrl-R'' дуу (Macintosh-ка ''Command-R'') баттаа; '''Konqueror: ''' ''Reload'' ''F5'' эбэтэр баттаа;
'''Opera:''' кээһин ыраастыырга манна ''Tools → Preferences'' киир; '''Internet Explorer:''' ''Ctrl'' тутан туран ''Refresh'' баттаа, эбэтэр ''Ctrl-F5'' баттаа.",
'usercssjsyoucanpreview'           => '<strong>Көмө:</strong> Саҥа css- эбэтэр js-билэни тургутуоххун баҕардаххына эрдэ көрөр тимэҕи баттаа.',
'usercsspreview'                   => "'''Умнума: бу CSS тургутуута эрэ.
Билигин оҥорбутуҥ бигэргэтиллэ илик!'''",
'userjspreview'                    => "'''Умнума: бу JavaScript тургутуутэ эрэ, уларыппытыҥ бигэргэтиллэ илик!'''",
'userinvalidcssjstitle'            => "'''Болҕой:''' Бу тиэмэ «$1» суох. Кыттааччы .css и .js сирэйдэрэ кыра буукубаннан суруллуохтаахтар, холобур «{{ns:user}}:Ньургун/monobook.css», маннык буолуо суохтаах «{{ns:user}}:Ньургун/Monobook.css».",
'updated'                          => '(Саҥардылынна)',
'note'                             => '<strong>Хос быһаарыы:</strong>',
'previewnote'                      => '<strong>Бу көрүү эрэ; уларытыылар бигэргэтиллэ иликтэр!</strong>',
'previewconflict'                  => 'Этот предварительный просмотр отражает текст в верхнем окне редактирования так, как он будет выглядеть, если вы решите записать его.',
'session_fail_preview'             => '<strong>Сиэрбэр сессия идентификаторын сүтэрэн кэбиһэн эн уларытыыгын кыайан киллэрбэтэ.
Өссө холонон көр. 
Олох сатамматаҕына биикиттэн [[Special:UserLogout|тахсан]] баран өссө киирэн көрөөр.</strong>',
'session_fail_preview_html'        => "<strong>Сессия дааннайдарын сүтэрэн кэбиһэн сиэрбэр эн уларытыыгын киллэрбэтэ.</strong>

''{{SITENAME}} ыраас HTML тылы көҥүллүүр буолан JavaScript туһананнар куһаҕаны оҥоруохтарын сөп, онон эрдэ көрдөрүү араарыллыбыт.''

<strong>Өскө бу уларытыы туох да куһаҕаны аҕалыа диэбэт буоллаххына өссө биирдэ боруобалаа. Ол сатамматаҕына [[Special:UserLogout|тахсан баран]] өссө киирэн көрөөр.</strong>",
'token_suffix_mismatch'            => '<strong>Эн уларытыыҥ киирбэтэ, тоҕо диэтэххэ эн бырагырааммаҥ сорох сурук бэлиэлэрин сыыһа көрөр эбит.
Ыстатыйаны буорту гынымаары уларытыыҥ ылыныллыбата.
Итинник сыыһалар үксүн прокси-сиэрбэрдэри туһаннахха тахсааччылар.</strong>',
'editing'                          => 'Уларытыы $1',
'editingsection'                   => 'Уларытыы $1 (раздел)',
'editingcomment'                   => 'Уларытыы $1 (ырытыы)',
'editconflict'                     => 'Уларытыы мөккүөрэ: $1',
'explainconflict'                  => "Ыстатыйаны көннөрө олордоххутуна ким эрэ эмиэ бу ыстатыйаны көннөрбүт.
Үөһээҥи түннүккэ \"Уларытыыны бигэргэт\" тимэҕи баттаатахха киириэхтээх барыл сурулунна.
Алларааҥы түннүккэ эн барылыҥ көстөр.
Бэйэҥ уларытыыгын киллэриэххин баҕарар буоллаххына аллараттан үөһээҥи түннүккэ уларытыыларгын көһөр.
\"Уларытыыны бигэргэт\" баттаатаххына үөһээҥи '''эрэ''' тиэкис хаалыаҕа.",
'yourtext'                         => 'Тиэкиһиҥ',
'storedversion'                    => 'Суруллубут барыл',
'nonunicodebrowser'                => '<strong>СЭРЭТИИ: Интэриниэтиҥ бырагырааммата Юникод кодировканы билиммэт эбит. Ыстатыйаны уларытаргар ASCII-тан атын бэлиэлэр шестнадцатиричнай кодка уларытыллыахтара.</strong>',
'editingold'                       => '<strong>СЭРЭТИИ: Эргэрбит барылы көннөрө олороҕун.
Уларытыыны киллэрдэххинэ кэнники уларытыылар суох буолуохтара.</strong>',
'yourdiff'                         => 'Уратылар',
'copyrightwarning'                 => 'Болҕой, манна оҥоһуллубут эбиилэр уонна уларытыылар $2 лицензиялаахтар (сиһ. маны көр $1). Өскө эн ыстатыйаларыҥ көҥүл тарҕаналларын уонна туһаныллалларын баҕарбат буоллаххына манна суруйума.<br />
Эбиитин манна суруйар матырыйаалгын эбэтэр бэйэҥ суруйуохтааххын, эбэтэр көҥүл туһаныллары уонна көҥүл уларытары көҥүллүүр сиртэн ылбыт буолуохтааххын.
<strong>КИМ ЭРЭ БАС БИЛЭР МАТЫРЫЙААЛЫН КИНИТТЭН КӨҤҮЛЭ СУОХ МАННА УГУМА!</strong>',
'copyrightwarning2'                => 'Болҕой, эн суруйбут матырыйаалгын ким баҕарар уларытар уонна суох гынар бырааптаах. Суруйбуккун уларыталларын сөбүлээбэт буоллаххына манна суруйума.<br />
Эбиитин манна суруйдаххына, уларытыы ааптара мин буолабын, эбэтэр көҥүл туһанары уонна уларытары көҥүллүүр сиртэн ыллым диэн бигэргэтэҕин (маны көр $1).<br /> <strong>КИМ ЭРЭ БАС БИЛИИТИН МАННА КИНИТТЭН КӨҤҮЛЭ СУОХ УГУМА!</strong>',
'longpagewarning'                  => '<strong>СЭРЭТИИ: Бу сирэй ыйааһына $1 килобайт.
Сорох интэриниэт бырагырааммаларыгар 32 КБ ыйааһыҥҥа чугаһыыр сирэйдэр үчүгэйдик көстүбэттэр.
Онон бука диэн бу сирэйи кыра сирэйдэргэ хайытар туһунан толкуйдааҥ.</strong>',
'longpageerror'                    => '<strong>ERROR: The text you have submitted is $1 kilobytes
long, which is longer than the maximum of $2 kilobytes. It cannot be saved.</strong>
<strong>АЛҔАС: Суруйар кэрчиккит $1 килобайт ыйааһыннаах, онтуккут көҥүллэммит $2 килобайты куоһарар. Маннык хаалар кыаҕа суох</strong>',
'readonlywarning'                  => '<strong>СЭРЭТИИ: Сиэрбэргэ техническай үлэ бара турар, онон киллэрбит уларытыыларыҥ тута хаалар кыахтара суох.
Билигин уларытыыгын бэйэҥ диискэҕэр хаалларан баран, кэлин манна уган биэриэххин сөп.</strong>',
'protectedpagewarning'             => '<strong>СЭРЭТИИ:  Бу сирэй хатанан турар, администратордар эрэ уларытар кыахтаахтар.</strong>',
'semiprotectedpagewarning'         => "'''Биллэрии:''' Бу сирэй хатанан турар, ааттарын билиһиннэрбит эрэ кыттааччылар уларытар кыахтаахтар.",
'cascadeprotectedwarning'          => "'''Сэрэтии:''' Бу сирэйи \"админстратордар\" бөлөххө киирэр кыттааччылар эрэ уларытар кыахтаахтар, тоҕо диэтэххэ сирэй маннык каскаднай көмүскэллээх сирэйдэр бөлөхтөрүгэр киирэр:",
'titleprotectedwarning'            => '<strong>СЭРЭТИИ:  Бу сирэйи уларытар бобуллубут, аҕыйах эрэ киһи уларытыан сөп.</strong>',
'templatesused'                    => 'Манна туттуллубут халыыптар:',
'templatesusedpreview'             => 'Манна туттуллубут халыыптар:',
'templatesusedsection'             => 'Манна туттуллубут халыыптар:',
'template-protected'               => '(хатаммыт)',
'template-semiprotected'           => '(хатаммыт аҥардаах)',
'hiddencategories'                 => 'Бу сирэй кистэммит {{PLURAL:$1|1 категорияҕа|$1 категорияларга}} киирэр:',
'edittools'                        => '<!-- Манна суруллубут сурук уларытыы уонна эбии пуормаларын анныгар суруллуо. -->',
'nocreatetitle'                    => 'Сирэй оҥорор хааччахтаммыт',
'nocreatetext'                     => '{{SITENAME}} саайтыгар саҥа сирэйи оҥорор хааччахтанар.
Баар сирэйи уларытыаххын сөп, эбэтэр [[Special:UserLogin|манна  бэлиэтэниэххин эбэтэр атын аатынан киириэххин сөп]].',
'nocreate-loggedin'                => 'Эн саҥа сирэйи оҥорор кыаҕыҥ өссө суох.',
'permissionserrors'                => 'Көҥүллээһин моһуогурда',
'permissionserrorstext'            => 'Маны оҥорор кыаҕыҥ суох, {{PLURAL:$1|төрүтэ|төрүттэрэ}}:',
'permissionserrorstext-withaction' => 'Бу дьайыыны ($2) оҥорор кыаҕыҥ суох.  {{PLURAL:$1|Биричиинэтэ|Биричиинэлэрэ}}:',
'recreate-deleted-warn'            => "'''Болҕой: сотулубут сирэйи төттөрү оҥорон эрэҕин.'''

Толкуйдаан баран оҥор. Аллара сотуулар сурунааллара көрдөрүлүннэ.",

# Parser/template warnings
'expensive-parserfunction-warning'        => 'Болҕой. Бу сирэй наһаа элбэх көмпүүтэри ноҕуруускалыыр ресурсаларга сигэнэр.

Сигэнии ахсаана мантан тахсыа суохтаах - $2, билигин ахсаана - $1.',
'expensive-parserfunction-category'       => 'Көмпүүтэри ноҕуруускалыыр ресурсаларга наһаа элбэхтик сигэнэр сирэйдэр',
'post-expand-template-inclusion-warning'  => 'Болҕой: Киллэрэр халыыптарыҥ ыйааһыннара наһаа улахан.
Онон сорох халыыптар киллэриллиэхтэрэ суоҕа.',
'post-expand-template-inclusion-category' => 'Киллэриллибит халыыптарын ыйааһына сиэри таһынан барбыт сирэйдэр',
'post-expand-template-argument-warning'   => 'Болҕой. Бу сирэйгэ баар халыып биир эбэтэр элбэх наһаа улахан ыйааһыннаах толоруллар аргуменнаах эбит.
Оннук аргуменнар толоруллубатылар.',
'post-expand-template-argument-category'  => 'Толоруллубатах (көтүтүллүбүт) аргуменнаах сирэйдэр',

# "Undo" feature
'undo-success' => 'Правка может быть отменена. Пожалуйста, просмотрите сравнение версий, чтобы убедиться, что это именно те изменения, которые вас интересуют, и нажмите «Записать страницу», чтобы изменения вступили в силу.',
'undo-failure' => 'Уларытыы төннөр кыаҕа суох. Ыккардынааҕы көннөрүүлэр бэйэ бэйэлэригэр сөп түбэспэттэр.',
'undo-norev'   => 'Бу көннөрүү сотуллар кыаҕа суох, тоҕо диэтэххэ ончу суох эбэтэр номнуо сотуллубут.',
'undo-summary' => '[[Special:Contributions/$2|$2]] кыттааччы ([[User talk:$2|ырытыы]] | [[Special:Contributions/$2|{{MediaWiki:Contribslink}}]]) $1 нүөмэрдээх уларытыытын сотон оннугар түһэрэргэ.',

# Account creation failure
'cantcreateaccounttitle' => 'Саҥа ааты киллэрэр сатаммат',
'cantcreateaccount-text' => "[[User:$3|$3]] кыттааччы бу IP-ттан ('''$1''') саҥа бэлиэтэниини бопто.

Быһаарыыта: $3 - ''$2''",

# History pages
'viewpagelogs'        => 'Бу сирэй историятын көрдөр',
'nohistory'           => 'Бу сирэй историята суох эбит.',
'revnotfound'         => 'Уларытыы булуллубата',
'revnotfoundtext'     => 'Бу сирэй урукку барыла булуллубата. Ыйынньыгы сыыһата суох суруйбуккун көр.',
'currentrev'          => 'Билиҥҥи барыл',
'revisionasof'        => '$1 барыл',
'revision-info'       => 'Версия от $1; $2',
'previousrevision'    => '←Инники барыл',
'nextrevision'        => 'Аныгыскы барыл→',
'currentrevisionlink' => 'Билиҥҥи барыл',
'cur'                 => 'бил.',
'next'                => 'аныгыскы',
'last'                => 'бүтэһик',
'page_first'          => 'бастакы',
'page_last'           => 'бүтэһик',
'histlegend'          => 'Тал: торумнары тэҥнииргэ бэлиэтээ. <br />
Легенда: (cur) = билигин баар торумтан атына,
(бүтэһик) = инники баар торумтан атына, М. = улахан суолтата суох көннөрүү.',
'deletedrev'          => '[сотуллубут]',
'histfirst'           => 'Эрдэтээҥи',
'histlast'            => 'Соторутааҥы',
'historysize'         => '($1 байт)',
'historyempty'        => '(кураанах)',

# Revision feed
'history-feed-title'          => 'Уларытыы историята',
'history-feed-description'    => 'Бу сирэй Биикигэ уларыйыытын историята',
'history-feed-item-nocomment' => '$1 манна $2', # user at time
'history-feed-empty'          => 'Көрдүүр сирэйиҥ суох эбит.
Баҕар сотуллубута эбэтэр атын ааттаммыта буолуо.
Манна майгынныыр сирэйдэри [[Special:Search|көрдөөн]] көр.',

# Revision deletion
'rev-deleted-comment'         => '(ырытыы сотулунна)',
'rev-deleted-user'            => '(кыттааччы аата сотулунна)',
'rev-deleted-event'           => '(бэлиэтээһин дьайыыта сотулунна)',
'rev-deleted-text-permission' => '<div class="mw-warning plainlinks"> Ыстатыйа бу торума архыыптан сотуллубут. Быһаарыыта  [{{fullurl:Special:Log/delete|page={{FULLPAGENAMEE}}}} манна] баар буолуон сөп. </div>',
'rev-deleted-text-view'       => '<div class="mw-warning plainlinks">
Ыстатыйа бу торума архыыптан сотуллубут.
Ол эрэн эн администратор буоларыҥ быһыытынан көрүөххүн сөп.
Сотуллубутун быһаарыыта [{{fullurl:{{ns:special}}:Log/delete|page={{PAGENAMEE}}}} манна] баар буолуон сөп.</div>',
'rev-delundel'                => 'көрдөр/кистээ',
'revisiondelete'              => 'Соторго/торуму төнүннэрэргэ',
'revdelete-nooldid-title'     => 'Торум чопчу ыйыллыбата',
'revdelete-nooldid-text'      => 'Бу дьайыыны оҥорорго торуму (торумнары) чуолаан ыйбатаххын, 
эбэтэр торум ончу суох, эбэтэр кистэммит торум.',
'revdelete-selected'          => '[[:$1]] сирэй {{PLURAL:$2|талыллыбыт торума|талыллыбыт торумнара}}:',
'logdelete-selected'          => '{{PLURAL:$1|Сирэй талыллыбыт историята|Сирэй талыллыбыт историялара}}:',
'revdelete-text'              => 'Сотуллубут торумнар сирэй историятыгар киириэхтэрэ,
ол гынан баран сорох торумнар көннөрү киһиэхэ көстүөхтэрэ суоҕа.

{{SITENAME}} администратордара кистэммит суруктары көрөр уонна сотуллубуту төттөрү төннөрөр кыахтаахтар
(эбии хааччахтааһын турбатах буоллаҕына).',
'revdelete-legend'            => 'Хааччахтары туруоруу:',
'revdelete-hide-text'         => 'Сирэй бу торумун кистээ',
'revdelete-hide-name'         => 'Дьайыыны уонна дьайыы сыалын кистээ.',
'revdelete-hide-comment'      => 'Ырытыыны кистээ',
'revdelete-hide-user'         => 'Ааппын/IP-бын көрдөрүмэ',
'revdelete-hide-restricted'   => 'Бу хааччахтааһыннары администраатардарга эмиэ туттарга',
'revdelete-suppress'          => 'Бу суругу администратордартан эмиэ кистээ',
'revdelete-hide-image'        => 'Билэ иһин кистээ',
'revdelete-unsuppress'        => 'Төннөрүллүбүт торумнартан хааччахтааһыны ылан кэбиһэргэ',
'revdelete-log'               => 'Хос быһаарыы:',
'revdelete-submit'            => 'Маны талбыт торуммар тутун',
'revdelete-logentry'          => '[[$1]] сирэй торумун көстүүтэ уларыйда',
'logdelete-logentry'          => '[[$1]] дьайыы көстүүтэ уларыйда',
'revdelete-success'           => "'''Торум көстүүтэ сөпкө уларыйда.'''",
'logdelete-success'           => "'''Дьайыы көстүүтэ сөпкө уларыйда.'''",
'revdel-restore'              => 'Көстүүтүн уларытыы',
'pagehist'                    => 'Историятын сирэйэ',
'deletedhist'                 => 'Сотуллубут история',
'revdelete-content'           => 'иһинээҕитэ',
'revdelete-summary'           => 'уларытыылар туһунан',
'revdelete-uname'             => 'аата',
'revdelete-restricted'        => 'хааччахтааһын администраатардарга сыһыаннаах',
'revdelete-unrestricted'      => 'хааччахтааһын админстраатардартан уһулунна',
'revdelete-hid'               => 'кистэммит $1',
'revdelete-unhid'             => 'аһыллыбыт $1',
'revdelete-log-message'       => '$2 аналлаах $1 {{PLURAL:$2|торум|торумнар}}',
'logdelete-log-message'       => '$2 аналлаах (сыһыаннаах) $1 {{PLURAL:$2|түбэлтэ|түбэлтэлэр}}',

# Suppression log
'suppressionlog'     => 'Кистээһин сурунаала',
'suppressionlogtext' => 'Аллара соторутааҥҥы сотуулар уонна хааччахтааһыннар тиһиктэрэ бэриллэр (администраатардарга көстүбэт сээкэйдэр эмиэ).
Билигин баар хааччахтар тиһиктэрин көрөргө [[Special:IPBlockList|IP хааччахтааһынын тиһигэр]] киир.',

# History merging
'mergehistory'                     => 'Силбэһии сирэйин хронологията',
'mergehistory-header'              => 'Бу сирэй биир ыстатыйа (сирэй) хас да барылын биир саҥа барыл гына оҥорорго аналлаах.
Бу уларытыы сирэй устуоруйатын кэспэтин ситиһиэхтээххин.',
'mergehistory-box'                 => 'Икки сирэй силбэспитин түмүгэ:',
'mergehistory-from'                => 'Бастааҥы сирэй:',
'mergehistory-into'                => 'Оҥоһуллуохтаах сирэй:',
'mergehistory-list'                => 'Силлэһиилэр устуоруйаларын уларытыы',
'mergehistory-merge'               => 'Следующие версии [[:$1]] могут быть объединены в [[:$2]]. Используйте переключатели для того, чтобы объединить только выбранный диапазон правок. Сэрэтии: Навигационнай ыйынньыктары туһаннаххына дааннайдар сүтүөхтэрэ.',
'mergehistory-go'                  => 'Силлэһиилэр уларыйыыларын көрдөр',
'mergehistory-submit'              => 'Силлэһии барыллара',
'mergehistory-empty'               => 'Биир да барыл силлиһэр кыаҕа суох.',
'mergehistory-success'             => '$3 {{PLURAL:$3|барыл|барыллар}} [[:$1]] биир [[:$2]] барылга силлистилэр.',
'mergehistory-fail'                => 'Сирэй устуоруйалара кыайан холбоспотулар, өссө биирдэ торумнар бириэмэлэрин уонна сирэй параметрдарын бэрэбиэркэлээ.',
'mergehistory-no-source'           => 'Бастакы $1 сирэй суох.',
'mergehistory-no-destination'      => 'Баар буолуохтаах $1 сирэй суох.',
'mergehistory-invalid-source'      => 'Источнигыҥ сөптөөх ааттаах буолуохтаах.',
'mergehistory-invalid-destination' => 'Сирэй сөптөөх ааттаах буолуохтаах.',
'mergehistory-autocomment'         => '[[:$1]] манна [[:$2]] көһүүтэ (көһөрүү)',
'mergehistory-comment'             => '[[:$1]] манна [[:$2]] көһүүтэ. Быһаарыы: $3',

# Merge log
'mergelog'           => 'Силбэһиилэр сурунааллара',
'pagemerge-logentry' => 'силбэстилэр [[$1]] уонна [[$2]] ($3 диэри торумнар)',
'revertmerge'        => 'Араарыы',
'mergelogpagetext'   => 'Манна сирэйдэр устуоруйаларын бүтэһик силлэһиилэрин тиһигэ бэриллэр.',

# Diffs
'history-title'           => 'Көннөрүү историята "$1"',
'difference'              => '(Торумнар бэйэ-бэйэлэриттэн уратылара)',
'lineno'                  => '$1 строка:',
'compareselectedversions' => 'Талыллыбыт торумнары тэҥнээ',
'editundo'                => 'төнүн',
'diff-multi'              => '({{PLURAL:$1|$1 орто торум көрдөрүллүбэтэ|$1 орто торумнар көрдөрүллүбэтилэр|$1.}})',

# Search results
'searchresults'             => 'Булулунна',
'searchresulttext'          => 'Көрдөөһүн туһунан сиһилии ааҕыаххын баҕардаххына [[{{MediaWiki:Helppage}}|маны]] көр.',
'searchsubtitle'            => 'Эн [[:$1]] көмөтүнэн ([[Special:Prefixindex/$1|"$1" саҕаланар сирэйдэри ]] | [[Special:WhatLinksHere/$1|"$1" сигэнэр сирэйдэри]]) көрдөөбүтүҥ',
'searchsubtitleinvalid'     => 'По запросу «$1»',
'noexactmatch'              => "'''«\$1» ааттаах сирэй суох.''' <span style=\"display: block; margin: 1.5em 2em\"> [[:\$1|Саҥа сирэйи оҥорорго]]</span>",
'noexactmatch-nocreate'     => "'''Маннык ааттаах: \"\$1\" сирэй суох.'''",
'toomanymatches'            => 'Наһаа элбэх ыйытыы төнүннэ, бука диэн атыннык көрдөө',
'titlematches'              => 'Ыстатыйалар ааттара хоһулаһар',
'notitlematches'            => 'Ыстатыйалар ааттара хоһуласпаттар',
'textmatches'               => 'Ыстатыйалар истэрэ хатыланар',
'notextmatches'             => 'Ыстатыйалар истэрэ хатыламмат',
'prevn'                     => 'инники $1',
'nextn'                     => 'аныгыскы $1',
'viewprevnext'              => 'Көр ($1) ($2) ($3).',
'search-result-size'        => '$1 ({{PLURAL:$2|1 тыл|$2 тыл}})',
'search-result-score'       => 'Релевантноһа: $1%',
'search-redirect'           => '(утаарыы $1)',
'search-section'            => '($1 сиэксийэ)',
'search-suggest'            => 'Баҕар маннык диэри гыммытыҥ буолуо: $1',
'search-interwiki-caption'  => 'Уруулуу бырайыактар',
'search-interwiki-default'  => '$1 түмүгэ:',
'search-interwiki-more'     => '(өссө)',
'search-mwsuggest-enabled'  => 'этиилэрдээх',
'search-mwsuggest-disabled' => 'этиилэрэ суох',
'search-relatedarticle'     => 'Сигэнэр',
'mwsuggest-disable'         => 'AJAX этэн биэриилэрин араар',
'searchrelated'             => 'сибээстэммит',
'searchall'                 => 'бары',
'showingresults'            => 'Манна {{PLURAL:$1|түмүк|түмүктэр}} {{PLURAL:$1|көрдөрүлүннэ|көрдөрүлүннүлэр}} <strong>$1</strong> , мантан саҕалаан №&nbsp;<strong>$2</strong>.',
'showingresultsnum'         => 'Манна {{PLURAL:$3|түмүк|түмүктэр}} {{PLURAL:$3|көрдөрөлүннэ|көрдөрүлүннүлэр}} <strong>$3</strong>, мантан саҕалаан №&nbsp;<strong>$2</strong>.',
'showingresultstotal'       => "Аллара {{PLURAL:$3|'''$3''' '''$1''' түмүк|'''$3''' '''$1 - $2''' түмүк}} көрдөрүлүннэ",
'nonefound'                 => "'''Болҕой:''' Анаан эппэтэххэ көрдөөһүн аат сорох далларыгар эрэ көрдүүр. Бу сыһыарыыны ''all:'' тутуннаххына аат туох баар далларыгар барытыгар (холобур, кыттаачылар ырыытыыларыгар, халыыптарга иҥин) көрдүөҕэ.",
'powersearch'               => 'Бу бөлөхтөргө көрдөө',
'powersearch-legend'        => 'Дириҥэтэн көрдөөһүн',
'powersearch-ns'            => 'Аат далыгар көрдөө:',
'powersearch-redir'         => 'Утаарыылар испииһэктэрэ',
'powersearch-field'         => 'Көрдөөһүн',
'search-external'           => 'Тастан көрдөөһүн',
'searchdisabled'            => '{{SITENAME}} көрдүүр тэрилэ араарыллыбыт. Атын көрдүүр системаларынан наадыйар сирэйдэргитин көрдөтүөххүтүн сөп. Ол гынан баран поисковик кээһигэр баар торум эргэрбит буолуон сөп.',

# Preferences page
'preferences'              => 'Уларытыылар',
'mypreferences'            => 'Туруорууларым',
'prefs-edits'              => 'Көннөрүү ахсаана:',
'prefsnologin'             => 'Ааккын эппэтиҥ',
'prefsnologintext'         => 'Эн <span class="plainlinks">[{{fullurl:Special:Userlogin|returnto=$1}} ааккын эттэххинэ]</span> эрэ кыттаачы настройкатын уларытар кыахтаныаҥ.',
'prefsreset'               => 'Саҥа киирэргэ баар туруоруулар төнүннүлэр.',
'qbsettings'               => 'Навигация панела',
'qbsettings-none'          => 'Көрдөрүмэ',
'qbsettings-fixedleft'     => 'Хаҥас өттө хамсаабат',
'qbsettings-fixedright'    => 'Уҥа өттө хамсаабат',
'qbsettings-floatingleft'  => 'Хаҥас өттө устаҥныыр',
'qbsettings-floatingright' => 'Уҥа өттө устаҥныыр',
'changepassword'           => 'Киирии тылы уларытарга',
'skin'                     => 'Тас көстүү',
'math'                     => 'Фуормулалар',
'dateformat'               => 'Дьыл-хонук формаата',
'datedefault'              => 'Көннөрү көстүүтэ',
'datetime'                 => 'Күнэ-дьыла уонна кэмэ',
'math_failure'             => 'Сатаан ааҕыллыбата',
'math_unknown_error'       => 'биллибэт алҕас',
'math_unknown_function'    => 'биллибэт дьайыы (функция)',
'math_lexing_error'        => 'лексиката алҕастаах',
'math_syntax_error'        => 'синтаксис алҕаһа',
'math_image_error'         => 'PNG-га уларытыы сатаммата; latex, dvips, gs, уонна convert туруоруулара сөбүн көр',
'math_bad_tmpdir'          => 'Математика быстах кэмнээҕи директорията сатаан оҥоһуллубута',
'math_bad_output'          => 'Математика таһынааҕы директорията сатаан оҥоһуллубата',
'math_notexvc'             => 'texvc кыайан толоруллубата; маны math/README көр.',
'prefs-personal'           => 'Кыттааччы туруоруулара',
'prefs-rc'                 => 'Кэлиҥҥи уларытыылар',
'prefs-watchlist'          => 'Кэтээһин',
'prefs-watchlist-days'     => 'Хас хонуктааҕы уларыйыылар кэтээһин испииһэгэр көстөллөрө:',
'prefs-watchlist-edits'    => 'Хас уларытыыны тупсарыллыбыт кэтээһиҥҥэ көрдөрөрө:',
'prefs-misc'               => 'Атын туруоруулар',
'saveprefs'                => 'Бигэргэт',
'resetprefs'               => 'Бигэргэтиллибэтэх уларыйыылары сот',
'oldpassword'              => 'Эргэ киирии тыл:',
'newpassword'              => 'Саҥа киирии тыл:',
'retypenew'                => 'Саҥа киирии тылы хатылаа:',
'textboxsize'              => 'Уларытыы',
'rows'                     => 'Строкаалара:',
'columns'                  => 'Колонкалара:',
'searchresultshead'        => 'Көрдөөһүн түмүгэ',
'resultsperpage'           => 'Сирэйгэ булуллубут суруктар ахсааннара:',
'contextlines'             => 'Булуллубут сирэй хас строкатын көрдөрөрө:',
'contextchars'             => 'Строкааҕа контекст бэлиэлэрин ахсаана:',
'stub-threshold'           => '<a href="#" class="stub">омооннорго ыйынньыктары</a> оҥоруу боруога:',
'recentchangesdays'        => 'Хас хонук иһинэн уларытыылары көрдөрөргө:',
'recentchangescount'       => 'Историяларга уонна регистрация сурунаалларыгар көрдөрүллэр саҥа уларытыылар ахсааннара:',
'savedprefs'               => 'Эн туруорууларыҥ олохтоннулар.',
'timezonelegend'           => 'Чаһыы пуойаһа',
'timezonetext'             => '¹Эн бириэмэҥ сиэрбэр (Гринвич, UTC) бириэмэтиттэн хас чаас уратылааҕын киллэр.',
'localtime'                => 'Олорор сириҥ бириэмэтэ',
'timezoneoffset'           => 'Сыҕарыйыы',
'servertime'               => 'Сиэрбэр бириэмэтэ',
'guesstimezone'            => 'Интэриниэтиҥ бырагыраамматыттан ылан толор',
'allowemail'               => 'Атын кыттааччылартан сурук тутары көҥүллүүргэ',
'prefs-searchoptions'      => 'Көрдөөһүн туруоруулара',
'prefs-namespaces'         => 'Аат дала',
'defaultns'                => 'Чопчу ыйыллыбатаҕына бу ааттар быыстарыгар көрдүүргэ:',
'default'                  => 'чопчу ыйыллыбатаҕына маннык',
'files'                    => 'Билэлэр',

# User rights
'userrights'                  => 'Кыттааччылар бырааптарын салайыы', # Not used as normal message but as header for the special page itself
'userrights-lookup-user'      => 'Кыттаачылар бөлөхтөрүн салайыы',
'userrights-user-editname'    => 'Кыттааччы аата:',
'editusergroup'               => 'Кыттааччылар бөлөхтөрүн уларытарга',
'editinguser'                 => "'''[[User:$1|$1]]''' кыттааччы быраабын уларытыы ([[User talk:$1|{{int:talkpagelinktext}}]] | [[Special:Contributions/$1|{{int:contribslink}}]])",
'userrights-editusergroup'    => 'Кыттааччы бөлөхтөрүн уларытарга',
'saveusergroups'              => 'Кыттааччы бөлөхтөрүн бигэргэт',
'userrights-groupsmember'     => 'Бу бөлөхтөргө киирэр:',
'userrights-groups-help'      => 'Бу киһи киирэр бөлөхтөрүн уларытыаххын сөп:
* Бөлөх аатын таһыгар бэлиэ турар буоллаҕына бу кыттааччы бу бөлөххө киирэр.
* Бэлиэ суох буоллаҕына - кыттааччы бөлөххө киирбэт
* Маннык бэлиэ * кыттааччы бөлөххө киирэрин/киирбэтин уларытар кыаҕыҥ суоҕун көрдөрөр.',
'userrights-reason'           => 'Уларытыы төрүөтэ:',
'userrights-no-interwiki'     => 'Атын биикилэргэ кыттааччылар бырааптарын уларытар быраабыҥ суох.',
'userrights-nodatabase'       => '$1 билэ тиһигэ (олоҕо, база данных) суох эбэтэр локальнай буолбатах.',
'userrights-nologin'          => 'Эн дьон бырааптарын уларытаргар администратор быһыытынан [[Special:UserLogin|бэлиэтэниэхтээххин]].',
'userrights-notallowed'       => 'Бэлиэтэммит ааккынан атын кыттааччы быраабын уларытар кыаҕыҥ суох.',
'userrights-changeable-col'   => 'Эн уларытар кыахтаах бөлөхтөрүҥ',
'userrights-unchangeable-col' => 'Бу бөлөхтөрү уларытар кыаҕыҥ суох',

# Groups
'group'               => 'Бөлөх:',
'group-user'          => 'Кыттааччылар',
'group-autoconfirmed' => 'Аптамаатынан бигэргэтиллибит кыттааччылар',
'group-bot'           => 'Роботтар',
'group-sysop'         => 'Дьаһабыл',
'group-bureaucrat'    => 'Бюрокрааттар',
'group-suppress'      => 'Алҕастар',
'group-all'           => '(бары)',

'group-user-member'          => 'Кыттааччы',
'group-autoconfirmed-member' => 'Аптамаатынан бигэргэтиллибит кыттааччы',
'group-bot-member'           => 'Робот',
'group-sysop-member'         => 'Дьаһабыл',
'group-bureaucrat-member'    => 'Бюрократ',
'group-suppress-member'      => 'Алҕас',

'grouppage-user'          => '{{ns:project}}:Кыттааччылар',
'grouppage-autoconfirmed' => '{{ns:project}}:Аптамаатынан бигэргэммит кыттааччылар',
'grouppage-bot'           => '{{ns:project}}:Роботтар',
'grouppage-sysop'         => '{{ns:project}}:Дьаһабыллар',
'grouppage-bureaucrat'    => '{{ns:project}}:Бюрокрааттар',
'grouppage-suppress'      => '{{ns:project}}:Алҕас',

# Rights
'right-read'                 => 'Сирэйдэри көрүү',
'right-edit'                 => 'Сирэйдэри уларытыы',
'right-createpage'           => 'Сирэйдэри оҥоруу (ырытыы сирэйдэрин кытта холбуу)',
'right-createtalk'           => 'Ырытыы сирэйдэрин оҥоруу',
'right-createaccount'        => 'Саҥа кыттааччыны бэлиэтээһин',
'right-minoredit'            => 'Уларытыыны кыра суолталаах курдук бэлиэтээ',
'right-move'                 => 'Сирэйдэр ааттарын уларытыы',
'right-move-subpages'        => 'Сирэйдэр ааттарын иһигэр киирэр сирэйдэри кытта уларытыы',
'right-suppressredirect'     => 'Аатын уларытарга урукку ааттан утаарыы сирэй кыайан оҥоһуллубат',
'right-upload'               => 'Билэлэри киллэр',
'right-reupload'             => 'Баар билэни саҥаттан суруттар',
'right-reupload-own'         => 'Билэлэри суруттарбыт киһи бэйэтэ иккистээн суруттарыыта',
'right-reupload-shared'      => 'Уопсай ыскылаат билэлэрин локальнай ыскылаат билэлэринэн уларытыы',
'right-upload_by_url'        => 'URL аадырыстан билэлэри киллэрии',
'right-purge'                => 'Кээһи бигэргэтэр сирэйэ суох ыраастааһын',
'right-autoconfirmed'        => 'Аҥардара (сорҕото) көмүскэммит сирэйдэри уларытыы',
'right-bot'                  => 'аптамаат быһыытынан ааҕыллар',
'right-nominornewtalk'       => 'Ырытыы сирэйдэригэр кыра көннөрүүлэр суох буоллахтарына саҥа этии эрэсиимэ холбонор',
'right-apihighlimits'        => 'API-запростарга үрдүк лимиити туттуу',
'right-writeapi'             => 'API-ны туттуу',
'right-delete'               => 'Сирэйдэри сотуу',
'right-bigdelete'            => 'Уһун историялаах сирэйдэри сотуу',
'right-deleterevision'       => 'Сирэй сорох торумнарын сотуу уонна хат киллэрии',
'right-deletedhistory'       => 'Сотуллубут тиэкиһи көрөөһүнэ суох сотуу историятын көрүү',
'right-browsearchive'        => 'Сотуллубут сирэйдэри көрдөөһүн',
'right-undelete'             => 'Сотуллубут сирэйи хат киллэрии',
'right-suppressrevision'     => 'Администраатардартан кистэммит сирэйдэри көрүү уонна урукку барылларыгар төннөрүү',
'right-suppressionlog'       => 'Атын дьон сурунаалларын көрүү',
'right-block'                => 'Атын кыттааччылар уларыталларын бобуу',
'right-blockemail'           => 'Эл. суругу ыытары бобуу',
'right-hideuser'             => 'Кыттааччы аатын бобуу уонна кистээһин',
'right-ipblock-exempt'       => 'IP хааччахтааһынын, аптамаатынан уонна диапазоннары хааччахтааһыны тумнуу',
'right-proxyunbannable'      => 'Прокси аптааматынан хааччахтааһынын тумнуу',
'right-protect'              => 'Сирэйдэр көмүскэллэрин таһымын уонна көмүскэммит сирэйдэри уларытыы',
'right-editprotected'        => 'Көмүскэллээх сирэйдэри уларытыыы (каскаднай көмүскэллэрэ суох буоллаҕына)',
'right-editinterface'        => 'Кыттааччы интерфейсын уларытыы',
'right-editusercssjs'        => 'Атын кыттааччылар CSS- и JS-билэлэрин уларытыы',
'right-rollback'             => 'Кыттааччы оҥорбут көннөрүүлэрин талыллыбыт биир сирэйгэ суох гыныы',
'right-markbotedits'         => 'Төннөрүллэр көннөрүүлэри робот уларытыытын курдук бэлиэтээһин',
'right-noratelimit'          => 'Нуорманнан хааччахтааһын суох',
'right-import'               => 'Атын биикиттэн сирэйдэри киллэрии',
'right-importupload'         => 'Билэлэри суруйуу нөҥүө сирэйдэри киллэрии (импорт)',
'right-patrol'               => 'Уларытыылары ботуруулламмыт курдук бэлиэтээһин',
'right-autopatrol'           => 'Уларытыылар ботуруулламмыт курдук аптамаатынан бэлиэтэнэллэр',
'right-patrolmarks'          => 'Кэнники уларытыыларга бэрэбиэркэлэммиттэрин туһунан бэлиэлэри көрүү',
'right-unwatchedpages'       => 'Кэтэммэт сирэйдэр тиһиктэрин көрүү',
'right-trackback'            => 'Trackback ыытыы',
'right-mergehistory'         => 'Сирэйдэр историяларын холбооһун',
'right-userrights'           => 'Кытааччылар бырааптарын барытын уларытыы',
'right-userrights-interwiki' => 'Атын биики-саайтарга кыттааччылар бырааптарын уларытыы',
'right-siteadmin'            => 'Билэ олоҕор (database) киирэри бобуу уонна көҥүллээһин',

# User rights log
'rightslog'      => 'Кыттаачы бырааптарын сурунаала',
'rightslogtext'  => 'Бу кыттааччы бырааптарын уларыйыытын көрдөрөр сурунаал.',
'rightslogentry' => '$1 кыттаачы киирэр бырааба $2-тан $3 уларыйда',
'rightsnone'     => '(суох)',

# Recent changes
'nchanges'                          => '$1 {{PLURAL:$1|уларытыы|уларытыылар}}',
'recentchanges'                     => 'Кэнники уларытыылар',
'recentchangestext'                 => 'Манна хаһан киирибитинэн сааһыланан {{SITENAME}} кэнники уларыытыылара сурулуннулар.',
'recentchanges-feed-description'    => 'Бу ботуокка биики бүтэһик уларыйыыларын кэтииргэ.',
'rcnote'                            => "{{PLURAL:$2|хонук|'''$2''' хонуктар}} иһинэн бүтэһик {{PLURAL:$1|'''1''' уларыйыы|'''$1''' уларыйыылар}}, $5, $4.",
'rcnotefrom'                        => "Мантан '''$2''' маныаха '''$1''' дылы уларыыйылар көрдөрүлүннүлэр.",
'rclistfrom'                        => 'Мантан $1 уларыйыылары көрдөр',
'rcshowhideminor'                   => '$1 кыра уларыйыы',
'rcshowhidebots'                    => '$1 робот',
'rcshowhideliu'                     => '$1 аатын билиһиннэрбит кыттааччы',
'rcshowhideanons'                   => '$1 аатын эппэтэх кыттааччы',
'rcshowhidepatr'                    => '$1 бэрэбиэркэлэммит уларытыылар',
'rcshowhidemine'                    => '$1 мин уларытыыларым',
'rclinks'                           => '$2 күҥҥэ бүтэһик $1 уларытыыны көрдөр;<br />$3.',
'diff'                              => 'уратыта',
'hist'                              => 'история',
'hide'                              => 'Кистээ',
'show'                              => 'Көрдөр',
'minoreditletter'                   => 'к',
'newpageletter'                     => 'С',
'boteditletter'                     => 'р',
'number_of_watching_users_pageview' => '[$1 кэтиир {{PLURAL:$1|кыттааччы|кыттааччылар}}]',
'rc_categories'                     => 'Бу эрэ категориялартан (араар бэлиэ "|")',
'rc_categories_any'                 => 'Ханнык баҕарар',
'newsectionsummary'                 => '/* $1 */ саҥа сиэксийэ',

# Recent changes linked
'recentchangeslinked'          => 'Сигэнэр уларытыылар',
'recentchangeslinked-title'    => '"$1" кытта сибээстээх уларытыылар',
'recentchangeslinked-noresult' => 'Сигэммит сирэйдэргэ этиллибит кэмҥэ уларытыылар оҥоһуллубатылар.',
'recentchangeslinked-summary'  => "Бу анал сирэйгэ сигэнэр сирэйдэр бүтэһик уларыйыылара көһүннүлэр. [[Special:Watchlist|Кэтэнэр сирэйдэр]] '''модьу бичигинэн''' бэлиэтэннилэр.",
'recentchangeslinked-page'     => 'Сирэй аата:',
'recentchangeslinked-to'       => 'Төттөрүтүн, ыйыллыбыт сирэйгэ сигэнэр сирэйдэри көрдөр',

# Upload
'upload'                      => 'Билэни киллэр',
'uploadbtn'                   => 'Билэни киллэрии',
'reupload'                    => 'Хат киллэр',
'reuploaddesc'                => 'Тохтот уонна киллэрии форматыгар төнүн',
'uploadnologin'               => 'Биикигэ ааккын билиһиннэрбэтиҥ',
'uploadnologintext'           => 'Билэлэри киллэрэргэ манна [[Special:UserLogin|бэлиэтэниэххэ]] наада',
'upload_directory_missing'    => 'Суруйуу паапката ($1) суох, ону ааһан сиэрбэр ону бэйэтэ оҥорор кыаҕа суох.',
'upload_directory_read_only'  => '($1) директорияҕа сиэрбэр билэни суруйар кыаҕа суох.',
'uploaderror'                 => 'Билэ суруллубата',
'uploadtext'                  => "Бу форманы туһанан сиэрбэргэ билэлэри суруйуоххун сөп.
Урут суруллубут билэлэри көрөргө манна тиий: [[Special:ImageList|ойуулар тиһиктэрэ]]. Билэлэри суруйуу уонна иккистээн суруйуу устуоруйата [[Special:Log/upload|манна]], сотуу устуоруйата [[Special:Log/delete|манна]] көстөллөр.

Ойууну ыстатыйаҕа киллэрэргэ маннык суруйуллар:
* '''<tt><nowiki>[[</nowiki>{{ns:image}}<nowiki>:File.jpg]]</nowiki></tt>''' ойуу хайдах баарынан (кыччаппакка)
* '''<tt><nowiki>[[</nowiki>{{ns:image}}<nowiki>:File.png|200px|thumb|left|хос быһаарыы]]</nowiki></tt>''' 200 пииксэл кэтиттээх аллараа өттүгэр быһаарыы суруктаах экран хаҥас кырыытыгар сыстар ойуу
* '''<tt><nowiki>[[</nowiki>{{ns:media}}<nowiki>:File.ogg]]</nowiki></tt>''' - ойууну бэйэтин көрдөрбөккө сигэтин эрэ көрдөрүү.",
'upload-permitted'            => 'Көҥүллэммит билэ көрүҥнэрэ: $1.',
'upload-preferred'            => 'Маннык билэ көрүҥнэрин туһанар ордук: $1.',
'upload-prohibited'           => 'Маннык билэ көрүҥнэрэ бобуллубуттар: $1.',
'uploadlog'                   => 'уларытыы устуоруйата',
'uploadlogpage'               => 'Уларытыы устуоруйата',
'uploadlogpagetext'           => 'Манна бүтэһик уларытыылар тиһиктэрэ көстөр.
Өссө [[Special:NewImages|саҥа билэлэр]] тиһиктэрин көрүөххүн сөп.',
'filename'                    => 'Билэ аата',
'filedesc'                    => 'Быһаарыы',
'fileuploadsummary'           => 'Быһаарыы:',
'filestatus'                  => 'Туһаныы (Copyright):',
'filesource'                  => 'Хантан ылыллыбыта:',
'uploadedfiles'               => 'Киллэриллибит билэлэр',
'ignorewarning'               => 'Сэрэтиилэри истибэккэ билэни киллэр',
'ignorewarnings'              => 'Сэрэтиини истимэ',
'minlength1'                  => 'Билэ аата биир суругунан буолуохтаах.',
'illegalfilename'             => '«$1» билэ аата аакка туттуллубат бэлиэлэрдээх. Уларыт уонна өссө киллэрэн көр.',
'badfilename'                 => 'Билэ аата маннык буолла: "$1".',
'filetype-badmime'            => 'MIME-типтээх "$1" билэлэр кыайан манна суруллубаттар.',
'filetype-unwanted-type'      => "'''\".\$1\"''' — билэ оччо сөбүлэммэт көрүҥэ. 
Маннык {{PLURAL:\$3|көрүҥү|көрүҥнэри}} туһанар ордук: \$2.",
'filetype-banned-type'        => "'''\".\$1\"''' — билэ бобуллубут көрүҥэ.
Көҥүллэммит билэ {{PLURAL:\$3|көрүҥэ|көрүҥнэрэ}}: \$2.",
'filetype-missing'            => 'Билэ расширенията суох (холобур ".jpg").',
'large-file'                  => 'Манна $1 байт аннынан ыйааһыннаах ойуулары туттар ордук (эн суруйбут билэҥ $2 байтаах).',
'largefileserver'             => 'Билэ ыйааһына көҥүллэммиттэн ордук.',
'emptyfile'                   => 'Суруйбут билэҥ арааһа кураанах быһылаах. Баҕар билэ аатын сыыһа суруйбутуҥ буолаарай. Өссө төгүл көр.',
'fileexists'                  => 'Инник ааттаах билэ бэлиэр баар эбит, ону уларытыаххын саарбахтыыр буоллаххына - маны көр <strong><tt>$1</tt></strong>.',
'filepageexists'              => 'Бу билэни быһаарар сирэй номнуо оҥоһуллубут <strong><tt>$1</tt></strong>, ол гынан баран маннык ааттаах сирэй суох.
Киллэрбит быһаарыыҥ быһаарыы сирэйигэр тахсыа суоҕа.
Саҥа быһаарыыны эбэр буоллаххына илиигинэн уларытыаххын наада.',
'fileexists-extension'        => 'Майгынныыр ааттаах билэ баар:<br />
Эн суруйбут билэҥ аата: <strong><tt>$1</tt></strong><br />
Уруккуттан баар билэ аата: <strong><tt>$2</tt></strong><br />
Атын аатта таларыҥ буоллар.',
'fileexists-thumb'            => "<center>'''Баар ойуу'''</center>",
'fileexists-thumbnail-yes'    => 'Ойуу арааһа кыччатыллыбыт ойуу (миниатюра) быһыылаах. Көр <strong><tt>$1</tt></strong>.<br /> Бу ойуу урукку ойуу кыччатыллыбыта буоллаҕына суруйар наадата суох.',
'file-thumbnail-no'           => 'Билэ аата мантан саҕаланар <strong><tt>$1</tt></strong>. 
Арааһа ойуу кыра куоппуйата быһыылаах <i>(миниатюра)</i>. 
Бу ойуу толору барыйаана баар буоллаҕына ону манна суруй, эбэтэр аатын уларыт.',
'fileexists-forbidden'        => 'Маннык ааттаах ойуу баар, төннөн атыннык ааттаа. [[Image:$1|thumb|center|$1]]',
'fileexists-shared-forbidden' => 'Маннык ааттаах ойуу уопсай ыскылаакка баар эбит. 
Ол да буоллар билэни киллэриэххин баҕарар буоллаххына төннөн атыннык ааттаа. [[Image:$1|thumb|center|$1]]',
'file-exists-duplicate'       => 'Бу билэ атын {{PLURAL:$1|билэ дубликаата|билэлэр дубликааттара}} буолар:',
'successfulupload'            => 'Сатанна',
'uploadwarning'               => 'Сэрэтии',
'savefile'                    => 'Билэни суруттарыы',
'uploadedimage'               => 'суруттарылынна "[[$1]]"',
'overwroteimage'              => '"[[$1]]" киллэриллибит саҥа торума',
'uploaddisabled'              => 'Суруттарыы бобуллубут',
'uploaddisabledtext'          => 'Билэлэри суруттарар көҥүллэммэт.',
'uploadscripted'              => 'Бу билэ HTML эбэтэр скрипт куодтаах эбит. Интэриниэт көрдөрөр бырагыраамма ону сыыһа ааҕыан сөп.',
'uploadcorrupt'               => 'Билэ сатаан ааҕыллыбат эбэтэр атын расширениялаах. Бэрэбиэркэлээн баран өссө суруттаран көр.',
'uploadvirus'                 => 'Бу билэ вирустаах! Көр: $1',
'sourcefilename'              => 'Билэ сытар сирэ:',
'destfilename'                => 'Билэ хайдах ааттаах буолуохтааҕа:',
'upload-maxfilesize'          => 'Билэ муҥур улахана: $1',
'watchthisupload'             => 'Билэни кэтииргэ',
'filewasdeleted'              => 'Маннык ааттаах билэ урут баар эбит, ону соппуттар. $1 суруттарыах иннинэ өссө биирдэ толкуйдаа.',
'upload-wasdeleted'           => "'''Сэрэтии: Эн суох оҥоһуллубут биэни саҥаттан суруйан эрэҕин.'''

Бу билэни суруттарар тоҕоостооҕун ырыҥалаан көр. Суох оҥорууну (сотторууну) регистрациялыыр файл манна баар:",
'filename-bad-prefix'         => 'Киллэрээри гынар билэҥ аата <strong>"$1"</strong> фотоаппарат аптамаатынан ааттыыр аатыгар майгынныыр. Бука диэн атыннык, арыый сиһилии ааттаан киллэрэриҥ буоллар.',
'filename-prefix-blacklist'   => ' #<!-- Бу строканы оннунан хааллар --> <pre>
# Синтаксииһа маннык:
#   * Бу "#" бэлиэттэн саҕалаан строка бүтүөр дылы быһаарыы
#   * Кураанах буолбатах строка - билэ фотоаппарат аптамаатынан ааттаабыт ааттарын префикса
CIMG # Casio
DSC_ # Nikon
DSCF # Fuji
DSCN # Nikon
DUW # сорох мобильнай төлөппүөннэр
IMG # generic
JD # Jenoptik
MGP # Pentax
PICT # misc.
 #</pre> <!-- Бу строканы оннунан хааллар -->',

'upload-proto-error'      => 'Сыыһа боротокуол',
'upload-proto-error-text' => 'Ыраахтан суруттарарга маннык аадырыстар наадалар: <code>http://</code> эбэтэр <code>ftp://</code>.',
'upload-file-error'       => 'Ис сыыһа',
'upload-file-error-text'  => 'Быстах кэмҥэ оҥоһуллар билэни суруйууга туох эрэ моһол таҕыста.
[[Special:ListUsers/sysop|Администраатары]] кытта сибээстэс.',
'upload-misc-error'       => 'Сурутуу биллибэт моһоллонно',
'upload-misc-error-text'  => 'Сурутуу биллибэт моһоллонно.
Аадырыһы сөпкө суруйбуккун көр уонна өссө биирдэ боруобалаа.
Бу хатыланнаҕына [[Special:ListUsers/sysop|администраатары]] кытта сибээстэс.',

# Some likely curl errors. More could be added from <http://curl.haxx.se/libcurl/c/libcurl-errors.html>
'upload-curl-error6'       => 'Бу URL-га кыайан тахсыбата',
'upload-curl-error6-text'  => 'Ыйыллыбыт URL көстүбэтэ. Хат киллэрэн көр эбэтэр маннык сир баарын-суоҕун бэрэбиэркэлээ.',
'upload-curl-error28'      => 'Суруттарыы болдьоҕо ааста',
'upload-curl-error28-text' => 'Бу сир наһаа өр хардарда. Үлэлиирин суоҕун бэрэбиэркэлээ уонна хат киирэн көр. Эбэтэр сиргэ аҕыйах киһи киирэр кэмигэр боруобалаан көр.',

'license'            => 'Лицензиялааһын:',
'nolicense'          => 'Талыллыбатах',
'license-nopreview'  => '(Уларытыыны бигэргэтиэх иннинэ көрүү сатаммат)',
'upload_source_url'  => ' (сөптөөх URL, ким баҕарбыт киирэр сирэ)',
'upload_source_file' => ' (билэ компьютергар баар)',

# Special:ImageList
'imagelist-summary'     => 'Бу анал сирэй киллэриллибит билэлэри барытын көрдөрөр.
Соторутааҕыта киллэриллибиттэр үөһэ сылдьаллар.
Колонка баһын баттаатаххына наардааһын бэрээдэгэ уларыйар.',
'imagelist_search_for'  => 'Миэдьийэни (ойууну) аатынан көрдөтүү:',
'imgfile'               => 'билэ',
'imagelist'             => 'Билэлэр',
'imagelist_date'        => 'Күнэ-ыйа',
'imagelist_name'        => 'Аата',
'imagelist_user'        => 'Кыттааччы',
'imagelist_size'        => 'Кээмэйэ',
'imagelist_description' => 'Быһаарыыта',

# Image description page
'filehist'                       => 'Билэ устуоруйата',
'filehist-help'                  => 'Ыйын-күнүн/кэмин баттаа, оччотооҕуга баар буолбут.',
'filehist-deleteall'             => 'барытын сот',
'filehist-deleteone'             => 'сотуу',
'filehist-revert'                => 'төттөрү',
'filehist-current'               => 'билиҥҥи',
'filehist-datetime'              => 'Күнэ-ыйа/Кэмэ',
'filehist-user'                  => 'Кыттааччы',
'filehist-dimensions'            => 'Кээмэйдэрэ',
'filehist-filesize'              => 'Билэ кээмэйэ',
'filehist-comment'               => 'Хос быһаарыы',
'imagelinks'                     => 'Ыйынньыктар',
'linkstoimage'                   => 'Бу билэҕэ маннык атын {{PLURAL:$1|сирэй сигэнэр|$1 сирэйдэр сигэнэллэр}}:',
'nolinkstoimage'                 => 'Атын сирэйдэр бу билэҕэ сигэммэттэр.',
'morelinkstoimage'               => 'Бу билэҕэ [[Special:WhatLinksHere/$1|атын сигэлэри]] көрөргө.',
'redirectstofile'                => 'Билэҕэ бу {{PLURAL:$1|билэттэн сигэ олохтоммут|$1 билэлэртэн сигэлэр олохтоммуттар}}:',
'duplicatesoffile'               => 'Бу билэ {{PLURAL:$1|дубликаата манна көстөр|$1 дубликаата манна көстөллөр}}:',
'sharedupload'                   => 'Бу билэ хас да бырайыак туһанар ыскылаатыгар сытар.',
'shareduploadwiki'               => 'Эбиитин мантан ааҕыаххын сөп $1.',
'shareduploadwiki-desc'          => 'Уопсай ыскылааттан $1 туһунан аллара көһүннэ.',
'shareduploadwiki-linktext'      => 'Билэни хос быһаарар сирэй',
'shareduploadduplicate'          => 'Бу билэ уопсай ыскылаакка сытар $1 дубликаата.',
'shareduploadduplicate-linktext' => 'атын билэ',
'shareduploadconflict'           => 'Бу билэ аата уопсай ыскылаакка сытар $1 билэ аатын кытта сөп түбэһэр.',
'shareduploadconflict-linktext'  => 'атын билэ',
'noimage'                        => 'Маннык ааттаах билэ суох эбит, маны гыныаххын сөп $1.',
'noimage-linktext'               => 'итини суруттар',
'uploadnewversion-linktext'      => 'Бу билэ саҥа барылын суруттар',
'imagepage-searchdupe'           => 'Хатыланар билэлэри көрдөөһүн',

# File reversion
'filerevert'                => 'Төннөр $1',
'filerevert-legend'         => 'Билэни төннөр',
'filerevert-intro'          => "Эн бу билэни  '''[[Media:$1|$1]]'''  [$4 торумҥа от $3, $2] төннөрөҕүн.",
'filerevert-comment'        => 'Хос быһаарыы:',
'filerevert-defaultcomment' => 'Торумҥа төннүү $2, $1',
'filerevert-submit'         => 'Төннөрүү',
'filerevert-success'        => "'''[[Media:$1|$1]]''' бу торумҥа төннөрүлүннэ [$4 торум Filetype-missingот $3, $2].",
'filerevert-badversion'     => 'Бу билэ этиллибит күҥҥэ-ыйга/кэмҥэ оҥоһуллубут урукку торума суох.',

# File deletion
'filedelete'                  => 'Сот: $1',
'filedelete-legend'           => 'Билэни сот',
'filedelete-intro'            => "Маны сотон эрэҕин '''[[Media:$1|$1]]'''.",
'filedelete-intro-old'        => "Манна баар [$4 $3, $2]  '''[[Media:$1|$1]]''' торумнара сотулуннулар.",
'filedelete-comment'          => 'Быһаарыыта:',
'filedelete-submit'           => 'Сотуу',
'filedelete-success'          => "'''$1''' сотулунна.",
'filedelete-success-old'      => "$3-ҕа баар '''[[Media:$1|$1]]''' торуму (версияны)  $2 соппут.",
'filedelete-nofile'           => "'''$1''' суох.",
'filedelete-nofile-old'       => "Этиллибит параметрдаах '''$1''' архыыптаммыт торума суох.",
'filedelete-iscurrent'        => 'Эн билэ саҥа торумун сото сатыыгын. Бастаан эргэ торумун көр.',
'filedelete-otherreason'      => 'Атын/эбии төрүөт:',
'filedelete-reason-otherlist' => 'Атын төрүөт',
'filedelete-reason-dropdown'  => '*Common сотор төрүөттэрэ
** Бас билии быраабын кэһии
** Хос суруллубут билэ',
'filedelete-edit-reasonlist'  => 'Сотуу төрүөтүн уларыт',

# MIME search
'mimesearch'         => 'MIME көрдөөһүн',
'mimesearch-summary' => 'Бу сирэй MIME көрүҥнээх фильтрдааһыны көҥүллүүр. Киллэрии: contenttype/subtype, холобур <tt>image/jpeg</tt>.',
'mimetype'           => 'MIME көрүҥэ:',
'download'           => 'хачайдаан ылыы',

# Unwatched pages
'unwatchedpages' => 'Ким да кэтээбэт сирэйдэрэ',

# List redirects
'listredirects' => 'Көһөрүүлэр испииһэктэрэ',

# Unused templates
'unusedtemplates'     => 'Туттуллубат халыыптар',
'unusedtemplatestext' => 'Манна атын сирэйдэр ахсааннарыгар киирбэтэтх "Халыыптарга" сыһыаннаах сирэйдэр көстөллөр. Соторгор атын билэлэртэн сигэммэтэхтэрин көр.',
'unusedtemplateswlh'  => 'атын ыйынньыктар',

# Random page
'randompage'         => 'Үлүбээй сирэй',
'randompage-nopages' => 'Майгынныыр ааттаах сирэйдэр суохтар.',

# Random redirect
'randomredirect'         => 'Случайное перенаправление',
'randomredirect-nopages' => 'Бу ааттарга көһөрөр ыйынньыктар суохтар.',

# Statistics
'statistics'             => 'Статистика',
'sitestats'              => '{{SITENAME}} статистиката',
'userstats'              => 'Кыттааччы статистиката',
'sitestatstext'          => "Барыта '''$1''' сирэй баар. Онно киирэллэр: бырайыак туһунан сирэйдэр, ырытыылар, ситэриллибэтэх ыстатыйалар, атын сирэйгэ көһөрөр сирэйдэр уонна да атын ыстатыйа ахсааныгар киирбэт ыстатыйалар. Мантан ураты толору ыстатыйа диэн ааттанар '''$2''' ыстатыйа баар.

Барыта '''$8''' билэ суруттарыллыбыт.

{{SITENAME}} туруоҕуттан барыта '''$3''' сирэй көрөөһүнэ буолбут уонна '''$4''' сирэй уларытыыта. Онон ортотунан ыллахха биир сирэйгэ '''$5''' уларытыы уонна '''$6''' көрүү тиксэр.

Величина [http://www.mediawiki.org/wiki/Manual:Job_queue очереди заданий] составляет '''$7'''.",
'userstatstext'          => "'''$1''' бэлиэтэммит [[Special:ListUsers|кыттааччы]] баарыттан '''$2''' (эбэтэр '''$4%''') $2 $5 бырааптаах",
'statistics-mostpopular' => 'Саамай элбэхтик көрүллэр ыстатыйалар',

'disambiguations'      => 'Элбэх суолталаах өйдөбүллэр сирэйдэрэ',
'disambiguationspage'  => 'Template:элбэх суолталаах өйдөбүллэр',
'disambiguations-text' => "Маннык сирэйдэр '''омонимнар сирэйдэрин''' кытта сибээстээхтэр. Ол оннугар чуолаан теманы кытта сибээстэһиэхтээхтэр.<br />Өскө бу халыыбы [[MediaWiki:Disambiguationspage]] туттубут буоллахтарына, сирэй омонимнары суох оҥоруу курдук обработкаламмыт.",

'doubleredirects'            => 'Хос көһөрөөһүн',
'doubleredirectstext'        => 'Каждая строка содержит ссылки на первое и второе перенаправления, а также первую строчку страницы второго перенаправления, в которой обычно указывается название страницы, куда должно осуществляться перенаправление. Нужно, чтобы и первое перенаправление ссылалось на эту страницу.',
'double-redirect-fixed-move' => '[[$1]] сирэй аата уларытыллыбыт, билигин манна утаарар [[$2]]',
'double-redirect-fixer'      => 'Утаарыылары көннөрөөччү',

'brokenredirects'        => 'Быстыбыт көһөрүүлэр',
'brokenredirectstext'    => 'Бу көһөрөр сирэйдэр суох ыстатыйаларга сигэнэллэр:',
'brokenredirects-edit'   => '(уларытыы)',
'brokenredirects-delete' => '(сотуу)',

'withoutinterwiki'         => 'Атын тылынан суруллубут ыстатыйаларга сигэммэт ыстатыйалар',
'withoutinterwiki-summary' => 'Бу сирэйдэр атын тылынан суруллубут ыстатыйаларга сигэммэттэр:',
'withoutinterwiki-legend'  => 'Префикс',
'withoutinterwiki-submit'  => 'Көрдөрүү',

'fewestrevisions' => 'Саамай аҕыйах көннөрүүлээх ыстатыйалар',

# Miscellaneous special pages
'nbytes'                  => '$1 баайтаах',
'ncategories'             => '$1 категориялаах',
'nlinks'                  => '$1 ыйынньыктаах',
'nmembers'                => '$1 кыттааччылаах',
'nrevisions'              => '$1 уларытыылаах (барыллаах)',
'nviews'                  => '$1 көрүүлээх',
'specialpage-empty'       => 'Көрдөөн тугу да булбата.',
'lonelypages'             => 'Атын сирэйдэри кытта сибээһэ суох сирэйдэр',
'lonelypagestext'         => 'Бу сирэйдэргэ {{SITENAME}} атын сирэйдэрэ сигэммэттэр.',
'uncategorizedpages'      => 'Ханнык да категорияҕа киирбэтэх сирэйдэр',
'uncategorizedcategories' => 'Ханнык да категорияҕа киирбэтэх категориялар',
'uncategorizedimages'     => 'Ханнык да категорияҕа киирбэтэх ойуулар',
'uncategorizedtemplates'  => 'Ханнык да категорияҕа киирбэтэх халыыптар',
'unusedcategories'        => 'Туттуллубатах категориялар',
'unusedimages'            => 'Туттулубатах билэлэр',
'popularpages'            => 'Элбэх киһи көрөр сирэйдэрэ',
'wantedcategories'        => 'Көрдөнүллэр категориялар',
'wantedpages'             => 'Көрдөнүллэр сирэйдэр',
'missingfiles'            => 'Суох билэлэр',
'mostlinked'              => 'Саамай элбэх сирэй сигэнэр сирэйдэрэ',
'mostlinkedcategories'    => 'Саамай элбэх сирэй сигэнэр категориялара',
'mostlinkedtemplates'     => 'Саамай элбэхтик туттуллар халыыптар',
'mostcategories'          => 'Элбэх категорияҕа киирэр ыстатыйалар',
'mostimages'              => 'Саамай элбэхтик сигэниллэр билэлэр',
'mostrevisions'           => 'Саамай элбэхтик уларытыллыбыт ыстатыйалар',
'prefixindex'             => 'Префикс бэлиэтэ',
'shortpages'              => 'Кылгас ыстатыйалар',
'longpages'               => 'Уһун ыстатыйалар',
'deadendpages'            => 'Dead-end (Бүтэй) сирэйдэр',
'deadendpagestext'        => 'Бу ыстатыйалар {{SITENAME}} саайтын атын сирэйдэригэр сигэммэттэр.',
'protectedpages'          => 'Көмүскэммит ыстатыйалар',
'protectedpages-indef'    => 'Болдьоҕо суох эрэ көмүскэллэр',
'protectedpagestext'      => 'Бу ыстатыйалар аатын уларытартан уонна көннөрөртөн көмүскэммиттэр',
'protectedpagesempty'     => 'Билигин этиллибит параметрдаах көмүскэниллибит ыстатыйалар суохтар.',
'protectedtitles'         => 'Көмүскэммит ааттар',
'protectedtitlestext'     => 'Бу ааттары оҥорор/айар бобуллар',
'protectedtitlesempty'    => 'Биир да аат бу параметрдарынан көмүскэммэт',
'listusers'               => 'Кыттааччылар испииһэктэрэ',
'newpages'                => 'Саҥа ыстатыйалар',
'newpages-username'       => 'Кыттааччы:',
'ancientpages'            => 'Бүтэһик уларытыы киирбитинэн наардаммыт ыстатыйалар',
'move'                    => 'Аатын уларыт',
'movethispage'            => 'Бу сирэй аатын уларыт',
'unusedimagestext'        => 'Атын саайтар бу ойууга быһа URL көмөтүнэн эмиэ сигэниэхтэрин сөп, онон ойуу бу испииһэккэ киирбитин да үрдүнэн элбэхтик туһаныллар буолуон сөп.',
'unusedcategoriestext'    => 'Манна көрдөрүллүбүт категория сирэйдэрэ ыстатыйата эбэтэр атын категорията суохтар.',
'notargettitle'           => 'Сыала суох',
'notargettext'            => 'Көрөөрү гыммыт сирэйгин уонна кыттааччыгын эппэтиҥ.',
'nopagetitle'             => 'Маннык сирэй суох',
'nopagetext'              => 'Көрдөөбүт сирэйиҥ суох.',
'pager-newer-n'           => '{{PLURAL:$1|саҥа 1|саҥа $1}}',
'pager-older-n'           => '{{PLURAL:$1|аҕа 1|аҕа $1}}',
'suppress'                => 'Кистээһин',

# Book sources
'booksources'               => 'Кинигэлэр источниктара',
'booksources-search-legend' => 'Кинигэ туһунан көрдөө',
'booksources-go'            => 'Бул',
'booksources-text'          => 'Манна кинигэ туһунан атын саайтарга ыйынньыктар хомулуннулар, онно баҕар эбии информация көстүөҕэ.',

# Special:Log
'specialloguserlabel'  => 'Кыттааччы:',
'speciallogtitlelabel' => 'Баһа:',
'log'                  => 'Сурунааллар',
'all-logs-page'        => 'Сурунааллар барыта',
'log-search-legend'    => 'Сурунааллары көрдөөһүн',
'log-search-submit'    => 'Бул',
'alllogstext'          => '{{SITENAME}} сурунаалларын уопсай испииһэгэ. 
Сурунаал көрүҥүнэн, кыттааччы аатынан (улахан-кыра буукубата учуоттанар) эбэтэр сирэй аатынан (эмиэ улахана-кырата учуоттанар) наардыаххытын сөп.',
'logempty'             => 'Сурунаалга сөп түбэһэр элэмиэннэр суохтар.',
'log-title-wildcard'   => 'Бу сурук бэлиэлэриттэн (буукубалартан) саҕаланар ааттары бул',

# Special:AllPages
'allpages'          => 'Сирэйдэр барыта',
'alphaindexline'    => 'мантан $1 манна $2',
'nextpage'          => 'Аныгыскы сирэй ($1)',
'prevpage'          => 'Бу иннинээҕи сирэй ($1)',
'allpagesfrom'      => 'Мантан саҕаланар сирэйдэри көрдөр:',
'allarticles'       => 'Бары ыстатыйалар',
'allinnamespace'    => 'Бары сирэйдэр (пространство имен $1)',
'allnotinnamespace' => 'Бары сирэйдэр ($1 namespace-тан уратылар)',
'allpagesprev'      => 'Бу иннинээҕилэр',
'allpagesnext'      => 'Бу кэнниттэн кэлэллэр',
'allpagessubmit'    => 'Толор',
'allpagesprefix'    => 'Мантан саҕаланар сирэйдэри бул:',
'allpagesbadtitle'  => 'Сирэй маннык ааттанара сатаммат: аакка туттуллуо суохтаах бэлиэлэрдээх эбэтэр тыллар ыккардыларыгар туһаныллар ыйынньыктаах.',
'allpages-bad-ns'   => '{{SITENAME}} не содержит пространства имён «$1».',

# Special:Categories
'categories'                    => 'Категориялар',
'categoriespagetext'            => 'Бу категориялар истэригэр сирэйдэр эбэтэр медиа-билэлэр бааллар.
[[Special:UnusedCategories|Туттуллубат категориялар]] манна көстүбэттэр.
Өссө маны көр: [[Special:WantedCategories|Баар буолуохтаах категориялар тиһиктэрэ]].',
'categoriesfrom'                => 'Мантан саҕаланар категориялары көрдөр:',
'special-categories-sort-count' => 'ахсаанынан бэрээдэктээһин',
'special-categories-sort-abc'   => 'алпабыытынан бэрээдэктээһин',

# Special:ListUsers
'listusersfrom'      => 'Мантан саҕалаан кыттааччылары көрдөр:',
'listusers-submit'   => 'Көрдөр',
'listusers-noresult' => 'Кыттааччылар булуллубатылар.',

# Special:ListGroupRights
'listgrouprights'          => 'Кыттааччылар бөлөхтөрүн бырааптара',
'listgrouprights-summary'  => 'Манна бу биикигэ баар бөлөхтөр уонна кинилэр киирэр бырааптара көстөллөр.
Баҕар дьон туспа бырааптарын  туһунан [[{{MediaWiki:Listgrouprights-helppage}}|эбии информация]] баара буолуо.',
'listgrouprights-group'    => 'Бөлөх',
'listgrouprights-rights'   => 'Бырааптар',
'listgrouprights-helppage' => 'Help:Бөлөхтөр бырааптара',
'listgrouprights-members'  => '(кыттар дьон испииһэгэ)',

# E-mail user
'mailnologin'     => 'Аадырыһа суох',
'mailnologintext' => 'Атын кыттааччылары кытта e-mail көмөтүнэн суруйсуоххун баҕарар буоллаххына бэйэҕин [[Special:UserLogin|билиһиннэриэхтээххин]]  уонна e-mail аадырыскын [[Special:Preferences|туруорууларгар]] суруйуохтааххын.',
'emailuser'       => 'Кыттааччыга сурук',
'emailpage'       => 'Кыттааччыга E-mail ыыт',
'emailpagetext'   => 'Бу кыттааччы бэйэтин туруорууларыгар эл. аадырыһын суруйбут буоллаҕына
аллараа баар форманы толорон сурук ыытыаххын сөп.
Эн [[Special:Preferences|туруорууларгар]] баар бэйэҥ аадырыһыҥ ол суруккар "Кимтэн" графааҕа киириэҕэ,
онон туппут киһи хардарар кыахтаныа.',
'usermailererror' => 'Сурук кыайан барбата:',
'defemailsubject' => '{{SITENAME}} эл. почтата',
'noemailtitle'    => 'E-mail суох',
'noemailtext'     => 'Бу кыттааччы e-mail аадырыһын эппэтэх,
эбэтэр атын кыттааччылартан сурук тутуон баҕарбатын биллэрбит.',
'emailfrom'       => 'Кимтэн:',
'emailto'         => 'Кимиэхэ:',
'emailsubject'    => 'Сурук аата:',
'emailmessage'    => 'Сурук:',
'emailsend'       => 'Ыыт',
'emailccme'       => 'Сурукпун бэйэбэр эмиэ ыыт.',
'emailccsubject'  => 'Эн суругуҥ куоппуйата $1: $2',
'emailsent'       => 'Сурук барда',
'emailsenttext'   => 'Эн суругуҥ ыытылынна.',
'emailuserfooter' => 'Бу сурук $2 кыттааччыга $1 кыттааччыттан «Сурукта ыыт» диэн функция көмөтүнэн {{SITENAME}} саайтан ыытыллыбыт.',

# Watchlist
'watchlist'            => 'Мин кэтээһиним',
'mywatchlist'          => 'Кэтээн көрөр сирэйдэрим',
'watchlistfor'         => "('''$1''' киэнэ)",
'nowatchlist'          => 'Эн кэтиир сирэйдэриҥ суохтар.',
'watchlistanontext'    => 'Кэтэбилиҥ сирэйин көрөргөр эбэтэр уларытаргар маны оҥор: $1.',
'watchnologin'         => 'Бэйэҕин билиһиннэр',
'watchnologintext'     => 'Бэйэҕин [[Special:UserLogin|билиһиннэрдэххинэ]] кэтэбил сирэйгин уларытыаххын сөп.',
'addedwatch'           => 'Кэтэбилгэ киирдэ',
'addedwatchtext'       => '«[[:$1]]» сирэй [[Special:Watchlist|кэтэбилгэ]] киирдэ.
Сирэй уларытыылара бүгүҥҥүттэн манна көстөр буолуохтара, эбиитин [[Special:RecentChanges|саҥа уларытыылар испииһэктэригэр]] модьу бичигинэн бэлиэтэнэн көстүөхтэрэ.',
'removedwatch'         => 'Кэтэбилтэн сотулунна',
'removedwatchtext'     => '"[[:$1]]" сирэй бу күнтэн кэтэбилгэ суох.',
'watch'                => 'Кэтээ',
'watchthispage'        => 'Бу сирэйи кэтээ',
'unwatch'              => 'Кэтээмэ',
'unwatchthispage'      => 'Кэтиири тохтот',
'notanarticle'         => 'Бу ыстатыйа буолбатах',
'notvisiblerev'        => 'Торум сотуллубут',
'watchnochange'        => 'Кэтиир сирэйдэргиттэн этиллибит кэмҥэ биир да уларыйбатах.',
'watchlist-details'    => '$1 сирэйи кэтиигин, ырытыы сирэйдэрин аахпатахха.',
'wlheader-enotif'      => '* эл. почтанан биллэрии холбоммут.',
'wlheader-showupdated' => "* Бүтэһик киириигит кэннэ уларыйбыт сирэйдэр '''модьу''' бичигинэн бэлиэтэннилэр",
'watchmethod-recent'   => 'кэтээн көрүү бүтэһик уларыйыыларын көрүү',
'watchmethod-list'     => 'кэтээһин бүтэһик уларыйыылара',
'watchlistcontains'    => '$1 сирэйи кэтээн көрөҕүн.',
'iteminvalidname'      => "'$1' моһуогурда, аата сатаммата...",
'wlnote'               => 'Манна кэлиҥҥи <strong>$2</strong> чааска бүтэһик $1 уларытыы көрдөрүлүннэ.',
'wlshowlast'           => 'бүтэһик $1 чааска $2 күҥҥэ $3 көрдөр',
'watchlist-show-bots'  => 'Роботтар уларытыыларын көрдөр',
'watchlist-hide-bots'  => 'Роботтар уларытыыларын көрдөрүмэ',
'watchlist-show-own'   => 'Мин уларытыыларбын көрдөр',
'watchlist-hide-own'   => 'Мин уларытыыларбын көрдөрүмэ',
'watchlist-show-minor' => 'Кыра суолталаах уларытыылары көрдөр',
'watchlist-hide-minor' => 'Кыра суолталаах уларытыылары көрдөрүмэ',

# Displayed when you click the "watch" button and it is in the process of watching
'watching'   => 'Кэтээ...',
'unwatching' => 'Кэтээмэ...',

'enotif_mailer'                => '{{SITENAME}} Биллэрэр Сулууспата',
'enotif_reset'                 => 'Бары сирэйдэри көрбүтүм курдук бэлиэтээ',
'enotif_newpagetext'           => 'Бу саҥа сирэй.',
'enotif_impersonal_salutation' => '{{SITENAME}} кыттааччыта',
'changed'                      => 'уларыйбыт',
'created'                      => 'айыллыбыт',
'enotif_subject'               => '«{{SITENAME}}» $PAGETITLE сирэйин $PAGEEDITOR кыттааччы $CHANGEDORCREATED',
'enotif_lastvisited'           => 'Бутэһик киирииҥ кэнниттэн оҥоһуллубут уларыйыылары барытын көрөргө манна киир: $1.',
'enotif_lastdiff'              => 'Уларытыыны манна көрүҥ: $1.',
'enotif_anon_editor'           => 'ааттамматах кыттааччы $1',
'enotif_body'                  => 'Күндү $WATCHINGUSERNAME,

«{{SITENAME}}» $PAGETITLE сирэйин $PAGEEDITDATE $PAGEEDITOR кыттааччы $CHANGEDORCREATED. Сирэй билиҥҥи туругун манна көр: $PAGETITLE_URL.

$NEWPAGE

Уларытыы кылгас ис хоһооно: $PAGESUMMARY $PAGEMINOREDIT

Уларыппыт киһи:
эл. почтата $PAGEEDITOR_EMAIL
вики: $PAGEEDITOR_WIKI

Бу сирэйи кэлин көрбөт буоллаххына атын биллэрии/сэрэтии кэлиэ суоҕа. Эн баҕар кэтиир сирэйдэргэр "уларытыыны биллэрэргэ" диэни иккистээн туруобутуҥ буолуо.

         Бары үтүөнү кытта {{SITENAME}} биллэрэр системата

--
Кэтиир сирэйдэриҥ испииһэгин уларытарга маны көр
{{fullurl:{{ns:special}}:Watchlist/edit}}

Көмө оҥорор уонна ыйытар сир: {{fullurl:{{MediaWiki:Helppage}}}}',

# Delete/protect/revert
'deletepage'                  => 'Сирэйи сот',
'confirm'                     => 'Бигэргэтии',
'excontent'                   => "иһинээҕитэ: '$1'",
'excontentauthor'             => 'иһинээҕитэ: «$1» (соҕотох ааптар [[Special:Contributions/$2|$2]])',
'exbeforeblank'               => "иһинээҕитэ сотуллуон иннинэ: '$1'",
'exblank'                     => 'сирэй кураанах этэ',
'delete-confirm'              => 'Маны "$1" соторго',
'delete-legend'               => 'Сотуу',
'historywarning'              => 'Сэрэтии: Сотоору турар сирэйиҥ устуоруйалаах:',
'confirmdeletetext'           => 'Эн сирэйи (ойууну) уонна кини устуоруйатын букатын сотоору гынаҕын.
Бука диэн, кырдьык инньэ гынаары гынаргын,
бу дьайыы туох содуллаах буоларын толору билэргин
уонна [[{{MediaWiki:Policy-url}}]] сиэрин кэспэккин бигэргэт.',
'actioncomplete'              => 'Дьайыы оҥоһулунна',
'deletedtext'                 => '«<nowiki>$1</nowiki>» сотуллубут.
Бүтэһик сотуулар испииһэктэрин манна: $2 көр.',
'deletedarticle'              => '"[[$1]]" сотуллубут',
'suppressedarticle'           => '"[[$1]]" кистээбит',
'dellogpage'                  => 'Сотуу испииһэгэ',
'dellogpagetext'              => 'Манна кэнники сотуулар испииһэктэрэ көстөр.',
'deletionlog'                 => 'сотуу испииһэгэ',
'reverted'                    => 'Урукку торумугар төннөрүлүннэ',
'deletecomment'               => 'Сотуу төрүөтэ:',
'deleteotherreason'           => 'Атын/эбии биричиинэлэр:',
'deletereasonotherlist'       => 'Атын биричиинэ',
'deletereason-dropdown'       => '*Common сотуу биричиинэтэ
** ааптар ирдээһинэ
** ааптар быраабын күөмчүлээһин
** Алдьатыы (Вандализм)',
'delete-edit-reasonlist'      => 'Сотуу төрүөтүн уларытыы',
'delete-toobig'               => 'Бу сирэй уларытыыларын историята уһун, хас да ($1) {{PLURAL:$1|хат көрүүлээх|хат көрүүлэрдээх}}. Маннык сирэйдэри сотор хааччахтанар, тоҕо диэххэ алҕас {{SITENAME}} алдьаныан сөп.',
'delete-warning-toobig'       => 'Бу сирэй уларыылара уһун историялаах, хас да ($1) {{PLURAL:$1|хат көрүүлээх|хат көрүүлэрдээх}}. Маны соттоххуна, {{SITENAME}} билэтин тиһигин алдьатыан сөп; салгыыр буоллаххына сэрэнэн үлэлээ.',
'rollback'                    => 'Уруккутугар төннөр',
'rollback_short'              => 'Төннөрүү',
'rollbacklink'                => 'төннөр',
'rollbackfailed'              => 'Төннөрөргө моһуок үөскээтэ',
'cantrollback'                => 'Төннөрөр кыах суох; бүтэһик көннөрүүнү оҥорбут киһи бу сирэй соҕотох ааптара буолар.',
'alreadyrolled'               => 'Бүтэһик [[User:$2|$2]] ([[User talk:$2|Ырытыы]] | [[Special:Contributions/$2|{{int:contribslink}}]]) оҥорбут [[:$1]] уларытыыларын төннөрөр кыах суох;
ким эрэ атын номнуо бу сирэйи уларыппыт эбэтэр уруккутун төннөрбүт.

Кэнники уларытыыны [[User:$3|$3]] ([[User talk:$3|Ырытыы]] | [[Special:Contributions/$3|{{int:contribslink}}]]) оҥорбут.',
'editcomment'                 => 'Уларытыыны маннык быһаарбыттар: "<i>$1</i>".', # only shown if there is an edit comment
'revertpage'                  => '([[User talk:$2|Ырытыы]]) көннөрүүлэрэ: [[Special:Contributions/$2|$2]] бу торумҥа: [[User:$1|$1]] төннөрүлүннүлэр', # Additional available: $3: revid of the revision reverted to, $4: timestamp of the revision reverted to, $5: revid of the revision reverted from, $6: timestamp of the revision reverted from
'rollback-success'            => '$1 көннөрүүлэр бу торумҥа төннөрүлүннүлэр: $2.',
'sessionfailure'              => 'Арааһа туох эрэ сатаммата, дьайыыҥ оҥоһуллубата. Браузергар "Төнүн" тимэҕи баттаа уонна бу иннинээҕи сирэйгин иккистээн киллэрэн көр.',
'protectlogpage'              => 'Харысхал сурунаала (көннөрүүттэн көмүскэммит билэлэр испииһэктэрэ)',
'protectlogtext'              => 'Манна ыстатыйалары уларытыыттан көмүскээһин уонна ол көмүскэли суох оҥоруу устуоруйата суруллубут.
Эн өссө [[Special:ProtectedPages|билигин уларытыллыбат сирэйдэр]] испииһэктэрин көрүөххүн сөп.',
'protectedarticle'            => '"[[$1]]" сирэй уларытыллыбат',
'modifiedarticleprotection'   => '"[[$1]]" сирэй уларытыытын таһыма уларыйда',
'unprotectedarticle'          => '"[[$1]]": уларытыыны хааччахтааһын суох оҥоһулунна',
'protect-title'               => '"$1": Уларытыы таһымын туруоруу',
'protect-legend'              => 'Уларытыы таһымын бигэргэт',
'protectcomment'              => 'Хос быһаарыы:',
'protectexpiry'               => 'Бүтүөхтээх:',
'protect_expiry_invalid'      => 'Уларытыыны хааччахтааһын болдьоҕун кэмэ сатаан турбата.',
'protect_expiry_old'          => 'Болдьох кэмэ сыыһа ааспыт кэмҥэ турбут.',
'protect-unchain'             => 'Ааты уларытыыны көҥүллээ',
'protect-text'                => 'Эн <strong><nowiki>$1</nowiki></strong> сирэй уларытыытын таһымын көрүөххүн уонна уларытыаххын сөп.',
'protect-locked-blocked'      => 'Уларытыы таһымын учуотунай суругуҥ бобуллубут кэмигэр уларытар кыаҕыҥ суох.
<strong>$1</strong> сирэй уларытыытын таһыма:',
'protect-locked-dblock'       => 'Уларытыы таһыма уларыйар кыаҕа суох - дааннайдар баазаларын уларытар бобулунна.
<strong>$1</strong> сирэй уларытыытын таһыма билиҥҥи туругунан маннык:',
'protect-locked-access'       => 'Эн аккаунуҥ уларытыы таһымын көннөрөр кыаҕа суох.
<strong>$1</strong> сирэй уларыыттын таһыма билиҥҥи туругунан маннык:',
'protect-cascadeon'           => 'Бу сирэй уларытыыттан көмүскэммит {{PLURAL:$1|сирэй бөлөҕөр|сирэйдэр бөлөхтөрүгэр}} (каскааднай көмүскэл) киирэр буолан эмиэ көмүскэммит. Эн көмүскэнии таһымын уларытыаххын сөп, ол каскаднай көмүскэли уларыппат.',
'protect-default'             => '(этиллибэтэҕинэ)',
'protect-fallback'            => '"$1" көҥүллэ көрдөө',
'protect-level-autoconfirmed' => 'Бэлиэтэммэтэх кыттааччылар уларыппаттарын курдук оҥор',
'protect-level-sysop'         => 'Админнар эрэ',
'protect-summary-cascade'     => 'каскадтаах',
'protect-expiring'            => 'болдьоҕо $1 (UTC)',
'protect-cascade'             => 'Бу сирэйгэ киирэр сирэйдэри уларытыыттан көмүскээ (cascading protection)',
'protect-cantedit'            => 'Бу сирэй хатааһынын таһымын уларыппаккын: уларытар кыах бэриллибэтэх.',
'restriction-type'            => 'Маны оҥорор кыахтааххын:',
'restriction-level'           => 'Киирии таһыма:',
'minimum-size'                => 'Оччугуй',
'maximum-size'                => 'Бөдөҥ:',
'pagesize'                    => '(байт)',

# Restrictions (nouns)
'restriction-edit'   => 'Уларытыы',
'restriction-move'   => 'Аатын уларытыы',
'restriction-create' => 'Ай',
'restriction-upload' => 'Киллэрии',

# Restriction levels
'restriction-level-sysop'         => 'Кытаанах көмүскэл (харысхал)',
'restriction-level-autoconfirmed' => 'Сымнаҕас көмүскэл (харысхал)',
'restriction-level-all'           => 'бары таһымнар',

# Undelete
'undelete'                     => 'Сотуллубут сирэйдэри көрүү',
'undeletepage'                 => 'Сотуллубут сирэйдэри көрүү уонна төннөрүү',
'undeletepagetitle'            => "'''Манна [[:$1|$1]] сирэй сотуллубут торумнарын тиһигэ көстөр'''.",
'viewdeletedpage'              => 'Сотуллубут сирэйдэри көрүү',
'undeletepagetext'             => 'Манна ыйыллыбыт сирэйдэр сотуллубуттар гынан баран архыыпка сыталлар.
Онон оннуларыгар төннөрүөххүн сөп. Архыып кэмиттэн кэмигэр ыраастанар.',
'undelete-fieldset-title'      => 'Торумнары төнүннэр',
'undeleteextrahelp'            => "Сирэйи барытын оннугар төннөрөргө тугу да бэлиэтээмэ уонна '''''Төннөр''''' тимэҕи баттаа.
Сирэй сороҕун эрэ төннөрөр буоллаххына сорох эрэ торумнарын бэлиэтээ уонна '''''Төннөр''''' тимэҕи баттаа.
'''''Ыраастаа''''' тимэҕи баттаатаххына бэлиэлэр уонна хос быһаарыы сүтүөхтэрэ.",
'undeleterevisions'            => 'Архыыпка $1 торум баар',
'undeletehistory'              => 'Сирэйи төннөрдөххүнэ уларытыытын устуоруйата барыта төннөрүллүө.
Сотуллубутун кэннэ маннык ааттаах атын сирэй оҥоһуллубут түбэлтэтигэр төннөрүллүбүт торумнар уларытыы сурунаалыгар саҥа суруктар иннилэригэр суруллуохтара.',
'undeleterevdel'               => 'Бу дьайыы сирэй эбэтэр билэ бүтэһик торумун сороҕун сотор кыахтаах буоллаҕына, оҥоһуллуо суоҕа.
Оннук түбэлтэҕэ эн бэлиэни устуохтааххын, эбэтэр бүтэһик сотуллубут торумнары көрдөрүөхтээххин.',
'undeletehistorynoadmin'       => 'Ыстатыйа сотуллубут.
Сотуу төрүөтэ уонна ыстатыйаны суруйбут кыттааччылар испииһэктэрэ манна көрдөрүлүннэ.
Сотуллубут ыстатыйа ис хоһоонун админнар эрэ көрүөхтэрин сөп.',
'undelete-revision'            => '$1 сотуллубут торума ($2), $3 соппут:',
'undeleterevision-missing'     => 'Сыыһа эбэтэр суох торум.
Арааһа ыйынньыгыҥ сыыһа суруллубут, эбэтэр бу торум архыыптан сотуллан хаалбыт.',
'undelete-nodiff'              => 'Ханнык да иннинээҕи торум көстүбэтэ.',
'undeletebtn'                  => 'Төннөр',
'undeletelink'                 => 'төннөр',
'undeletereset'                => 'Саҥаттан',
'undeletecomment'              => 'Хос быһаарыы:',
'undeletedarticle'             => '"[[$1]]" төннөрүлүннэ',
'undeletedrevisions'           => '$1 уларытыы төннөрүлүннэ',
'undeletedrevisions-files'     => '$1 уларытыы уонна $2 билэ төннөрүлүннэ',
'undeletedfiles'               => '$1 билэ төннөрүлүннэ',
'cannotundelete'               => 'Төннөрүллүбэтэ; баҕар ким эрэ номнуо төннөрө охсубута буолуо.',
'undeletedpage'                => "<big>'''$1 төннөрүлүннэ (төннөрүллүбүт)'''</big>

Кэнники сотуулар уонна төннөрүүлэр испииһэктэрин [[Special:Log/delete|манна]] көрүөххүн сөп.",
'undelete-header'              => 'Соторутааҥы [[Special:Log/delete|сотуу испииһэгин]] көрүөххүн сөп.',
'undelete-search-box'          => 'Сотуллубут сирэйдэри көрдөөһүн',
'undelete-search-prefix'       => 'Мантан саҕаланар сирэйдэри көрдөө:',
'undelete-search-submit'       => 'Көрдөө',
'undelete-no-results'          => 'Сотуллубут сирэйдэргэ эн көрдүүр сирэйиҥ көстүбэтэ.',
'undelete-filename-mismatch'   => 'Сирэй $1 кэмнээҕи торумун төннөрөр кыах суох: аата сөп түбэспэт',
'undelete-bad-store-key'       => 'Сирэй $1 кэмнээҕи торумун төннөрөр кыах суох: сотуу иннинэ маннык билэ суох этэ.',
'undelete-cleanup-error'       => 'Туһаныллыбат, архыыпка сытар "$1" билэ кыайан сотуллубата.',
'undelete-missing-filearchive' => 'Архыыпка сытыахтаах $1 нүөмэрдээх билэни суох буолан төннөрөр сатаммата. Номнуо төннөрүллүбүт буолуон сөп.',
'undelete-error-short'         => 'Билэни төннөрүү моһуогурда: $1',
'undelete-error-long'          => 'Билэни төннөрүү кэмигэр моһуок таҕыста:

$1',

# Namespace form on various pages
'namespace'      => 'Аат дала (Пространство имён):',
'invert'         => 'Бэлиэтэниллибити таҥнары тут',
'blanknamespace' => '(Сүрүн)',

# Contributions
'contributions' => 'Кыттааччы суруйуута (вклад)',
'mycontris'     => 'Суруйуум испииһэгэ',
'contribsub2'   => 'Вклад $1 ($2)',
'nocontribs'    => 'Эппит критерийгэр эппиэттиир уларытыылар көстүбэтилэр.',
'uctop'         => '(бүтэһик)',
'month'         => 'Ый иһигэр:',
'year'          => 'Сыл иһигэр:',

'sp-contributions-newbies'     => 'Саҥа эрэ ааттан оҥоһуллубут уларытыылары көрдөр',
'sp-contributions-newbies-sub' => 'Саҥа ааттартан',
'sp-contributions-blocklog'    => 'Бобуу сурунаала',
'sp-contributions-search'      => 'Кыттааччы оҥорбут уларытыыларын көрдөөһүн',
'sp-contributions-username'    => 'IP аадырыһа эбэтэр аата:',
'sp-contributions-submit'      => 'Көрдөө',

# What links here
'whatlinkshere'            => 'Манна сигэнэллэр',
'whatlinkshere-title'      => 'Сирэй манна сигэнэр "$1"',
'whatlinkshere-page'       => 'Сирэй:',
'linklistsub'              => '(Ыйынньыктар испииһэктэрэ)',
'linkshere'                => "'''[[:$1]]''' билэҕэ манна көрдөрүллүбүт сирэйдэр сигэнэллэр:",
'nolinkshere'              => "'''[[:$1]]''' сирэйгэ сигэнэр сирэйдэр суохтар.",
'nolinkshere-ns'           => "Талыллыбыт бөлөххө (namespace) бу '''[[:$1]]''' сирэйгэ сигэнэр сирэйдэр суохтар.",
'isredirect'               => 'көлбөрүтэр сирэй',
'istemplate'               => 'иһинээҕи',
'isimage'                  => 'ойуу сигэтэ',
'whatlinkshere-prev'       => '{{бу иннинээҕи $1}}',
'whatlinkshere-next'       => '{{аныгыскы $1}}',
'whatlinkshere-links'      => '← ыйынньыктар',
'whatlinkshere-hideredirs' => '$1 утаарыы',
'whatlinkshere-hidetrans'  => '$1 киллэриилэр',
'whatlinkshere-hidelinks'  => '$1 сигэ (ыйынньык)',
'whatlinkshere-hideimages' => '$1 ойуу сигэтэ',
'whatlinkshere-filters'    => 'Фильтрдар',

# Block/unblock
'blockip'                         => 'IP аадырыстан киириини бобуу',
'blockip-legend'                  => 'Кыттааччыны хааччахтааһын',
'blockiptext'                     => 'Ханнык эмит IP-ттан суруйары манна баар форманы туһанан боп.
Вандализмы утаран уонна [[{{MediaWiki:Policy-url}}]]
быраабылалрын тутуһан эрэ бобуохтааххын.
Хайаан да бобуу төрүөтүн кэпсээ (холобур, вандализм баар сирэйдэриттэн
быһа тардан манна көрдөр).',
'ipaddress'                       => 'IP аадырыһа:',
'ipadressorusername'              => 'IP аадырыһа эбэтэр кыттааччы аата:',
'ipbexpiry'                       => 'Түмүктэниэ:',
'ipbreason'                       => 'Төрүөт (тоҕо):',
'ipbreasonotherlist'              => 'Атын биричиинэ',
'ipbreason-dropdown'              => '* Бобуу сүрүн биричиинэлэрэ
** Сымыйаны суруйуу
** Сирэй иһинээҕитин суох оҥоруу
** Тас саайтарга спам-ыйынньыктары олордуу
** Туох да суолтата суох тиэкиһи суруйуу
** Кыттааччыларга суоһурҕаныы, күөмчүлээһин
** Хас да аатынан киирэн куһаҕаны оҥоруу
** Бүрүкүтэ суох ааттаныы',
'ipbanononly'                     => 'Ааттамахтар уларыталларын эрэ боп',
'ipbcreateaccount'                => 'Саҥа кытааччылары оҥорума',
'ipbemailban'                     => 'Кыттааччы эл. суругу суруйарын боборго',
'ipbenableautoblock'              => 'Кыттааччы туһаммыт IP-аадырыстарын боборго',
'ipbsubmit'                       => 'Бу кыттааччыны тохтот',
'ipbother'                        => 'Атын кэм:',
'ipboptions'                      => '2 чаас:2 hours,1 күн:1 day,3 күн:3 day,1 нэдиэлэ:1 week,2 нэдиэлэ:2 week,1 ый:1 month,3 ый:3 month,6 ый:6 month,1 сыл:1 month,больдьоҕо суох:infinite', # display1:time1,display2:time2,...
'ipbotheroption'                  => 'атын',
'ipbotherreason'                  => 'Атын/эбии биричиинэлэр:',
'ipbhidename'                     => 'Кыттааччы аатын бобуу сурунаалыгар, бобуллубуттар уонна кытааччылар уопсай испииһэктэригэр көрдөрүмэ',
'ipbwatchuser'                    => 'Кыттааччы бэйэтин туһунан сирэйин уонна ырытыытын сирэйин кэтииргэ',
'badipaddress'                    => 'IP аадырыһа сыыһа',
'blockipsuccesssub'               => 'Тохтотулунна',
'blockipsuccesstext'              => '[[Special:Contributions/$1|«$1»]] бобуллубут/тохтотуллубут.<br />
[[Special:IPBlockList|Бобуллубут IP-лар испииһэктэрин]] көр.',
'ipb-edit-dropdown'               => 'Бобуу биричиинэтин уларыт',
'ipb-unblock-addr'                => '$1 бобуутун суох гын',
'ipb-unblock'                     => 'Кыттаачыны эбэтэр IP-ны бобуллубуттар испииһэктэриттэн таһаар',
'ipb-blocklist-addr'              => '$1 бобууларын көрдөр',
'ipb-blocklist'                   => 'Бобуулары көрдөр',
'unblockip'                       => 'Кыттааччыны көҥүллээ',
'unblockiptext'                   => 'IP эбэтэр кыттааччы көннөрөр/уларытар быраабын манна баар форманы туһанан төннөр.',
'ipusubmit'                       => 'Бу IP-га уларытар быраабын төннөр',
'unblocked'                       => '[[User:$1|$1]] хааччахтаныыта уһулунна',
'unblocked-id'                    => '$1 хааччахтаныыта уһулунна',
'ipblocklist'                     => 'Бобуллубут IP-лар уонна кыттааччылар',
'ipblocklist-legend'              => 'Хааччахтаммыт/бобуллубут кыттааччыны көрдөөһүн',
'ipblocklist-username'            => 'Кыттааччы аата эбэтэр IP-та:',
'ipblocklist-submit'              => 'Бул',
'blocklistline'                   => '$1, $2 хааччахтаабыт/боппут: $3 ($4)',
'infiniteblock'                   => 'болдьоҕо суох',
'expiringblock'                   => 'болдьоҕо: $1',
'anononlyblock'                   => 'ааттамматахтары эрэ',
'noautoblockblock'                => 'автоблокировка араарылынна',
'createaccountblock'              => 'саҥа бэлиэтэнии бобуллубут',
'emailblock'                      => 'суруйар бобуллубут',
'ipblocklist-empty'               => 'Бобуллуу испииһэгэ кураанах.',
'ipblocklist-no-results'          => 'Бу IP эбэтэр кыттааччы бобуллубатах.',
'blocklink'                       => 'боп/хааччахтаа',
'unblocklink'                     => 'бобууну/хааччахтааһыны суох гын',
'contribslink'                    => 'вклад',
'autoblocker'                     => 'Эн IP-ҥ "[[User:$1|$1]]" кыттааччыны кытта биир буолан, эн эмиэ хааччахтаныыга түбэстиҥ. Кини хааччахтаммыт төрүөтэ: "$2"',
'blocklogpage'                    => 'Хааччахтааһын/бобуу сурунаала',
'blocklogentry'                   => '[[$1]] хааччахтаата, болдьоҕо: $2 $3',
'blocklogtext'                    => 'Кыттааччылары хааччахтааһын уонна ол хааччахтааһыннарын суох гыныы сурунаала.
Аптамаатынан хааччахтаммыт IP-лар манна көстүбэттэр.
[[Special:IPBlockList|Билигин баар хааччахтаныылар испииһэктэрин]] көр.',
'unblocklogentry'                 => '$1 хааччахтааһыны уһулла',
'block-log-flags-anononly'        => 'ааттамматах кыттааччылар эрэ',
'block-log-flags-nocreate'        => 'саҥа бэлиэтэнии бобуллубут',
'block-log-flags-noautoblock'     => 'аптаамаатынан хааччахтааһын араарыллыбыт',
'block-log-flags-noemail'         => 'суруктар бобуллубуттар',
'block-log-flags-angry-autoblock' => 'кэҥэтиллибит автоблок холбоммут',
'range_block_disabled'            => 'Админнар диапазоннары боболлоро көҥүллэммэт.',
'ipb_expiry_invalid'              => 'Сатаммат кэми туруордуҥ.',
'ipb_expiry_temp'                 => 'Аатын кистиэһиннээх бобуу больдьоҕо суох буолуохтаах.',
'ipb_already_blocked'             => '"$1" номнуо бобуллубут',
'ipb_cant_unblock'                => 'Алҕас: $1 нүөмэрдээх бобуу булуллубата. Баҕар кыттааччы хааччаҕын устубуттара буолуо.',
'ipb_blocked_as_range'            => 'Сыыһа: $1 IP-та чопчу бобуллубатах (не блокирован), онон аһыллар кыаҕа суох. Ол гынан баран IP бу $2 диапазон сорҕотун быһыытынан бобуллубут, ону арыйыахха (бобуутун устуохха) сөп.',
'ip_range_invalid'                => 'IP-лар диапазоннара сатаммат.',
'blockme'                         => 'Миигин боп (блокируйдаа)',
'proxyblocker'                    => 'Прокси бобуллуута',
'proxyblocker-disabled'           => 'Бу дьайыы араарыллыбыт.',
'proxyblockreason'                => 'Эн IP-ҥ аһаҕас прокси эбит, онон бобулунна. Интернет-провайдергын эбэтэр техническэй сулууспаны кытта сибээстэһэн кутталлаах суол баарын биллэр.',
'proxyblocksuccess'               => 'Сатанна.',
'sorbsreason'                     => 'Эн IP-ҥ {{SITENAME}} саайт DNSBL-гар аһаҕас прокси быһыытынан сылдьар.',
'sorbs_create_account_reason'     => 'Эн IP-ҥ {{SITENAME}} саайт DNSBL-гар аһаҕас прокси быһыытынан сылдьар. Саҥаттан бэлиэтэнэр кыаҕыҥ суох.',

# Developer tools
'lockdb'              => 'Билии олоҕо (database) хатаммыт (көрүөххэ эрэ сөп)',
'unlockdb'            => 'билии олоҕун (database) хааччаҕын уһул',
'lockdbtext'          => 'database хааччахтаатаххына атыттар сирэйдэри, туруорууларын, кэтээн көрүү испииһэгин уларытар уонна да атын database көмөтүнэн оҥоһуллар дьайыылары оҥорор кыахтара суох буолуо.
Чахчы инньэ гыныаххын баҕарар буоллаххына уонна хааччахтааһыны, туттан баран, бэйэм суох гыныам диир буоллаххына, бигэргэт.',
'unlockdbtext'        => 'Билии олоҕун уларытары көҥүллээһин атыттарга сирэйдэри, туруорулары, кэтээһин сирэйдэрин уларытар кыаҕы, уонна да атын билии олоҕун көмөтүнэн оҥоһуллар дьайыылары оҥорор кыаҕы биэрэр.
Чахчы инньэ гыныаххын баҕарар буоллаххына бигэргэт.',
'lockconfirm'         => 'Сөп, мин чахчы билии олоҕун (database) хааччахтаары гынабын.',
'unlockconfirm'       => 'Сөп, мин чахчы билии олоҕун (database) хааччахтааһынын устаары гынабын.',
'lockbtn'             => 'Билии олоҕун (database) уларытары бобуу',
'unlockbtn'           => 'Билии олоҕун (database) уларытары көҥүллээһин',
'locknoconfirm'       => 'Бигэргэтиини бэлиэтээбэтэххин.',
'lockdbsuccesssub'    => 'Билии олоҕун (Database) уларытыы бобулунна',
'unlockdbsuccesssub'  => 'Билии олоҕун (Database) уларытыы көҥүллэннэ',
'lockdbsuccesstext'   => 'Билии олоҕун (database) уларытар бобулунна.
<br />Үлэлээн бүттэххинэ [[Special:UnlockDB|уларытары көҥүллүүргүн]] умнума.',
'unlockdbsuccesstext' => 'Билии олоҕун (database) уларытар көҥүллэннэ.',
'lockfilenotwritable' => 'Бобуу билэтигэр суруйар кыаҕыҥ суох. БД уларытары көҥүллүүргэ эбэтэр боборго веб-сервер бу билэни уларытар бырааптаах буолуохтаах.',
'databasenotlocked'   => 'БД уларытааһын бобуллубата.',

# Move page
'move-page'               => '$1 - аатын уларытыы',
'move-page-legend'        => 'Аатын уларытыы',
'movepagetext'            => "Манна баар форманы туһанан сирэй аатын уларытыаххын сөп.
Бу түбэлтэҕэ уларытыы сурунаала саҥа сиргэ көһөр.
Урукку аат саҥа сирэйгэ утаарар сирэйгэ кубулуйар.
Урукку аакка ыйынньыктар уларыйбаттар; 
бука диэн [[Special:DoubleRedirects|хос ыйынньыктар]] уонна [[Special:BrokenRedirects|быстыбыт сигэниилэр]] баалларын-суохтарын көр.
Сиэр быһыытынан ыйынньыктар сөпкө сигэнэллэрин эн ситиһиэхтээххин.

Өскө маннык ааттаах сирэй номнуо баар буоллаҕына сирэй аата '''уларыйыа суоҕа''', арай ол сирэй кураанах эбэтэр утаарар сирэй буолбатах буоллаҕына.
Ол аата эн сирэй аатын сыыһа уларыппыт буоллаххына төттөрү урукку аатыгар төннөрүөххүн сөп гынан баран баар сирэйи алҕас сотор кыаҕыҥ суох.

'''СЭРЭТИИ!'''
Сирэй аатын уларытыы улахан уонна эрдэттэн өйдөммөтөх содуллаах буолуон сөп.
Онон, бука диэн салгыаҥ иннинэ үчүгэйдик толкуйдаа.",
'movepagetalktext'        => 'Холбонуллубут ырытыы (баар буоллаҕына) эмиэ аатын уларытыа. Ол сатаммат түбэлтэлэрэ:
*Маннык ааттаах кураанах буолбатах ырытыы баар буоллаҕына
*Манна бэлиэ туруорбатаххына.

Ити түгэннэргэ сирэйдэри бэйэҥ көһөрүөхтээххин эбэтэр холбуохтааххын.',
'movearticle'             => 'Бу аатын уларыт:',
'movenotallowed'          => 'Cирэйдэр ааттарын уларытар кыаҕыҥ суох.',
'newtitle'                => 'Саҥа аата:',
'move-watch'              => 'Кэтээн көрөргө',
'movepagebtn'             => 'Аатын уларыт',
'pagemovedsub'            => 'Аата уларыйда',
'movepage-moved'          => '<big>\'\'\'"$1" сирэй аата маннык буолла "$2"\'\'\'</big>', # The two titles are passed in plain text as $3 and $4 to allow additional goodies in the message.
'articleexists'           => 'Маннык ааттаах сирэй баар, эбэтэр
маннык аат көҥүллэммэт эбит.
Атын аатта таларгар көрдөһөбүт.',
'cantmove-titleprotected' => 'Сирэйи көһөрөр кыаҕыҥ суох: саҥа аат оҥоһуллара бобуллубут',
'talkexists'              => "'''Сирэй аата уларыйда, ол гынан баран ырытыы аата сатаан уларыйбата, тоҕо диэтэххэ маннык ааттаах ырытыы сирэйэ баар эбит. Онон бэйэҥ ол икки ырытыы сирэйдэрин холбууруҥ буоллар.'''",
'movedto'                 => 'аатын манныкка уларытыллыбыт:',
'movetalk'                => 'Сөп түбэһэр ырытыы сирэйин аатын эмиэ уларыт',
'move-subpages'           => 'Субсирэйдэри сатанар буоллаҕына ааттарын уларыт',
'move-talk-subpages'      => 'Сатанар буоллаҕына ырытыы субсирэйдэрин барытын ааттарын уларыт',
'movepage-page-exists'    => '$1 сирэй номнуо баар, онон аптамаатынан хос суруллар кыаҕа суох.',
'movepage-page-moved'     => '$1 сирэй аата $2 буолбут.',
'movepage-page-unmoved'   => '$1 сирэй $2 ааттанар кыаҕа суох.',
'movepage-max-pages'      => '$1 {{PLURAL:$1|сирэй аата уларыйда|сирэйдэр ааттара уларыйда}} — мантан элбэх сирэйи аптамаатынан уларытар кыах суох.',
'1movedto2'               => '[[$1]] аата манныкка уларытылынна: [[$2]]',
'1movedto2_redir'         => 'Утаарыы үрдүнэн [[$1]] сирэй аата манныкка уларытылынна: [[$2]]',
'movelogpage'             => 'Аат уларыйыытын испииһэгэ',
'movelogpagetext'         => 'Манна ааттара уларытыллыбыт сирэйдэр испииһэктэрэ көстөр.',
'movereason'              => 'Төрүөтэ:',
'revertmove'              => 'төннөрүү',
'delete_and_move'         => 'Суох гын уонна аатын уларыт',
'delete_and_move_text'    => '==Сотуохха наада==

Маннык ааттаах сирэй [[:$1|«$1»]] бэлиэр баар. Эн ону суох гынан баран аатын уларытаары гынаҕын дуо?',
'delete_and_move_confirm' => 'Сөп, бу сирэйи суох гын',
'delete_and_move_reason'  => 'Аатын уларытаары сотулунна',
'selfmove'                => 'Аатын уларытар сатаммат. Эргэ уонна саҥа аата биирдэр.',
'immobile_namespace'      => 'Аатын уларытар сатаммат. Саҥа дуу эргэ дуу аата аналлаах (служебнай) тыллаах эбит.',
'imagenocrossnamespace'   => 'Ойууга атын аат далыттан аат биэрэр сатаммат',
'imagetypemismatch'       => 'Билэ саҥа расширенията тиибигэр сөп түбэспэт',
'imageinvalidfilename'    => 'Билэ аата сыыһалаах',
'fix-double-redirects'    => 'Утаарыылары урукку ааттарыгар төннөр',

# Export
'export'            => 'Сирэйдэри таска таһаарааһын (export)',
'exporttext'        => 'Эн тиэкиһи уонна уларытыы сурунаалын таска XML көрүҥүнэн таһаарыаххын (экспортыаххын) сөп.
Онтугун MediaWiki көмөтүнэн үлэлиир атын вики-бырайыакка [[Special:Import|киллэриэххин]] (импортыаххын) сөп.

Ыстатыйалары таһаарарга (экспортыырга) ааттарын строкааҕа биирдии аатынан,
уларытыы түннүгэр (поле редактирования) суруй.
Онтон тал: ыстатыйалар историяларын барытын көһөрөҕүн дуу, кэлиҥҥи торумнарын эрэ дуу.

Экспорт анал аадырыһын туһанан сирэй бүтэһик торумун көһөрүөххэ эмиэ сөп.
Холобур, [[{{MediaWiki:Mainpage}}]] сирэйи маннык: [[{{ns:special}}:Export/{{MediaWiki:Mainpage}}]].',
'exportcuronly'     => 'Бүтэһик торуму эрэ киллэр, уларытыы толору историята наадата суох',
'exportnohistory'   => "----
'''Биллэрии:''' Сирэй толору историятын таһаарыы (экспорт) кыах тиийбэтинэн араарыллыбыт.",
'export-submit'     => 'Таска таһаарыы (экспорт)',
'export-addcattext' => 'Бу категрияттан сирэйдэри эп:',
'export-addcat'     => 'Эбэн биэр',
'export-download'   => 'Билэ быһыытынан хаалларыахха диэ',
'export-templates'  => 'Халыыптары киллэрии',

# Namespace 8 related
'allmessages'               => 'Систиэмэ (тиһик) биллэриилэрэ',
'allmessagesname'           => 'Биллэрии',
'allmessagesdefault'        => 'Туспа этиллибэтэҕинэ суруллар тиэкис',
'allmessagescurrent'        => 'Билиҥҥи тиэкис',
'allmessagestext'           => 'Манна MediaWiki биллэриилэрин испииһэгэ көстөр.
Эн MediaWiki движогун тылбаастыырга көмөлөһүөххүн баҕарар буоллаххына манна [http://www.mediawiki.org/wiki/Localisation MediaWiki Localisation] уонна манна [http://translatewiki.net Betawiki] киир.',
'allmessagesnotsupportedDB' => "'''{{ns:special}}:Allmessages''' туттуллар кыаҕа суох, тоҕо диэтэххэ '''\$wgUseDatabaseMessages''' араарыллыбыт.",
'allmessagesfilter'         => 'Сурук аатын фильтра:',
'allmessagesmodified'       => 'Уларыйбыттары эрэ көрдөр',

# Thumbnails
'thumbnail-more'           => 'Улаатыннар',
'filemissing'              => 'Билэ көстүбэтэ',
'thumbnail_error'          => 'Кыра ойууну оҥоруу сатаммата: $1',
'djvu_page_error'          => 'DjVu сирэй тиһик таһыгар эбит',
'djvu_no_xml'              => 'DjVu билэтигэр аналлаах XML кыайан ылыллыбата',
'thumbnail_invalid_params' => 'Кыра ойуу кээмэйэ сыыһалаах',
'thumbnail_dest_directory' => 'Наадалаах каталогы оҥорор табыллыбата',

# Special:Import
'import'                     => 'Сирэйдэри импортааһын',
'importinterwiki'            => 'Биики ыккардынааҕы импорт',
'import-interwiki-text'      => 'Биикини уонна импортанар сирэй аатын киллэр.
Уларытыылар күннэрэ-ыйдара уонна аапптардар ааттара оннуларынан хаалыахтара.
Биики ыккардынааҕы импорт дьайыылара [[Special:Log/import|аналлаах сурунаалга]] суруллаллар.',
'import-interwiki-history'   => 'Сирэй туох баар историятын көһөрөргө',
'import-interwiki-submit'    => 'Импортаа',
'import-interwiki-namespace' => 'Сирэйдэри бу namespace-ка көһөрөргө:',
'importtext'                 => 'Сирэйи [[Special:Export|экспорт үнүстүрүмүөнүн]] көмөтүнэн экспортаа. Билэни бэйэҥ көмпүүтэргэр суруй, онтон манна көһөр.',
'importstart'                => 'Сирэйдэри импортааһын...',
'import-revision-count'      => '$1 {{PLURAL:$1|торум|торумнар}}',
'importnopages'              => 'Импортка аналлаах сирэй суох.',
'importfailed'               => 'Импортыыр табыллыбата: $1',
'importunknownsource'        => 'Импортанар сирэй биллибэт көрүҥнээх',
'importcantopen'             => 'Импортанар билэ кыайан арыллыбат',
'importbadinterwiki'         => 'Интервики ыйынньык сыыһа',
'importnotext'               => 'Тиэкис суох',
'importsuccess'              => 'Импортааһын түмүктэннэ!',
'importhistoryconflict'      => 'Баар торумнар сөпсөспөтүлэр (баҕар сирэй номнуо импортаммыт буолуон сөп)',
'importnosources'            => 'Биики ыккрадынааҕы импортанар билэ талыллыбатах, уларытыы историятын көһөрүү арахса сылдьар.',
'importnofile'               => 'Импортанар билэ сатаан киллэриллибэтэ.',
'importuploaderrorsize'      => 'Файл ыйааhына наhаа улахан буолан хачайдааhын тохтотулунна.',
'importuploaderrorpartial'   => 'Хачайдааhын тохтотулунна. Файл сорҕото эрэ сурулунна.',
'importuploaderrortemp'      => 'Хачайдааhын тохтотулунна. Быстах кэмҥэ уурар сир көстүбэтэ.',
'import-parse-failure'       => 'Импортааһын кэмигэр ошибка разбора XML',
'import-noarticle'           => 'Импортанар сирэй суох!',
'import-nonewrevisions'      => 'Туох баар торумнар бу иннинэ импортаммыттар/импортаннылар.',
'xml-error-string'           => '$1 - $2 строка, $3 колонка ($4 байт): $5',
'import-upload'              => 'XML-дааннайдары киллэр',

# Import log
'importlogpage'                    => 'Импорт сурунаала',
'importlogpagetext'                => 'Сирэйдэри историяларын кытта холбуу атын биикилэртэн импортааһын.',
'import-logentry-upload'           => '[[$1]] - билэттэн импортааһын',
'import-logentry-upload-detail'    => '$1 торум',
'import-logentry-interwiki'        => 'биикилэр ыккардыларынааҕы $1',
'import-logentry-interwiki-detail' => 'барыта $2 торумтан $1 торум',

# Tooltip help for the actions
'tooltip-pt-userpage'             => 'Кыттааччы быһыытынан бэйэм сирэйим',
'tooltip-pt-anonuserpage'         => 'Билигин киирбит IP-м сирэйэ',
'tooltip-pt-mytalk'               => 'Ырытар сирим',
'tooltip-pt-anontalk'             => 'Бу IP ырытыыта',
'tooltip-pt-preferences'          => 'Бэйэм туруорууларым',
'tooltip-pt-watchlist'            => 'Кэтээн көрөр сирэйдэрим испииһэгэ',
'tooltip-pt-mycontris'            => 'Суруйбут/көннөрбүт сирэйдэрим испииһэктэрэ',
'tooltip-pt-login'                => 'Манна бэйэҕин билиһиннэриэххин сөп (булгуччута суох).',
'tooltip-pt-anonlogin'            => 'Бэйэҕин билиһиннэриэххин сөп (булгуччута суох).',
'tooltip-pt-logout'               => 'Тахсыы',
'tooltip-ca-talk'                 => 'Ыстатыйаны ырытыы',
'tooltip-ca-edit'                 => 'Бу сирэйи уларытыахха сөп. Бука диэн бастаан хайдах буоларын көрөн баран уларыт.',
'tooltip-ca-addsection'           => 'Бу ырытыыга бэйэ санаатын эбии.',
'tooltip-ca-viewsource'           => 'Бу сирэй улартыллыбат. Ол гынан баран тутулун көрүөххүн уонна устан ылыаххын сөп.',
'tooltip-ca-history'              => 'Бу сирэй урукку торумнара.',
'tooltip-ca-protect'              => 'Бу сирэйи уларытары боборго',
'tooltip-ca-delete'               => 'Бу сирэйи суох гын',
'tooltip-ca-undelete'             => 'Сирэй сотулла илигинэ оҥоһуллубут уларытыыларын төннөрөргө',
'tooltip-ca-move'                 => 'Аатын уларытарга',
'tooltip-ca-watch'                => 'Кэтээн көрүү испииһэгэр киллэр',
'tooltip-ca-unwatch'              => 'Бу сирэйи кэтээн көрүү испииһэгиттэн сот',
'tooltip-search'                  => 'Тылы көрдөө',
'tooltip-search-go'               => 'Маннык толору ааттаах сирэйи (сирэйгэ) көрдүүргэ',
'tooltip-search-fulltext'         => 'Сирэйдэргэ бу тиэкиһи көрдөө',
'tooltip-p-logo'                  => 'Сүрүн сирэй',
'tooltip-n-mainpage'              => 'Сүрүн сирэйгэ барыы',
'tooltip-n-portal'                => 'Бу бырайыак туһунан, манна тугу гыныаххытын сөбүй уонна туох ханна баара',
'tooltip-n-currentevents'         => 'Найдите вводную информацию на текущих событиях',
'tooltip-n-recentchanges'         => 'Бу биикигэ буолбут бүтэһик уларытыылар.',
'tooltip-n-randompage'            => 'Үлүбээй сирэйи көрдөр',
'tooltip-n-help'                  => '«{{SITENAME}}» справочнига.',
'tooltip-t-whatlinkshere'         => 'Бу сирэйгэ сигэнэр сирэйдэр испииһэктэрэ',
'tooltip-t-recentchangeslinked'   => 'Бу сирэй сигэнэр сирэйдэригэр кэнники уларыйыылар',
'tooltip-feed-rss'                => 'RSS бу сирэйгэ',
'tooltip-feed-atom'               => 'Atom бу сирэйгэ',
'tooltip-t-contributions'         => 'Бу кыттааччы уларыппыт сирэйдэрин испииһэгэ',
'tooltip-t-emailuser'             => 'Бу киһиэхэ сурук ыытарга',
'tooltip-t-upload'                => 'Билэлэри суруттарыы',
'tooltip-t-specialpages'          => 'Анал сирэйдэр испииһэктэрэ',
'tooltip-t-print'                 => 'Сирэй бэчээккэ ыытыллар торума',
'tooltip-t-permalink'             => 'Сирэй куруук баар сиригэр ыйынньык',
'tooltip-ca-nstab-main'           => 'Ыстатыйа ис хоһооно',
'tooltip-ca-nstab-user'           => 'Кыттааччы бэйэтин сирэ',
'tooltip-ca-nstab-media'          => 'Миэдьийэ билэтэ',
'tooltip-ca-nstab-special'        => 'Бу туспа аналлаах сирэй, уларытыллыбат',
'tooltip-ca-nstab-project'        => 'Бырайыак туһунан',
'tooltip-ca-nstab-image'          => 'Ойуу туһунан көрүү',
'tooltip-ca-nstab-mediawiki'      => 'Тиһик (система) биллэриитин көрүү',
'tooltip-ca-nstab-template'       => 'Халыып туһунан',
'tooltip-ca-nstab-help'           => 'Көмө сирэйи көрүү',
'tooltip-ca-nstab-category'       => 'Категория туһунан',
'tooltip-minoredit'               => 'Уларытыыны суолтата кыра курдук бэлиэтээ',
'tooltip-save'                    => 'Уларытыыны бигэргэтии',
'tooltip-preview'                 => 'Уларытыах иннинэ көрүү; бука диэн маны туһан!',
'tooltip-diff'                    => 'Уларытыах иннинэ баар тиэкиһи кытта тэҥнээһин.',
'tooltip-compareselectedversions' => 'Икки талыллыбыт торумнар ыккардыларынааҕы уратыны көрдөр.',
'tooltip-watch'                   => 'Бу сирэйи кэтээһин испииһэгэр киллэр',
'tooltip-recreate'                => 'Сирэйи суох гыныллыбытын үрдүнэн сөргүтүү',
'tooltip-upload'                  => 'Суруйууну саҕалаа',

# Stylesheets
'common.css'   => '/** Манна оҥоһуллубут CSS атын скиннарга эмиэ олохтонуо */',
'monobook.css' => '/* Манна оҥоһуллубут CSS Monobook диэн скиҥҥа туһаныллыа */',

# Scripts
'common.js'   => '/* Оҥоһуллубут JavaScript ханнык баҕарар киһи манна киирдэҕинэ үлэлээн кэлиэ. */',
'monobook.js' => '/* Эргэрбит; маны туһан:[[MediaWiki:common.js]] */',

# Metadata
'nodublincore'      => 'Dublin Core RDF метадааннайдар бу сиэрбэргэ бобуллубуттар.',
'nocreativecommons' => 'Creative Commons RDF метадааннайдар бу сиэрбэргэ бобуллубуттар.',
'notacceptable'     => "Биики-сиэрбэр эн браузерыҥ ааҕар формаатын кыайан көрдөрбөт.<br /> The wiki server can't provide data in a format your client can read.",

# Attribution
'anonymous'        => '{{SITENAME}} ааттамматах кыттааччылара',
'siteuser'         => '{{SITENAME}} кыттааччыта $1',
'lastmodifiedatby' => 'Бу сирэйи бүтэһигин $3 кыттааччы $2 уларыппыт, $1.', # $1 date, $2 time, $3 user
'othercontribs'    => '$1 үлэтигэр олоҕурбут.',
'others'           => 'атыттар',
'siteusers'        => '{{SITENAME}} кыттааччыта (-лара) $1',
'creditspage'      => 'Махтаныы',
'nocredits'        => 'Бу сирэй кыттааччыларын испииһэгэ суох.',

# Spam protection
'spamprotectiontitle' => 'Спам утары фильтр',
'spamprotectiontext'  => 'Эн суруйа сатыыр сирэйгин спамы утарар фильтр суруттарбата. 
Тас атын сиргэ ыйынньыктааҕын иһин буолуон сөп.',
'spamprotectionmatch' => 'Бу сурук спамы утарар фильтртан кэллэ: $1',
'spambot_username'    => 'Спамы ыраастааһын',
'spam_reverting'      => 'Манна: $1 ыйынньыга суох бүтэһик торуму сөргүтүү (төннөрүү)',
'spam_blanking'       => 'Бары торумнар манна "$1" ыйынньыктаахтар, барытын суох оҥоруу',

# Info page
'infosubtitle'   => 'Сирэй туһунан',
'numedits'       => 'Уларытыы ахсаана (ыстатыйа): $1',
'numtalkedits'   => 'Уларытыы ахсаана (ырытыы): $1',
'numwatchers'    => 'Кэтээччилэр ахсааннара: $1',
'numauthors'     => 'Тус туспа ааптардар ахсааннара (ыстатыйа): $1',
'numtalkauthors' => 'Тус туспа ааптардар ахсааннара (ырытыы): $1',

# Math options
'mw_math_png'    => 'Куруук PNG таһаарарга (туһанарга)',
'mw_math_simple' => 'көннөрү түбэлтэҕэ HTML, атын буоллаҕына PNG',
'mw_math_html'   => 'сатанаҕына HTML, сатамматаҕына PNG',
'mw_math_source' => 'TeX бэлиэтин (разметкатын) хааллар (тиэкиһинэн эрэ үлэлиир браузерга)',
'mw_math_modern' => 'Аныгы браузердарга анаан',
'mw_math_mathml' => 'Сатаннаҕына MathML туһан (experimental)',

# Patrolling
'markaspatrolleddiff'                 => 'Бэрэбиэркэлэммит курдук бэлиэтээ',
'markaspatrolledtext'                 => 'Бу ыстатыйаны бэрэбиэркэлэммит курдук бэлиэтээ',
'markedaspatrolled'                   => 'Бэрэбиэркэлэммит курдук бэлиэтэннэ',
'markedaspatrolledtext'               => 'Талбыт торумуҥ бэрэбиэркэлэммит курдук бэлиэтэннэ.',
'rcpatroldisabled'                    => 'Кэлиҥҥи уларытыылары бэрэбиэркэлиир бобулунна',
'rcpatroldisabledtext'                => 'Бүтэһик уларытыылары бэрэбиэкэлээһин арахсан турар.',
'markedaspatrollederror'              => 'Бэрэбиэркэлэммит курдук бэлиэтиир сатаммата',
'markedaspatrollederrortext'          => 'Бэрэбиэркэлэммит курдук бэлиэтииргэ торуму чопчу талыахтааххын.',
'markedaspatrollederror-noautopatrol' => 'Бэйэҥ уларытыыгын бэрэбиэркэлэммит курдук оҥороруҥ сатаммат.',

# Patrol log
'patrol-log-page'   => 'Бэрэбиэркэ сурунаала',
'patrol-log-header' => 'Ботуруулламмыт торумнар сурунааллара.',
'patrol-log-line'   => '$2-тэн $1 бэлиэтэммит, патрулламмыт $3',
'patrol-log-auto'   => '(аптамаатынан)',

# Image deletion
'deletedrevision'                 => '$1 урукку торума сотулунна',
'filedeleteerror-short'           => 'Билэни сотор сатаммата: $1',
'filedeleteerror-long'            => 'Билэни сотуу кэмигэр кэккэ моһоллор таҕыстылар:

$1',
'filedelete-missing'              => '"$1" билэ суох буолан сотуллар кыаҕа суох.',
'filedelete-old-unregistered'     => 'Билэ бэриллибит "$1" барыла билэлэр тиһиктэригэр (база данных) суох.',
'filedelete-current-unregistered' => 'Бу "$1" билэ тиһиккэ (база данных) суох.',
'filedelete-archive-read-only'    => '"$1" архыып директорията сиэрбэргэ кыайан суруллубат.',

# Browsing diffs
'previousdiff' => '← Иннинээҕи уларытыыга',
'nextdiff'     => 'Кэннинээҕи уларытыыга →',

# Media information
'mediawarning'         => "'''Сэрэтии''': бу билэ систиэмэни алдьатар куһаҕан бырагыраамма куодун илдьэ сылдьар буолуон сөп. <hr />",
'imagemaxsize'         => 'Ойуу туһунан сирэй ойууларын бу кээмэйгэ дылы кыччат:',
'thumbsize'            => 'Кыра ойуу (миниатюра) кээмэйэ:',
'widthheightpage'      => '$1×$2, $3 {{PLURAL:$3|сирэй|сирэй}}',
'file-info'            => '(билэ кээмэйэ: $1, MIME тиибэ: $2)',
'file-info-size'       => '($1 × $2 пииксэл, билэ кээмэйэ: $3, MIME тиибэ: $4)',
'file-nohires'         => '<small>Бу ойуу маннааҕар улахан торума суох.</small>',
'svg-long-desc'        => '(SVG билэ, номинальнай кээмэйэ $1 × $2 пииксэл, билэ кээмэйэ: $3)',
'show-big-image'       => 'Ойуу бэйэтин толору кээмэйэ',
'show-big-image-thumb' => '<small>Хачайдыах иннинэ көрүү кээмэйэ: $1 × $2 пииксэл</small>',

# Special:NewImages
'newimages'             => 'Саҥа билэлэр галереялара',
'imagelisttext'         => "Манна {{PLURAL:$1|билэ|билэлэр}} испииһэктэрэ ('''$1''') көстөр, суортаммыт: $2.",
'newimages-summary'     => 'Бу анал сирэй киллэриллибит билэлэр испииһэктэрин көрдөрөр.',
'showhidebots'          => '($1 робот)',
'noimages'              => 'Ойуу суох.',
'ilsubmit'              => 'Көрдөт',
'bydate'                => 'айыллыбыт кэминэн',
'sp-newimages-showfrom' => 'Баччаттан киирбит саҥа ойуулары көрдөр: $2, $1',

# Video information, used by Language::formatTimePeriod() to format lengths in the above messages
'seconds-abbrev' => 'с.',
'minutes-abbrev' => 'м.',
'hours-abbrev'   => 'ч.',

# Bad image list
'bad_image_list' => 'Формаата маннык буолуохтаах:

Испииһэк курдук көрүҥнээх (маннык бэлиэлээх *) строкалар эрэ учуоттаныахтара. Строка бастакы ыйынньыга бобуллубут ойууну ыйыахтаах. Бу строкаҕа баар атын ыйынньыктар исключение курдук сыаналаныахтара (ол аата ойуу онно көҥүллэнэр).',

# Metadata
'metadata'          => 'Мета дааннайдар',
'metadata-help'     => 'Бу билэҕэ цифровой камералар уонна сканердар эбэр ойуу туһунан информациялара баар. Билэ кэлин уларытыллыбыт буоллаҕына сорох кээмэйдэр билиҥҥи ойууга сөп түбэһиэ суохтарын сөп.',
'metadata-expand'   => 'Эбии информацияны көрдөр',
'metadata-collapse' => 'Эбии информацияны көрдөрүмэ',
'metadata-fields'   => 'Манна баар метадааннайдар ойуу сирэйигэр куруук көстүөхтэрэ, атыттара көстүөхтэрэ суоҕа.
* make
* model
* datetimeoriginal
* exposuretime
* fnumber
* focallength', # Do not translate list items

# EXIF tags
'exif-imagewidth'                  => 'Кэтитэ',
'exif-imagelength'                 => 'Үрдүгэ',
'exif-bitspersample'               => 'Глубина цвета',
'exif-compression'                 => 'Хам тутуу ньымата',
'exif-photometricinterpretation'   => 'Цветовая модель',
'exif-orientation'                 => 'Кадр ориентацията',
'exif-samplesperpixel'             => 'Компоненнарын ахсаана',
'exif-planarconfiguration'         => 'Дааннайдары наардааһын ньымата',
'exif-ycbcrsubsampling'            => 'Y уонна C бэйэ бэйэлэригэр сыһыаннара',
'exif-ycbcrpositioning'            => 'Y уонна C ханан тураллара',
'exif-xresolution'                 => 'Сытыары разрешениета',
'exif-yresolution'                 => 'Туруору разрешениета',
'exif-resolutionunit'              => 'Разрешениены тугунан кээмэйдиэххэ',
'exif-stripoffsets'                => 'Ойуу дааннайдара ханна баар буолара',
'exif-rowsperstrip'                => 'Биир блокка төһө строка баар буолара',
'exif-stripbytecounts'             => 'Хам тутуллубут блок кээмэйэ',
'exif-jpeginterchangeformat'       => 'JPEG SOI аналлаах сиригэр көһүү',
'exif-jpeginterchangeformatlength' => 'JPEG дааннайдарын кээмэйэ',
'exif-transferfunction'            => 'Функция преобразования цветового пространства',
'exif-whitepoint'                  => 'Үрүҥ өҥ цветноһа',
'exif-primarychromaticities'       => 'Сүрүн өҥнөр цветностара',
'exif-ycbcrcoefficients'           => 'Өҥ уларыйыытын коэфициеннара',
'exif-referenceblackwhite'         => 'Хара уонна үрүҥ сыһыаннара',
'exif-datetime'                    => 'Билэ хаһан уларыйбыта',
'exif-imagedescription'            => 'Ойуу аата',
'exif-make'                        => 'Камераны оҥорооччу',
'exif-model'                       => 'Камера модела',
'exif-software'                    => 'Туһанар бырагырааммата',
'exif-artist'                      => 'Ааптар',
'exif-copyright'                   => 'Бас билээччи',
'exif-exifversion'                 => 'Exif биэрсийэтэ',
'exif-flashpixversion'             => 'Flashpix туттуллар биэрсийэтэ',
'exif-colorspace'                  => 'Өҥ куйаара (пространство, space)',
'exif-componentsconfiguration'     => 'Хас биирдии компонент суолтата',
'exif-compressedbitsperpixel'      => 'Ойууну хам тутуу ньымата',
'exif-pixelydimension'             => 'Ойуу дьиҥ кэтитэ',
'exif-pixelxdimension'             => 'Ойуу дьиҥ үрдүгэ',
'exif-makernote'                   => 'Оҥорооччу хос быһаарыыта',
'exif-usercomment'                 => 'Кыттааччы хос быһаарыыта',
'exif-relatedsoundfile'            => 'Аудио-билэҕэ сыһыаннаах',
'exif-datetimeoriginal'            => 'Оҥоһуллубут кэмэ',
'exif-datetimedigitized'           => 'Сыыппараҕа көһөрүллүбүт кэмэ',
'exif-subsectime'                  => 'Доли секунд времени изменения файла',
'exif-subsectimeoriginal'          => 'Сөкүүндэ аҥаардарын КэмэКүнэ-ыйа',
'exif-subsectimedigitized'         => 'Сыыппараҕа көһөрүллүбүт сөкүүндэ аҥаардарын КэмэКүнэ-ыйа',
'exif-exposuretime'                => 'Экспозиция кэмэ',
'exif-exposuretime-format'         => '$1 сөк ($2)',
'exif-fnumber'                     => 'F кээмэйэ',
'exif-exposureprogram'             => 'Экспозиция бырагырааммата',
'exif-spectralsensitivity'         => 'Спектр чувствительноһа',
'exif-isospeedratings'             => 'ISO кээмэйэ',
'exif-oecf'                        => 'OECF (коэффициент оптоэлектрического преобразования)',
'exif-shutterspeedvalue'           => 'Объективы арыйыы кээмэйэ (Выдержка)',
'exif-aperturevalue'               => 'Диафрагма',
'exif-brightnessvalue'             => 'Сырдыга (яркость)',
'exif-exposurebiasvalue'           => 'Экспозиция сыҕарыйыыта (компенсация)',
'exif-maxaperturevalue'            => 'Диафрагма саамай улахан кээмэйэ (Maximum land aperture)',
'exif-subjectdistance'             => 'Объект ырааҕа',
'exif-meteringmode'                => 'Экспозиция кээмэйин ньымата',
'exif-lightsource'                 => 'Сырдыгы туох биэрэрэ',
'exif-flash'                       => 'Вспышка',
'exif-focallength'                 => 'Фокус кээмэйэ',
'exif-focallength-format'          => '$1 мм',
'exif-subjectarea'                 => 'Түһэриллибит объект иэнэ',
'exif-flashenergy'                 => 'Вспышка күүһэ',
'exif-spatialfrequencyresponse'    => 'Пространственная частотная характеристика',
'exif-focalplanexresolution'       => 'Разрешение по X в фокальной плоскости',
'exif-focalplaneyresolution'       => 'Разрешение по Y в фокальной плоскости',
'exif-focalplaneresolutionunit'    => 'Единица измерения разрешения в фокальной плоскости',
'exif-subjectlocation'             => 'Объект балаһыанньата (хаҥас үөһээ муннукка сыһыана)',
'exif-exposureindex'               => 'Экспозиция индэксэ',
'exif-sensingmethod'               => 'Сенсор тиибэ',
'exif-filesource'                  => 'Билэ хантан ылыллыбыта',
'exif-scenetype'                   => 'Сцена көрүҥэ',
'exif-cfapattern'                  => 'Өҥ фильтрын көрүҥэ (CFA pattern)',
'exif-customrendered'              => 'Ойууну эбии тупсарыы',
'exif-exposuremode'                => 'Экспозиция көрүҥэ',
'exif-whitebalance'                => 'Үрүҥ балансата',
'exif-digitalzoomratio'            => 'Сыыппаранан улаатыннарыы кээмэйэ (зуум)',
'exif-focallengthin35mmfilm'       => 'Фокус 35 мм пленкаҕа тэҥнээх кээмэйэ',
'exif-scenecapturetype'            => 'Устарга сцена көрүҥэ',
'exif-gaincontrol'                 => 'Сырдыгын уларытыы',
'exif-contrast'                    => 'Контрааһа',
'exif-saturation'                  => 'Насыщенноһа',
'exif-sharpness'                   => 'Резкоһа',
'exif-devicesettingdescription'    => 'Камера туруоруулара',
'exif-subjectdistancerange'        => 'Түһэриллибит объекка дылы ырааҕа',
'exif-imageuniqueid'               => 'Ойуу нүөмэрэ (ID)',
'exif-gpsversionid'                => 'GPS тегын биэрсийэтэ',
'exif-gpslatituderef'              => 'Хотугу/Соҕурууҥу кэтирээһин',
'exif-gpslatitude'                 => 'Кэтирээһин',
'exif-gpslongituderef'             => 'Илиҥҥи/Арҕааҥҥы усталааһын',
'exif-gpslongitude'                => 'Усталааһын',
'exif-gpsaltituderef'              => 'Үрдүгүн кээмэйэ',
'exif-gpsaltitude'                 => 'Үрдүгэ',
'exif-gpstimestamp'                => 'GPS бириэмэтэ (atomic clock)',
'exif-gpssatellites'               => 'Туттуллубут спутниктар',
'exif-gpsstatus'                   => 'Приемник туруга',
'exif-gpsmeasuremode'              => 'Кээмэйдээһин ньымата',
'exif-gpsdop'                      => 'Кээмэйдээһин туочунаһа',
'exif-gpsspeedref'                 => 'Түргэнин кээмэйэ',
'exif-gpsspeed'                    => 'GPS приемник хамсыырын түргэнэ',
'exif-gpstrackref'                 => 'GPS-приемник азимутун көрүҥэ (дьиҥнээх, магнитнай)',
'exif-gpstrack'                    => 'GPS-приемник азимута',
'exif-gpsimgdirectionref'          => 'Ойуу азимутун көрүҥэ (дьиҥнээх, магнитнай)',
'exif-gpsimgdirection'             => 'Ойуу азимута',
'exif-gpsmapdatum'                 => 'Туһаныллыбыт геодезия координатата',
'exif-gpsdestlatituderef'          => 'Кэтирээһинин кээмэйэ',
'exif-gpsdestlatitude'             => 'Объект кэтирээһинэ',
'exif-gpsdestlongituderef'         => 'Усталааһынын кээмэйэ',
'exif-gpsdestlongitude'            => 'Объект усталааһына',
'exif-gpsdestbearingref'           => 'Тип пеленга объекта (истинный, магнитный)',
'exif-gpsdestbearing'              => 'Пеленг объекта',
'exif-gpsdestdistanceref'          => 'Ырааҕы кээмэйдиир единица',
'exif-gpsdestdistance'             => 'Ырааҕа',
'exif-gpsprocessingmethod'         => 'Ханна баарын билии көрүҥэ (GPS processing method)',
'exif-gpsareainformation'          => 'GPS оройуонун аата',
'exif-gpsdatestamp'                => 'GPS ыйа-күнэ',
'exif-gpsdifferential'             => 'GPS көннөрүүтүн дифференциала',

# EXIF attributes
'exif-compression-1' => 'Хам тутуллубатах',

'exif-unknowndate' => 'Күнэ-ыйа биллибэт',

'exif-orientation-1' => 'Нуорма', # 0th row: top; 0th column: left
'exif-orientation-2' => 'Сытыары көстүбүт', # 0th row: top; 0th column: right
'exif-orientation-3' => '180° эргитиллибит', # 0th row: bottom; 0th column: right
'exif-orientation-4' => 'Туруору көстүбүт', # 0th row: bottom; 0th column: left
'exif-orientation-5' => '90° чаһы утары эргитиллибит уонна туруору көстүбүт', # 0th row: left; 0th column: top
'exif-orientation-6' => '90° чаһы хоту эргитиллибит', # 0th row: right; 0th column: top
'exif-orientation-7' => '90° чаһы хоту эргитиллибит уонна туруору көстүбүт', # 0th row: right; 0th column: bottom
'exif-orientation-8' => '90° чаһы утары эргитиллибит', # 0th row: left; 0th column: bottom

'exif-planarconfiguration-1' => '"chunky" формат',
'exif-planarconfiguration-2' => '"planar" формат',

'exif-componentsconfiguration-0' => 'суох',

'exif-exposureprogram-0' => 'Биллибэт',
'exif-exposureprogram-1' => 'Илиинэн туруоруу',
'exif-exposureprogram-2' => 'Нормальнай программнай режим',
'exif-exposureprogram-3' => 'Диафрагма приоритеттаах',
'exif-exposureprogram-4' => 'Выдержка приоритеттаах',
'exif-exposureprogram-5' => 'Художественная программа (на основе нужной глубины резкости)',
'exif-exposureprogram-6' => 'Спорт режимэ (саамай кылгас выдержкалаах)',
'exif-exposureprogram-7' => 'Портрет режимэ (чугастан, фон фокуска киирбэт)',
'exif-exposureprogram-8' => 'Пейзаж режимэ (фона фокуска эмиэ киирэр)',

'exif-subjectdistance-value' => '$1 миэтэрэ',

'exif-meteringmode-0'   => 'Биллибэт',
'exif-meteringmode-1'   => 'Орто',
'exif-meteringmode-2'   => 'Средневзвешеннай',
'exif-meteringmode-3'   => 'Точечнай',
'exif-meteringmode-4'   => 'Мультиточечнай',
'exif-meteringmode-5'   => 'Матричнай',
'exif-meteringmode-6'   => 'Чаас чааһынан',
'exif-meteringmode-255' => 'Атын',

'exif-lightsource-0'   => 'Биллибэт',
'exif-lightsource-1'   => 'Күн сырдыга',
'exif-lightsource-2'   => 'Флюоресцентнай лаампа',
'exif-lightsource-3'   => 'Көннөрү (вольфрам) кыллаах лаампа',
'exif-lightsource-4'   => 'Вспышка',
'exif-lightsource-9'   => 'Күннээх күн',
'exif-lightsource-10'  => 'Былыттаах күн',
'exif-lightsource-11'  => 'Күлүк',
'exif-lightsource-12'  => 'Флуоресцентнай (D 5700 – 7100K)',
'exif-lightsource-13'  => 'Флуоресцентнай (N 4600 – 5400K)',
'exif-lightsource-14'  => 'Флуоресцентнай (W 3900 – 4500K)',
'exif-lightsource-15'  => 'Флуоресцентнай (WW 3200 – 3700K)',
'exif-lightsource-17'  => 'Стандарт A',
'exif-lightsource-18'  => 'Стандарт B',
'exif-lightsource-19'  => 'Стандарт C',
'exif-lightsource-24'  => 'ISO студия лаампата',
'exif-lightsource-255' => 'Атын уот',

'exif-focalplaneresolutionunit-2' => 'дюйм',

'exif-sensingmethod-1' => 'Чуолкайдамматах',
'exif-sensingmethod-2' => 'Биир чиптаах өҥнөөх матричнай сенсор',
'exif-sensingmethod-3' => 'Икки чиптаах өҥнөөх матричнай сенсор',
'exif-sensingmethod-4' => 'Үс чиптаах өҥнөөх матричнай сенсор',
'exif-sensingmethod-5' => 'Матричный сенсор с последовательным измерением цвета',
'exif-sensingmethod-7' => 'Үс өҥнөөх линейнай сенсор',
'exif-sensingmethod-8' => 'Линейный сенсор с последовательным измерением цвета',

'exif-scenetype-1' => 'Объект бэйэтин хаартыскаҕа түһэриллибит',

'exif-customrendered-0' => 'Оҥоһуллубатах',
'exif-customrendered-1' => 'Талан уларытыллыбыт',

'exif-exposuremode-0' => 'Автоэкспозиция',
'exif-exposuremode-1' => 'Экспозицияны илиинэн туруоруу',
'exif-exposuremode-2' => 'Брэкетинг',

'exif-whitebalance-0' => 'Үрүҥ балаансатын аптамаатынан',
'exif-whitebalance-1' => 'Үрүҥ балаансатын илиинэн',

'exif-scenecapturetype-0' => 'Стандарт',
'exif-scenecapturetype-1' => 'Ландшафт',
'exif-scenecapturetype-2' => 'Бэртириэт',
'exif-scenecapturetype-3' => 'Түүҥҥү устуу',

'exif-gaincontrol-0' => 'Суох',
'exif-gaincontrol-1' => 'Кыратык улаатыннарыы',
'exif-gaincontrol-2' => 'Улаханнык улаатыннарыы',
'exif-gaincontrol-3' => 'Кыратык кыччатыы',
'exif-gaincontrol-4' => 'Улаханнык кыччатыы',

'exif-contrast-0' => 'Нуорма',
'exif-contrast-1' => 'Сымнаҕас',
'exif-contrast-2' => 'Кытаанах',

'exif-saturation-0' => 'Нуорма',
'exif-saturation-1' => 'Арыый насыщеннай',
'exif-saturation-2' => 'Үрдүк насыщениялаах',

'exif-sharpness-0' => 'Нуорма',
'exif-sharpness-1' => 'Арыый сырдык',
'exif-sharpness-2' => 'Олох сырдык',

'exif-subjectdistancerange-0' => 'Биллибэт',
'exif-subjectdistancerange-1' => '"Тута сытан" түһэрии',
'exif-subjectdistancerange-2' => 'Чугастан түһэрии',
'exif-subjectdistancerange-3' => 'Ыраахтан түһэрии',

# Pseudotags used for GPSLatitudeRef and GPSDestLatitudeRef
'exif-gpslatitude-n' => 'Хотугу кэтирээһин',
'exif-gpslatitude-s' => 'Соҕуруу кэтирээһин',

# Pseudotags used for GPSLongitudeRef and GPSDestLongitudeRef
'exif-gpslongitude-e' => 'Илиҥҥи усталааһын',
'exif-gpslongitude-w' => 'Арҕааҥы усталааһын',

'exif-gpsstatus-a' => 'Кээмэйдээһин бүтэ илик',
'exif-gpsstatus-v' => 'Кээмэйдээһин бэлэм',

'exif-gpsmeasuremode-2' => '2 координаатаны кээмэйдээһин',
'exif-gpsmeasuremode-3' => '3 координаатаны кээмэйдээһин',

# Pseudotags used for GPSSpeedRef and GPSDestDistanceRef
'exif-gpsspeed-k' => 'км/чаас',
'exif-gpsspeed-m' => 'Миляны чааска',
'exif-gpsspeed-n' => 'Узел',

# Pseudotags used for GPSTrackRef, GPSImgDirectionRef and GPSDestBearingRef
'exif-gpsdirection-t' => 'Дьиҥнээх',
'exif-gpsdirection-m' => 'Магнитнай',

# External editor support
'edit-externally'      => 'Бу билэни таһынааҕы бырагыраамма көмөтүнэн уларытарга',
'edit-externally-help' => 'Сиһилии бу ыйынньыгынан баран көр: [http://www.mediawiki.org/wiki/Manual:External_editors setup instructions].',

# 'all' in various places, this might be different for inflected languages
'recentchangesall' => 'бары',
'imagelistall'     => 'бары',
'watchlistall2'    => 'бары',
'namespacesall'    => 'бары',
'monthsall'        => 'бары',

# E-mail address confirmation
'confirmemail'             => 'Электроннай аадырыһы бигэргэтии',
'confirmemail_noemail'     => '[[Special:Preferences|Бэйэҥ туруорууларгар]] электроннай аадырыскын суруйбатаххын эбэтэр сыыһа суруйбуккун.',
'confirmemail_text'        => '{{SITENAME}} движога үлэлиэҥ иннинэ электроннай аадырыскын бигэргэтэри эрэйэр.
Аналлаах тимэҕи баттаан эппит аадырыскар сурукта ыыттар.
Ол суругу арыйдаххына, аадырыһыҥ бигэргэтиллиэ.',
'confirmemail_pending'     => '<div class="error">Бигэргэтии куода номнуо ыытыллыбыт.
Бэйэҕин соторутааҕыта билиһиннэрбит буоллаххына ол сурук кэлэрин кыратык кэтэһэ түс.
Ол кэннэ, кэлбэтэҕинэ, куоду өссө көрдөөр.</div>',
'confirmemail_send'        => 'Бигэргэтии куодун почтанан ыыт',
'confirmemail_sent'        => 'Бигэргэтэр сурук ыытылынна.',
'confirmemail_oncreate'    => 'Бигэргэтэр сурук эппит почтаҕар ыытылынна.
Бу бигэргэтии систиэмэҕэ киирэри хааччахтаабат эрээри, электроннай почтаны манна туһанаргар бигэргэтэриҥ наада.',
'confirmemail_sendfailed'  => '{{SITENAME}} бигэргэтэр суруга кыайан ыытыллыбата. 
Электроннай аадырыскын сөпкө суруйбуккун бэрэбиэркэлээ.

Сурук барбатах төрүөтэ: $1',
'confirmemail_invalid'     => 'Бигэргэтии куода сыыһа эбэтэр болдьоҕо ааспыт.',
'confirmemail_needlogin'   => '$1 - маны оҥордоххуна аадырыскын бигэргэтиэҥ.',
'confirmemail_success'     => 'Электроннай аадырыһыҥ бигэргэтилиннэ.',
'confirmemail_loggedin'    => 'Электроннай почтаҥ аадырыһа бигэргэтилиннэ.',
'confirmemail_error'       => 'Бигэргэтии кэмигэр моһол таҕыста.',
'confirmemail_subject'     => '{{SITENAME}}: эл. почта аадырыһын бигэргэтии',
'confirmemail_body'        => 'Ким эрэ, баҕар эн буолуо бу IP-ттан: $1, {{SITENAME}} сиэрбэригэр
«$2» диэн ааты бэлиэтээтэ уонна бу электроннай аадырыһы ыйда.

Маны сөбүлэһэр буоллаххына бу ыйынньыгы: $3 баттаан
{{SITENAME}} аадырыскын туһанарын көҥүллүүргүн бигэргэт (болдьоҕо $4 дылы).

Оттон бу туһунан тугу да билбэт буоллаххына бу ыйынньыгынан баран эл. почтаҕын сотон кэбис:

$5',
'confirmemail_invalidated' => 'Электроннай почта аадырыһын бигэргэтиини суох оҥоһулунна',
'invalidateemail'          => 'Эл. почта бигэргэтээһинин араарга',

# Scary transclusion
'scarytranscludedisabled' => '[Interwiki transcluding араҕыста]',
'scarytranscludefailed'   => '[$1 халыыбы туһанар табыллыбата]',
'scarytranscludetoolong'  => '[URL наһаа уһун]',

# Trackbacks
'trackbackbox'      => '<div id="mw_trackbacks">
Бу ыстатыйа Trackback`а:<br />
$1
</div>',
'trackbackremove'   => ' ([$1 сотуу])',
'trackbacklink'     => 'Урукку суола',
'trackbackdeleteok' => 'trackback сотулунна.',

# Delete conflict
'deletedwhileediting' => "'''Болҕой''': Сирэйи көннөрө олордоххуна ким эрэ сотон кэбистэ!",
'confirmrecreate'     => "[[User:$1|$1]] ([[User talk:$1|ырытыыта]]) бу сирэйи эн уларыта олордоххуна сотон кэбистэ, төрүөтэ:
: ''$2''
Бука диэн сирэйи төннөрөргүн бигэргэт.",
'recreate'            => 'Саҥаттан оҥоруу',

# HTML dump
'redirectingto' => '[[:$1]] сирэйгэ көһөрүү...',

# action=purge
'confirm_purge'        => 'Бу сирэй кээһин сотоору гынаҕын дуо?

$1',
'confirm_purge_button' => 'Сөп',

# AJAX search
'searchcontaining' => "Маннык тыллаах/тыллардаах сирэйдэри көрдөөһүн: ''$1''.",
'searchnamed'      => "Маннык ааттаах сирэйи көрдөөһүн: ''$1''.",
'articletitles'    => "Мантан саҕаланар ыстатыйалары көрдөөһүн: ''$1''",
'hideresults'      => 'Булуллубуту көстүбэт оҥор',
'useajaxsearch'    => 'AJAX көрдөөһүнү туһаныы',

# Multipage image navigation
'imgmultipageprev' => '← инники сирэй',
'imgmultipagenext' => 'аныгыскы сирэй →',
'imgmultigo'       => 'Көс!',
'imgmultigoto'     => 'Бу сирэйгэ көс $1',

# Table pager
'ascending_abbrev'         => 'улаатыннар',
'descending_abbrev'        => 'кыччат',
'table_pager_next'         => 'Аныгыскы сирэй',
'table_pager_prev'         => 'Иннинээҕи сирэй',
'table_pager_first'        => 'Бастакы сирэй',
'table_pager_last'         => 'Бүтэһик сирэй',
'table_pager_limit'        => 'Сирэйгэ бачча $1 пууну көрдөр',
'table_pager_limit_submit' => 'Толор',
'table_pager_empty'        => 'Туох да көстүбэтэ',

# Auto-summaries
'autosumm-blank'   => 'Сирэй иһэ барыта сотуллубут',
'autosumm-replace' => "Сирэй иһэ уларытыллыбыт: '$1'",
'autoredircomment' => 'Утаарыы: [[$1]]',
'autosumm-new'     => 'Саҥа: $1',

# Size units
'size-bytes' => '$1 байт',

# Live preview
'livepreview-loading' => 'Киллэрии бара турар…',
'livepreview-ready'   => 'Суруттарыы… Бэлэм!',
'livepreview-failed'  => 'Түргэн инники көрүү моһуогурда! Көннөрү инники көрүүнү туһан.',
'livepreview-error'   => 'Холбоммото: $1 "$2". Көннөрү инники көрүүнү туһан.',

# Friendlier slave lag warnings
'lag-warn-normal' => '$1 {{PLURAL:$1|сөкүүндэ|сөкүүндэ}} иһинэн оҥоһуллубут уларытыылар манна көстүө суохтарын сөп.',
'lag-warn-high'   => 'Синхронизация лаппа хойутуур буолан кэнники $1 {{PLURAL:$1|сөкүүндэ|сөкүүндэ}} иһинэн оҥоһуллубут уларытыылар манна көстүө суохтарын сөп.',

# Watchlist editor
'watchlistedit-numitems'       => 'Эн кэтиир испииһэгиҥ $1 пууннаах, ырытыы сирэйэ ааҕыллыбата.',
'watchlistedit-noitems'        => 'Эн кэтиир испииһэгиҥ кураанах.',
'watchlistedit-normal-title'   => 'Кэтэбил испииһэгин уларытыы',
'watchlistedit-normal-legend'  => 'Кэтэбил испииһэгиттэн пууннары суох гыныы',
'watchlistedit-normal-explain' => 'Манна кэтиир сирэйдэриҥ испииһэгэ көстөр.
Биири эмит сотоору гынар буоллаххына аттыгар баар квадратикка бэлиэтэ туруор, онтон "Пууннары сот" тимэҕи баттаа.
Өссө манна [[Special:Watchlist/raw|«сиикэй» испииһэги уларытыаххын]] сөп.',
'watchlistedit-normal-submit'  => 'Пууннары сот',
'watchlistedit-normal-done'    => '$1 пуун эн кэтээн көрүүҥ испииһэгиттэн сотулунна:',
'watchlistedit-raw-title'      => '"Сиикэй" кэтээн көрүү испииһэгин уларытыы',
'watchlistedit-raw-legend'     => '"Сиикэй" кэтээн көрүү испииһэгин уларытыы',
'watchlistedit-raw-explain'    => 'Манна кэтээн көрөр сирэйдэриҥ көстөллөр. Испииһэги строка эбэн-көҕүрэтэн уларытыаххын сөп. Уларытан бүтэн баран "Испииһэги бигэргэт" тимэҕи баттаа. Өссө испииһэги  [[Special:Watchlist/edit|уларытыы көннөрү ньыматын]] туһаныаххын сөп.',
'watchlistedit-raw-titles'     => 'Пууннар:',
'watchlistedit-raw-submit'     => 'Испииһэги бигэргэт',
'watchlistedit-raw-done'       => 'Саҥа испииһэк бигэргэтилиннэ.',
'watchlistedit-raw-added'      => 'Испииһэккэ $1 пуун эбилиннэ:',
'watchlistedit-raw-removed'    => 'Испииһэктэн $1 пуун көҕүрээтэ:',

# Watchlist editing tools
'watchlisttools-view' => 'Атыҥҥа сабыдыаллаах уларытыылар',
'watchlisttools-edit' => 'Кэтэбил испииһэгин көрүү/уларытыы',
'watchlisttools-raw'  => '"Сиикэй" испииһэги уларытыы',

# Core parser functions
'unknown_extension_tag' => 'Биллибэт тиэг "$1"',

# Special:Version
'version'                          => 'MediaWiki биэрсийэтэ (барыла)', # Not used as normal message but as header for the special page itself
'version-extensions'               => 'Туруоруллубут расширениялар',
'version-specialpages'             => 'Аналлаах сирэйдэр',
'version-parserhooks'              => 'синтаксическай анализатор перехватчиктара',
'version-variables'                => 'Уларыйар дааннайдар (переменнайдар)',
'version-other'                    => 'Атын',
'version-mediahandlers'            => 'Медиа уларытааччылар',
'version-hooks'                    => 'Перехватчиктар',
'version-extension-functions'      => 'Расширениялар функциялара',
'version-parser-extensiontags'     => 'Синтаксииһы анаалыстыыр тэрил расширениятын тиэктэрэ',
'version-parser-function-hooks'    => 'Синтаксииһы анаалыстыыр тэрил функциятын перехватчиктара',
'version-skin-extension-functions' => 'Оформление темаларын расширенияларын функцията',
'version-hook-name'                => 'Перехватчик аата',
'version-hook-subscribedby'        => 'Суруттарыыта:',
'version-version'                  => 'Торум',
'version-license'                  => 'Лиссиэнзийэ',
'version-software'                 => 'Туруоруллубут бырагырааммалар',
'version-software-product'         => 'Бородуукта',
'version-software-version'         => 'Барыл (торум)',

# Special:FilePath
'filepath'         => 'Билэ суола',
'filepath-page'    => 'Билэ:',
'filepath-submit'  => 'Суол',
'filepath-summary' => 'Бу аналлаах сирэй билэ толору суолун (дисскэҕэ ханна сытарын) көрдөрөр.

Билэ аатын префикса суох киллэр <code>{{ns:image}}:</code>.',

# Special:FileDuplicateSearch
'fileduplicatesearch'          => 'Хос билэлэри көрдөөһүн',
'fileduplicatesearch-summary'  => 'Тэҥ билэлэри хэш-куодтарынан көрдөөһүн.

Билэ аатын "{{ns:image}}:" префикса суох киллэр.',
'fileduplicatesearch-legend'   => 'Хатылааһыннары көрдөөһүн',
'fileduplicatesearch-filename' => 'Билэ аата:',
'fileduplicatesearch-submit'   => 'Бул',
'fileduplicatesearch-info'     => '$1 × $2 пииксэл<br />Билэ кээмэйэ: $3<br />MIME-тиип: $4',
'fileduplicatesearch-result-1' => '"$1" билэ хатылааһыннара суох эбит.',
'fileduplicatesearch-result-n' => '"$1" билэ {{PLURAL:$2|1 хатылааһыннаах эбит|$2 хатылааһыннардаах эбит}}.',

# Special:SpecialPages
'specialpages'                   => 'Анал сирэйдэр',
'specialpages-note'              => '----
* Көннөрү анал сирэйдэр.
* <span class="mw-specialpagerestricted">Киирэргэ хааччахтардаах анал сирэйдэр.</span>',
'specialpages-group-maintenance' => 'Техническэй отчуоттар',
'specialpages-group-other'       => 'Атын аналлаах сирэйдэр',
'specialpages-group-login'       => 'Киирии / бэлиэтэнии',
'specialpages-group-changes'     => 'Саҥа уларытыылар уонна сурунааллар',
'specialpages-group-media'       => 'Медиа отчуоттар уонна киллэриилэр',
'specialpages-group-users'       => 'Кыттааччылар уонна бырааптара',
'specialpages-group-highuse'     => 'Элбэхтик туттуллар сирэйдэр',
'specialpages-group-pages'       => 'Сирэйдэр тиһиктэрэ',
'specialpages-group-pagetools'   => 'Сирэйдэр үнүстүрүмүөннэрэ',
'specialpages-group-wiki'        => 'Wiki дааннайдара уонна үнүстүрүмүөннэр',
'specialpages-group-redirects'   => 'Утаарар аналлаах сирэйдэр',
'specialpages-group-spam'        => 'Спаамы утары үнүстүрүмүөннэр',

# Special:BlankPage
'blankpage'              => 'Кураанах сирэй',
'intentionallyblankpage' => 'Бу сирэй соруйан кураанах хаалларыллыбыт',

);
