<?php
/** Hindi (हिन्दी)
 *
 * @ingroup Language
 * @file
 *
 * @author Aksi great
 * @author Kaustubh
 * @author Shyam
 * @author Sunil Mohan
 * @author לערי ריינהארט
 */

$namespaceNames = array(
	NS_MEDIA          => 'Media',
	NS_SPECIAL        => 'विशेष',
	NS_MAIN           => '',
	NS_TALK           => 'वार्ता',
	NS_USER           => 'सदस्य',
	NS_USER_TALK      => 'सदस्य_वार्ता',
	# NS_PROJECT set by $wgMetaNamespace
	NS_PROJECT_TALK   => '$1_वार्ता',
	NS_IMAGE          => 'चित्र',
	NS_IMAGE_TALK     => 'चित्र_वार्ता',
	NS_MEDIAWIKI      => 'MediaWiki',
	NS_MEDIAWIKI_TALK => 'MediaWiki_talk',
	NS_TEMPLATE       => 'साँचा',
	NS_TEMPLATE_TALK  => 'साँचा_वार्ता',
	NS_CATEGORY       => 'श्रेणी',
	NS_CATEGORY_TALK  => 'श्रेणी_वार्ता',
);

$digitTransformTable = array(
	'0' => '०', # &#x0966;
	'1' => '१', # &#x0967;
	'2' => '२', # &#x0968;
	'3' => '३', # &#x0969;
	'4' => '४', # &#x096a;
	'5' => '५', # &#x096b;
	'6' => '६', # &#x096c;
	'7' => '७', # &#x096d;
	'8' => '८', # &#x096e;
	'9' => '९', # &#x096f;
);
$linkTrail = "/^([a-z]+)(.*)\$/sD";

$messages = array(
# User preference toggles
'tog-underline'               => 'कड़ियाँ अधोरेखित किजीयें:',
'tog-highlightbroken'         => 'टूटी हुई कड़ियाँ <a href="" class="new">इस प्रकार दर्शायें</a> (या फिर: इस प्रकार दर्शायें<a href="" class="internal">?</a>).',
'tog-justify'                 => 'परिच्छेद समान करें',
'tog-hideminor'               => 'हाल में हुएं बदलावोंसे छोटे बदलाव छुपायें',
'tog-extendwatchlist'         => 'ध्यानसूचीमें सभी बदलाव दर्शायें',
'tog-usenewrc'                => 'एनहान्सड हाल में हुए बदलाव (जावास्क्रीप्ट)',
'tog-numberheadings'          => 'शीर्षक स्वयं-क्रमांकित करें',
'tog-showtoolbar'             => 'एडिट टूलबार दर्शायें (जावास्क्रीप्ट)',
'tog-editondblclick'          => 'दुगुनी क्लीक करके पन्ना संपादित करें (जावास्क्रीप्ट)',
'tog-editsection'             => '[संपादित करें] कड़ियों द्वारा विभाग संपादन करने की अनुमती दें',
'tog-editsectiononrightclick' => 'विभाग शीर्षकपर दायाँ क्लीक करके संपादन करने की अनुमती दें (जावास्क्रीप्ट)',
'tog-showtoc'                 => 'अनुक्रम दर्शायें (जिन पन्नोंपर तीन से ज्यादा विभाग हो)',
'tog-rememberpassword'        => 'इस संगणक पर मेरा कूटशब्द याद रखें',
'tog-editwidth'               => 'एडिट बॉक्स पूरी चौड़ाई के साथ दर्शायें',
'tog-watchcreations'          => 'मैंने तैयार किये हुए पन्नें मेरी ध्यानसूचीमें रखियें',
'tog-watchdefault'            => 'मैंने संपादित किये हुए पन्नें मेरी ध्यानसूचीमें रखियें',
'tog-watchmoves'              => 'मैंने नाम बदलें हुए पन्नें मेरी ध्यानसूचीमें रखियें',
'tog-watchdeletion'           => 'मैंने हटायें हुए पन्नें मेरी ध्यानसूचीमें रखियें',
'tog-minordefault'            => 'मेरे सभी संपादन छोटे बदलाव हैं',
'tog-previewontop'            => 'एडिट बॉक्स के उपर झलक दिखायें',
'tog-previewonfirst'          => 'पहिले एडिट के बाद झलक दिखायें',
'tog-nocache'                 => 'पन्ने कैश में ना रखें',
'tog-enotifwatchlistpages'    => 'मेरी ध्यानसूची में दर्ज़ पन्ने बदलने के बाद मुझे इ-मेल करें',
'tog-enotifusertalkpages'     => 'मेरे सदस्य वार्ता पृष्ठ पर बदलाव होने से मुझे इ-मेल करें',
'tog-enotifminoredits'        => 'छोटे बदलावों के लिये भी मुझे इ-मेल भेजें',
'tog-enotifrevealaddr'        => 'सूचना इ-मेल में मेरा इ-मेल पता दर्शायें',
'tog-shownumberswatching'     => 'ध्यान रखें सदस्योंकी संख्या दर्शायें',
'tog-fancysig'                => 'कच्चा दस्तखत (स्वचलित कड़ियोंके बिना)',
'tog-externaleditor'          => 'हमेशा बाह्य संपादक का इस्तेमाल करें',
'tog-externaldiff'            => 'पुराने अवतरणोंमें फर्क दर्शाने के लिये बाह्य प्रणाली का इस्तेमाल करें',
'tog-showjumplinks'           => '"की तरफ़ जाईयें" कड़ियाँ उपलब्ध करायें',
'tog-uselivepreview'          => 'संपादन करने के साथ साथ ही झलक दर्शायें (जावास्क्रीप्ट) (प्रयोगक्षम)',
'tog-forceeditsummary'        => 'अगर बदलाव का सारांश ना दिया हो तो मुझे सूचित करें',
'tog-watchlisthideown'        => 'मेरी ध्यानसूचीसे मेरे बदलाव छुपायें',
'tog-watchlisthidebots'       => 'मेरी ध्यानसूचीसे बोटोंद्वारा किये हुए बदलाव छुपायें',
'tog-watchlisthideminor'      => 'मेरी ध्यानसूचीसे छोटे बदलाव छुपायें',
'tog-nolangconversion'        => 'वेरियंट्स के बदलाव बंद करें',
'tog-ccmeonemails'            => 'मैने अन्य सदस्योंको भेजे इ-मेल की कापी मुझे भी भेजें',
'tog-diffonly'                => 'अवतरणोंमें फर्क दर्शाते समय पुराने अवतरण न दिखायें',
'tog-showhiddencats'          => 'छुपाई हुई श्रेणियाँ दर्शायें',

'underline-always'  => 'हमेशा',
'underline-never'   => 'कभीभी नहीं',
'underline-default' => 'ब्राउज़र डिफ़ॉल्ट',

'skinpreview' => '(झलक)',

# Dates
'sunday'        => 'रविवार',
'monday'        => 'सोमवार',
'tuesday'       => 'मंगलवार',
'wednesday'     => 'बुधवार',
'thursday'      => 'गुरुवार',
'friday'        => 'शुक्रवार',
'saturday'      => 'शनिवार',
'sun'           => 'रवि',
'mon'           => 'सोम',
'tue'           => 'मंगल',
'wed'           => 'बुध',
'thu'           => 'गुरू',
'fri'           => 'शुक्र',
'sat'           => 'शनि',
'january'       => 'जनवरी',
'february'      => 'फरवरी',
'march'         => 'मार्च',
'april'         => 'अप्रैल',
'may_long'      => 'मई',
'june'          => 'जून',
'july'          => 'जुलाई',
'august'        => 'अगस्त',
'september'     => 'सितम्बर',
'october'       => 'अक्टूबर',
'november'      => 'नवम्बर',
'december'      => 'दिसम्बर',
'january-gen'   => 'जनवरी',
'february-gen'  => 'फरवरी',
'march-gen'     => 'मार्च',
'april-gen'     => 'अप्रैल',
'may-gen'       => 'मई',
'june-gen'      => 'जून',
'july-gen'      => 'जुलाई',
'august-gen'    => 'अगस्त',
'september-gen' => 'सितंबर',
'october-gen'   => 'अक्टूबर',
'november-gen'  => 'नव्हंबर',
'december-gen'  => 'दिसंबर',
'jan'           => 'जनवरी',
'feb'           => 'फरवरी',
'mar'           => 'मार्च',
'apr'           => 'अप्रैल',
'may'           => 'मई',
'jun'           => 'जून',
'jul'           => 'जुलाई',
'aug'           => 'अगस्त',
'sep'           => 'सितम्बर',
'oct'           => 'अक्टूबर',
'nov'           => 'नवम्बर',
'dec'           => 'दिसम्बर',

# Categories related messages
'pagecategories'                 => '{{PLURAL:$1|श्रेणी|श्रेणियाँ}}',
'category_header'                => '"$1" श्रेणी में लेख',
'subcategories'                  => 'उपविभाग',
'category-media-header'          => '"$1" श्रेणी में होनेवाली मीडिया',
'category-empty'                 => "''यह श्रेणी वर्तमान में कोई लेख या मीडिया(संचार-माध्यम) नही रखती''",
'hidden-categories'              => '{{PLURAL:$1|छुपाई हुई श्रेणी|छुपाई हुई श्रेणियाँ}}',
'hidden-category-category'       => 'छुपाई हुई श्रेणियाँ', # Name of the category where hidden categories will be listed
'category-subcat-count'          => '{{PLURAL:$2|इस श्रेणी में सिर्फ निम्नलिखित उपश्रेणी हैं|इस श्रेणी में निम्नलिखित {{PLURAL:$1|उपश्रेणी|$1 उपश्रेणियाँ}} हैं, कुल उपश्रेणियाँ $2 ।}}',
'category-subcat-count-limited'  => 'इस श्रेणीमें निम्नलिखित {{PLURAL:$1|उपश्रेणी हैं|$1 उपश्रेणियाँ हैं}}.',
'category-article-count'         => '{{PLURAL:$2|इस श्रेणी में सिर्फ निम्नलिखित लेख हैं ।|इस श्रेणीमें निम्नलिखित {{PLURAL:$1|लेख है|$1 लेख हैं}}, कुल लेख $2 ।}}',
'category-article-count-limited' => 'निम्नलिखित {{PLURAL:$1|लेख|$1 लेख}} इस श्रेणी में हैं ।',
'category-file-count'            => '{{PLURAL:$2|इस श्रेणी में सिर्फ निम्नलिखित फ़ाईल हैं ।|इस श्रेणीमें निम्नलिखित {{PLURAL:$1|फ़ाईल|$1 फ़ाईलें}} हैं, कुल फ़ाईलें $2 ।}}',
'category-file-count-limited'    => 'इस श्रेणीमें निम्नलिखित {{PLURAL:$1|फ़ाईल है ।|फ़ाईलें हैं ।}}',
'listingcontinuesabbrev'         => 'आगे.',

'mainpagetext'      => "<big>'''मीडियाविकिका इन्स्टॉलेशन पूरा हो गया हैं ।'''</big>",
'mainpagedocfooter' => 'विकि सॉफ्टवेयरके इस्तेमाल के लिये [http://meta.wikimedia.org/wiki/Help:Contents उपयोगकर्ता गाईड] देखें ।

== शुरुवात करें ==
* [http://www.mediawiki.org/wiki/Manual:Configuration_settings कॉन्फिगरेशन सेटींगकी सूची]
* [http://www.mediawiki.org/wiki/Manual:FAQ मीडियाविकिके बारे में प्राय: पूछे जाने वाले सवाल]
* [http://lists.wikimedia.org/mailman/listinfo/mediawiki-announce मीडियाविकि मेलिंग लिस्ट]',

'about'          => 'अबाउट',
'article'        => 'लेख',
'newwindow'      => '(नया विंडो में खुलता है)',
'cancel'         => 'रद्द करें',
'qbfind'         => 'खोज',
'qbbrowse'       => 'ब्राउज़',
'qbedit'         => 'बदलें',
'qbpageoptions'  => 'यह पन्ना',
'qbpageinfo'     => 'पृष्ठ जानकारी',
'qbmyoptions'    => 'मेरे पन्नें',
'qbspecialpages' => 'विशेष पन्नें',
'moredotdotdot'  => 'और...',
'mypage'         => 'मेरा पृष्ठ',
'mytalk'         => 'मेरी सदस्य वार्ता',
'anontalk'       => 'इस आई पी के लिये वार्ता',
'navigation'     => 'नैविगेशन',
'and'            => 'और',

# Metadata in edit box
'metadata_help' => 'मेटाडाटा:',

'errorpagetitle'    => 'त्रुटि',
'returnto'          => 'लौटें $1.',
'tagline'           => 'विकिपीडिया, एक मुक्त ज्ञानकोष से',
'help'              => 'सहायता',
'search'            => 'खोजें',
'searchbutton'      => 'खोज',
'go'                => 'जा',
'searcharticle'     => 'जायें',
'history'           => 'पन्ने का इतिहास',
'history_short'     => 'पुराने अवतरण',
'updatedmarker'     => 'आखिरी मुआइने के बाद बदलाव हुए',
'info_short'        => 'जानकारी',
'printableversion'  => 'प्रिन्ट करने लायक',
'permalink'         => 'स्थायी कड़ी',
'print'             => 'प्रिंट करें',
'edit'              => 'बदलें',
'create'            => 'बनाइयें',
'editthispage'      => 'इस पृष्ठ को बदलें',
'create-this-page'  => 'इस लेख को लिखें',
'delete'            => 'हटायें',
'deletethispage'    => 'इस पृष्ठ को हटायें',
'undelete_short'    => '{{PLURAL:$1|एक हटायागया|$1 हटायागये}} बदलाव वापस लायें',
'protect'           => 'सुरक्षित करें',
'protect_change'    => 'सुरक्षा नियम बदलें',
'protectthispage'   => 'इस पृष्ठ को सुरक्षित करें',
'unprotect'         => 'असुरक्षित करें',
'unprotectthispage' => 'इस पृष्ठ को असुरक्षित करें',
'newpage'           => 'नया पृष्ठ',
'talkpage'          => 'इस पृष्ठ के बारे में बात करें',
'talkpagelinktext'  => 'वार्ता',
'specialpage'       => 'विशेष पन्ना',
'personaltools'     => 'वैयक्तिक औज़ार',
'postcomment'       => 'अपनी राय दें',
'articlepage'       => 'लेख देखें',
'talk'              => 'संवाद',
'views'             => 'दर्शाव',
'toolbox'           => 'औज़ार-सन्दूक',
'userpage'          => 'सदस्य पृष्ठ देखें',
'projectpage'       => 'मेटा पृष्ठ देखें',
'imagepage'         => 'चित्र पृष्ठ देखें',
'mediawikipage'     => 'संदेश पन्ना देखें',
'templatepage'      => 'टेम्प्लेट पृष्ठ देखें',
'viewhelppage'      => 'सहायता पृष्ठ देखें',
'categorypage'      => 'श्रेणी पृष्ठ देखें',
'viewtalkpage'      => 'चर्चा देखें',
'otherlanguages'    => 'अन्य भाषायें',
'redirectedfrom'    => '($1 से भेजा गया)',
'redirectpagesub'   => 'पुनर्निर्देश पृष्ठ',
'lastmodifiedat'    => 'अन्तिम परिवर्तन $2, $1.', # $1 date, $2 time
'viewcount'         => 'यह पृष्ठ {{PLURAL:$1|एक|$1}} बार देखा गया है',
'protectedpage'     => 'सुरक्षित पृष्ठ',
'jumpto'            => 'यहां जाईयें:',
'jumptonavigation'  => 'नेविगेशन',
'jumptosearch'      => 'ख़ोज',

# All link text and link target definitions of links into project namespace that get used by other message strings, with the exception of user group pages (see grouppage) and the disambiguation template definition (see disambiguations).
'aboutsite'            => '{{SITENAME}} के बारे में',
'aboutpage'            => 'Project:अबाउट',
'bugreports'           => 'बग रिपोर्ट',
'bugreportspage'       => 'Project:बग रिपोर्ट',
'copyright'            => 'यहां का पाठ्य $1 के अंतर्गत उपलब्ध हैं ।',
'copyrightpagename'    => '{{SITENAME}} कॉपीराइट',
'copyrightpage'        => '{{ns:project}}:कोपिराइट',
'currentevents'        => 'हाल की घटनाएँ',
'currentevents-url'    => 'Project:हाल की घटनाएँ',
'disclaimers'          => 'अस्वीकरण',
'disclaimerpage'       => 'Project:साधारण अस्वीकरण',
'edithelp'             => 'बदलाव सहायता',
'edithelppage'         => 'Help:संपादन',
'faq'                  => 'अक्सर पूछे जाने वाले सवाल',
'faqpage'              => 'Project:अक्सर पूछे जाने वाले सवाल',
'helppage'             => 'Help:सहायता',
'mainpage'             => 'मुख्य पृष्ठ',
'mainpage-description' => 'मुख्य पृष्ठ',
'policy-url'           => 'Project:नीति',
'portal'               => 'समाज मुखपृष्ठ',
'portal-url'           => 'Project:समाज मुखपृष्ठ',
'privacy'              => 'गोपनीयता नीति',
'privacypage'          => 'Project:गोपनीयता नीति',

'badaccess'        => 'अनुमति त्रुटि',
'badaccess-group0' => 'जिस क्रिया का अनुरोध आपने किया है उसे संचालित करने की अनुमति आपको नही है।',
'badaccess-group1' => '$1 ग्रुपमें शामिल हुए सदस्यही इसप्रकारकी क्रियाएं कर सकतें हैं ।',
'badaccess-group2' => '$1 ग्रुपोंमेंसे एक ग्रुपमें शामिल सदस्य ही इस प्रकार की क्रियाएं कर सकतें हैं ।',
'badaccess-groups' => '$1 ग्रुपोंमेंसे एक ग्रुपमें शामिल सदस्य ही इस प्रकार की क्रियाएं कर सकतें हैं ।',

'versionrequired'     => 'मीडीयाविकिका $1 अवतरण ज़रूरी हैं ।',
'versionrequiredtext' => 'यह पन्ना इस्तेमाल करने के लिये मीडियाविकीका $1 अवतरण ज़रूरी हैं । देखें [[Special:Version|अवतरण सूची]] ।',

'ok'                      => 'ओके',
'pagetitle'               => '$1 - विकिपीडिया',
'retrievedfrom'           => '"$1" से लिया गया',
'youhavenewmessages'      => 'आपके लिए $1 है। ($2)',
'newmessageslink'         => 'नया संदेश',
'newmessagesdifflink'     => 'पिछला बदलाव',
'youhavenewmessagesmulti' => '$1 पर आपके लिए नया संदेश है',
'editsection'             => 'संपादित करें',
'editold'                 => 'संपादन',
'viewsourceold'           => 'स्रोत देखें',
'editsectionhint'         => 'विभाग संपादन: $1',
'toc'                     => 'अनुक्रम',
'showtoc'                 => 'दिखा',
'hidetoc'                 => 'छुपा',
'thisisdeleted'           => '$1 देखें या बदलें?',
'viewdeleted'             => '$1 दिखायें?',
'restorelink'             => '{{PLURAL:$1|एक हटाया हुआ|$1 हटाये हुए}} बदलाव',
'feedlinks'               => 'फ़ीड :',
'feed-invalid'            => 'गलत सब्स्क्रीप्शन फ़ीड प्रकार',
'feed-unavailable'        => '{{SITENAME}}पर सिंडिकेशन फ़ीड उपलब्ध नहीं हैं',
'site-rss-feed'           => '$1 आरएसएस फीड',
'site-atom-feed'          => '$1 ऍटम फीड',
'page-rss-feed'           => '"$1" आरएसएस फ़ीड',
'page-atom-feed'          => '"$1" ऍटम फ़ीड',
'feed-atom'               => 'ऐटम',
'feed-rss'                => 'आरएसएस',
'red-link-title'          => '$1 (अब तक बनाया नहीं)',

# Short words for each namespace, by default used in the namespace tab in monobook
'nstab-main'      => 'पन्ना',
'nstab-user'      => 'सदस्य',
'nstab-media'     => 'मीडिया',
'nstab-special'   => 'विशेष',
'nstab-project'   => 'परियोजना पृष्ठ',
'nstab-image'     => 'चित्र',
'nstab-mediawiki' => 'संदेश',
'nstab-template'  => 'टेम्प्लेट',
'nstab-help'      => 'सहायता पृष्ठ',
'nstab-category'  => 'श्रेणी',

# Main script and global functions
'nosuchaction'      => 'ऐसा कोई कार्य नहीं है',
'nosuchactiontext'  => '{{SITENAME}} सौफ़्टवेयर में इस URL द्वारा निर्धारित कोई क्रिया नही है',
'nosuchspecialpage' => 'ऐसा कोई विशेष पृष्ठ नहीं है',
'nospecialpagetext' => 'आपने ऐसा विशेष पृष्ठ मांगा है जो {{SITENAME}} सौफ़्टवेयर में नहीं है.',

# General errors
'error'                => 'गलती',
'databaseerror'        => 'डाटाबेस गलती',
'dberrortext'          => 'एक डाटाबेस पृच्छा रचना गलती मिली है ।
यह चीज सॉफ्टवेअरमें बग होने के संकेत देती हैं ।
"<tt>$2</tt>" इस फ़ंक्शनसे निकली आखिरी पृच्छा की रचना इसप्रकार थी:
<blockquote><tt>$1</tt></blockquote>
MySQL ने "<tt>$3: $4</tt>" इसे गलती बताया हैं ।',
'dberrortextcl'        => 'एक डाटाबेस पृच्छा रचना गलती मिली है ।
आखिरी डाटाबेस पॄच्छा यह थी:
"$1"
"$2" इस फ़ंक्शनसे ।
MySQL ने "$3: $4" इसे गलती बताया हैं ।',
'noconnect'            => 'माफ किजीये! यह विकि तकनीकी समस्याओं के कारण डाटाबेस सर्व्हर से संपर्क करने के लिये असमर्थ हैं ।<br />
$1',
'nodb'                 => 'डाटाबेस $1 का चयन नहीं कर सकें',
'cachederror'          => 'नीचे दिया हुवा अवतरण कैश मेमरी से लिया गया है, और यह अद्यतन जानकारीयुक्त ना होने की आशंका हैं ।',
'laggedslavemode'      => 'सूचना: यह लेख अद्यतन जानकारीयुक्त ना होने की आशंका हैं ।',
'readonly'             => 'डाटाबेस लॉक किया हुवा हैं',
'enterlockreason'      => 'लॉक करने कारण दिजीये, साथ ही लॉक खुलने का लगभग आकलन दिजीयें ।',
'readonlytext'         => 'शायद मेंटेनन्सके चलते डाटाबेस नये संपादन और अन्य बदलोंसे लॉक किया गया है, जिसके बाद यह सामान्य स्थितीमें आ जाना चाहियें ।

जिस प्रबंधक ने यह लॉक किया था उसने यह कारण दिया है: $1',
'missing-article'      => 'डाटाबेसको "$1" $2 नामका पृष्ठ मिला नहीं, जो मिलना चाहिये था।

ऐसा शायद खतम हुए फरक अथवा हटाये गये पृष्ठ के इतिहास कडी से होता हैं।

अगर ऐसा नहीं हैं, तो आपको सॉफ्टवेअरका बग मिला हैं।
कृपया किसी प्रबंधकसे इस पृष्ठ के URL के साथ चर्चा करें।',
'missingarticle-rev'   => '(अवतरण#: $1)',
'missingarticle-diff'  => '(फर्क: $1, $2)',
'readonly_lag'         => 'उपमुख्य डाटाबेस सर्व्हर्‌स मुख्य डाटाबेस सर्व्हर तक पहूंचने से पहले ही मुख्य डाटाबेस सर्व्हर लॉक हो गया है ।',
'internalerror'        => 'आन्तरिक गलती',
'internalerror_info'   => 'आन्तरिक गलती: $1',
'filecopyerror'        => '"$1" फ़ाईलकी "$2" यह कापी नहीं बना पायें ।',
'filerenameerror'      => '"$1" फ़ाईल का नाम बदलकर "$2" नहीं कर पायें ।',
'filedeleteerror'      => '"$1" फ़ाईलको हटा नहीं सकें ।',
'directorycreateerror' => '"$1" डाइरेक्टरी नहीं बना पायें ।',
'filenotfound'         => '"$1" यह फ़ाईल मिली नहीं ।',
'fileexistserror'      => 'फ़ाईल "$1" पर लिख नहीं सकतें: फ़ाईल अस्तित्वमें है',
'unexpected'           => 'अनपेक्षित मूल्य: "$1"="$2".',
'formerror'            => 'गलती: फॉर्म सबमीट नहीं कर पायें',
'badarticleerror'      => 'इस पन्ने पर यह क्रिया नहीं कर सकतें ।',
'cannotdelete'         => 'इस पन्ने या चित्र को हटाया नहीं जा सका । (शायद इसे किसी और ने पहले ही हटा दिया हो )',
'badtitle'             => 'खराब शीर्षक',
'badtitletext'         => 'आपके द्वारा पूछा गया लेख का शीर्षक अयोग्य, ख़ाली या गलतीसे जुडा हुवा आंतर-भाषिय या आंतर-विकि शीर्षक हैं । इसमें एक या एकसे ज्यादा ऐसे कॅरेक्टर है जो शीर्षकमें इस्तेमाल नहीं किये जा सकते है ।',
'perfdisabled'         => 'माफ़ किजीयें! यह सुविधा अस्थायी रुप से बंद की गई है क्योंकि इसके चलते डाटाबेस इतनी धीमी गतीसे चलता है कि कोई भी विकिका इस्तेमाल नहीं कर पायेगा ।',
'perfcached'           => 'नीचे दिया हुवा पाठ्य कैश मेमरीसे लिया हुवा होने के कारण अद्यतन जानकारीयुक्त ना होने की संभावना है ।',
'perfcachedts'         => 'नीचे दी गई ज़ानकारी कैश मेमरीमें रखी हुई है, और आखिरी बार $1 को बदली गई हैं ।',
'querypage-no-updates' => 'इस पन्ने का नवीनीकरण करना मना है । अभी यहां के डाटा को ताज़ा नहीं कर सकतें ।',
'wrong_wfQuery_params' => 'wfQuery() के लिये गलत मापदण्ड दियें हैं<br />
कार्य: $1<br />
पृच्छा: $2',
'viewsource'           => 'सोर्स देखें .',
'viewsourcefor'        => '$1 के लिये',
'actionthrottled'      => 'कार्य समाप्त कर दिया गया हैं',
'actionthrottledtext'  => 'स्पैम की रोकथाम के लिये, यह क्रिया इतने कम समय में एकसे ज्यादा बार करनेसे मनाई है, और आप इस मर्यादाको पार कर चुके हैं ।
कृपया कुछ समय बाद पुन: यत्न किजीयें ।',
'protectedpagetext'    => 'यह पान संपादनोंसे सुरक्षित किया हुवा है ।',
'viewsourcetext'       => 'आप इस पन्ने का स्रोत देख सकते हैं और उसकी नकल उतार सकतें हैं:',
'protectedinterface'   => 'यह पन्ना सॉफ्टवेयरको इंटरफ़ेस देता हैं, और इसके गलत इस्तेमालसे बचने के लिये इसे सुरक्षित कर दिया गया हैं ।',
'editinginterface'     => "'''सावधान:''' आप ऐसे पृष्ठ का संपादन कर रहें हैं जो सॉफ़्टवेयर के अंतरफलक का पाठ उपलब्ध कराता हैं। इस पृष्ठ के परिवर्तन अन्य उपयोगकर्ताओं के प्रयोग में आने वाले अंतरफलकों के स्वरूप को प्रभावित करेंगे।",
'sqlhidden'            => '(छुपाई हुई SQL पृच्छा)',
'cascadeprotected'     => 'यह पन्ना सुरक्षित हैं, क्योंकी यह निम्नलिखित {{PLURAL:$1|पन्ने की|पन्नों की}} सुरक्षा-सीढीमें समाविष्ट हैं:
$2',
'namespaceprotected'   => "आपको '''$1''' नामस्थानमें समाविष्ट पन्नोंको बदलने की अनुमति नहीं हैं ।",
'customcssjsprotected' => 'इस पन्नेपर दुसरे सदस्यकी व्यक्तिगत वरीयताएं होने के कारण, आपको यह पन्ना बदलने की अनुमति नहीं हैं ।',
'ns-specialprotected'  => 'विशेष पन्ने बदलें नहीं जा सकतें ।',
'titleprotected'       => "सदस्य [[User:$1|$1]] ने इस शीर्षक का पन्ना बनानेसे मना किया हुआ हैं ।
इसके लिये दिया हुआ कारण ''$2'' ।",

# Login and logout pages
'logouttitle'                => 'सदस्य लॉग आउट',
'logouttext'                 => '<strong>अब आपने लॉग आउट किया हुआ हैं ।</strong>

आप अनामकता से {{SITENAME}} का इस्तेमाल कर सकते हैं, या फिर उसी अथवा किसी अन्य सदस्यनामसे लॉग इन कर सकतें हैं ।
जबतक आप अपने ब्राउज़र की कैश मेमरी खाली नहीं करतें, तब तक कुछ पन्नोंपर आप लॉग इन हैं, ऐसा दिखाया जा सकता हैं ।',
'welcomecreation'            => "<h2>स्वागतम्‌, $1!</h2><p>आपका अकाउन्ट बना दिया गया है.
Don't forget to personalize your {{SITENAME}} preferences.",
'loginpagetitle'             => 'सदस्य लॉग इन',
'yourname'                   => 'सदस्यनाम:',
'yourpassword'               => 'आपका पासवर्ड',
'yourpasswordagain'          => 'पासवर्ड दुबारा लिखें',
'remembermypassword'         => 'इस कंप्यूटर पर मेरी लॉग-इन सूचना याद रखें।',
'yourdomainname'             => 'आपका डोमेन:',
'externaldberror'            => 'बाह्य प्रमाणिकरण डाटाबेसमें समस्या हुई हैं या फिर आपको अपना बाह्य खाता अपडेट करने की अनुमति नहीं हैं ।',
'loginproblem'               => '<b>आपके लोगिन में समस्या हुई है ।</b><br />दुबारा प्रयत्न करें!',
'login'                      => 'लॉग इन',
'nav-login-createaccount'    => 'सदस्य लॉग इन',
'loginprompt'                => 'विकिपीडिया पर लॉग इन करने लिए आपने ब्राउज़र पर कुकी (cookies) को समर्थ करें।',
'userlogin'                  => 'सदस्य लॉग इन',
'logout'                     => 'लॉग आउट',
'userlogout'                 => 'लॉग आउट',
'notloggedin'                => 'लॉग इन नहीं किया हैं',
'nologin'                    => 'क्या आपका खाता नहीं है? $1।',
'nologinlink'                => 'नया खाता बनाएँ',
'createaccount'              => 'खाता बनाएँ',
'gotaccount'                 => 'पहलेसे आपका खाता हैं? $1.',
'gotaccountlink'             => 'लॉग इन',
'createaccountmail'          => 'ई-मेल द्वारा',
'badretype'                  => 'आपने जो पासवर्ड दिये हैं वे एक दूसरे से नहीं मिलते। फिर से लिखें।',
'userexists'                 => 'आपने दिया हुआ सदस्यनाम पहले से इस्तेमालमें हैं ।
कृपया अन्य सदस्यनाम चुनियें ।',
'youremail'                  => 'आपका ई-मेल पता*',
'username'                   => 'सदस्यनाम:',
'uid'                        => 'सदस्य क्रमांक:',
'prefs-memberingroups'       => 'निम्नलिखित {{PLURAL:$1|ग्रुप का|ग्रुपों का}} सदस्य:',
'yourrealname'               => 'आपका असली नाम*',
'yourlanguage'               => 'भाषा:',
'yourvariant'                => 'वेरियंट:',
'yournick'                   => 'आपका उपनाम (दस्तखत/सही के लिये)',
'badsig'                     => 'गलत कच्चा दस्तखत, HTML टैग की जाँच करें ।',
'badsiglength'               => 'अत्याधिक बड़ा उपनाम; $1 अक्षरों से कम होना चाहिये',
'email'                      => 'इ-मेल',
'prefs-help-realname'        => 'आपका असली नाम देना जरूरी नहीं है पर अगर दिया तो आपके योगदानको आपसे आरोपण करने के लिये इस्तेमाल किया जायेगा ।',
'loginerror'                 => 'लॉग इन ग़लती',
'prefs-help-email'           => 'इ-मेल पता देना वैकल्पिक हैं, पर अगर इसे दिया जायें तो यह अन्य सदस्योंको आपकी पहचान दिये बिना आपसे संपर्क करने की सुविधा देता हैं ।',
'prefs-help-email-required'  => 'इ-मेल पता ज़रूरी हैं ।',
'nocookiesnew'               => 'आपका खाता खोल दिया हैं, पर आप लॉग इन नहीं हुए हैं ।
{{SITENAME}} पर लॉग इन करने के लिये कूकीस का प्रयोग होता हैं ।
आपने कूकीस इस्तेमाल करने की अनुमति नहीं दी हैं ।
कृपया कूकीस का इस्तेमाल करने की अनुमति दें, तथा अपने सदस्यनाम एवम्‌ कूटशब्दसे लॉग इन करें ।',
'nocookieslogin'             => '{{SITENAME}} पर लॉग इन करने के लिये कूकीस का प्रयोग होता हैं । 
आपने कूकीस इस्तेमाल करने की अनुमति नहीं दी हैं । 
कृपया कूकीस का इस्तेमाल करने की अनुमति दें, तथा फिरसे कोशीश करें ।',
'noname'                     => 'आपने वैध सदस्यनाम नहीं दिया हैं ।',
'loginsuccesstitle'          => 'लॉग इन हो गया है',
'loginsuccess'               => 'आप विकिपीडिया में "$1" सदस्य नाम  से लॉग इन हो चुके हैं ।',
'nosuchuser'                 => '"$1" नाम से कोई सदस्य नहीं है।
अपनी वर्तनी जाचेँ, या निम्न प्रपत्र का प्रयोग कर के नया उपयोगकर्ता खाता बनायें।',
'nosuchusershort'            => '"<nowiki>$1</nowiki>" इस नाम का कोई सदस्य नहीं है ।
कृपया आपने दिया हुवा नाम जाँचियें ।',
'nouserspecified'            => 'आपको सदस्यनाम देना जरूरी है ।',
'wrongpassword'              => 'आपने जो कूटशब्द लिखा है वह गलत है। कृपया पुनः प्रयास करें।',
'wrongpasswordempty'         => 'कूटशब्द खाली है; फिरसे यत्न किजीये ।',
'passwordtooshort'           => 'आपका कूटशब्द गलत या फिर ज्यादा छोटा है ।
उसमें कम से कम $1 अक्षरे होने चाहिये और वह आपके सदस्यनामसे अलग होना चाहिये ।',
'mailmypassword'             => 'ई-मेल द्वारा नया पासवर्ड भेजें',
'passwordremindertitle'      => '{{SITENAME}} के लिया नया अस्थायी कूटशब्द',
'passwordremindertext'       => 'किसीने (शायद आपने, $1 आयपी एड्रेस से)
{{SITENAME}} पर इस्तेमाल के लिये ’नया कूटशब्द’ मंगाया है ($4) ।
"$2" सदस्यके लिये  कूटशब्द अब "$3" है ।
अभी आप लॉग इन करें और अपना कूटशब्द बदलें ।

अगर यह गुजारिश आपके अलावा और किसीने की है या फिर आपको अपना पुराना कूटशब्द याद आया हो और आप इसे बदलना नहीं चाहते हो तो, इस संदेश को नजर-अंदाज करके पुराना कूटशब्द इस्तेमाल कर सकते है ।',
'noemail'                    => '"$1" सदस्य के लिये कोई भी इ-मेल पता दर्ज नहीं किया गया हैं ।',
'passwordsent'               => '"$1" का ई-मेल पता पर एक ई-मेल भेजा गया। ई-मेल पाने बाद में कृपया दुबारा लॉग इन करें।',
'blocked-mailpassword'       => 'आपके IP एड्रेस को संपादन करने से प्रतिबंधित कर दिया गया हैं, ऐसे मौके पे गलत इस्तेमाल को रोकने के लिये कूटशब्द पुनः प्राप्ति की सुविधा बंद कर दी गईं हैं ।',
'eauthentsent'               => 'दर्ज किये हुए इ-मेल पते पर एक सत्यापन इ-मेल भेजा गया है ।
कोई भी दूसरा इ-मेल भेजने से पहले, आपके सदस्यत्व का सत्यापन करने के लिये, आपको उस इ-मेल में दिये हुए सूचनाओंके अनुसार क्रियाएं करना आवश्यक है ।',
'throttled-mailpassword'     => 'पिछलें $1 घंटोंमें कूटशब्द पुनः प्राप्ति की सूचना भेजी गईं हैं ।
गलत इस्तेमाल रोकने के लिये हर $1 घंटोंमें सिर्फ एक बार ही यह सूचना दी जा सकती हैं ।',
'mailerror'                  => 'इ-मेल भेजनेमें समस्या: $1',
'acct_creation_throttle_hit' => 'माफ करें, आप ने पहले ही $1 खाते बना रखे हैं। आप और अधिक नही बना सकते।',
'emailauthenticated'         => 'आपका इ-मेल पता $1 को प्रमाणित कर दिया गया हैं ।',
'emailnotauthenticated'      => 'आपका इ-मेल पता अभी तक प्रमाणित नहीं किया हुआ हैं ।
आप निम्नलिखित विषयों हेतु इ-मेल नहीं भेज सकतें ।',
'noemailprefs'               => 'इन सुविधाओंका इस्तेमाल करने के लिये एक इ-मेल पता दें ।',
'emailconfirmlink'           => 'आपका इ-मेल पता प्रमाणित करें',
'invalidemailaddress'        => 'आपने दिया हुआ इ-मेल पता गलत हैं क्योंकी यह वैध फ़रमैटमें नहीं लिखा गया हैं ।
कृपया वैध इ-मेल पतादे या फ़िर उस जगह कुछ भी ना लिखें ।',
'accountcreated'             => 'खाता निर्मित',
'accountcreatedtext'         => '$1 के किये खाता निर्मित कर दिया गया है।',
'createaccount-title'        => '{{SITENAME}} के लिये खाता बनाईयें',
'createaccount-text'         => 'आपके इ-मेल एड्रेस के लिये {{SITENAME}} ($4) पर "$2" नामके किसीने, "$3" यह कूटशब्द देकर खाता खोला हैं । कृपया आप लॉग इन करके अपना कूटशब्द बदलें ।

अगर यह खाता गलती से खोला गया हैं, तो आप इस मेसेज को दुर्लक्षित कर सकतें हैं ।',
'loginlanguagelabel'         => 'भाषा: $1',

# Password reset dialog
'resetpass'               => 'कूटशब्द रिसेट करें',
'resetpass_announce'      => 'आप इ-मेल से प्राप्त अस्थायी कोडसे लॉग इन हैं ।
लॉग इन को पूरा करने के लिये, आप एक नया कूटशब्द दें:',
'resetpass_text'          => '<!-- पाठ यहां लिखें -->',
'resetpass_header'        => 'कूटशब्द रिसेट करें',
'resetpass_submit'        => 'कूटशब्द बनाईयें और लॉग इन करें',
'resetpass_success'       => 'आपका कूटशब्द बदल दिया गया हैं! अभी आपको लॉग इन करवा रहें हैं...',
'resetpass_bad_temporary' => 'अस्थायी कूटशब्द गलत हैं ।
आपने ही पहले ही अपना कूटशब्द बदल दिया हो या फिर आपने नया अस्थायी कूटशब्द मंगाया होगा ।',
'resetpass_forbidden'     => '{{SITENAME}} पर कूटशब्द बदलें नहीं जा सकतें',
'resetpass_missing'       => 'फ़ार्म डाटा मिला नहीं ।',

# Edit page toolbar
'bold_sample'     => 'मोटा पाठ',
'bold_tip'        => 'बोल्ड पाठ्य',
'italic_sample'   => 'झूकी मूल',
'italic_tip'      => 'तिरछा पाठ्य',
'link_sample'     => 'कड़ी शीर्षक',
'link_tip'        => 'आंतर्गत कड़ि',
'extlink_sample'  => 'http://www.example.com कड़ी शीर्षक',
'extlink_tip'     => 'बाहरी कड़ी (उपसर्ग http:// अवश्य लगाएँ)',
'headline_sample' => 'शीर्षक',
'headline_tip'    => 'द्वितीय-स्तर शीर्षक',
'math_sample'     => 'गणितीय फ़ॉर्म्युला यहाँ निवेश करें',
'math_tip'        => 'मॅथेमॅटिकल फ़ार्म्यूला (LaTeX)',
'nowiki_sample'   => 'असंरूपित पाठ यहाँ निवेश करें',
'nowiki_tip'      => 'विकिभाषाके अनुसार बदलाव न करें',
'image_sample'    => 'उदाहरण.jpg',
'image_tip'       => 'एम्बडेड फ़ाईल',
'media_sample'    => 'उदाहरण.ogg',
'media_tip'       => 'फ़ाईल कड़ि',
'sig_tip'         => 'आपकी सिग्नेचर समय के साथ',
'hr_tip'          => 'हॉरिझॉंटल लाईन (कम इस्तेमाल करें)',

# Edit pages
'summary'                          => 'सारांश',
'subject'                          => 'विषय/शीर्षक',
'minoredit'                        => 'यह एक छोटा बदलाव है',
'watchthis'                        => 'इस पृष्ठ को ध्यानसूची में डालें',
'savearticle'                      => 'बदलाव संजोयें',
'preview'                          => 'झलक',
'showpreview'                      => 'झलक दिखायें',
'showlivepreview'                  => 'सीधी झलक',
'showdiff'                         => 'बदलाव दिखाएं',
'anoneditwarning'                  => "'''सावधान:''' आपने लॉग इन नहीं किया। इस पृष्ठ के इतिहास में आपका आइपी पता अंकित किया जाएगा।",
'missingsummary'                   => "'''तकाज़ा (स्मरण-पत्र):''' आपने संपादन सारांश नहीं दिया हुआ हैं ।
अगर आप दुबारा संजोयेंपर क्लीक करते हैं तो आपका संपादन बिना सारांश दिये संजोया जायेगा ।",
'missingcommenttext'               => 'कृपया नीचे टिप्पणी दें ।',
'missingcommentheader'             => "'''स्मरण-पत्र:''' आपने इस टिप्पणीको शीर्षक नहीं दिया हैं ।
अगर आप दुबारा संजोयें पर क्लीक करें तो आपके बदलाव संजोयें जायेंगे ।",
'summary-preview'                  => 'सारांशकी झलक',
'subject-preview'                  => 'विषय/शीर्षक की झलक',
'blockedtitle'                     => 'सदस्य अवरुद्ध है',
'blockedtext'                      => "<big>'''आपका सदस्यनाम अथवा IP एड्रेस ब्लॉक कर दिया गया हैं ।'''</big>

यह ब्लॉक $1 ने दिया है । इसके लिये ''$2'' यह कारन दिया हुआ हैं ।

* ब्लॉकका आरंभ: $8
* ब्लॉककी समाप्ती: $6
* किसे ब्लॉक करना है: $7

आप इस ब्लॉकके बारेमें वार्तालाप के लिये $1 या [[{{MediaWiki:Grouppage-sysop}}|प्रबन्धकोंसे]] संपर्क कर सकते हैं ।
आप जबतक वैध इमेल पता अपने [[Special:Preferences|सदस्य पसंद]] पन्नेपर देते नहीं तबतक आप ’सदस्यको इमेल भेजें’ यह कड़ि इस्तेमाल नहीं कर सकतें । आपको ऐसा करनेसे नहीं रोका गया है । आपका अभीका IP एड्रेस $3 यह है, और आपका ब्लॉक क्रमांक #$5 हैं । कृपया इस विषयपर होनेवाले वार्तालापमें इनमेंसे किसीकाभी प्रयोग किजीयें ।",
'autoblockedtext'                  => 'आपका आईपी एड्रेस अपनेआप ब्लॉक हो गया हैं क्योंकी यह उस सदस्य ने इस्तेमाल किया था, जिसे $1 ने ब्लॉक किया हैं।
ब्लॉक करने का कारण नीचे दिया हैं:

:\'\'$2\'\'

* ब्लॉक की शुरुवात: $8
* ब्लॉक की समाप्ती: $6

आप इस बारें में $1 से या फिर किसी [[{{MediaWiki:Grouppage-sysop}}|प्रबंधक]] से संपर्क कर सकतें हैं।

अगर आपने अपने [[Special:Preferences|सदस्य वरीयताएं]]में वैध इ-मेल पता नहीं दिया हैं तो आप "इस सदस्यको इ-मेल करें" सुविधा का इस्तेमाल नहीं कर सकतें हैं। आपको ऐसा करने से रोका नहीं गया हैं।

आपका ब्लाक आईडी $5 हैं।
अपने कोईभी पृच्छामें इसका इस्तेमाल करें।',
'blockednoreason'                  => 'कारण दिया नहीं हैं',
'blockedoriginalsource'            => "'''$1''' का स्रोत इसके नीचे दिया गया है:",
'blockededitsource'                => "'''$1''' को '''आपके बदलाव''' का पाठ्य नीचे दर्शाया गया हैं:",
'whitelistedittitle'               => 'संपादित करनें के लिये लॉग इन करना ज़रूरी हैं',
'whitelistedittext'                => 'लेख संपादित करने के लियें $1 करें ।',
'confirmedittitle'                 => 'संपादित करने के लियें इ-मेल से पुष्टि करना आवश्यक हैं',
'confirmedittext'                  => 'संपादन करने से पहले आपने अपना इ-मेल पता प्रमाणित कराना आवश्यक हैं ।
कृपया अपनी [[Special:Preferences|सदस्य वरीयताएं]] में जाकर अपना इ-मेल पता दें और उसे प्रमाणित करें ।',
'nosuchsectiontitle'               => 'ऐसा कोई विभाग नहीं हैं',
'nosuchsectiontext'                => 'आपने एक ऐसा विभाग संपादित करनेकी कोशीश की हैं जो अस्तित्व में नहीं हैं । विभाग $1 ना होने के कारण, आपके बदलाव संजोनेकी जगह नहीं हैं ।',
'loginreqtitle'                    => 'लॉग इन आवश्यक हैं',
'loginreqlink'                     => 'लॉग इन',
'loginreqpagetext'                 => 'अन्य पन्ने देखने के लिये आपको $1 करना आवश्यक हैं ।',
'accmailtitle'                     => 'पासवर्ड भेज दिया गया है।',
'accmailtext'                      => "'$1' का पासवर्ड $2 को भेज दिया गया है।",
'newarticle'                       => '(नया)',
'newarticletext'                   => 'आप जो लेख चाहते हैं वह अभीतक लिखा नहीं गया हैं । यह लेख लिखनेके लिये नीचे पाठ्य लिखियें । सहाय्यताके लिये [[{{MediaWiki:Helppage}}|यहां]] क्लीक किजीयें ।

अगर आप यहांपर गलतीसे आये हैं तो अपने ब्राउज़रके बॅक (back) पर क्लीक किजीयें ।',
'anontalkpagetext'                 => "---- ''यह वार्ता पन्ना उस अज्ञात सदस्य के लिये है जिसने या तो अकाउन्ट नहीं बनाया है या वह उसे प्रयोग नहीं कर रहा है । इसलिये उसकी पहचान के लिये हम उसका आ ई पी ऐड्रस प्रयोग कर रहे हैं । ऐसे आ ई पी ऐड्रस कई लोगों के बीच शेयर किये जा सके हैं । अगर आप एक अज्ञात सदस्य हैं और आपको लगता है कि आपके बारे में अप्रासंगिक टीका टिप्पणी की गयी है तो कृपया  [[Special:UserLogin|अकाउन्ट बनायें या लॉग इन करें]] जिससे भविष्य में अन्य अज्ञात सदस्यों के साथ  कोई गलतफहमी न हों .''",
'noarticletext'                    => 'इस लेखमें अभी कुछभी पाठ्य नहीं हैं । आप विकिपीडियापर होनेवाले दुसरे लेखोंमें इस [[Special:Search/{{PAGENAME}}|शीर्षक को खोज सकते हैं]] या फिर यह लेख [{{fullurl:{{FULLPAGENAME}}|action=edit}} तैयार कर सकते हैं] ।',
'userpage-userdoesnotexist'        => 'सदस्य खाता "$1" पंजिकृत नहीं हैं । कृपया यह लेख आप संपादित अथवा निर्मित करना चाहते हैं इसकी जाँच करें ।',
'clearyourcache'                   => "'''सुचना''': यह पृष्ठ सुरक्षित करने बाद, बदलावों देखने लिए आपका ब्राउज़र का कैश ख़ाली करने की ज़रूरत हो सकती है। 

'''मोज़िला / फ़ायरफ़ॉक्स / सफ़ारी:''' ''shift hold'' करें जब आप ''reload'' क्लिक करते है, या ''Ctrl-Shift-R'' (अपल मैक में ''Cmd-Shift-R'') दबाएँ; 

'''इंटरनेट एक्सप्लोरर:''' ''Ctrl hold'' करें जब आप ''refresh'' क्लिक करते है, या ''Ctrl-F5'' क्लिक करते है; 
'''कॉङ्करर:''' सिर्फ़ ''Reload'' बटन पर क्लिक करें, या ''F5'' दबाएँ; 

'''ऑपरा''' सदस्य को ''Tools→Preferences'' में सम्पूर्ण कैश ख़ाली करने की ज़रूरत हो सकती है।",
'usercssjsyoucanpreview'           => '<strong>टीप:</strong>आपका नया CSS/JS संजोने से पहले ’झलक’ देखें ।',
'usercsspreview'                   => "'''आप अपने सी.एस.एस.की सिर्फ झलक देख रहें हैं, वह अभीतक संजोई नहीं हैं इसका खयाल रखें ।'''",
'userjspreview'                    => "'''आप अपने जावास्क्रीप्टकी सिर्फ झलक देख रहें हैं, वह अभीतक संजोई नहीं हैं इसका खयाल रखें ।'''",
'userinvalidcssjstitle'            => "'''ताक़ीद:''' \"\$1\" नामसे कोई त्वचा नहीं हैं ।
कृपया ध्यान में रहें की बदली हुई .css और .js फ़ाईलें नीचे स्तरकी लिपी का इस्तेमाल करती हैं, उदा.  {{ns:user}}:Foo/monobook.css के विरुध {{ns:user}}:Foo/Monobook.css ।",
'updated'                          => '(अद्यतनीत)',
'note'                             => '<strong>सूचना:</strong>',
'previewnote'                      => '<strong>याद रखें, यह केवल एक झलक है और अभी तक सुरक्षित  नहीं किया गया है!</strong>',
'previewconflict'                  => 'उपरी बदलाव संजोये जाने के बाद उपरी पाठ इस झलकके अनुसार दिखाया जायेगा।',
'session_fail_preview'             => '<strong>माफ किजीयें! आपके बदलाव सेशन डाटा के नष्ट होने के कारण संजोयें नहीं गयें हैं।
कृपया पुन: यत्न करें। अगर इसके बाद भी ऐसा ही होता हैं तो कॄपया लॉग आउट करके फिरसे लॉग इन करें।</strong>',
'session_fail_preview_html'        => "<strong>माफ किजीयें! आपके बदलाव सत्र डाटा नष्ट होने के कारण संजोयें नहीं जा सकें।</strong>

''चूंकी {{SITENAME}} HTML पर निर्भर हैं, जावास्क्रीप्ट पर होने वाले संभाव्य हमलोंसे बचाव के लिये झलक नहीं दिखाईं गईं हैं।''

<strong>अगर यह आपका वैध संपादन यत्न था, तो कृपया पुन: यत्न करें। अगर इसके बाद भी ऐसा ही हुआ तो कृपया लॉग आउट करके फिरसे लॉग इन करें।</strong>",
'token_suffix_mismatch'            => '<strong>आपके द्वारा किये गये बदलाव रद्द कर दियें गयें हैं क्योंकी आपके क्लायंटने आपके संपादनमें दियें हुए विरामचिन्होंमें बदलाव कियें हैं।
लेख के पाठमें खराबी ना आयें इसलियें यह बदलाव रद्द कर दियें गयें हैं।
ऐसा शायद आप अनामक प्रोक्सी इस्तेमाल करने से हो सकता हैं।</strong>',
'editing'                          => '$1 सम्पादन',
'editingsection'                   => '$1 सम्पादन (अनुभाग)',
'editingcomment'                   => '$1 (टिप्पणी) सम्पादन',
'editconflict'                     => 'संपादन अंतर्विरोध: $1',
'explainconflict'                  => 'आपने बदलाव शुरु करने बाद और किसीने बदलाव किये हैं।
उपरी हिस्से में अभीका पाठ दर्शाया गया हैं, तो नीचले हिस्से में आपके बदलाव दर्शायें गयें हैं।
आपको यह बदलाव अभी खुद एकत्रित करने पडेंगे।
अगर आपने "बदलाव संजोयें" पर क्लिक किया तो <b>सिर्फ</b> उपरी हिस्से में दिखने वाला पाठ संजोया जायेगा।<br />',
'yourtext'                         => 'आपका पाठ',
'storedversion'                    => 'संजोया हुआ अवतरण',
'nonunicodebrowser'                => '<strong>सावधान: आपका ब्राउज़र यूनिकोड आधारित नहीं हैं। 
आपके द्वारा सुयोग्य संपादन होने के लिये: ASCII न होने वाले चिन्ह षट्‍पदी कोड (hexadecimal) में दर्शायें जायेंगे।</strong>',
'editingold'                       => '<strong>सूचना: आप इस पृष्ठ का कालातीत अवतरण संपादित कर रहें हैं।
अगर आप इसे संजोतें हैं, तो इस अवतरण के बाद हुए सभी बदलाव नष्ट हो जायेंगे।</strong>',
'yourdiff'                         => 'अंतर',
'copyrightwarning'                 => 'कृपया ध्यान रहे कि {{SITENAME}} को किये गये सभी योगदान $2
की शर्तों के तहत् उपलब्ध किये हुए माने जायेंगे (अधिक जानकारी के लिये $1 देखें) । अगर आप अपनी लिखाई को बदलते और पुनः वितरित होते नहीं देखना चाहते हैं तो यहां योगदान नहीं करें । <br />
आप यह भी प्रमाणित कर रहे हैं कि यह आपने स्वयं लिखा है अथवा जनार्पीत या किसी अन्य मुक्त स्रोत से कॉपी किया है । <strong>कॉपीराइट वाले लेखों को, बिना अनुमति के, यहाँ नहीं डालिये !</strong>',
'copyrightwarning2'                => '{{SITENAME}} पर लिखा हुआ कोईभी पाठ अन्य सदस्योंद्वारा बदला जा सकता है या फिर निकाला भी जा सकता हैं।
अगर आपको अपने लिखे हुए पाठ में संपादन होना नामंजूर हैं तो कृपया यहां पर मत लिखें।<br />
आप हमें यह भी वचन देतें हैं कि यह आपने खुद लिखा हैं या फिर कोई पब्लिक डोमेन या ऐसे ही किसी मुक्त स्रोतसे कापी किया हैं। (अधिक जानकारी के लिये $1 देखें)।
<strong>कॉपीराइट वाले लेखों को, बिना अनुमति के, यहाँ न डाले।</strong>',
'longpagewarning'                  => '<strong>सूचना: यह पन्ना $1 किलोबाईट्सका है; कुछ ब्राउज़र्स 32kb से ज्यादा बडे पन्नोंको ठीक से नहीं दिखा सकते या संपादित करने में असुविधा हो सकती है ।
कृपया इस पन्नेके उससे कम आकारके विभाग बनाईये ।</strong>',
'longpageerror'                    => '<strong>गलती: आपने दिया हुआ पाठ $1 कीलोबाईट लंबा हैं, जो $2 केबी के मर्यादा से बाहर हैं।
इसे संजोया नहीं जा सकता।</strong>',
'readonlywarning'                  => '<strong>सावधान: डाटाबेस रख रखाव के लियें बंद कर दिया गया हैं, इसलिये अभी आपके बदलाव संजोयें नहीं जा सकतें।
अगर आप चाहतें हैं तो इस पाठ को टैक्स्ट फ़ाईल में कट-पेस्ट करके रख सकतें हैं।</strong>',
'protectedpagewarning'             => '<strong>सुचना:  यह लेख सुरक्षित कर दिया गया हैं और सिर्फ प्रबंधक इसमें बदलाव कर सकतें हैं।</strong>',
'semiprotectedpagewarning'         => "'''सूचना:''' यह लेख सुरक्षित कर दिया गया हैं और सिर्फ पंजीकृत सदस्य ही इसमें बदलाव कर सकतें हैं।",
'cascadeprotectedwarning'          => "'''सावधान:''' यह लेख निम्नलिखीत सुरक्षा-सीढी {{PLURAL:$1|पन्ने से|पन्नों से}} जुडा हुआ होने के कारण सुरक्षित हुआ हैं, और सिर्फ प्रबंधक ही इसमें बदलाव कर सकतें हैं:",
'titleprotectedwarning'            => '<strong>सुचना:  यह लेख सुरक्षित हैं और कुछ सदस्य ही इसका निर्माण कर सकतें हैं।</strong>',
'templatesused'                    => 'इस पृष्ठ पर प्रयुक्त साँचे:',
'templatesusedpreview'             => 'इस झलकमें इस्तेमाल किये हुए टेम्प्लेट्स:',
'templatesusedsection'             => 'इस विभागमें इस्तेमाल किये गये साँचे:',
'template-protected'               => '(सुरक्षित)',
'template-semiprotected'           => '(अर्ध-सुरक्षीत)',
'hiddencategories'                 => 'यह लेख निम्नलिखित {{PLURAL:$1|1 छुपाई हुई श्रेणीमें|$1 छुपाईं हुईं श्रेणियोंमें}} हैं:',
'edittools'                        => '<!-- यहां दिया हुआ पाठ संपादन और अपलोड फ़ार्म के नीचे दर्शाया जायेगा। -->',
'nocreatetitle'                    => 'लेख निर्माणमें प्रतिबंध',
'nocreatetext'                     => '{{SITENAME}} पर नये लेख लिखनेके लिये मनाई की गई हैं ।
आप पीछे जाकर अस्तित्वमें होनेवाले लेखोंको संपादित कर सकते हैं, अथवा [[Special:UserLogin|नया ख़ाता खोलें / प्रवेश करें]] ।',
'nocreate-loggedin'                => '{{SITENAME}} पर नये पन्ने बनाने का आपको अधिकार नहीं हैं।',
'permissionserrors'                => 'अधिकारोंमें गलती',
'permissionserrorstext'            => 'निम्नलिखित {{PLURAL:$1|कारण|कारणोंसे}} आपको ऐसा करने की अनुमति नहीं हैं:',
'permissionserrorstext-withaction' => 'आपको $2 की अनुमति नहीं हैं, निम्नलिखित {{PLURAL:$1|कारण के लिये|कारणोंके लिये}}:',
'recreate-deleted-warn'            => "'''चेतावनी: आप एक पहले से मिटाये गये पृष्ठ को पुनर्निर्मित कर रहे हैं।'''

आप को विचार करना चाहिये क्या इस पृष्ठ का संपादन चालू रखना उचित होगा।
इस पृष्ट को मिटाने का अभिलेख/प्रचालेख सुविधा के लिये उपलब्ध कराया गया है:",

# Parser/template warnings
'expensive-parserfunction-warning'        => 'सूचना: इस पन्नेपर बहुत सारे किमती पार्सर क्रिया कॉल हैं।

वे $2 से कम होने चाहिये, पर अभी $1 हैं।',
'expensive-parserfunction-category'       => 'बहुत सारे किमती पार्सर क्रिया कॉल होने वाले पन्ने',
'post-expand-template-inclusion-warning'  => 'सूचना: साँचा डालनेकी सीमा खतम हो चुकी हैं।
कुछ साँचे हटाये जायेंगे।',
'post-expand-template-inclusion-category' => 'ऐसे पन्ने जिनपर और साँचे नहीं डाले जा सकते',
'post-expand-template-argument-warning'   => 'सूचना: इस पन्नेपर ऐसा कमसे कम एक साँचा है जिसे बढाने पर बहुत बडा हो जायेगा।
ऐसा साँचा हटा दिया गया है।',
'post-expand-template-argument-category'  => 'ऐसे पन्ने जिनमें साँचे हटाये गये हैं',

# "Undo" feature
'undo-success' => 'यह संपादन पूर्ववत किया जा सकता हैं। ऐसा करने के लिये कृपया निम्नलिखित पाठ को ध्यान से देखकर बदलाव संजोयें।',
'undo-failure' => 'इस बीच अन्य बदलाव होने के कारण यह संपादन पूर्ववत करना संभव नहीं हैं।',
'undo-norev'   => 'यह बदलाव वापिस नहीं कर पायें हैं क्योंकि या तो इसे पहलेसे पलटा दिया गया हैं या फिर हटा दिया गया हैं।',
'undo-summary' => '[[Special:Contributions/$2|$2]] ([[User talk:$2|वार्ता]]) के अवतरण $1 को पूर्ववत किया',

# Account creation failure
'cantcreateaccounttitle' => 'खाता खोल नहीं सकतें',
'cantcreateaccount-text' => "इस आईपी एड्रेस ('''$1''') को खाता निर्मित करने से [[User:$3|$3]] ने प्रतिबंधित किया हैं।

इसके लिये $3 ने ''$2'' यह कारण दिया हैं।",

# History pages
'viewpagelogs'        => 'इस पन्नेका लॉग देखियें',
'nohistory'           => 'इस पन्ने का कोई इतिहास नहीं',
'revnotfound'         => 'अवतरण मिला नहीं',
'revnotfoundtext'     => 'आपसे पूछा गया इस लेख का पुराना अवतरण नहीं मिल पाया। कॄपया आपने इस्तेमाल किये URL की जाँच करें।',
'currentrev'          => 'सद्य अवतरण',
'revisionasof'        => '$1 का आवर्तन',
'revision-info'       => '$2ने किया हुवा $1का अवतरण',
'previousrevision'    => '← पुराना संशोधन',
'nextrevision'        => 'नया संशोधन →',
'currentrevisionlink' => 'वर्तमान संशोधन',
'cur'                 => 'चालू',
'next'                => 'अगले',
'last'                => 'पिछला',
'page_first'          => 'पहला',
'page_last'           => 'आखिरी',
'histlegend'          => 'फर्क चयन: फर्क देखनेके लिये पुराने अवतरणोंके आगे दिये गये रेडियो बॉक्सपर क्लीक करें तथा एन्टर करें अथवा नीचे दिये हुए बटनपर क्लीक करें<br />
लिजेंड: (चालू) = सद्य अवतरणके बीचमें फर्क,
(आखिरी) = पिछले अवतरणके बीचमें फर्क, छो = छोटा बदलाव ।',
'deletedrev'          => '[हटाया गया]',
'histfirst'           => 'सबसे पुराना',
'histlast'            => 'नवीनतम',
'historysize'         => '({{PLURAL:$1|1 बाईट|$1 बाईट}})',
'historyempty'        => '(खाली)',

# Revision feed
'history-feed-title'          => 'अवतरण इतिहास',
'history-feed-description'    => 'विकिपर उपलब्ध इस पन्ने का अवतरण इतिहास',
'history-feed-item-nocomment' => '$1 यहांके $2', # user at time
'history-feed-empty'          => 'पूछा गया लेख अस्तित्व में नहीं हैं।
यह लेख या तो हटाया गया हैं या फिर इसका नाम बदल दिया गया हैं।
[[Special:Search|विकिपर खोज]] का इस्तेमाल करें।',

# Revision deletion
'rev-deleted-comment'         => '(टिप्पणी हटाई)',
'rev-deleted-user'            => '(सदस्यनाम हटाया)',
'rev-deleted-event'           => '(कार्यकी नोंद हटाई)',
'rev-deleted-text-permission' => '<div class="mw-warning plainlinks">
इस लेख का अवतरण सामान्य डाटाबेससे हटाया गया हैं।
इसकी अधिक जानकारी [{{fullurl:Special:Log/delete|page={{FULLPAGENAMEE}}}} हटाने की सूची] में पाईं जा सकती हैं।</div>',
'rev-deleted-text-view'       => '<div class="mw-warning plainlinks">
इस लेख का अवतरण सामान्य डाटाबेससे हटाया गया हैं।
{{SITENAME}} पर प्रबंधक होनेके नाते आप इसे देख सकतें हैं।
इसकी अधिक जानकारी [{{fullurl:Special:Log/delete|page={{FULLPAGENAMEE}}}} हटाने की सूची] में पाईं जा सकती हैं।</div>',
'rev-delundel'                => 'दिखायें/छुपायें',
'revisiondelete'              => 'अवतरण हटायें/पुनर्स्थापित करें',
'revdelete-nooldid-title'     => 'लक्ष्य अवतरण गलत',
'revdelete-nooldid-text'      => 'इस क्रिया को करने के लिये आपने लक्ष्य अवतरण नहीं दियें हैं, या फिर आपने दिया हुआ अवतरण अस्तित्वमें नहीं हैं या फिर आप सद्य अवतरणको छुपा रहें हैं।',
'revdelete-selected'          => '[[:$1]] {{PLURAL:$2|का चुना हुआ अवतरण|के चुने हुए अवतरण}}:',
'logdelete-selected'          => '{{PLURAL:$1|चुना हुआ लॉग इवेंट|चुने हुए लॉग इवेंट्स}}:',
'revdelete-text'              => 'हटायें गयें अवतरण और घटनायें अभी भी पन्ने के इतिहास और लॉग सूचीमें नजर आयेंगे, पर इसके पाठ सामान्य सदस्य देख नहीं पायेंगे।

{{SITENAME}} अन्य प्रबंधक अभी भी इसे देख सकते हैं और पुनर्स्थापित भी कर सकतें हैं, जब तक इससे ज्यादा प्रतिबंध ना लगायें जायें।',
'revdelete-legend'            => 'दृश्य प्रतिबंध निश्चित करें',
'revdelete-hide-text'         => 'अवरतणका पाठ छुपायें',
'revdelete-hide-name'         => 'क्रिया और लक्ष्य को छुपायें',
'revdelete-hide-comment'      => 'संपादन टिप्पणी छुपायें',
'revdelete-hide-user'         => 'संपादक का सदस्यनाम/आईपी छुपायें',
'revdelete-hide-restricted'   => 'यह प्रबंधन प्रबंधक सहित सभी सदस्योंको लगायें और इस इंटरफेसको ताला लगायें',
'revdelete-suppress'          => 'प्रबंधक सहित सभी सदस्योंसे डाटा छुपायें',
'revdelete-hide-image'        => 'फ़ाईल का पाठ छुपायें',
'revdelete-unsuppress'        => 'पुनर्स्थापित अवतरणोंपरसे प्रबंधन हटायें',
'revdelete-log'               => 'लॉग टिप्पणी:',
'revdelete-submit'            => 'चुने हुए अवतरणोंको लागू करें',
'revdelete-logentry'          => '[[$1]] की अवतरण दृष्यता बदली गईं',
'logdelete-logentry'          => '[[$1]] की घटना दृष्यता बदली गईं',
'revdelete-success'           => "'''अवतरण दृष्यता सैट कर दी गईं हैं।'''",
'logdelete-success'           => "'''सूची दृष्यता बदली गईं।'''",
'revdel-restore'              => 'दृश्यता बदलें',
'pagehist'                    => 'पन्ने का इतिहास',
'deletedhist'                 => 'हटाया हुआ इतिहास',
'revdelete-content'           => 'कंटेंट',
'revdelete-summary'           => 'बदलाव ज़ानकारी',
'revdelete-uname'             => 'सदस्यनाम',
'revdelete-restricted'        => 'प्रबंधकोंको प्रतिबंधित किया',
'revdelete-unrestricted'      => 'प्रबंधकोंके प्रबंधन हटायें',
'revdelete-hid'               => 'छुपायें $1',
'revdelete-unhid'             => 'दर्शायें $1',
'revdelete-log-message'       => '$2 {{PLURAL:$2|अवतरण|अवतरणों}}के लिये $1',
'logdelete-log-message'       => '$2 {{PLURAL:$2|घटना|घटनाओं}}के लिये $1',

# Suppression log
'suppressionlog'     => 'सप्रेशन सूची',
'suppressionlogtext' => 'नीचे प्रबंधकोंसे छुपायें गयें ब्लॉक और हटाये गये पन्नों की सूची हैं। अभी अस्तित्वमें होने वाले ब्लॉक देखने के लिये [[Special:IPBlockList|आइपी ब्लॉक सूची]] देखें।',

# History merging
'mergehistory'                     => 'पन्ने के इतिहास एकत्रित करें',
'mergehistory-header'              => 'यह पन्ना एक स्रोत पन्ने का इतिहास किसी अन्य पन्ने में मिलाने के लिये सहायक हैं।
यह बदलाव पन्ने के इतिहास में कन्टिन्य़ुईटी रखें इस बात का गौर करें।',
'mergehistory-box'                 => 'दो पन्नोंका इतिहास एकत्रित करें:',
'mergehistory-from'                => 'स्रोत पन्ना:',
'mergehistory-into'                => 'लक्ष्य पन्ना:',
'mergehistory-list'                => 'एकत्रित करने लायक संपादन इतिहास',
'mergehistory-merge'               => '[[:$1]]के अगले अवतरण [[:$2]] में समाविष्ट कर सकतें हैं। किसी दिये हुए समय या उससे पहले हुए अवतरणोंको एकत्रित करने के लिये रेड़ियो बटन का इस्तेमाल करें।
नैविगेशन कड़ियोंके इस्तेमाल के बाद यह कालम अपने पुराने स्थिती पर आ जायेगा।',
'mergehistory-go'                  => 'एकत्रित करने लायक संपादन दिखायें',
'mergehistory-submit'              => 'अवतरण एकत्रित करें',
'mergehistory-empty'               => 'कोईभी अवतरण एकत्रित नहीं कर सकतें।',
'mergehistory-success'             => '[[:$1]] {{PLURAL:$3|का|के}} $3 अवतरण [[:$2]] में एकत्रित कर दिये गयें हैं।',
'mergehistory-fail'                => 'इतिहास एकत्रित नहीं कर सकतें, कृपया पन्ना और समय की पुन: जाँच करें।',
'mergehistory-no-source'           => 'स्रोत पन्ना $1 अस्तित्वमें नहीं हैं।',
'mergehistory-no-destination'      => 'लक्ष्य पन्ना $1 अस्तित्वमें नहीं हैं।',
'mergehistory-invalid-source'      => 'स्रोत पन्नेका शीर्षक वैध होना आवश्यक हैं।',
'mergehistory-invalid-destination' => 'लक्ष्य पन्नेका शीर्षक वैध होना आवश्यक हैं।',
'mergehistory-autocomment'         => '[[:$2]] में [[:$1]] एकत्रित कर दिया',
'mergehistory-comment'             => '[[:$2]] में [[:$1]] एकत्रित कर दिया: $3',

# Merge log
'mergelog'           => 'लॉग एकत्रित करें',
'pagemerge-logentry' => '[[$2]] में [[$1]] एकत्रित कर दियें ($3 तकके अवतरण)',
'revertmerge'        => 'अलग करें',
'mergelogpagetext'   => 'नीचे उन पन्नोंकी सूची हैं जिनका इतिहास हाल में ही दुसरे पन्ने में मिलाया गया था।',

# Diffs
'history-title'           => '"$1" का अवतरण इतिहास',
'difference'              => '(संसकरणों के बीच अंतर)',
'lineno'                  => 'लाईन $1:',
'compareselectedversions' => 'च़यन किये हुए अवतरणोंमें फर्क देखियें',
'editundo'                => 'पूर्ववत करें',
'diff-multi'              => '({{PLURAL:$1|बीच वाला एक अवतरण|बीचवाले $1 अवतरण}} दर्शाये नहीं हैं ।)',

# Search results
'searchresults'             => 'खोज निकाल',
'searchresulttext'          => '{{SITENAME}} में खोज में सहायता के लिए [[{{MediaWiki:Helppage}}|{{int:help}}]] देखें ।',
'searchsubtitle'            => "आपने '''[[:$1]]''' इस शब्दकी खोज की",
'searchsubtitleinvalid'     => "आपकी खोज '''$1''' के परिणाम",
'noexactmatch'              => "'''\"\$1\" नामसे कोई भी लेख नहीं हैं।''' आप यह लेख [[:\$1|तैयार कर सकते हैं]]।",
'noexactmatch-nocreate'     => "'''\"\$1\" नामसे कोई भी लेख नहीं हैं।'''",
'toomanymatches'            => 'बहुत ज्यादा जवाब मिलें हैं, कॄपया खोजशब्द बदलें',
'titlematches'              => 'लेख का शीर्षक मिलता हैं',
'notitlematches'            => 'कोईभी लेख का शीर्षक मिलता नहीं',
'textmatches'               => 'लेख का पाठ मिलता हैं',
'notextmatches'             => 'लेख का पाठ मिलता नहीं',
'prevn'                     => 'पिछले $1',
'nextn'                     => 'अगले $1',
'viewprevnext'              => 'देख़ें ($1) ($2) ($3)',
'search-result-size'        => '$1 ({{PLURAL:$2|1 शब्द|$2 शब्द}})',
'search-result-score'       => 'संबद्ध: $1%',
'search-redirect'           => '($1 को अनुप्रेषित)',
'search-section'            => '(विभाग $1)',
'search-suggest'            => 'क्या आप यहीं कहना चाहतें हैं: $1',
'search-interwiki-caption'  => 'अन्य प्रकल्प',
'search-interwiki-default'  => '$1 के रिज़ल्ट:',
'search-interwiki-more'     => '(और)',
'search-mwsuggest-enabled'  => 'सजेशन्स के साथ',
'search-mwsuggest-disabled' => 'सजेशन्स नहीं',
'search-relatedarticle'     => 'रिलेटेड',
'mwsuggest-disable'         => 'AJAX सजेशन्स बंद करें',
'searchrelated'             => 'रिलेटेड',
'searchall'                 => 'सभी',
'showingresults'            => "नीचे दर्शायें गयें #'''$2''' से {{PLURAL:$1|'''1''' निकाल|'''$1''' निकाल}} हैं।",
'showingresultsnum'         => "नीचे दर्शाये हुए #'''$2''' से {{PLURAL:$3|'''1''' निकाल|'''$3''' निकाल}} हैं।",
'showingresultstotal'       => "नीचे '''$3''' में से {{PLURAL:$3|'''$1''' निकाल|'''$1 - $2''' निकाल}} दर्शायें गयें हैं",
'nonefound'                 => "'''सूचना''': हमेशा कुछही नामस्थानोंमें खोजा जाता हैं। अगर आपको सभी नामस्थानोंमें खोजना हैं तो खोजशब्दोंके पहले ''all:'' लगाकर खोजने की कोशिश करें या फिर किसी नामस्थान का नाम लिखें।",
'powersearch'               => 'खोज',
'powersearch-legend'        => 'एडव्हन्स्ड खोज़',
'powersearch-ns'            => 'नामस्थानोंमें खोजें:',
'powersearch-redir'         => 'अनुप्रेषितोंकी सूची दर्शायें',
'powersearch-field'         => 'के लिये खोजें',
'search-external'           => 'बाहरी खोज',
'searchdisabled'            => '{{SITENAME}} पर खोज के लिये मनाई कर दी गईं हैं।
तब तक गूगलसे खोज करें।
{{SITENAME}} के उनके इंडेक्स पुराने हो सकतें हैं, इसका ध्यान रखें।',

# Preferences page
'preferences'              => 'मेरी पसंद',
'mypreferences'            => 'मेरी वरीयताएँ',
'prefs-edits'              => 'संपादनोंकी संख्या:',
'prefsnologin'             => 'लॉग इन नहीं किया हैं',
'prefsnologintext'         => 'सदस्य वरीयतायें बदलने के लियें आपने [[Special:UserLogin|लॉग इन]] किया होना जरूरी हैं।',
'prefsreset'               => 'पसंदे पूर्ववत कर दी गईं हैं।',
'qbsettings'               => 'शीघ्रपट',
'qbsettings-none'          => 'बिल्कुल नहीं',
'qbsettings-fixedleft'     => 'स्थिर बाई तरफ़',
'qbsettings-fixedright'    => 'स्थिर दाहिनी तरफ़',
'qbsettings-floatingleft'  => 'अस्थिर बाईं तरफ़',
'qbsettings-floatingright' => 'अस्थिर दाहिनी तरफ़',
'changepassword'           => 'कूटशब्द बदलें',
'skin'                     => 'त्वचा',
'math'                     => 'गणित',
'dateformat'               => 'दिनांक प्रारूप',
'datedefault'              => 'खा़स पसंद नहीं',
'datetime'                 => 'दिनांक तथा समय',
'math_failure'             => 'पार्स नहीं कर पायें',
'math_unknown_error'       => 'अपरिचीत समस्या',
'math_unknown_function'    => 'अज्ञात कार्य',
'math_lexing_error'        => 'लेक्सींग समस्या',
'math_syntax_error'        => 'सिन्टैक्स गलती',
'math_image_error'         => 'PNG में रुपांतरण अयशस्वी;
latex, dvips, gs, और convert के इन्स्टॉलेशन की जाँच करें',
'math_bad_tmpdir'          => 'मैथ अस्थायी डाइरेक्टरी या तो बना नहीं सकतें या फिर उसमें लिख नहीं सकतें',
'math_bad_output'          => 'मैथ आउटपुट डाइरेक्टरी या तो बना नहीं सकतें या फिर उसमें लिख नहीं सकतें',
'math_notexvc'             => 'texvc एक्झीक्यूटेबल फ़ाईल मिल नहीं रहीं;
समनुरूप बनाने के लियें math/README देखें।',
'prefs-personal'           => 'सदस्य व्यक्तिरेखा',
'prefs-rc'                 => 'हाल में हुए बदलाव',
'prefs-watchlist'          => 'ध्यानसूची',
'prefs-watchlist-days'     => 'ध्यानसूचीमें दिखाने के दिन:',
'prefs-watchlist-edits'    => 'बढ़ाई हुई ध्यानसूची में दिखाने के ज्यादा से ज्यादा बदलाव:',
'prefs-misc'               => 'अन्य',
'saveprefs'                => 'संजोयें',
'resetprefs'               => 'ना संजोये गये बदलाव रद्द करें',
'oldpassword'              => 'पुराना पासवर्ड',
'newpassword'              => 'नया कूटशब्द',
'retypenew'                => 'नया कूटशब्द पुन: लिखें',
'textboxsize'              => 'संपादन',
'rows'                     => 'कतारें:',
'columns'                  => 'कॉलम:',
'searchresultshead'        => 'खोज',
'resultsperpage'           => 'प्रति पन्ना हिट्स:',
'contextlines'             => 'प्रति हिट कतारें:',
'contextchars'             => 'प्रति कतार संदर्भ:',
'stub-threshold'           => '<a href="#" class="stub">आधार कड़ियों</a> का ज्यादासे ज्यादा आकार (बाईट्स):',
'recentchangesdays'        => 'हाल में हुए बदलावोंमें दर्शाने के दिन:',
'recentchangescount'       => 'हाल में हुए बदलावोंमें दिखाने के लिये बदलाव संख्या:',
'savedprefs'               => 'आपकी वरीयतायें संजोईं गईं हैं।',
'timezonelegend'           => 'टाईम ज़ोन',
'timezonetext'             => '¹सर्वर समयसे (यूटीसी) आपके स्थानीय समय का अंतर (घंटोंमें)।',
'localtime'                => 'स्थानीय समय',
'timezoneoffset'           => 'फर्क¹',
'servertime'               => 'सर्वरका समय',
'guesstimezone'            => 'ब्राउज़रसे भरें',
'allowemail'               => 'अन्य उपयोगकर्ताओं से ई-मेल समर्थ करें',
'prefs-searchoptions'      => 'खोज ऑप्शन्स',
'prefs-namespaces'         => 'नामस्थान',
'defaultns'                => 'इन नामस्थानोंमें हमेशा खोजें:',
'default'                  => 'अविचल',
'files'                    => 'फ़ाईलें',

# User rights
'userrights'                  => 'सदस्य अधिकार व्यवस्थापन', # Not used as normal message but as header for the special page itself
'userrights-lookup-user'      => 'सदस्य ग्रुपोंका व्यवस्थापन करें',
'userrights-user-editname'    => 'सदस्यनाम दें:',
'editusergroup'               => 'सदस्य ग्रुपका संपादन करें',
'editinguser'                 => "सदस्य '''[[User:$1|$1]]''' ([[User talk:$1|{{int:talkpagelinktext}}]] | [[Special:Contributions/$1|{{int:contribslink}}]])के सदस्य अधिकारोंमें बदलाव कियें जा रहें हैं।",
'userrights-editusergroup'    => 'सदस्य ग्रुपोंका संपादन करें',
'saveusergroups'              => 'सदस्य ग्रुप संजोयें',
'userrights-groupsmember'     => 'का सदस्य:',
'userrights-groups-help'      => 'आप इस सदस्य का ग्रुप सदस्यत्व बदल सकतें हैं:
* एक चुना हुआ बक्सा मतलब सदस्य उस ग्रुपमें हैं।
* एक ना चुना हुआ बक्सा मतलब सदस्य उस ग्रुपमें नहीं हैं।
* एक * का मतलब आप एकबार बढाने के बाद ग्रुप निकाल नहीं सकते या फिर निकालने के बाद बढा नहीं सकतें हैं।',
'userrights-reason'           => 'बदलाव के कारण:',
'userrights-no-interwiki'     => 'अन्य विकियोंपर आपको सदस्य अधिकार बदलने की अनुमति नहीं हैं।',
'userrights-nodatabase'       => 'डाटाबेस $1 या तो अस्तित्वमें नहीं हैं या फिर स्थानीय नहीं हैं।',
'userrights-nologin'          => 'सदस्य अधिकार बदलने के लिये आपने प्रबंधक खाते से [[Special:UserLogin|लॉग इन]] किया हुआ होना आवश्यक हैं।',
'userrights-notallowed'       => 'आपके सदस्य खातेको सदस्य अधिकार बदलनेकी अनुमति नहीं हैं।',
'userrights-changeable-col'   => 'ग्रुप जिन्हें आप बदल सकतें हैं',
'userrights-unchangeable-col' => 'ग्रुप जिन्हें आप नहीं बदल सकते हैं',

# Groups
'group'               => 'ग्रुप:',
'group-user'          => 'सदस्य',
'group-autoconfirmed' => 'पंजीकृत सदस्य',
'group-bot'           => 'बोट्स',
'group-sysop'         => 'प्रबंधक',
'group-bureaucrat'    => 'प्रशासक',
'group-suppress'      => 'ओवरसाईट्स',
'group-all'           => '(सभी)',

'group-user-member'          => 'सदस्य',
'group-autoconfirmed-member' => 'पंजीकृत सदस्य',
'group-bot-member'           => 'बोट्स',
'group-sysop-member'         => 'प्रबंधक',
'group-bureaucrat-member'    => 'प्रशासक',
'group-suppress-member'      => 'ओवरसाईट',

'grouppage-user'          => '{{ns:project}}:सदस्य',
'grouppage-autoconfirmed' => '{{ns:project}}:पंजीकृत सदस्य',
'grouppage-bot'           => '{{ns:project}}:बोट्स',
'grouppage-sysop'         => '{{ns:project}}:प्रबंधक',
'grouppage-bureaucrat'    => '{{ns:project}}:प्रशासक',
'grouppage-suppress'      => '{{ns:project}}:ओवरसाईट',

# Rights
'right-read'                 => 'पन्ने पढें',
'right-edit'                 => 'पन्नें बदलें',
'right-createpage'           => 'पन्ने बनायें',
'right-createtalk'           => 'वार्ता पन्ने तैयार करें',
'right-createaccount'        => 'नये सदस्य अकाउंट बनायें',
'right-minoredit'            => 'बदलाव छोटे नामसे संजोयें',
'right-move'                 => 'पन्नोंके नाम बदलें',
'right-move-subpages'        => 'पन्ने उपपृष्ठोंसे साथ स्थानांतरीत करें',
'right-suppressredirect'     => 'पन्ना नये नाम से बदलते समय अनुप्रेषित ना करें',
'right-upload'               => 'फ़ाईल अपलोड करें',
'right-reupload'             => 'अस्तित्वमें होनेवाले फ़ाईलपर पुनर्लेखन करें',
'right-reupload-own'         => 'उसी सदस्यने अपलोड की हुई फ़ाईल पर पुनर्लेखन करें',
'right-reupload-shared'      => 'शेअर्ड इमेज रिपोज़िटरी में होने वाले फ़ाईलोंपर पुनर्लेखन करें',
'right-upload_by_url'        => 'URL के साथ फ़ाईल अपलोड करें',
'right-purge'                => 'एक पन्ने की कैशे मेमरी खाली करें',
'right-autoconfirmed'        => 'पंजिकृत सदस्य जैसा बर्ताव करें',
'right-bot'                  => 'स्वयंचलित कार्यजैसा बर्ताव करें',
'right-nominornewtalk'       => 'वार्ता पृष्ठोंपर छोटे बदलाव जो कि नई वार्ता दर्शाते हैं, नहीं चाहियें',
'right-apihighlimits'        => 'API पृच्छाओं की उपरी मर्यादाका इस्तेमाल करें',
'right-writeapi'             => 'लिखित API का इस्तेमाल',
'right-delete'               => 'पन्ने हटायें',
'right-bigdelete'            => 'ज्यादा इतिहास होने वाले पन्ने हटायें',
'right-deleterevision'       => 'पन्नोंके विशिष्ट अवतरण छुपायें',
'right-deletedhistory'       => 'हटाई गई इतिहास सूची, उसके साथ पाये जाने वाले पाठ के बिना देखें',
'right-browsearchive'        => 'हटायें गये पन्ने देखें',
'right-undelete'             => 'एक पृष्ठ पुनर्स्थापित करें',
'right-suppressrevision'     => 'छुपायें हुए अवतरण देखें और पुनर्स्थापित करें',
'right-suppressionlog'       => 'खासगी सूचीयाँ देखें',
'right-block'                => 'अन्य सदस्योंको बदलाव करने से रोके',
'right-blockemail'           => 'सदस्यको इ-मेल भेजने से प्रतिबंधित करें',
'right-hideuser'             => 'एक सदस्यनाम लोगोंसे छुपायें',
'right-ipblock-exempt'       => 'आइपी ब्लॉक्स को नजर अंदाज करें',
'right-proxyunbannable'      => 'प्रोक्सी होनेपर ब्लॉक्स को नजर अंदाज करें',
'right-protect'              => 'सुरक्षा स्तर बदलें',
'right-editprotected'        => 'सुरक्षित पन्ने बदलें',
'right-editinterface'        => 'सदस्योंका इंटरफेस बदलें',
'right-editusercssjs'        => 'अन्य सदस्योंके CSS और JS फ़ाईल्समें बदलाव करें',
'right-rollback'             => 'विशिष्ट पन्ना जिसने बदला हो उसे जल्दी पूर्ववत करें',
'right-markbotedits'         => 'चुने हुए संपादनोंपर बोट मार्क करें',
'right-noratelimit'          => 'रेट लिमिट्सका असर नहीं होता',
'right-import'               => 'अन्य विकियोंसे पृष्ठ आयात करें',
'right-importupload'         => 'अपलोड किये फ़ाईल से पन्ने निकालें',
'right-patrol'               => 'बदलाव पेट्रोल्ड करके मार्क करें',
'right-autopatrol'           => 'सभी बदलाव पेट्रोल्ड करके मार्क करें',
'right-patrolmarks'          => 'हालमें हुए बदलावोंमें पैट्रोल मार्क देखें',
'right-unwatchedpages'       => 'ना देखे हुए पन्नोंकी सूची देखें',
'right-trackback'            => 'एक ट्रैकबैक भेजें',
'right-mergehistory'         => 'पन्नोंका इतिहास एकत्रित करें',
'right-userrights'           => 'सभी सदस्योंके अधिकार बदलें',
'right-userrights-interwiki' => 'अन्य विकियोंपर सदस्य अधिकार बदलें',
'right-siteadmin'            => 'डाटाबेस को ताला लगायें या खोलें',

# User rights log
'rightslog'      => 'सदस्य अधिकार सूची',
'rightslogtext'  => 'यह सदस्य अधिकारोंमें हुए बदलावोंकी सूची हैं।',
'rightslogentry' => '$1 का ग्रुप सदस्यत्व $2 से $3 को बदला',
'rightsnone'     => '(बिल्कुल नहीं)',

# Recent changes
'nchanges'                          => '$1 {{PLURAL:$1|बदलाव|बदलाव}}',
'recentchanges'                     => 'हाल में हुए बदलाव',
'recentchangestext'                 => 'इस विकिपर हाल में हुए बदलाव इस पन्ने पर देखें जा सकतें हैं।',
'recentchanges-feed-description'    => 'इस फ़ीडमें होनेवाले विकिपर हाल में हुए बदलाव देखियें ।',
'rcnote'                            => "नीचे $3 तक पिछले {{PLURAL:$2|'''१''' दिनमें हुआ|'''$2''' दिनोंमें हुए}} आखिरी $1 बदलाव {{PLURAL:$1|दिया है|दिये हैं}}।",
'rcnotefrom'                        => "नीचे '''$2''' से हुए ('''$1''' या कम) बदलाव दर्शाये गये है ।",
'rclistfrom'                        => '$1 से नये बदलाव दिखाएँ',
'rcshowhideminor'                   => 'छोटे बदलाव $1',
'rcshowhidebots'                    => 'बोटों $1',
'rcshowhideliu'                     => 'लॉग्ड इन सदस्यों के बदलाव $1',
'rcshowhideanons'                   => 'अनामक सदस्यों के बदलाव $1',
'rcshowhidepatr'                    => '$1 पहारा दी हुई एडिट्स',
'rcshowhidemine'                    => 'मेरे बदलाव $1',
'rclinks'                           => 'पिछले $2 दिनोंमें हुए $1 बदलाव देखियें.<br />$3',
'diff'                              => 'फर्क',
'hist'                              => 'इतिहास',
'hide'                              => 'छुपायें',
'show'                              => 'दिखायें',
'minoreditletter'                   => 'छो',
'newpageletter'                     => 'न',
'boteditletter'                     => 'बो',
'number_of_watching_users_pageview' => '[$1 देखनेवाले {{PLURAL:$1|सदस्य|सदस्य}}]',
'rc_categories'                     => 'श्रेणीयों तक सीमीत रखें ("|" से अलग करें)',
'rc_categories_any'                 => 'कोईभी',
'newsectionsummary'                 => '/* $1 */ नया विभाग',

# Recent changes linked
'recentchangeslinked'          => 'पन्ने से जुडे बदलाव',
'recentchangeslinked-title'    => '"$1" में हुए बदलाव',
'recentchangeslinked-noresult' => 'जुडे हुए पन्नोंमें दिये हुए अवसरमें कोई भी बदलाव नहीं हुए हैं ।',
'recentchangeslinked-summary'  => "यह पृष्ठ एक विशेष पृष्ठ से जुड़े हुए पन्नोंके (या एक विशिष्ट श्रेणीमें होनेवाले पन्नोंके) बदलाव दर्शाता हैं। 
आपकी ध्यानसूची में रखे पन्ने '''बोल्ड''' दिखेंगे।",
'recentchangeslinked-page'     => 'पृष्ठ नाम:',
'recentchangeslinked-to'       => 'इसके बदले में दिये हुए पन्नेसे जुडे पन्नोंके बदलाव दर्शायें',

# Upload
'upload'                      => 'फ़ाइल अपलोड करें',
'uploadbtn'                   => 'फ़ाइल अपलोड करें',
'reupload'                    => 'पुन: अपलोड करें',
'reuploaddesc'                => 'अपलोड रद्द करें और पुन: अपलोड पन्ने पर जायें',
'uploadnologin'               => 'आप लॉगड इन नहीं हैं ।',
'uploadnologintext'           => 'फ़ाईलें अपलोड करने के लिये [[Special:UserLogin|लॉग इन]] किया होना ज़रूरी हैं।',
'upload_directory_read_only'  => 'अपलोड डाइरेक्टरी ($1) में सर्वर लिख नहीं पा रहा हैं।',
'uploaderror'                 => 'अपलोड एरर',
'uploadtext'                  => "नईं फ़ाईलें अपलोड करने के लिये इस पन्ने का इस्तेमाल करें।
इसके पहले [[Special:ImageList|अपलोड की गईं फ़ाईलों की सूची]] देखें। अपलोड की हुईं और हटाईं हुई फ़ाइलों के लिये [[Special:Log/upload|सूची]] देखें।

अपने लेखोंमें यह फ़ाईल इस्तेमाल के लिये नीचे दिये गये उदाहरणोंके अनुसार कड़ियां बनाईयें।
'''<nowiki>[[</nowiki>{{ns:image}}<nowiki>:File.jpg]]</nowiki>''',
'''<nowiki>[[</nowiki>{{ns:image}}<nowiki>:File.png|alt text]]</nowiki>''' या फिर
'''<nowiki>[[</nowiki>{{ns:media}}<nowiki>:File.ogg]]</nowiki>''' डाइरेक्ट कड़ि बनाने के लिये।",
'upload-permitted'            => 'अनुमतित फ़ाईल प्रकार: $1।',
'upload-preferred'            => 'पसंदीदा फ़ाईल प्रकार: $1।',
'upload-prohibited'           => 'प्रतिबंधिक फ़ाईल प्रकार: $1।',
'uploadlog'                   => 'अपलोड सूची',
'uploadlogpage'               => 'अपलोड सूची',
'uploadlogpagetext'           => 'नीचे हाल में अपलोड कियें हुए फ़ाइलोंकी सूची हैं।',
'filename'                    => 'फ़ाईल का नाम',
'filedesc'                    => 'वर्णन',
'fileuploadsummary'           => 'संक्षिप्त ज़ानकारी:',
'filestatus'                  => 'कॉपीराईट की स्थिती:',
'filesource'                  => 'स्रोत:',
'uploadedfiles'               => 'अपलोड की हुईं फ़ाईलें',
'ignorewarning'               => 'सुचनाओं को नजर‍अंदाज करें और फ़ाईल अपलोड करें',
'ignorewarnings'              => 'सभी सूचनाओंको नजर अंदाज करें',
'minlength1'                  => 'फ़ाईल का नाम कम से कम एक अक्षरका होना चाहियें।',
'illegalfilename'             => 'फ़ाईलके नाम "$1" में शीर्षक में प्रतिबंधित अक्षर हैं।
कृपया फ़ाइल का नाम बदलके पुन: यत्न करें।',
'badfilename'                 => 'फाइल का नाम "$1" कर दिया गया है।',
'filetype-badmime'            => '"$1" प्रकार की फ़ाईलें अपलोड करने के लिये अनुमति नहीं हैं।',
'filetype-unwanted-type'      => "'''\".\$1\"''' यह गलत फ़ाईल हैं। \$2 यह चाहियें।",
'filetype-banned-type'        => "'''\".\$1\"''' प्रकार की फ़ाईलें अपलोड करने के लिये अनुमति नहीं हैं। \$2 प्रकार की फ़ाईलें अपलोड करने की अनुमति हैं।",
'filetype-missing'            => 'इस फ़ाईल को एक्स्टेंशन नहीं हैं (उदा ".jpg")।',
'large-file'                  => 'फ़ाईलें $1 से कम आकार की होना आवश्यक हैं;
यह फ़ाईल $2 आकार की हैं।',
'largefileserver'             => 'इस फ़ाईल का आकार निर्धारित आकार से ज्यादा हैं।',
'emptyfile'                   => 'आपके द्वारा अपलोड की गई फ़ाईल रिक्त हैं। यह फ़ाईल का नाम लिखने में गलती के चलते हो सकता हैं। कॄपया आप यहीं फ़ाईल अपलोड करना चाहतें हैं इसकी जाँच करें।',
'fileexists'                  => 'इस नामकी फ़ाईल पहले से अस्तित्वमें हैं, कृपया यह फ़ाईल बदलनेमें आप साशंक हैं तो <strong><tt>$1</tt></strong> देखें।',
'filepageexists'              => '<strong><tt>$1</tt></strong> यह नामसे एक सहायतापृष्ठ पहलेसे अस्तित्व में हैं, पर इस नामसे कोई फ़ाईल नहीं हैं।
आपके द्वारा दी गई संक्षिप्त ज़ानकारी इस सहायतापृष्ठ पर नहीं दिखाई जायेगी।
संक्षिप्त ज़ानकारी वहां दिखाने के लिये आपको इसे स्वयं संपादित करना पडेगा।',
'fileexists-extension'        => 'इस नाम से मिलतेजुलते नाम की एक फ़ाईल पहलेंसे हैं:<br />
अपलोड हो रहे फ़ाईल का नाम: <strong><tt>$1</tt></strong><br />
अस्तित्वमें होने वालें फ़ाईल का नाम: <strong><tt>$2</tt></strong><br />
कृपया अन्य नाम चुनें।',
'fileexists-thumb'            => "<center>'''उपलब्ध फ़ाईल'''</center>",
'fileexists-thumbnail-yes'    => 'यह फ़ाईल बडे चित्रका छोटा आकार <i>(thumbnail)</i> प्रतीत होता हैं।
<strong><tt>$1</tt></strong> यह फ़ाईल देखें।<br />
अगर जाँची गई फ़ाईल इसी आकारकी हैं तो नईं फ़ाईल अपलोड करना जरूरी नहीं हैं।',
'file-thumbnail-no'           => 'इस फ़ाइल का नाम <strong><tt>$1</tt></strong> से शुरू हो रहा हैं।
हो सकता हैं यह शायद <i>(thumbnail)</i> हों।
अगर आपके पास पूरे रिज़ोल्यूशन की फ़ाईल हैं तो उसे अपलोड करें या फिर इस फ़ाईल का नाम बदलें।',
'fileexists-forbidden'        => 'इस नाम से एक फ़ाईल पहलेसे अस्तित्वमें हैं;
कॄपया पीछे जाकर इस फ़ाईल को नये नाम से अपलोड करें। [[Image:$1|thumb|center|$1]]',
'fileexists-shared-forbidden' => 'शेअर्ड फ़ाईल रिपोज़िटरीमें इस नाम से एक फ़ाईल हैं;
कृपया पीछे जाकर इसे नये नाम से अपलोड करें। [[Image:$1|thumb|center|$1]]',
'file-exists-duplicate'       => 'यह फ़ाईल निम्नलिखित {{PLURAL:$1|फ़ाइल की|फ़ाइलोंकी}} कापी हैं:',
'successfulupload'            => 'अपलोड हो गईं',
'uploadwarning'               => 'अपलोड वार्निंग',
'savefile'                    => 'फ़ाईल संजोयें',
'uploadedimage'               => '"[[$1]]" को चढाया गया हैं',
'overwroteimage'              => '"[[$1]]" का नया अवतरण अपलोड किया',
'uploaddisabled'              => 'अपलोड प्रतिबंधित हैं',
'uploaddisabledtext'          => '{{SITENAME}} पर अपलोड प्रतिबंधित हैं।',
'uploadscripted'              => 'इस फ़ाईलमें HTML या फिर स्क्रीप्ट कोड हैं, जो की एखाद वेब ब्राउज़र द्वारा गलती से पढ़ लिया जा सकता हैं।',
'uploadcorrupt'               => 'यह फ़ाईल खराब हैं या फिर इसका एक्स्टेंशन गलत हैं।
कृपया फ़ाईल जाँच कर फिरसे अपलोड करें।',
'uploadvirus'                 => 'इस फ़ाईल में व्हाईरस हैं! अधिक ज़ानकारी: $1',
'sourcefilename'              => 'स्रोत फ़ाईलका नाम:',
'destfilename'                => 'लक्ष्य फ़ाईल नाम:',
'upload-maxfilesize'          => 'ज्यादासे ज्यादा फ़ाइलका आकार: $1',
'watchthisupload'             => 'इस पन्ने पर ध्यान रखें',
'filewasdeleted'              => 'इस नामकी एक फ़ाईल अपलोड करनेके बाद हटाईं गईं हैं।
फिरसे अपलोड करने से पहले आप $1 को अच्छी तरह से जाँचे।',
'upload-wasdeleted'           => "'''सूचना: आप पहले हटाई गई फ़ाईल फिर से अपलोड कर रहें हैं।'''

आपको यह क्रिया वैध हैं इसके बारें में सोचना चाहियें।
इस फ़ाईल की हटाने की सूची आपके सहायता के लिये यहां दी गई हैं:",
'filename-bad-prefix'         => 'आप अपलोड कर रहे फ़ाईल का नाम <strong>"$1"</strong> से शुरू होता हैं, जो की डिजिटल कैमेरे द्वारा दिया गया नाम हैं।
कृपया इस फ़ाईलके लिये कोई दूसरा ज्यादा ज़ानकारीयुक्त नाम चुनें।',
'filename-prefix-blacklist'   => '#<!-- leave this line exactly as it is --> <pre>
# रूपरेखा इस प्रकार हैं:
#   *  "#" अक्षर से शुरु होने वाली लाइनें टिप्पणीयाँ हैं।
#   *हर नई लाईन कैमेरा उत्पादक द्वारा लगाये जाने वाले उपपदोंकी सूची हैं।
CIMG # Casio
DSC_ # Nikon
DSCF # Fuji
DSCN # Nikon
DUW # some mobil phones
IMG # generic
JD # Jenoptik
MGP # Pentax
PICT # misc.
 #</pre> <!-- leave this line exactly as it is -->',

'upload-proto-error'      => 'गलत प्रोटोकोल',
'upload-proto-error-text' => 'रिमोट अपलोड के लिये URL का नाम <code>http://</code> या <code>ftp://</code> से शुरु होना आवश्यक हैं।',
'upload-file-error'       => 'आंतर्गत गलती',
'upload-file-error-text'  => 'सर्वरपर अस्थायी फ़ाईल बनाने में समस्या आई हैं।
कृपया प्रबंधकोंसे संपर्क करें।',
'upload-misc-error'       => 'अज्ञात अपलोड समस्या',
'upload-misc-error-text'  => 'अपलोड करने में समस्या आई हैं।
कृपया देखें की URL वैध हैं और पुन: यत्न करें।
अगर समस्या का समाधान न हुआ, तो प्रबंधकोंसे संपर्क करें।',

# Some likely curl errors. More could be added from <http://curl.haxx.se/libcurl/c/libcurl-errors.html>
'upload-curl-error6'       => 'URL तक पहूंच नहीं पायें',
'upload-curl-error6-text'  => 'दिये हुए URL पर पहूंच नहीं पा रहें हैं।
कृपया URL जाँचे और देखें की साईट पर कोई समस्या नहीं हैं।',
'upload-curl-error28'      => 'अपलोड टाइम‍आउट',
'upload-curl-error28-text' => 'साईटसे संदेश आने में बहुत ज्यादा समय व्यतीत हो रहा हैं।
कॄपया साईटमें समस्या नहीं हैं इसकी जाँच करें, या फिर थोडी देर रूककर पुन: यत्न करें।
आप शायद कम भीडवाले समयमें कोशीश करना चाहेंगे।',

'license'            => 'लाइसेन्सिंग:',
'nolicense'          => 'कुछ भी चुना नहीं',
'license-nopreview'  => '(झलक उपलब्ध नहीं हैं)',
'upload_source_url'  => ' (एक वैध, सभी जगहोंसे उपलब्ध URL)',
'upload_source_file' => ' (आपके कम्प्यूटरपर होनेवाली फ़ाईल)',

# Special:ImageList
'imagelist-summary'     => 'यह विशेष पृष्ठ सभी अपलोड की हुई फ़ाईलें दर्शाता हैं।
सामान्यत: सबसे बादमें अपलोड हुई फ़ाईलें सबसे उपर दिखती हैं।
कालम कें शीर्षकमें क्लिक करने से अनुक्रम बदला जा सकता हैं।',
'imagelist_search_for'  => 'इस मीडिया नाम से खोजें:',
'imgfile'               => 'फ़ाईल',
'imagelist'             => 'चित्र सूची',
'imagelist_date'        => 'दिनांक',
'imagelist_name'        => 'नाम',
'imagelist_user'        => 'सदस्य',
'imagelist_size'        => 'आकार',
'imagelist_description' => 'ज़ानकारी',

# Image description page
'filehist'                       => 'फ़ाईलका इतिहास',
'filehist-help'                  => 'फ़ाईलका पुराना अवतरण देखनेके लिये दिनांक/समय पर क्लीक करें।',
'filehist-deleteall'             => 'सभी हटायें',
'filehist-deleteone'             => 'हटायें',
'filehist-revert'                => 'पूर्ववत करें',
'filehist-current'               => 'सद्य',
'filehist-datetime'              => 'दिनांक/समय',
'filehist-user'                  => 'सदस्य',
'filehist-dimensions'            => 'डायमेन्शन्स',
'filehist-filesize'              => 'फ़ाईलका आकार (बाईट्स)',
'filehist-comment'               => 'प्रतिक्रीया',
'imagelinks'                     => 'कड़ियाँ',
'linkstoimage'                   => 'निम्नलिखित पन्ने इस चित्र से जुडते हैं :',
'nolinkstoimage'                 => 'इस चित्र से कोई पन्ने नहीं जुडते',
'morelinkstoimage'               => 'इस फ़ाईलकी [[Special:WhatLinksHere/$1|और कडी़याँ]] देखें।',
'redirectstofile'                => 'नीचे दी हुई फ़ाइलें इस फ़ाईलको अनुप्रेषितें हैं:',
'duplicatesoffile'               => 'निम्नलिखित फ़ाइलें इस फ़ाइलकी कापीयाँ हैं:',
'sharedupload'                   => 'यह फ़ाईल दुसरेभी प्रोजेक्ट्समें इस्तेमाल की हुई होनेकी आशंका है ।',
'shareduploadwiki'               => 'अधिक ज़ानकारी के लिये $1 देखें।',
'shareduploadwiki-desc'          => 'ज़ानकारी जो $1 पर शेअर्ड रिपोजिटरीमें हैं नीचे दी हुई हैं।',
'shareduploadwiki-linktext'      => 'फ़ाईल ज़ानकारी पन्ना',
'shareduploadduplicate'          => 'यह फ़ाईल शेअर्ड रिपॉझिटरी में उपलब्ध $1 की कापी हैं',
'shareduploadduplicate-linktext' => 'अन्य फ़ाईल',
'shareduploadconflict'           => 'इस फ़ाईल का नाम शेअर्ड रिपॉझिटरी में उपलब्ध $1 से मिलता हैं।',
'shareduploadconflict-linktext'  => 'अन्य फ़ाईल',
'noimage'                        => 'इस नामसे कोई भी फ़ाईल नहीं है, आप $1 कर सकते हैं ।',
'noimage-linktext'               => 'चढाईयें',
'uploadnewversion-linktext'      => 'इस फ़ाईलका नया अवतरण अपलोड करें',
'imagepage-searchdupe'           => 'डुप्लिकेट फ़ाईलें खोजें',

# File reversion
'filerevert'                => '$1 पूर्ववत करें',
'filerevert-legend'         => 'फ़ाईल पूर्ववत करें',
'filerevert-intro'          => "आप '''[[Media:$1|$1]]''' के [$3, $2 तक के अवतरण, $4 की तरफ] वापिस भेज रहें हैं।",
'filerevert-comment'        => 'टिप्पणी:',
'filerevert-defaultcomment' => '$2, $1 के अवतरण पूर्ववत कियें',
'filerevert-submit'         => 'पूर्ववत करें',
'filerevert-success'        => "'''[[Media:$1|$1]]''' के [$3, $2 तक के अवतरण, $4 की तरफ] वापिस भेज दिये गयें हैं।",
'filerevert-badversion'     => 'दिये हुए समयसे मेल खाने वाला, इस फ़ाईलका पुराना अवतरण नहीं हैं।',

# File deletion
'filedelete'                  => '$1 हटायें',
'filedelete-legend'           => 'फ़ाइल हटायें',
'filedelete-intro'            => "आप '''[[Media:$1|$1]]''' हटा रहें हैं।",
'filedelete-intro-old'        => "आप '''[[Media:$1|$1]]''' के [$4 $3, $2 के अवतरण] हटा रहें हैं।",
'filedelete-comment'          => 'हटाने का कारण:',
'filedelete-submit'           => 'हटायें',
'filedelete-success'          => "'''$1''' को हटा दिया गया हैं।",
'filedelete-success-old'      => '<span class="plainlinks">\'\'\'[[Media:$1|$1]]\'\'\' के [$3, $2 के अवतरण] हटा दिये गयें हैं।</span>',
'filedelete-nofile'           => "'''$1''' {{SITENAME}} पर अस्तित्वमें नहीं हैं।",
'filedelete-nofile-old'       => "दिये हुए विशेशता से मेल खाने वालें '''$1''' के अवतरण नहीं हैं।",
'filedelete-iscurrent'        => 'आप इस फ़ाईलका सबसे नया अवतरण हटा रहें हैं।
कृपया इसके पहले इसके पुराने अवतरणको पुनर्स्थापित करें।',
'filedelete-otherreason'      => 'अन्य/दूसरा कारण:',
'filedelete-reason-otherlist' => 'अन्य कारण',
'filedelete-reason-dropdown'  => '*हटाने के साधारण कारण
** कॉपीराईट
** डुप्लिकेट फ़ाईल',
'filedelete-edit-reasonlist'  => 'हटाने के कारण बदलें',

# MIME search
'mimesearch'         => 'MIME खोज',
'mimesearch-summary' => 'MIME-प्रकारों के अनुसार फ़ाइलें खोजनेके लिये इस पन्ने का इस्तेमाल किया जा सकता हैं।
इनपुट: फ़ाईल का प्रकार/उपप्रकार, उदा. <tt>image/jpeg</tt>.',
'mimetype'           => 'MIME प्रकार:',
'download'           => 'डाउनलोड',

# Unwatched pages
'unwatchedpages' => 'ध्यान न दिये हुए पन्ने',

# List redirects
'listredirects' => 'अनुप्रेषित सूची',

# Unused templates
'unusedtemplates'     => 'इस्तेमाल न हुए टेम्प्लेट्स',
'unusedtemplatestext' => 'इस पन्नेपर टेम्प्लेट नामस्थानमेंसे वह सभी पन्ने दर्शायें गयें हैं जो अन्य पन्नोंमें मिलाये नहीं हैं।
टेम्प्लेट हटाने से पहले टेम्प्लेट से जुडने वाली सभी कड़ियाँ जाँचना न भूलें।',
'unusedtemplateswlh'  => 'अन्य कड़ियाँ',

# Random page
'randompage'         => 'किसी एक लेख पर जाएं',
'randompage-nopages' => 'इस नामस्थान में पन्ने नहीं हैं।',

# Random redirect
'randomredirect'         => 'किसी एक पुनर्निर्देशन पर जायें',
'randomredirect-nopages' => 'इस नामस्थानमें अनुप्रेषितें नहीं हैं।',

# Statistics
'statistics'             => 'आंकड़े',
'sitestats'              => 'विकिपीडिया आंकड़े',
'userstats'              => 'सदस्य आंकड़े',
'sitestatstext'          => "डेटाबेस में {{PLURAL:\$1|'''१''' पृष्ठ है|'''\$1''' कुल पृष्ठ हैं}}।
जिसमें \"संवाद\" पृष्ठ, {{SITENAME}} के बारे में पृष्ठ, अल्पतम \"ठूंठ\" पृष्ठ, अनुप्रेषित पृष्ठ, और अन्य पृष्ठ शामिल है, जो संभवत: विषय सूची पृष्ठों में शामिल होने योग्य नहीं है।
इनको छोड़कर, {{PLURAL:\$2|'''१'''  पृष्ठ है|'''\$2''' पृष्ठ हैं}}, जो कि तर्कसंगत विषयसूची पृष्ठ {{PLURAL:\$2|है|हैं}}।

'''\$8''' फाइल अपलोड की जा चुकी {{PLURAL:\$8|है|हैं}}।

जब से {{SITENAME}} का निर्माण हुआ है, कुल मिलाकर, {{PLURAL:\$3|पृष्ठ|पृष्ठों}} को '''\$3''' बार देखा जा चुका है, और '''\$4''' बार पृष्ठ संपादित {{PLURAL:\$4|किया जा चुका है|किये जा चुके हैं}}।
इससे पता चलता है कि, औसतन प्रति पृष्ठ '''\$5''' संपादन होते हैं, एवं प्रति संपादन इन्हें '''\$6''' बार देखा जाता है।

[http://www.mediawiki.org/wiki/Manual:Job_queue कार्य पंक्ति] की लम्बाई '''\$7''' है।",
'userstatstext'          => "इस विकिपीडिया में  {{PLURAL:$1|'''1''' रजिस्टर्ड [[Special:ListUsers|सदस्य]]|'''$1''' रजिस्टर्ड  [[Special:ListUsers|सदस्य]]}} हैं, जिसमें से  '''$2''' (या '''$4%''') {{PLURAL:$2|सदस्यको|सदस्योंको}} $5 अधिकार हैं।",
'statistics-mostpopular' => 'सबसे ज्यादा देखें जाने वाले पन्ने',

'disambiguations'      => 'डिसऍम्बिग्वीशन पन्ने',
'disambiguationspage'  => 'Template:disambig',
'disambiguations-text' => "निम्नांकित पृष्ठ '''असमंजश पृष्ठ''' से जुड़े हुए हैं।
वरन, ये पृष्ठ उपयुक्त विषय से जुड़े हुए होने चाहिए।<br />
यदि कोई पृष्ठ ऐसे सांचे का प्रयोग करता है, जो की [[MediaWiki:Disambiguationspage]] से जुड़ा हुआ है, तो उसे असमंजश पृष्ठ समझा जाता है।",

'doubleredirects'     => 'दुगुनी-अनुप्रेषिते',
'doubleredirectstext' => 'यह पृष्ठ उन पृष्ठों की सूची है, जो की अन्य अनुप्रेषित पृष्ठों पर अनुप्रेषित होते हैं। प्रत्येक पंक्ति प्रथम एवं द्वितीय अनुप्रेषक के साथ, द्वितीय अनुप्रेषक के लक्ष्य से सम्पर्कित है, जो कि प्राय: "वास्तविक" लक्ष्य पृष्ठ होता है, और प्रथम अनुप्रेषक भी उसी को लक्षित करना चाहिए।',

'brokenredirects'        => 'टूटे हुए अनुप्रेष',
'brokenredirectstext'    => 'नीचे दी गई अनुप्रेषिते अस्तित्व में न होने वाले पन्ने दर्शाती हैं:',
'brokenredirects-edit'   => '(संपादित करें)',
'brokenredirects-delete' => '(हटायें)',

'withoutinterwiki'         => 'आंतरविकि कड़ियाँ न होनेवाले लेख',
'withoutinterwiki-summary' => 'नीचे दिये गये पन्नोंमें अन्य भाषाओंके अवतरणोंसे जुडने वाली कड़ियाँ नहीं हैं:',
'withoutinterwiki-legend'  => 'उपपद',
'withoutinterwiki-submit'  => 'दिखायें',

'fewestrevisions' => 'सबसे कम अवतरण होने वाले लेख',

# Miscellaneous special pages
'nbytes'                  => '{{PLURAL:$1|एक बैट|$1 बैट}}',
'ncategories'             => '{{PLURAL:$1|एक श्रेणि|$1 श्रेणियाँ}}',
'nlinks'                  => '$1 {{PLURAL:$1|कडि|कडियाँ}}',
'nmembers'                => '{{PLURAL:$1|एक सदस्य|$1 सदस्य}}',
'nrevisions'              => '$1 {{PLURAL:$1|रूपान्तर|रूपान्तरें}}',
'nviews'                  => '{{PLURAL:$1|एक|$1}} बार देखा गया है',
'specialpage-empty'       => 'इस रिपोर्ट के लिये कोई निकाल नहीं हैं।',
'lonelypages'             => 'अकेले पन्ने',
'lonelypagestext'         => 'नीचे दिये पन्नों को {{SITENAME}} पर उपलब्ध अन्य पन्ने जुडते नहीं हैं।',
'uncategorizedpages'      => 'अश्रेणीकृत पन्ने',
'uncategorizedcategories' => 'अश्रेणीकृत श्रेणियाँ',
'uncategorizedimages'     => 'अश्रेणीकृत फ़ाईल्स',
'uncategorizedtemplates'  => 'अश्रेणीकृत टेम्प्लेट्स',
'unusedcategories'        => 'इस्तेमाल न हुई श्रेणियाँ',
'unusedimages'            => 'अप्रयुक्त चित्र',
'popularpages'            => 'लोकप्रिय पन्ने',
'wantedcategories'        => 'श्रेणियाँ जो चाहिये',
'wantedpages'             => 'जो पन्ने चाहिये',
'missingfiles'            => 'गायब हुई फ़ाइलें',
'mostlinked'              => 'सबसे ज्यादा जुडे हुए पन्ने',
'mostlinkedcategories'    => 'सबसे ज्यादा जुडी हुई श्रेणियाँ',
'mostlinkedtemplates'     => 'सबसे ज्यादा जुडी हुई टेम्प्लेट्स',
'mostcategories'          => 'सबसे ज्यादा श्रेणियाँ होनेवाले पन्ने',
'mostimages'              => 'सबसे ज्यादा जुडी हुई फ़ाईल्स',
'mostrevisions'           => 'सबसे ज्यादा अवतरण हुए लेख',
'prefixindex'             => 'उपपद सूची',
'shortpages'              => 'छोटे पन्ने',
'longpages'               => 'लम्बे पन्ने',
'deadendpages'            => 'डेड-एंड पन्ने',
'deadendpagestext'        => 'नीचे दिये पन्नों को {{SITENAME}} पर उपलब्ध अन्य पन्ने जुडते नहीं हैं।',
'protectedpages'          => 'सुरक्षित पन्ने',
'protectedpages-indef'    => 'सिर्फ इन्डेफिनाइट प्रोटेक्शन्स',
'protectedpagestext'      => 'नीचे दिये हुए पन्ने नाम बदलने या संपादित करने से सुरक्षित हैं',
'protectedpagesempty'     => 'इन नियमोंद्वारा सुरक्षित किये हुए पन्ने नहीं हैं।',
'protectedtitles'         => 'सुरक्षित शीर्षक',
'protectedtitlestext'     => 'निम्नलिखित शीर्षकोंके लेख बनाने के लिये प्रतिबंध हैं।',
'protectedtitlesempty'    => 'इन नियमोंद्वारा कोई भी शीर्षक सुरक्षित नहीं हैं।',
'listusers'               => 'सदस्यसूची',
'newpages'                => 'नये पन्ने',
'newpages-username'       => 'सदस्यनाम:',
'ancientpages'            => 'सबसे पुराने लेख',
'move'                    => 'नाम बदलें',
'movethispage'            => 'पन्ने का नाम बदलें',
'unusedimagestext'        => 'कृपया ध्यान दें की अन्य वेब साइट इस फ़ाईल को डाइरेक्ट कड़ीयाँ दे सकतीं हैं, इसलिये इस्तेमाल होने के बावजूदभी इस सूची में दिख सकती हैं।',
'unusedcategoriestext'    => 'निम्नलिखित श्रेणी पन्ने अस्तित्वमें हैं जबकि कोईभी लेख या अन्य श्रेणियाँ इनका इस्तेमाल नहीं करते हैं।',
'notargettitle'           => 'लक्ष्य नहीं',
'notargettext'            => 'इस क्रिया को करने के लिये आपने लक्ष्य पॄष्ठ या सदस्य बताया नहीं हैं।',
'nopagetitle'             => 'ऐसा लक्ष्य पान नहीं',
'nopagetext'              => 'आपने दिया हुआ लक्ष्य पान अस्तित्वमें नहीं हैं।',
'pager-newer-n'           => '{{PLURAL:$1|नया 1|नये $1}}',
'pager-older-n'           => '{{PLURAL:$1|पुराना 1|पुराने $1}}',
'suppress'                => 'ओवरसाईट',

# Book sources
'booksources'               => 'पुस्तक के स्रोत',
'booksources-search-legend' => 'बुक स्रोत खोजें',
'booksources-isbn'          => 'आइएसबीएन:',
'booksources-go'            => 'जायें',
'booksources-text'          => 'नीचे पुराने और नये किताब बेचनेवाले वेबसाईटके एड्रेस हैं, जिसमें आपको आपद्वारा खोजे जाने वाले किताबके बारें में अधिक ज़ानकारी मिल सकती हैं:',

# Special:Log
'specialloguserlabel'  => 'सदस्य:',
'speciallogtitlelabel' => 'शीर्षक:',
'log'                  => 'प्रचालेख सूची',
'all-logs-page'        => 'सभी सूचियाँ',
'log-search-legend'    => 'सूची के लिये खोज',
'log-search-submit'    => 'जायें',
'alllogstext'          => 'विकिपीडिया के सभी प्राप्य सत्रों का संयुक्त प्रदर्शन।
आप सत्र के प्रकार,उपयोगकर्ता नाम,या प्रभावित पृष्ठ का चयन कर के दृश्य को संकीर्णित कर सकते हैं।',
'logempty'             => 'सूची में ऐसा आइटम नहीं हैं।',
'log-title-wildcard'   => 'इस पाठ से शुरू होनेवाले शीर्षक खोजें',

# Special:AllPages
'allpages'          => 'सभी पन्ने',
'alphaindexline'    => '$1 से $2',
'nextpage'          => 'अगला पन्ना ($1)',
'prevpage'          => 'पिछला पन्ना ($1)',
'allpagesfrom'      => 'दिये हुए अक्षर से आरंभ होनेवाले लेख दर्शायें:',
'allarticles'       => 'सभी लेख',
'allinnamespace'    => 'सभी पन्ने ($1 नामस्थान)',
'allnotinnamespace' => 'सभी पन्ने ($1 नामस्थानमें ना होनेवाले)',
'allpagesprev'      => 'पिछला',
'allpagesnext'      => 'अगला',
'allpagessubmit'    => 'जाएँ',
'allpagesprefix'    => 'इस उपपदसे शुरू होनेवाले लेख दर्शायें:',
'allpagesbadtitle'  => 'दिया गया शीर्षक अमान्य था या उसमें अंतर-भाषित अथवा अंतर-विकी उपसर्ग था। इसमें संभवतः एक या एक से अधिक शीर्षक में प्रयोग न होने वाले अक्षर हैं।',
'allpages-bad-ns'   => '{{SITENAME}} में "$1" यह नामस्थान नहीं हैं ।',

# Special:Categories
'categories'                    => 'श्रेणियाँ',
'categoriespagetext'            => 'निम्न श्रेणियाँ विकि मे अस्तित्वमान हैं।',
'categoriesfrom'                => 'इस शब्दसे शुरू होनेवाली श्रेणीयाँ दर्शायें:',
'special-categories-sort-count' => 'संख्यानुसार वर्ग दर्शायें',
'special-categories-sort-abc'   => 'वर्णानुक्रम के अनुसार दर्शायें',

# Special:ListUsers
'listusersfrom'      => 'इस शब्द से शुरु होनेवाले सदस्य दर्शायें:',
'listusers-submit'   => 'दर्शायें',
'listusers-noresult' => 'सदस्य मिला नहीं।',

# Special:ListGroupRights
'listgrouprights'          => 'सदस्य ग्रुप अधिकार',
'listgrouprights-summary'  => 'नीचे विकिपर बनायें गये ग्रुपोंकी सूची उन ग्रुपोंके सदस्योंको प्राप्त अधिकारोंके साथ दर्शायी गई हैं। हर एक के अधिकार के बारे में अधिक जानकारी [[{{MediaWiki:Listgrouprights-helppage}}|यहां]] दी गई हैं।',
'listgrouprights-group'    => 'ग्रुप',
'listgrouprights-rights'   => 'अधिकार',
'listgrouprights-helppage' => 'Help:ग्रुप अधिकार',
'listgrouprights-members'  => '(सदस्य सूची)',

# E-mail user
'mailnologin'     => 'पानेवाले का एड्रेस दिया नहीं',
'mailnologintext' => 'अन्य सदस्यों को इ-मेल भेजने के लिये आपने [[Special:UserLogin|लॉग इन]] किया होना जरूरी हैं और आपकी [[Special:Preferences|वरीयताओंमें]] वैध इ-मेल एड्रेस होना आवश्यक हैं।',
'emailuser'       => 'इस सदस्य को ई-मेल भेजें',
'emailpage'       => 'सदस्य को इ-मेल करें',
'emailpagetext'   => 'यदि इस सदस्य ने अपनी सदस्य वरीयताओं में एक उपयुक्त ई-मेल पता प्रवेश किया है, तब निम्न पत्र एक संदेश भेजेगा।
आपने अपनी वरीयताओं में ई-मेल पता भेजा है, जो कि डाक के "पत्र" पते में प्रकट होगा, अतैव प्राप्तकर्ता उत्तर देने में सक्षम होगा।',
'usermailererror' => 'मेल ऑब्जेक्ट ने यह गलती बताई हैं:',
'defemailsubject' => 'विकिपीडिया ई-मेल',
'noemailtitle'    => 'इ-मेल एड्रेस नहीं',
'noemailtext'     => 'इस सदस्यने वैध इ-मेल पता दिया नहीं हैं, या फिर अन्य सदस्योंसे इ-मेल प्राप्त करने की अनुमति नहीं दी हैं।',
'emailfrom'       => 'किससे',
'emailto'         => 'किसे',
'emailsubject'    => 'विषय',
'emailmessage'    => 'मेसेज',
'emailsend'       => 'भेजें',
'emailccme'       => 'मेरे इ-मेल की कापी मुझे भी भेजें।',
'emailccsubject'  => 'आपके इ-मेल की कापी जो $1 को भेजा गया: $2',
'emailsent'       => 'ई-मेल भेज दिया गया है।',
'emailsenttext'   => 'आपका ई-मेल संदेश भेज दिया गया है ।',

# Watchlist
'watchlist'            => 'मेरी ध्यानसूची',
'mywatchlist'          => 'मेरी ध्यानसूची',
'watchlistfor'         => "('''$1''' के लिये)",
'nowatchlist'          => 'आपकी ध्यानसूचीमें कोईभी लेख नहीं हैं।',
'watchlistanontext'    => 'अपने ध्यानसूचीमें होने वाले लेख देखने या फिर संपादित करने के लिये कॄपया $1 करें।',
'watchnologin'         => 'लॉग इन नहीं किया हैं',
'watchnologintext'     => 'ध्यानसूचीमें बदलाव के लिये आपने [[Special:UserLogin|लॉग इन]] किया होना आवश्यक हैं।',
'addedwatch'           => 'ध्यानसूची में जोड़ दिया गया',
'addedwatchtext'       => 'आपकी [[Special:Watchlist|ध्यानसूची]] में "<nowiki>$1</nowiki>" का समावेश कर दिया गया है ।
भविष्य में इस पन्ने तथा इस पन्ने की वार्ता में होने  वाले बदलाव आपकी ध्यानसूची में दिखेंगे तथा [[Special:RecentChanges|हाल में हुए बदलावों की सूची]] में यह पन्ना बोल्ड दिखेगा ताकि  आप आसानी से इसका ध्यान रख सके ।

<p>अगर आपको इस पन्ने को अपनी ध्यानसूची से निकालना हो तो "ध्यान हटायें" पर क्लिक करें ।',
'removedwatch'         => 'ध्यानसूची से हटाया गया है',
'removedwatchtext'     => '"[[:$1]]" लेख आपके ध्यानसूचीसे हटाया गया है ।',
'watch'                => 'ध्यान रखें',
'watchthispage'        => 'इस पन्ने का ध्यान रखें',
'unwatch'              => 'ध्यान हटायें',
'unwatchthispage'      => 'ध्यानसूची से हटायें',
'notanarticle'         => 'पाठ के बिना पन्ना',
'notvisiblerev'        => 'अवतरण हटाया गया हैं',
'watchnochange'        => 'दिये गये समयमें आपके ध्यानसूचीमें होने वाले लेखोंमें कोई भी बदलाव नहीं हुए हैं।',
'watchlist-details'    => '{{PLURAL:$1|$1 पन्ना|$1 पन्ने}} ध्यानसूचीमें हैं, इसमे वार्ता पृष्ठ शामिल नहीं हैं ।',
'wlheader-enotif'      => '* इ-मेल नोटिफिकेशन उपल्ब्ध हैं।',
'wlheader-showupdated' => "* लेख, जो आपके द्वारा देखे जाने के बाद बदले गये हैं, '''बोल्ड''' दिखेंगे।",
'watchmethod-recent'   => 'ध्यानसूचीमें दिये गये लेखोंमें हाल में हुए बदलाव देख रहें हैं',
'watchmethod-list'     => 'ध्यानसूचीमें दिये गये लेखोंमें हाल में हुए बदलाव देख रहें हैं',
'watchlistcontains'    => 'आपकी ध्यानसूचीमें $1 {{PLURAL:$1|लेख|पन्ने}} हैं।',
'iteminvalidname'      => "'$1' के साथ समस्या, अवैध नाम...",
'wlnote'               => "नीचे पीछले {{PLURAL:$2|घंटेमें|'''$2''' घंटोंमें}} हुए {{PLURAL:$1|आखिरी बदलाव|आखिरी '''$1''' बदलाव}} दिये हुए हैं।",
'wlshowlast'           => 'पिछले $1 घंटे $2 दिन $3 देखें',
'watchlist-show-bots'  => 'बोटों के बदलाव दर्शायें',
'watchlist-hide-bots'  => 'बोट एडिट छुपायें',
'watchlist-show-own'   => 'मेरे बदलाव दर्शायें',
'watchlist-hide-own'   => 'मेरे बदलाव छुपायें',
'watchlist-show-minor' => 'छोटे बदलाव दर्शायें',
'watchlist-hide-minor' => 'छोटे बदलाव छुपायें',

# Displayed when you click the "watch" button and it is in the process of watching
'watching'   => 'ध्यान दे रहे हैं...',
'unwatching' => 'ध्यान हटा रहे हैं...',

'enotif_mailer'                => '{{SITENAME}} सूचना इ-मेल कर्ता',
'enotif_reset'                 => 'सभी पन्नोंको देखा ऐसे दर्शायें',
'enotif_newpagetext'           => 'यह नया पन्ना है।',
'enotif_impersonal_salutation' => '{{SITENAME}} सदस्य',
'changed'                      => 'परिवर्तित',
'created'                      => 'बनाया',
'enotif_subject'               => '{{SITENAME}} पन्ना $PAGETITLE $PAGEEDITOR ने $CHANGEDORCREATED',
'enotif_lastvisited'           => 'आपकी आखिरी भेंट के बाद हुए बदलाव देखनेकेलिये $1 देखें।',
'enotif_lastdiff'              => 'इस बदलाव को देखने के लिये $1 देखें।',
'enotif_anon_editor'           => 'अनामक सदस्य $1',
'enotif_body'                  => 'प्रिय $WATCHINGUSERNAME,


{{SITENAME}} पृष्ठ $PAGETITLE $PAGEEDITOR द्वारा $PAGEEDITDATE को  $CHANGEDORCREATED किया है, वर्त्तमान संस्करण के लिए $PAGETITLE_URL देखें।

$NEWPAGE

संपादक का सारांश: $PAGESUMMARY $PAGEMINOREDIT

संपादक से सम्पर्क करें:
डाक: $PAGEEDITOR_EMAIL
विकी: $PAGEEDITOR_WIKI

आगे परिवर्तन की स्थिति में आपको अधिसूचित नहीं किया जायेगा, जब तक आप इस पृष्ठ को नहीं देखेंगे।
आप अपनी ध्यानसूची में आपके द्वारा सभी देखे जाने वाले पृष्ठों के लिए अधिसूचना पताका को फिर से ठीक कर सकता है।

             आपका साथी {{SITENAME}} अधिसूचना तंत्र

--
अपनी ध्यानसूची में समायोजन में परिवर्तन के लिए, देखें
{{fullurl:{{ns:special}}:Watchlist/edit}}

प्रतिपुष्टि एवं सहायता के लिए:
{{fullurl:{{MediaWiki:Helppage}}}}',

# Delete/protect/revert
'deletepage'                  => 'पन्ना हटायें',
'confirm'                     => 'सुनिश्चित करें',
'excontent'                   => "पाठ था: '$1'",
'excontentauthor'             => "पाठ था: '$1' (और सिर्फ '[[Special:Contributions/$2|$2]]' का योगदान था।)",
'exbeforeblank'               => "हटाने के पहलेका पाठ था: '$1'",
'exblank'                     => 'पन्ना पाठ रहित था',
'delete-confirm'              => '"$1" को हटायें',
'delete-legend'               => 'हटायें',
'historywarning'              => 'चेतावनी: आप जिस पन्ने को हटाने जा रहे हैं उसका इतिहास खाली नहीं है ।',
'confirmdeletetext'           => 'आप एक लेख उसके सभी अवतरणोंके साथ हटाना चाहते हैं ।
आपसे अनुरोध है कि आप जो कर रहे है वह मीडियाविकिके [[{{MediaWiki:Policy-url}}|नीतिनुसार]] है इस बात की पुष्टि किजीये । तथा क्रिया करने से पहले आपकी क्रिया के परिणाम जान लें ।',
'actioncomplete'              => 'कार्य पूर्ण',
'deletedtext'                 => '"<nowiki>$1</nowiki>" को हटाया गया है ।
हाल में हटाये गये लेखोंकी सूची के लिये $2 देखें ।',
'deletedarticle'              => '"$1" को हटाया गया है।',
'suppressedarticle'           => '"[[$1]]" को सप्रेस किया',
'dellogpage'                  => 'हटाने की सूची',
'dellogpagetext'              => 'नीचे हाल में हटायें गये पन्नोंकी सूची हैं।',
'deletionlog'                 => 'हटाने की सूची',
'reverted'                    => 'पुराने अवतरणको पूर्ववत किया',
'deletecomment'               => 'हटाने का कारण',
'deleteotherreason'           => 'दुसरा/अतिरिक्त कारण:',
'deletereasonotherlist'       => 'दुसरा कारण',
'deletereason-dropdown'       => '*हटाने के सामान्य कारण
** लेखक कि बिनती
** कॉपीराईट
** वॅन्डॅलिजम',
'delete-edit-reasonlist'      => 'हटाने के कारण संपादित करें',
'delete-toobig'               => 'इस लेख को $1 से ज्यादा बार बदला गया हैं।
{{SITENAME}} के अनपेक्षित बंद होने से रोकने के लिये ऐसे पन्नोंको हटाने की अनुमति नहीं हैं।',
'delete-warning-toobig'       => 'इस लेख को $1 से ज्यादाबार बदला गया हैं।
इसे हटानेसे {{SITENAME}} पर खलबली मच सकती हैं;
कृपया ध्यानपूर्वक आगे बढें।',
'rollback'                    => 'संपादन पीछे ले जायें',
'rollback_short'              => 'पूर्ववत करें',
'rollbacklink'                => 'रोलबॅक',
'rollbackfailed'              => 'पूर्ववत नहीं कर सकें',
'cantrollback'                => 'पुराने अवतरणको पूर्ववत नहीं कर सकते हैं;
इस पन्ने का आखिरी योगदानकर्ता इस लेख का एकमात्र लेखक हैं।',
'alreadyrolled'               => '[[$1]] का [[User:$2|$2]] ([[User talk:$2|वार्ता]]) द्वारा किया गया पिछला बदलाव रोलबेक नहीं किया जा सकता; किसी और ने पहले ही इसे रोलबेक किया अथवा बदल दिया है । पिछला बदलाव [[User:$3|$3]] ([[User talk:$3|वार्ता]]) द्वारा किया गया है ।',
'editcomment'                 => 'संपादन टिप्पणी: "<i>$1</i>".', # only shown if there is an edit comment
'revertpage'                  => '[[Special:Contributions/$2|$2]] ([[User talk:$2|Talk]]) के संपादनोंको हटाकर [[User:$1|$1]] के आखिरी अवतरण को पूर्ववत किया', # Additional available: $3: revid of the revision reverted to, $4: timestamp of the revision reverted to, $5: revid of the revision reverted from, $6: timestamp of the revision reverted from
'rollback-success'            => '$1 के संपादन हटायें;
$2 द्वारा संपादित आखिरी अवतरण को पुनर्स्थापित किया।',
'sessionfailure'              => 'ऐसा प्रतीत होता है की आपके लोगिन सत्र के साथ कोई समस्या है।
सत्र अपहरण से बचाने के लिए सावधानी के तौर पर आपका यह क्रियाकलाप रद्द कर दिया गया है।
कृपया "back" पर वार करें और पृष्ठ को दुबारा से लोड करें, तब दुबारा कोशिश करें।',
'protectlogpage'              => 'सुरक्षा सूची',
'protectlogtext'              => 'नीचे उन पृष्ठों की सारणी है, जिनमें ताला लगा हुआ है और ताला खोल दिया गया है।
वर्त्तमान में क्रियाशील सुरक्षित पृष्ठों की सूची के लिए [[Special:ProtectedPages|सुरक्षित पृष्ठों की सूची]] देखें।',
'protectedarticle'            => '"[[$1]]" सुरक्षित कर दिया',
'modifiedarticleprotection'   => '"[[$1]]" के सुरक्षा-स्तर को बदला',
'unprotectedarticle'          => '"[[$1]]" असुरक्षित कर दिया',
'protect-title'               => '"$1" की सुरक्षा लेवल बदलें',
'protect-legend'              => 'सुरक्षितता निर्धारित करें',
'protectcomment'              => 'टिप्पणी:',
'protectexpiry'               => 'समाप्ती:',
'protect_expiry_invalid'      => 'समाप्ती समय गलत है ।',
'protect_expiry_old'          => 'समाप्ती समय बीत चुका है ।',
'protect-unchain'             => 'नाम बदलने की अनुमति दिजीये',
'protect-text'                => '<strong><nowiki>$1</nowiki></strong> पन्ने का सुरक्षा-स्तर आप यहां देख सकते है और उसे बदल भी सकते है ।',
'protect-locked-blocked'      => 'आप बाधित होने की स्थिति में सुरक्षा स्थर में परिवर्तन नहीं कर सकते।
पृष्ठ <strong>$1</strong> की वर्त्तमान स्तिथि यहाँ पर है:',
'protect-locked-dblock'       => 'सक्रिय डेटाबेस बंद होने की वजह से सुरक्षा स्तर में कोई परिवर्तन नहीं किया जा सकता।
पृष्ठ <strong>$1</strong> की वर्त्तमान स्तिथि यहाँ पर है:',
'protect-locked-access'       => 'आपको इस पन्ने का सुरक्षा-स्तर बदलने कि अनुमति नहीं है ।
<strong>$1</strong> का अभीका सुरक्षा-स्तर:',
'protect-cascadeon'           => 'यह पन्ना अभी सुरक्षित है क्योंकि वह {{PLURAL:$1|इस पन्नेकी|इन पन्नोंकी}} सुरक्षा-सीढीपर है । आप इस पन्ने का सुरक्षा-स्तर बदल सकते हैं, पर उससे सुरक्षा-सीढीमें बदलाव नहीं होंगे ।',
'protect-default'             => '(ड़िफॉल्ट)',
'protect-fallback'            => '"$1" इजाज़त जरूरी है',
'protect-level-autoconfirmed' => 'अनामक सदस्योंको ब्लॉक करें',
'protect-level-sysop'         => 'सिर्फ प्रबंधक',
'protect-summary-cascade'     => 'सीढी',
'protect-expiring'            => 'समाप्ती $1 (UTC)',
'protect-cascade'             => 'इस पन्ने से जुडे हुए पन्ने सुरक्षित करें (सुरक्षा-सीढी)',
'protect-cantedit'            => 'आप इस पन्नेका सुरक्षा-स्तर बदल नहीं सकते क्योंकी आपको ऐसा करने की अनुमति नहीं है ।',
'restriction-type'            => 'इजाज़त:',
'restriction-level'           => 'सुरक्षा-स्तर:',
'minimum-size'                => 'कमसे कम आकार',
'maximum-size'                => 'ज्यादा से ज्यादा आकार:',
'pagesize'                    => '(बाईट्स)',

# Restrictions (nouns)
'restriction-edit'   => 'संपादन',
'restriction-move'   => 'स्थानांतरण',
'restriction-create' => 'बनाईयें',
'restriction-upload' => 'अपलोड',

# Restriction levels
'restriction-level-sysop'         => 'पूर्ण सुरक्षित',
'restriction-level-autoconfirmed' => 'अर्ध सुरक्षित',
'restriction-level-all'           => 'कोईभी लेवल',

# Undelete
'undelete'                     => 'हटाया पन्ना वापस लायें',
'undeletepage'                 => 'हटायें गयें पन्ने देखें और पुनर्स्थापित करें',
'undeletepagetitle'            => "'''नीचे [[:$1]] के हटायें गयें अवतरणभी दर्शायें गयें हैं।'''",
'viewdeletedpage'              => 'हटायें गयें लेख देखें',
'undeletepagetext'             => 'निम्न पृष्ठों को मिटा दिया गया है, लेकिन अभी ये लेखागार में हैं और पुनर्स्थापित किये जा सकते हैं।
लेखागार समय-समय पर साफ किये जाते हैं।',
'undeleteextrahelp'            => "सम्पूर्ण पृष्ठ को पुनर्स्थापित करने के लिए, सभी सन्दूकों को बिना चुने '''''पुनर्स्थापन''''' पर क्लिक करें।
चुनिंदा पुनर्स्थापन के लिए, जिन अवतरणों को पुनार्थापित करना है, उन संबंधित सन्दूकों को चुने, और '''''पुनर्स्थापन''''' पर क्लिक करें।
'''''पुनर्स्थापन''' पर क्लिक्क करने से टिप्पणी क्षेत्र और सभी संदूक साफ हो जायेंगे।",
'undeleterevisions'            => '$1 {{PLURAL:$1|अवतरण|अवतरण}} आर्चिव्ह किये',
'undeletehistory'              => 'यदि आप पृष्ठ को पुनर्स्थापित करते हो तो, सभी अवतरण इतिहास में पुनर्स्थापित हो जायेंगे।
मिटाने के बाद, यदि एक नया पृष्ठ उसी नाम से बनाया गया है, तो पुनर्स्थापित अवतरण पिछले इतिहास में दर्शित होंगे।
कृपया ध्यान दें कि पुनर्स्थापन के बाद फाइल अवतरण पर लगे सभी प्रतिबन्ध हट जाते हैं।',
'undeleterevdel'               => 'यदि पुनर्स्थापन से शीर्ष पृष्ठ अथवा फाइल अवतरण आंशिक रूप से मिट जाता है, तो इसे क्रियान्वित नहीं किया जायेगा।
ऐसी स्थिति में, आपको नवीनतम निकाले गए अवतरण को बिना सही के निशान लगाये हुए या बिना छुपाये रखना होगा।',
'undeletehistorynoadmin'       => 'यह पृष्ठ निकाल दिया गया है।
निकाले जाने का कारन नीचे सारांश में दिया गया है, और साथ ही उन सदस्यों के बारे में विस्तार भी दिया गया है, जिन्होंने निकाले जाने से पहले इस पृष्ठ को संपादित किया है।
इन हटाये गए अवतरणों के विद्यमान विषय वस्तु केवल प्रशासकों को ही उपलब्ध है।',
'undelete-revision'            => '$1 के ($2 के) अवतरण $3 ने हटायें:',
'undeleterevision-missing'     => 'अमान्य अथवा अनुपस्थित अवतरण।
या तो आप ग़लत सम्पर्क प्रयोग कर रहे हैं, या यह अवतरण पुनर्स्थापित किया जा चुका है, अथवा इसे लेखागार से निकाल दिया गया है।',
'undelete-nodiff'              => 'पुरान अवतरण नहीं हैं।',
'undeletebtn'                  => 'वापस ले आयें',
'undeletelink'                 => 'पुनर्स्थापित करें',
'undeletereset'                => 'पूर्ववत करें',
'undeletecomment'              => 'टिप्पणी:',
'undeletedarticle'             => '"[[$1]]" पुनर्स्थापित किया',
'undeletedrevisions'           => '{{PLURAL:$1|एक रूपान्तर वापस लाया गया|$1 रूपान्तर वापस लाये गये}} है',
'undeletedrevisions-files'     => '{{PLURAL:$1|1 अवतरण|$1 अवतरण}} और {{PLURAL:$2|1 फ़ाईल|$2 फ़ाइलें}} पुनर्स्थापित कर दियें',
'undeletedfiles'               => '{{PLURAL:$1|1 फ़ाईल|$1 फ़ाईलें}} पुनर्स्थापित',
'cannotundelete'               => 'पुनर्स्थापित नहीं कर सकें;
किसी और ने पहले ही पुनर्स्थापित कर दिया हों।',
'undeletedpage'                => "<big>'''$1 को पुनर्स्थापित कर दिया गया हैं'''</big>

हाल में हटायें गये तथा पुनर्स्थापित किये हुए पन्नोंकी ज़ानकारी के लिये [[Special:Log/delete|हटानेकी सूची]] देखें।",
'undelete-header'              => 'हाल में हटाये गये पन्ने देखने के लियें [[Special:Log/delete|हटाने की सूची]] देखें।',
'undelete-search-box'          => 'हटायें गयें पन्ने खोजें',
'undelete-search-prefix'       => 'से शुरु होने पन्ने दर्शायें:',
'undelete-search-submit'       => 'खोज',
'undelete-no-results'          => 'हटायें गयें पन्नोंके आर्चिव्हमें मेल खाने वाले पन्ने मिले नहीं।',
'undelete-filename-mismatch'   => '$1 समयके फ़ाइलके हटाये गये अवतरणको पुनर्स्थापित नहीं किया जा सकता: फ़ाईल का नाम मेल नहीं खाता',
'undelete-bad-store-key'       => '$1 समयका फ़ाईल अवतरण पुनर्स्थापित नहीं कर सकतें हैं: हटाने से पहले फ़ाईल अस्तित्वमें नहीं थी।',
'undelete-cleanup-error'       => 'इस्तेमालमें न लाई गई "$1" आर्चिव्ह फ़ाईल हटाने में समस्या हुई हैं।',
'undelete-missing-filearchive' => '$1 फाइल लेखागार पहचान को पुनर्स्थापित करने में असक्षम हैं, क्योंकि यह डेटाबेस में उपलब्ध नहीं है।
या ऐसा भी हो सकता है कि यह पहले से ही पुनर्स्थापित किया जा चुका हो।',
'undelete-error-short'         => 'फ़ाईल पुनर्स्थापित करने में समस्या: $1',
'undelete-error-long'          => 'फ़ाईल पुनर्स्थापित करने में आई हुई समस्याएं:

$1',

# Namespace form on various pages
'namespace'      => 'नामस्थान:',
'invert'         => 'विपरीत प्रवरण',
'blanknamespace' => '(मुख्य)',

# Contributions
'contributions' => 'सदस्य योगदान',
'mycontris'     => 'मेरा योगदान',
'contribsub2'   => '$1 के लिये ($2)',
'nocontribs'    => 'इन कसौटियों से मिलनेवाले बदलाव मिले नहीं।',
'uctop'         => '(उपर)',
'month'         => 'इस महिनेसे (और पुरानें):',
'year'          => 'इस सालसे (और पुराने):',

'sp-contributions-newbies'     => 'सिर्फ नये सदस्योंका योगदान दर्शायें',
'sp-contributions-newbies-sub' => 'नये सदस्योंके लिये',
'sp-contributions-blocklog'    => 'ब्लॉक सूची',
'sp-contributions-search'      => 'योगदान के लिये खोज',
'sp-contributions-username'    => 'आईपी एड्रेस या सदस्यनाम:',
'sp-contributions-submit'      => 'खोज',

# What links here
'whatlinkshere'            => 'यहाँ क्या जुड़ता है',
'whatlinkshere-title'      => '$1को जुडे हुए पन्ने',
'whatlinkshere-page'       => 'पन्ना:',
'whatlinkshere-barrow'     => '>',
'linklistsub'              => '(कडियों की सूची)',
'linkshere'                => "नीचे दिये हुए पन्ने '''[[:$1]]''' से जुडते हैं:",
'nolinkshere'              => "'''[[:$1]]''' को कुछभी जुडता नहीं हैं ।",
'nolinkshere-ns'           => "चुने हुए नामस्थानसे '''[[:$1]]''' को जुडने वाले पन्ने नहीं हैं।",
'isredirect'               => 'पुनर्निर्देशन पन्ना',
'istemplate'               => 'मिलाईयें',
'isimage'                  => 'चित्र कड़ी',
'whatlinkshere-prev'       => '{{PLURAL:$1|पिछला|पिछले $1}}',
'whatlinkshere-next'       => '{{PLURAL:$1|अगला|अगले $1}}',
'whatlinkshere-links'      => '← कड़ियाँ',
'whatlinkshere-hideredirs' => '$1 अनुप्रेषितें',
'whatlinkshere-hidetrans'  => '$1 ट्रान्स्क्ल्युजन्स',
'whatlinkshere-hidelinks'  => '$1 कड़ीयाँ',
'whatlinkshere-hideimages' => '$1 चित्र कड़ीयाँ',
'whatlinkshere-filters'    => 'छन्ने',

# Block/unblock
'blockip'                     => 'अवरोधित करें',
'blockip-legend'              => 'सदस्य को ब्लॉक करें',
'blockiptext'                 => 'विशिष्ठ IP पते अथवा सदस्य नाम को लिखने के अधिकार से बाध्य करने के लिए निम्न पत्र का प्रयोग करें।
यह सिर्फ बर्बरता को रोकने के लिए ही किया जाना चाहिए, और [[{{MediaWiki:Policy-url}}|नीति]] के अनुसार ही करना चाहिए।
नीचे विशिष्ठ कारण भी लिखें (उदाहरण के लिए, सटीक पृष्ठों को दर्शाते हुए, जिनमें बर्बरता की गई हो)।',
'ipaddress'                   => 'आईपी एड्रेस:',
'ipadressorusername'          => 'आईपी एड्रेस या सदस्यनाम:',
'ipbexpiry'                   => 'समाप्ति:',
'ipbreason'                   => 'कारण',
'ipbreasonotherlist'          => 'दूसरा कारण',
'ipbreason-dropdown'          => '*ब्लॉक करने के साधारण कारण
** गलत ज़ानकारी भरना
** पन्नोंसे पाठ हटाना
** बाहरी साइट्सकी कड़ीयाँ देना
** पन्ने में कचरा भरना
** सदस्योंको तंग करना
** एक से ज्यादा खातें खोलकर परेशान करना
** अवैध सदस्यनाम',
'ipbanononly'                 => 'सिर्फ अनामक सदस्योंको ब्लॉक करें',
'ipbcreateaccount'            => 'खाते का निर्माण रोकें',
'ipbemailban'                 => 'सदस्य को इ-मेल भेजने से रोकें',
'ipbenableautoblock'          => 'इस सदस्यद्वारा इस्तेमाल किया गया आखिरी आईपी एड्रेस और यहां से आगे इस सदस्य द्वारा इस्तेमालमें लाये जाने वाले सभी एड्रेस ब्लॉक करें।',
'ipbsubmit'                   => 'इस सदस्य को और बदलाव करने से रोकें',
'ipbother'                    => 'अन्य समय:',
'ipboptions'                  => '२ घंटे:2 hours,१ दिन:1 day,३ दिन:3 days,१ हफ्ता:1 week,२ हफ्ते:2 weeks,१ महिना:1 month,३ महिने:3 months,६ महिने:6 months,१ साल:1 year,हमेशा के लिये:infinite', # display1:time1,display2:time2,...
'ipbotheroption'              => 'अन्य',
'ipbotherreason'              => 'अन्य/दूसरा कारण:',
'ipbhidename'                 => 'ब्लॉक सूची, चल रहें ब्लॉक की सूची और सदस्य सूची से सदस्यनाम छुपायें',
'ipbwatchuser'                => 'इस सदस्य के सदस्य तथा वार्ता पृष्ठ पर ध्यान रखें',
'badipaddress'                => 'अमान्य आईपी पता।',
'blockipsuccesssub'           => 'अवरोधन सफल ।(संपादन करने से रोक दिया गया है)',
'blockipsuccesstext'          => '[[Special:Contributions/$1|$1]] को बाध्य किया जा चुका है।<br />
बाध्यों की समीक्षा के लिए [[Special:IPBlockList|IP बाध्य सूची]] देखें।',
'ipb-edit-dropdown'           => 'ब्लॉक कारण संपादित करें',
'ipb-unblock-addr'            => '$1 को अनब्लॉक करें',
'ipb-unblock'                 => 'सदस्य अथवा आईपी एड्रेस को अनब्लॉक करें',
'ipb-blocklist-addr'          => '$1 के सद्य ब्लॉक देखें',
'ipb-blocklist'               => 'सद्य ब्लॉक देखें',
'unblockip'                   => 'सदस्य को अनब्लॉक करें',
'unblockiptext'               => 'पहले ब्लॉक किये हुए आईपी एड्रेस या सदस्यनाम को अनब्लॉक करने के लिये नीचे दिया गया फार्म भरें।',
'ipusubmit'                   => 'इस एड्रेस को अनब्लॉक करें',
'unblocked'                   => '[[User:$1|$1]] को अनब्लॉक कर दिया हैं',
'unblocked-id'                => 'ब्लॉक $1 निकाला गया हैं',
'ipblocklist'                 => 'ब्लॉक किये हुए सदस्यनाम और IP एड्रेसकी सूची',
'ipblocklist-legend'          => 'ब्लॉक किया हुआ सदस्य खोजें',
'ipblocklist-username'        => 'सदस्यनाव या आईपी एड्रेस:',
'ipblocklist-submit'          => 'खोज',
'blocklistline'               => '$1, $2 ने $3 को बदलाव करने से रोक दिया है (यह रोक $4 तक मान्य है)',
'infiniteblock'               => 'इनफाईनाईट',
'expiringblock'               => 'समाप्ति $1',
'anononlyblock'               => 'केवल अनाम सदस्य',
'noautoblockblock'            => 'स्वयंचलित ब्लॉक रद्द किये हैं',
'createaccountblock'          => 'खाते निर्माण को रोक दिया हैं',
'emailblock'                  => 'इ-मेल को ब्लॉक किया हैं',
'ipblocklist-empty'           => 'ब्लॉक सूची खाली हैं।',
'ipblocklist-no-results'      => 'पूछे गये आईपी एड्रेस / सदस्यनाम पर ब्लॉक नहीं हैं।',
'blocklink'                   => 'अवरोधित करें',
'unblocklink'                 => 'अनब्लॉक',
'contribslink'                => 'योगदान',
'autoblocker'                 => 'आपका IP पता स्वत: बाध्य है, जो की हाल ही में "[[User:$1|$1]]" द्वारा प्रयोग किया गया है।
$1 को बाध्य करने का कारण है: "$2"',
'blocklogpage'                => 'ब्लॉक सूची',
'blocklogentry'               => '"[[$1]]" को $2 $3 तक बदलाव करने से रोक दिया गया है।',
'blocklogtext'                => 'यह सदस्यों को बाध्य एवं अबाध्य करने के क्रियाकलापों का अभिलेख है।
स्वत: बाधित होने वाले IP पते इस सूची में उपलब्ध नहीं है।
वर्त्तमान में क्रियाशील प्रतिबंधों और बाध्यों की सूची के लिए [[Special:IPBlockList|IP बाधित सूची]] देखें।',
'unblocklogentry'             => '$1 ब्लॉक निकाल दिया हैं',
'block-log-flags-anononly'    => 'सिर्फ अनामक सदस्य',
'block-log-flags-nocreate'    => 'खाता निर्माण पर रोक',
'block-log-flags-noautoblock' => 'ऑटोब्लॉक बंद हैं',
'block-log-flags-noemail'     => 'इ-मेल बंद हैं',
'range_block_disabled'        => 'प्रबंधकोंको अब रेंज ब्लॉक करने की अनुमति नहीं हैं।',
'ipb_expiry_invalid'          => 'अवैध समाप्ति कालावधी।',
'ipb_expiry_temp'             => 'छुपायें हुए सदस्यनाम ब्लॉक्स हमेशा के लिये होने चाहिये।',
'ipb_already_blocked'         => '"$1" को पहलेसे ब्लॉक हैं',
'ipb_cant_unblock'            => 'समस्या: ब्लॉक ID $1 मिला नहीं। इसे पहले अनब्लॉक कर दिया गया हो सकता हैं।',
'ipb_blocked_as_range'        => 'गलती: $1 यह आइपी सीधे बाधित नहीं है और अबाध्य नहीं किया जा सकता।
फिर भी, $2 प्रकार को बाध्य किया जा सकता है, जिनको अबाध्य किया जा सकता है।',
'ip_range_invalid'            => 'गलत आईपी रेंज',
'blockme'                     => 'मुझे ब्लॉक करो',
'proxyblocker'                => 'प्रॉक्सी ब्लॉकर',
'proxyblocker-disabled'       => 'यह कार्य रद्द कर दिया गया हैं।',
'proxyblockreason'            => 'आपका IP पता बाधित किया जा चुका है क्योंकि यह एक मुक्त प्रतिनिधि है।
कृपया आप अपने इंटरनेट सेवा प्रदान करने वाले से या तकनीकी सहायक से सम्पर्क करें अथवा उन्हें इस भयावह सुरक्षा समस्या के बारे में सूचित करें।',
'proxyblocksuccess'           => 'हो गया।',
'sorbsreason'                 => '{{SITENAME}} द्वारा इस्तेमालमें लाये जाने वाले DNSBL में आपके आईपी एड्रेसको ओपन प्रॉक्सीमें दर्शाया गया हैं।',
'sorbs_create_account_reason' => '{{SITENAME}} के DNSBL ने आपका आईपी एड्रेस ओपन प्रोक्सी करके सूचित किया हैं। आप खाता खोल नहीं सकतें।',

# Developer tools
'lockdb'              => 'डाटाबेस लॉक करें',
'unlockdb'            => 'डाटाबेस अनलॉक करें',
'lockdbtext'          => 'डेटाबेस में ताला लगाने से सभी सदस्य पृष्ठ संपादन, अपनी वरीयताओं में परिवर्तन, अपनी ध्यानसूची में संपादन, और अन्य चीजें जिनके लिए डेटाबेस में परिवर्तन करना होता है, उनसे वंचित हो जायेंगे।
कृपया यह सुनिश्चित करे की आप यह करना चाहते हैं, और आप अनुरक्षण के पश्चात ताला खोल देंगे।',
'unlockdbtext'        => 'डेटाबेस का ताला खोलने से सभी सदस्य पृष्ठ संपादन, अपनी वरीयताओं में परिवर्तन, अपनी ध्यानसूची में संपादन, और अन्य चीजें जिनके लिए डेटाबेस में परिवर्तन करना होता है, की सक्षमता को पुनर्स्थापित कर लेंगे।
कृपया यह सुनिश्चित करे की आप यह करना चाहते हैं।',
'lockconfirm'         => 'जी हां, मुझे सचमुच डाटाबेस को ताला लगाना हैं।',
'unlockconfirm'       => 'जी हां, मुझे सचमुच डाटाबेस का ताला खोलना हैं।',
'lockbtn'             => 'डाटाबेस लॉक करें',
'unlockbtn'           => 'अनलॉक डाटाबेस',
'locknoconfirm'       => 'आपने कन्फर्मेशन सन्दूकमें क्लिक नहीं किया हैं।',
'lockdbsuccesssub'    => 'डाटाबेस को ताला लगाया गया हैं',
'unlockdbsuccesssub'  => 'डाटाबेस का ताला निकाला गया हैं',
'lockdbsuccesstext'   => 'डाटाबेस को ताला लगाया गया हैं।<br />
आपके द्वारा मेंटेनन्स पूरा होने के बाद [[Special:UnlockDB|ताला खोलना]] याद रखें।',
'unlockdbsuccesstext' => 'डाटाबेसका ताला खोल दिया गया हैं।',
'lockfilenotwritable' => 'डाटाबेस के लॉक फ़ाईलमें लिख नहीं पा रहें हैं।
डाटाबेस का ताला लगाने या खोलनेके लिये, इस फ़ाईलपर लिखा जाना जरूरी हैं।',
'databasenotlocked'   => 'डाटाबेस को ताला नहीं लगाया गया हैं।',

# Move page
'move-page'               => '$1 हिलाईयें',
'move-page-legend'        => 'पृष्ठ स्थानांतरण',
'movepagetext'            => "नीचे दिया हुआ ढाँचा किसी लेख का शीर्षक बदलने में सहयोगी है । इसे सबमीट करने के बाद किसी लेख का नाम बदला जायेगा तथा उसके सभी अवतरण नये नामसे जोडे जायेंगे ।
पुराना शीर्षक नये नामको अनुप्रेषित करेगा ।
पुराने नामसे दी हुई कड़ियाँ नहीं बदली जायेगी, इसलिये आपसे अनुरोध है कि आप गलत एवम्‌ दुगुनी-अनुप्रेषिते देखें ।
गलत कड़ियाँ ना हो इसलिये सर्वस्वी आप जिम्मेदार रहेंगे ।

अगर नये शीर्षकका लेख पहले से है तो स्थानांतरण '''नहीं''' होगा. पर अगर नये शीर्षकका लेख खाली है अथवा अनुप्रेषित करता है (मतलब उसके अवतरन नहीं है) तो स्थानांतरण हो जायेगा ।
इसका मतलब अगर कुछ गलती हुई तो आप फिरसे पुराने नाम पर स्थानांतरण कर पायेंगे ।

'''सूचना!'''
स्थानांतरण करनेसे कोई भी महत्वपूर्ण लेख में अनपेक्षित बदलाव हो सकते है ।
आपसे अनुरोध है कि आप इसके परिणाम जान लें ।",
'movepagetalktext'        => "संबंधित वार्ता पृष्ठ इसके साथ स्थानांतरीत नहीं होगा '''अगर:'''
* आप पृष्ठ दुसरे नामस्थान में स्थानांतरीत कर रहें है
* इस नाम का वार्ता पृष्ठ पहलेसे बना हुवा है, या
* नीचे दिया हुआ चेक बॉक्स आपने निकाल दिया है ।

इन मामलोंमे आपको स्वयं यह पन्ने जोडने पड़ सकते है ।",
'movearticle'             => 'पृष्ठ का नाम बदलें',
'movenotallowed'          => '{{SITENAME}} पर पृष्ठ स्थानांतरणकी अनुमति आपको नहीं हैं।',
'newtitle'                => 'नये शीर्षक की ओर:',
'move-watch'              => 'ध्यान रखें',
'movepagebtn'             => 'नाम बदलें',
'pagemovedsub'            => 'नाम बदल दिया गया है',
'articleexists'           => 'इस नाम का एक पृष्ठ पहले से ही उपस्थित है, अथवा आप ने अमान्य नाम चुना है। कृपया दूसरा नाम चुनें।',
'cantmove-titleprotected' => 'नया शीर्षक बनाने से रोक होने के कारण, आप इस जगह पर कोई अन्य पन्ना स्थानांतरित नहीं कर सकतें हैं।',
'talkexists'              => "'''पन्ने का नाम बदल दिया गया है, पर उससे संबंधित वार्ता पृष्ठ नहीं बदला गया है क्योंकि वह पहले से बना हुवा है ।
कृपया इसे स्वयं बदल दे ।'''",
'movedto'                 => 'को भेजा गया',
'movetalk'                => 'संबंधित वार्ता पृष्ठ भी बदलें',
'move-subpages'           => 'अगर उपलब्ध हैं, तो सभी उपपन्नेभी स्थानांतरित करें',
'move-talk-subpages'      => 'अगर उपलब्ध हैं, तो वार्ता पृष्ठके सभी उपपन्नेभी स्थानांतरित करें',
'movepage-page-exists'    => '$1 पृष्ठ पहले से अस्तित्वमें हैं और उसपर अपनेआप पुनर्लेखन नहीं कर सकतें।',
'movepage-page-moved'     => '$1 यह पृष्ठ $2 इस नामपर स्थानांतरित कर दिया गया।',
'movepage-page-unmoved'   => '$1 यह पृष्ठ $2 इस नामपर स्थानांतरित नहीं कर पायें।',
'movepage-max-pages'      => 'ज्यादासे ज्यादा $1 पृष्ठ स्थानांतरित कर {{PLURAL:$1|दिया गया है|दिये गये हैं}}, अब और पृष्ठ अपनेआप स्थानांतरित नहीं होंगे।',
'1movedto2'               => '$1 का नाम बदलकर $2 कर दिया गया है',
'1movedto2_redir'         => '[[$1]] यह लेख का नाम बदल कर [[$2]] कर दिया गया हैं (अनुप्रेषित)',
'movelogpage'             => 'स्थानांतरण सूची',
'movelogpagetext'         => 'नाम बदले गये लेखोंकी सूची नीचे दी गई हैं।',
'movereason'              => 'कारण:',
'revertmove'              => 'पुराने अवतरण पर ले जाएं',
'delete_and_move'         => 'हटाया और नाम बदला',
'delete_and_move_text'    => '==हटाने की जरूरत==
लक्ष्य पृष्ठ "[[:$1]]" पहले से अस्तित्वमें हैं।
नाम बदलने के लिये क्या आप इसे हटाना चाहतें हैं?',
'delete_and_move_confirm' => 'जी हां, पन्ना हटाईयें',
'delete_and_move_reason'  => 'स्थानांतरण करने के लिये जगह बनाई',
'selfmove'                => 'स्रोत और लक्ष्य शीर्षक समान हैं;
पन्ना अपने ही जगह पर स्थानांतरित नहीं हो सकता।',
'immobile_namespace'      => 'स्रोत और लक्ष्य शीर्षक विशेष रुप में हैं;
इस नामस्थानमें या फिर इस नामस्थानके बाहर स्थानांतरण नहीं हो सकता।',
'imagenocrossnamespace'   => 'जिन नामस्थानोंमें फ़ाइल रख नहीं सकते, उसमें फ़ाइल का स्थानांतरण नहीं हो सकता',
'imagetypemismatch'       => 'फ़ाइल का नया एक्स्टेंशन उसके प्रकारसे मेल नहीं खाता',

# Export
'export'            => 'पन्ने निर्यात किजीयें',
'exporttext'        => 'आप विशिष्ठ पृष्ठ के विषय वस्तु और संपादन इतिहास को निर्यात कर सकते हैं अथवा पृष्ठों के समूह को कुछ XML में लपेट सकते हैं।
यह [[Special:Import|आयात पृष्ठ]] की सहायता से मीडियाविकी का प्रयोग करके दूसरी विकी से आयात किया जा सकता है।

पृष्ठों को निर्यात करने के लिए, नीचे विषय वस्तु संदूक में शीर्षक प्रवेश करें, एक शीर्षक प्रति पंक्ति, और चुने कि आप वर्त्तमान अवतरण के साथ पुराने अवतरण भी चाहते हैं कि नहीं, या पिछले संपादन के बारे में जानकारी के साथ केवल वर्त्तमान अवतरण चाहते हैं।

बाद वाली स्थिति के लिए आप एक सम्पर्क भी प्रयोग कर सकते हैं, उदाहरण के लिए, "[[{{MediaWiki:Mainpage}}]]" पृष्ठ के लिए [[{{ns:special}}:Export/{{MediaWiki:Mainpage}}]]।',
'exportcuronly'     => 'पूरा इतिहास नहीं चाहियें, सिर्फ अभी का अवतरण अंतर्भूत करें',
'exportnohistory'   => "----
'''सूचना:''' इस फॉर्म का इस्तेमाल कर पन्नेका पूरा इतिहास निर्यात करना परफॉर्मेन्स के चलते रोक दिया गया हैं।",
'export-submit'     => 'निर्यात',
'export-addcattext' => 'इस श्रेणीसे पन्ने चुनें:',
'export-addcat'     => 'चुनें',
'export-download'   => 'फ़ाईलके रुपमें सेव करें',
'export-templates'  => 'टेम्प्लेटस भी जोडें',

# Namespace 8 related
'allmessages'               => 'व्यवस्था संदेश',
'allmessagesname'           => 'नाम',
'allmessagesdefault'        => 'डिफॉल्ट पाठ',
'allmessagescurrent'        => 'वर्तमान पाठ',
'allmessagestext'           => 'यह मीडियाविकि नेमस्पेस में उपलब्ध वयवस्था संदेशों की सूची है।',
'allmessagesnotsupportedDB' => "इस पन्ने का इस्तेमाल नहीं कर सकते क्योंकी '''\$wgUseDatabaseMessages''' बंद हैं।",
'allmessagesfilter'         => 'संदेशनाम फिल्टर:',
'allmessagesmodified'       => 'केवल परिवर्तित दिखायें',

# Thumbnails
'thumbnail-more'           => 'बड़ा किजीये',
'filemissing'              => 'फ़ाईल मिली नहीं',
'thumbnail_error'          => 'थंबनेल बनानेमें असुविधा हुई है: $1',
'djvu_page_error'          => 'DjVu पन्ना रेंजके बाहर हैं',
'djvu_no_xml'              => 'DjVu फ़ाईलके लिये XML नहीं मिल पाया',
'thumbnail_invalid_params' => 'थंबनेलके लिये गलत पॅरॅमीटर',
'thumbnail_dest_directory' => 'लक्ष्य डाइरेक्टरी बना नहीं पा रहें हैं',

# Special:Import
'import'                     => 'पन्ने इम्पोर्ट करें',
'importinterwiki'            => 'ट्रान्सविकि आयात',
'import-interwiki-text'      => 'आयात करनेके लिये एक विकि और एक पन्ना चुनें।
अवतरणोंके दिनांक और संपादक का नाम जतन किया जायेगा.
सभी ट्रान्सविकि आयात क्रियायें [[Special:Log/import|आयात सूचीमें]] डाली गई हैं।',
'import-interwiki-history'   => 'इस पन्ने के सभी इतिहास अवतरण कापी करें',
'import-interwiki-submit'    => 'आयात',
'import-interwiki-namespace' => 'पन्ने नामस्थानमें स्थानांतरित करें:',
'importtext'                 => 'कृपया Special:Export सुविधा का इस्तेमाल कर स्रोत विकिसे फ़ाईल निर्यात करें, उसे अपने डिस्क पर डालें और यहां अपलोड करें।',
'importstart'                => 'पन्ने आयात कर रहें हैं...',
'import-revision-count'      => '$1 {{PLURAL:$1|अवतरण|अवतरण}}',
'importnopages'              => 'आयात करने के लिये पन्ने नहीं हैं।',
'importfailed'               => 'इम्पोर्ट असफल रहा  $1',
'importunknownsource'        => 'अज्ञात आयात स्रोत प्रकार',
'importcantopen'             => 'आयात फ़ाईल खोल नहीं पायें',
'importbadinterwiki'         => 'अवैध आंतरविकि कड़ि',
'importnotext'               => 'खाली अथवा पाठ नहीं',
'importsuccess'              => 'इम्पोर्ट सफल हुआ !',
'importhistoryconflict'      => 'उपलब्ध इतिहास अवतरण आपसमें विरोधी हैं (यह पन्ना पहलेसे आयात कर दिया गया होनेकी आशंका हैं)',
'importnosources'            => 'कोईभी ट्रान्सविकी आयात स्रोत मिले नहीं और डाइरेक्ट इतिहास अपलोड बंद कर दिये गये हैं।',
'importnofile'               => 'कोईभी आयात फ़ाईल अपलोड नहीं हुई हैं।',
'importuploaderrorsize'      => 'आयात फ़ाईल अपलोड हुई नहीं। इसका आकार अनुमतिसे ज्यादा हैं।',
'importuploaderrorpartial'   => 'आयात फ़ाईल अपलोड हुई नहीं। फ़ाईल आधी अधूरी अपलोड हुई।',
'importuploaderrortemp'      => 'आयात फ़ाईल अपलोड हुई नहीं। एक अस्थायी डाइरेक्टरी नहीं मिल रहीं।',
'import-parse-failure'       => 'XML आयात पार्स पूरा नहीं हुआ',
'import-noarticle'           => 'आयात करने के लिये पन्ना नहीं!',
'import-nonewrevisions'      => 'सभी अवतरण पहले ही आयात कर दिये गये हैं।',
'xml-error-string'           => '$1 कतार $2 में, कालम $3 (बाईट $4): $5',
'import-upload'              => 'XML डाटा अपलोड करें',

# Import log
'importlogpage'                    => 'इम्पोर्ट सूची',
'importlogpagetext'                => 'अन्य विकियोंसे प्रबंधकोंद्वारा की गई सम्पादन इतिहास के साथ होने वाले पन्नों की आयात।',
'import-logentry-upload'           => 'फ़ाईल अपलोड करके [[$1]] का आयात किया',
'import-logentry-upload-detail'    => '$1 {{PLURAL:$1|अवतरण|अवतरण}}',
'import-logentry-interwiki'        => 'ट्रान्सविकि कर दिया $1',
'import-logentry-interwiki-detail' => '$2 से $1 {{PLURAL:$1|अवतरण|अवतरण}}',

# Tooltip help for the actions
'tooltip-pt-userpage'             => 'मेरा सदस्य पन्ना',
'tooltip-pt-anonuserpage'         => 'आप जिस आईपी से बदलाव कर रहें हैं उसका सदस्य पान',
'tooltip-pt-mytalk'               => 'मेरी सदस्य वार्ता',
'tooltip-pt-anontalk'             => 'इस आईपी एड्रेससे हुए बदलावों के बारे में वार्ता',
'tooltip-pt-preferences'          => 'मेरी पसंद',
'tooltip-pt-watchlist'            => 'आपने ध्यान दिये हुए पन्नोंकी सूची',
'tooltip-pt-mycontris'            => 'मेरे योगदानकी सूची',
'tooltip-pt-login'                => 'आप लॉग इन करें, बल्कि यह अत्यावश्यक नहीं हैं.',
'tooltip-pt-anonlogin'            => 'आप लॉग इन करें, जबकि यह अत्यावश्यक नहीं हैं।',
'tooltip-pt-logout'               => 'लॉग आउट',
'tooltip-ca-talk'                 => 'कंटेंट पन्नेके बारेमें वार्तालाप',
'tooltip-ca-edit'                 => 'आप यह पन्ना बदल सकते हैं. कृपया बदलाव संजोनेसे पहले झलक देखें.',
'tooltip-ca-addsection'           => 'इस वार्तालापमें अपनी राय दें ।',
'tooltip-ca-viewsource'           => 'यह पन्ना सुरक्षित हैं । आप इसका स्रोत देख सकते हैं ।',
'tooltip-ca-history'              => 'इस पन्ने के पुराने अवतरण।',
'tooltip-ca-protect'              => 'इस पन्नेको सुरक्षित किजीयें',
'tooltip-ca-delete'               => 'इस पन्ने को हटाएं',
'tooltip-ca-undelete'             => 'इस पन्नेको हटाने से पहले किये गये बदलाव पुनर्स्थापित करें',
'tooltip-ca-move'                 => 'यह पन्ना स्थानांतरित किजीयें ।',
'tooltip-ca-watch'                => 'यह पन्ना अपनी ध्यानसूचीमें डालियें',
'tooltip-ca-unwatch'              => 'यह पन्ना अपने ध्यानसूचीसे हटाएं',
'tooltip-search'                  => '{{SITENAME}} में खोजियें',
'tooltip-search-go'               => 'अगर इस शीर्षक का पन्ना हैं तो उसपर चलें',
'tooltip-search-fulltext'         => 'यह पाठ होनेवाले लेख खोजें',
'tooltip-p-logo'                  => 'मुख पृष्ठ',
'tooltip-n-mainpage'              => 'मुखपृष्ठ पर जाए',
'tooltip-n-portal'                => 'प्रोजेक्ट के बारे में, आप क्या कर सकतें हैं, ख़ोजने की जगह',
'tooltip-n-currentevents'         => 'हालकी घटनाओंके पीछेकी जानकारी',
'tooltip-n-recentchanges'         => 'विकिमें हाल में हुए बदलावोंकी सूची.',
'tooltip-n-randompage'            => 'किसी एक लेख पर जाएँ',
'tooltip-n-help'                  => 'ख़ोजने की जगह.',
'tooltip-t-whatlinkshere'         => 'यहां जुडे सभी विकिपन्नोंकी सूची',
'tooltip-t-recentchangeslinked'   => 'यहां जुडे हुए सभी पन्नोंमें हुए हाल के बदलाव',
'tooltip-feed-rss'                => 'इस पन्ने का RSS फ़ीड',
'tooltip-feed-atom'               => 'इस पन्नेका Atom फ़ीड',
'tooltip-t-contributions'         => 'इस सदस्यके योगदानकी सूची देखियें',
'tooltip-t-emailuser'             => 'इस सदस्य को इमेल भेजें',
'tooltip-t-upload'                => 'फ़ाइल अपलोड करें',
'tooltip-t-specialpages'          => 'सभी खास पन्नोंकी सूची',
'tooltip-t-print'                 => 'इस पन्नेका छपानेलायक अवतरण',
'tooltip-t-permalink'             => 'इस अवतरणको स्थायी कड़ी',
'tooltip-ca-nstab-main'           => 'पाठ पन्ना देखें',
'tooltip-ca-nstab-user'           => 'सदस्य पन्ना देखियें',
'tooltip-ca-nstab-media'          => 'मीडिया पन्ने देखें',
'tooltip-ca-nstab-special'        => 'यह एक विशेष पृष्ठ हैं, आप इसे बदल नहीं सकतें हैं',
'tooltip-ca-nstab-project'        => 'प्रोजेक्ट पन्ना देखियें',
'tooltip-ca-nstab-image'          => 'फ़ाईल पन्ना देख़ें',
'tooltip-ca-nstab-mediawiki'      => 'प्रणाली संदेश देखें',
'tooltip-ca-nstab-template'       => 'टेम्प्लेट देखियें',
'tooltip-ca-nstab-help'           => 'सहायता पन्ने पर जाईयें',
'tooltip-ca-nstab-category'       => 'श्रेणियाँ पन्ना देखियें',
'tooltip-minoredit'               => 'इस बदलाव को छोटा बदलावके रूपमें दर्शायें',
'tooltip-save'                    => 'आपने किये बदलाव संजोयें',
'tooltip-preview'                 => 'आपने किये हुए बदलावोंकी झलक देखें, कृपया बदलाव संजोनेसे पहले इसका इस्तेमाल किजीयें!',
'tooltip-diff'                    => 'इस पाठ्यमें आपने किये हुए बदलाव देखें।',
'tooltip-compareselectedversions' => 'इस पन्नेके चुने हुए अवतरणोंमें फर्क दिखायें ।',
'tooltip-watch'                   => 'यह पन्ना अपनी ध्यानसूची में डालियें ।',
'tooltip-recreate'                => 'यह पन्ना पहले हटाया होने के बावजूद फिरसे बनायें',
'tooltip-upload'                  => 'अपलोड शुरू करें',

# Stylesheets
'common.css'   => '/* यहां रखी css सभी त्वचाओंपर असर करेगी */',
'monobook.css' => '/* यहां रखी गई css मोनोबुक त्वचा का इस्तेमाल करने वाले सभी सदस्योंपर असर करेगी */',

# Scripts
'common.js'   => '/* यहां लिखी गई जावास्क्रीप्ट सभी सदस्योंके लिये इस्तेमाल में लाई जायेगी। */',
'monobook.js' => '/* डिप्रिकेटेड;[[MediaWiki:common.js]] का इस्तेमाल करें */',

# Metadata
'nodublincore'      => 'Dublin Core RDF metadata इस सर्वर के लिये प्राप्त नहीं हैं।',
'nocreativecommons' => 'Creative Commons RDF metadata इस सर्वर के लिये प्राप्त नहीं हैं।',
'notacceptable'     => 'विकि सर्वर आपके क्लायंटको जिस प्रकारसे डाटा चाहिये उस प्रकारसे नहीं दे सकता।',

# Attribution
'anonymous'        => 'विकिपीडिया के अनाम सदस्य',
'siteuser'         => 'विकिपीडिया सदस्य  $1',
'lastmodifiedatby' => 'इस पन्नेका आखिरी बदलाव $3 ने $2, $1 इस समय पर किया।', # $1 date, $2 time, $3 user
'othercontribs'    => '$1 के कार्य के अनुसार।',
'others'           => 'अन्य',
'siteusers'        => 'विकिपीडिया सदस्य  $1',
'creditspage'      => 'पान श्रेय नामावली',
'nocredits'        => 'इस पन्ने के लिये क्रेडिट ज़ानकारी नहीं हैं।',

# Spam protection
'spamprotectiontitle' => 'स्पॅम सुरक्षा फिल्टर',
'spamprotectiontext'  => 'आप जिस पन्ने के बदलाव संजोना चाहते थे उसे स्पॅम सुरक्षा फिल्टर द्वारा रोका गया हैं।
यह शायद बाहरी वेबसाईट को दी हुई कड़ी के चलते हुआ हैं।',
'spamprotectionmatch' => 'नीचे दिये हुए पाठ को स्पॅम सुरक्षा फिल्टर द्वारा रोका गया था: $1',
'spambot_username'    => 'मीडियाविकि स्पॅम स्वच्छता',
'spam_reverting'      => '$1 को कड़ी ना होने वाले पुराने अवतरण को पुनर्स्थापित कर रहें हैं',
'spam_blanking'       => 'सभी अवतरणोंमें $1 को कड़ियां हैं, पूरा पाठ निकाल रहें हैं',

# Info page
'infosubtitle'   => 'पन्नेके बारे में ज़ानकारी',
'numedits'       => 'बदलावोंकी संख्या (पन्ना): $1',
'numtalkedits'   => 'बदलावों की संख्या (वार्ता पॄष्ठ): $1',
'numwatchers'    => 'पहरा देनेवालोंकी संख्या: $1',
'numauthors'     => 'अलग लेखकोंकी संख्या (पन्ना): $1',
'numtalkauthors' => 'अलग लेखकोंकी संख्या (वार्ता पन्ना): $1',

# Math options
'mw_math_png'    => 'हमेशा PNG बनायें',
'mw_math_simple' => 'HTML अलग आसानी से बनें या फिर PNG बनायें',
'mw_math_html'   => 'HTML अगर हो सकें तो अन्यथा PNG',
'mw_math_source' => 'उसे TeX ही रखियें (पाठ ब्राउज़र के लिये)',
'mw_math_modern' => 'आधुनिक ब्राउज़रके लिये उपयुक्त',
'mw_math_mathml' => 'MathML अगर हो सके तो (प्रायोगिक)',

# Patrolling
'markaspatrolleddiff'                 => 'देख लिया ऐसा मार्क करें',
'markaspatrolledtext'                 => 'इस पन्ने को देख लिया ऐसा मार्क करें',
'markedaspatrolled'                   => 'देख लिया ऐसा मार्क करें',
'markedaspatrolledtext'               => 'चुने हुए अवतरणपर देखा गया का मार्क किया।',
'rcpatroldisabled'                    => 'हाल में हुए बदलावों पर नजर रखना बंद कर दिया हैं',
'rcpatroldisabledtext'                => 'हाल में हुए बदलावोंपर नजर रखने की सुविधा बंद कर दी ग‍ईं हैं।',
'markedaspatrollederror'              => 'देख लिया ऐसा मार्क नहीं कर पायें',
'markedaspatrollederrortext'          => 'नजर रखने के लिये आपको एक अवतरणको चुनना होगा।',
'markedaspatrollederror-noautopatrol' => 'आप खुद अपने बदलावोंपर नजर नहीं रख सकतें हैं।',

# Patrol log
'patrol-log-page' => 'नजर रखनेकी सूची',
'patrol-log-line' => '$2 के $1 अवतरण पर नजर रखी $3',
'patrol-log-auto' => '(अपनेआप)',

# Image deletion
'deletedrevision'                 => 'पुराना अवतरण $1 हटा दिया',
'filedeleteerror-short'           => 'फ़ाईल हटानेमें समस्या: $1',
'filedeleteerror-long'            => 'फ़ाईल हटानेमें आईं समस्यायें:

$1',
'filedelete-missing'              => 'फ़ाईल "$1" को हटा नहीं सकते, क्योकि यह अस्तित्व में नहीं हैं।',
'filedelete-old-unregistered'     => 'बताया गया "$1" अवतरण डाटाबेस में मिला नहीं।',
'filedelete-current-unregistered' => 'बताई गई "$1" फ़ाईल डाटाबेसमें नहीं हैं।',
'filedelete-archive-read-only'    => 'आर्चिव्ह डाइरेक्टरी "$1" पर वेबसर्वर लिख नहीं पा रहा हैं।',

# Browsing diffs
'previousdiff' => '← पिछला अंतर',
'nextdiff'     => 'अगला अंतर →',

# Media information
'mediawarning'         => "'''सूचना''': इस फ़ाईलमें गलत कोड होने की आशंका हैं, इसे चलानेसे आपके सिस्टममें परेशानियां हो सकती हैं।<hr />",
'imagemaxsize'         => 'फ़ाईल ज़ानकारी पन्नेपर ज्यादा से ज्यादा दिखायें जाने वाले चित्र:',
'thumbsize'            => 'थंबनेल का आकार:',
'widthheightpage'      => '$1×$2, $3 {{PLURAL:$3|पन्ना|पन्ने}}',
'file-info'            => '(फ़ाईल का आकार: $1, MIME प्रकार: $2)',
'file-info-size'       => '($1 × $2 पीक्सेल, फ़ाईल का आकार: $3, MIME प्रकार: $4)',
'file-nohires'         => '<small>इससे ज्यादा रिज़ोल्यूशन उपलब्ध नहीं हैं.</small>',
'svg-long-desc'        => '(SVG फ़ाईल, साधारणत: $1 × $2 पीक्सेल्स, फ़ाईलका आकार: $3)',
'show-big-image'       => 'सम्पूर्ण रिज़ोल्यूशन',
'show-big-image-thumb' => '<small>इस झलक का आकार: $1 × $2 पीक्सेल्स</small>',

# Special:NewImages
'newimages'             => 'नई फ़ाईल्सकी गैलरी',
'imagelisttext'         => "नीचे $2 के नुसार '''$1''' {{PLURAL:$1|फ़ाईल दी है।|फ़ाईलें दी हुईं हैं।}}",
'newimages-summary'     => 'यह विशेष पन्ना हाल में अपलोड हुई फ़ाईलोंकी सूची दर्शाता हैं',
'showhidebots'          => '(बोट्स $1)',
'noimages'              => 'देखनेके लिये कुछ भी नहीं हैं।',
'ilsubmit'              => 'खोज',
'bydate'                => 'दिनांक के अनुसार',
'sp-newimages-showfrom' => '$2, $1 के बाद की फ़ाईलें दर्शायें',

# Bad image list
'bad_image_list' => 'रूपरेख़ा नीचे दी गई है:

सिर्फ सूचीमें होनेवाली फ़ाईल्स (जिनके आगे * यह लिखा गया है) ध्यानमें ली गई हैं । लाईनमें पहली कड़ि गलत फ़ाईल की होनी चाहिये ।

आगे की कड़ियाँ अपवाद है, मतलब ऐसे पन्ने जहां यह फ़ाईल मिल सकती है.',

# Metadata
'metadata'          => 'मेटाडाटा',
'metadata-help'     => 'इस फ़ाईलमें बढ़ाई हुई जानकारी हैं, हो सकता है कि यह फ़ाईल बनानेमें इस्तेमाल किये गए स्कैनर अथवा कैमेरा से यह प्राप्त हुई हैं । अगर यह फ़ाईल बदलदी गई हैं तो यह जानकारी नई फ़ाईलसे मेल नहीं खाने की आशंका हैं ।',
'metadata-expand'   => 'बढ़ाई हुई जानकारी दिखायें',
'metadata-collapse' => 'बढ़ाई हुई जानकारीको छुपायें',
'metadata-fields'   => 'इस सूची में दी गई जानकारी फ़ाईलके नीचे मेटाडाटा जानकारीमें हमेशा दिखेगी ।
बची हुई जानकारी हमेशा छुपाई हुई रहेगी ।
* make
* model
* datetimeoriginal
* exposuretime
* fnumber
* focallength', # Do not translate list items

# EXIF tags
'exif-imagewidth'                  => 'चौडाई',
'exif-imagelength'                 => 'उंचाई',
'exif-bitspersample'               => 'प्रति घटक बीट्स',
'exif-compression'                 => 'कम्प्रेशन योजना',
'exif-photometricinterpretation'   => 'पिक्सेल कॉम्पोझीशन',
'exif-orientation'                 => 'ओरिएंटेशन',
'exif-samplesperpixel'             => 'घटकोंकी संख्या',
'exif-planarconfiguration'         => 'डाटा रचना',
'exif-ycbcrsubsampling'            => 'Y का C के साथ सबसॅम्पलींग अनुमान',
'exif-ycbcrpositioning'            => 'Y और C का पोज़िशनिंग',
'exif-xresolution'                 => 'होरिज़ॉंटल रिज़ोल्यूशन',
'exif-yresolution'                 => 'व्हर्टिकल रिज़ोल्यूशन',
'exif-resolutionunit'              => 'X और Y रिज़ोल्यूशन का मानक प्रमाण',
'exif-stripoffsets'                => 'चित्र डाटा स्थान',
'exif-rowsperstrip'                => 'हर स्ट्रीपमें कतारोंकी संख्या',
'exif-stripbytecounts'             => 'कॉम्प्रेस्स्ड स्ट्रीपमें बाईट्स',
'exif-jpeginterchangeformat'       => 'JPEG SOI के लिये ऑफसेट',
'exif-jpeginterchangeformatlength' => 'JPEG डाटाके बाईट्स',
'exif-transferfunction'            => 'ट्रान्स्फर फंक्शन',
'exif-whitepoint'                  => 'सफेद बिंदू क्रोमॅटिसिटी',
'exif-primarychromaticities'       => 'क्रोमॅटिसिटीज ऑफ प्राईमारिटीज',
'exif-ycbcrcoefficients'           => 'कलर स्पेस ट्रान्स्फॉर्मेशन मॅट्रीक्स कोएफिशीयंट्स',
'exif-referenceblackwhite'         => 'काले और सफेद संदर्भ मूल्योंकी जोड़ी',
'exif-datetime'                    => 'फ़ाईल बदलाव दिनांक और समय',
'exif-imagedescription'            => 'चित्र शीर्षक',
'exif-make'                        => 'कैमेरा उत्पादक',
'exif-model'                       => 'कैमेरा मॉडेल',
'exif-software'                    => 'इस्तेमाल किया हुआ सॉफ्टवेयर',
'exif-artist'                      => 'लेखक',
'exif-copyright'                   => 'कोपीराईट का धारक',
'exif-exifversion'                 => 'Exif अवतरण',
'exif-flashpixversion'             => 'सपोर्टेड फ्लॅशपीक्स अवतरण',
'exif-colorspace'                  => 'रंग स्थान',
'exif-componentsconfiguration'     => 'हर घटक का मतलब',
'exif-compressedbitsperpixel'      => 'चित्र कॉम्प्रेशन मोड',
'exif-pixelydimension'             => 'चित्रकी वैध चौड़ाई',
'exif-pixelxdimension'             => 'चित्रकी वैध उंचाई',
'exif-makernote'                   => 'उत्पादककी टिप्पणी',
'exif-usercomment'                 => 'सदस्य टिप्पणी',
'exif-relatedsoundfile'            => 'संबंधित ध्वनी फ़ाईल',
'exif-datetimeoriginal'            => 'डाटा बनाने का दिनांक और समय',
'exif-datetimedigitized'           => 'डिजिटाईज़िंग का दिनांक और समय',
'exif-subsectime'                  => 'दिनांकसमय उपसेकंद',
'exif-subsectimeoriginal'          => 'मूलदिनांकसमय उपसेकंड',
'exif-subsectimedigitized'         => 'दिनांकसमयडिजिटाईज्ड उपसेकेंड',
'exif-exposuretime'                => 'एक्स्पोज़र समय',
'exif-exposuretime-format'         => '$1 सेकंड ($2)',
'exif-fnumber'                     => 'F संख्या',
'exif-exposureprogram'             => 'एक्स्पोज़र प्रोग्रेम',
'exif-spectralsensitivity'         => 'स्पेक्ट्रल सेन्सिटीव्हिटी',
'exif-isospeedratings'             => 'ISO गती मूल्यमापन',
'exif-oecf'                        => 'ऑप्टोईलेक्ट्रॉनिक कन्व्हर्शन फॅक्टर',
'exif-shutterspeedvalue'           => 'शटरकी गती',
'exif-aperturevalue'               => 'ऍपर्चर',
'exif-brightnessvalue'             => 'ब्राईटनेस',
'exif-exposurebiasvalue'           => 'एक्सपोजर बायस',
'exif-maxaperturevalue'            => 'ज्यादासे ज्यादा लॅंड ऍपर्चर',
'exif-subjectdistance'             => 'सब्जेक्टसे अंतर',
'exif-meteringmode'                => 'मीटरींग मोड',
'exif-lightsource'                 => 'प्रकाश स्रोत',
'exif-flash'                       => 'फ्लॅश',
'exif-focallength'                 => 'लेन्स की फोकल लंबाई',
'exif-subjectarea'                 => 'सब्जेक्ट एरिया',
'exif-flashenergy'                 => 'फ्लॅश एनर्जी',
'exif-spatialfrequencyresponse'    => 'स्पॅशिअल फ्रिक्वेन्सी रिस्पॉन्स',
'exif-focalplanexresolution'       => 'फोकल प्लेन x रिज़ोल्यूशन',
'exif-focalplaneyresolution'       => 'फोकल प्लेन Y रिज़ोल्यूशन',
'exif-focalplaneresolutionunit'    => 'फोकल प्लेन रिज़ोल्यूशन एकक',
'exif-subjectlocation'             => 'सब्जेक्टका स्थान',
'exif-exposureindex'               => 'एक्स्पोज़र इन्डेक्स',
'exif-sensingmethod'               => 'सेन्सींग पद्धती',
'exif-filesource'                  => 'फ़ाईल स्रोत',
'exif-scenetype'                   => 'सीनका प्रकार',
'exif-cfapattern'                  => 'CFA पॅटर्न',
'exif-customrendered'              => 'कस्टम इमेज प्रोसेसिंग',
'exif-exposuremode'                => 'एक्स्पोज़र मोड',
'exif-whitebalance'                => 'व्हाईट बॅलन्स',
'exif-digitalzoomratio'            => 'डिजिटल झूम अनुमान',
'exif-focallengthin35mmfilm'       => '३५ मी.मी. फ़ील्ममें फोकल लंबाई',
'exif-scenecapturetype'            => 'सीन कॅप्चर प्रकार',
'exif-gaincontrol'                 => 'सीन नियंत्रण',
'exif-contrast'                    => 'कॉन्ट्रास्ट',
'exif-saturation'                  => 'सॅचूरेशन',
'exif-sharpness'                   => 'शार्पनेस',
'exif-devicesettingdescription'    => 'उपकरण रचना वर्णन',
'exif-subjectdistancerange'        => 'सब्जेक्ट डिस्टन्स रेंज',
'exif-imageuniqueid'               => 'यूनिक चित्र ID',
'exif-gpsversionid'                => 'GPS टॅग अवतरण',
'exif-gpslatituderef'              => 'उत्तर या दक्षिण अक्षांश',
'exif-gpslatitude'                 => 'अक्षांश',
'exif-gpslongituderef'             => 'पूर्व या पश्चिम रेखांश',
'exif-gpslongitude'                => 'रेखांश',
'exif-gpsaltituderef'              => 'अल्टिट्यूड संदर्भ',
'exif-gpsaltitude'                 => 'अल्टिट्यूड',
'exif-gpstimestamp'                => 'GPS समय (एटोमिक क्लॉक)',
'exif-gpssatellites'               => 'मापनके लिये इस्तेमाल किया हुआ सैटेलाईट',
'exif-gpsstatus'                   => 'प्राप्तकर्ता की स्थिती',
'exif-gpsmeasuremode'              => 'मेज़रमेंट मोड',
'exif-gpsdop'                      => 'मेज़रमेंट प्रिसिजन',
'exif-gpsspeedref'                 => 'गती एकक',
'exif-gpsspeed'                    => 'GPS रिसिवर की गती',
'exif-gpstrackref'                 => 'मूवमेंट दिशाके लिये संदर्भ',
'exif-gpstrack'                    => 'मूवमेंट डाइरेक्शन',
'exif-gpsimgdirectionref'          => 'चित्रके दिशा का संदर्भ',
'exif-gpsimgdirection'             => 'चित्र की दिशा',
'exif-gpsmapdatum'                 => 'जियोडेटिक सर्वे डाटा इस्तेमाल किया गया',
'exif-gpsdestlatituderef'          => 'लक्ष्यके अक्षांशका संदर्भ',
'exif-gpsdestlatitude'             => 'अक्षांश लक्ष्य',
'exif-gpsdestlongituderef'         => 'लक्ष्यके रेखांशका संदर्भ',
'exif-gpsdestlongitude'            => 'लक्ष्य का रेखांश',
'exif-gpsdestbearingref'           => 'लक्ष्य के बियरींग का संदर्भ',
'exif-gpsdestbearing'              => 'लक्ष्यका बेअरिंग',
'exif-gpsdestdistanceref'          => 'लक्ष्य के अंतर का संदर्भ',
'exif-gpsdestdistance'             => 'लक्ष्य का अंतर',
'exif-gpsprocessingmethod'         => 'GPS प्रक्रीया पद्धतीका नाम',
'exif-gpsareainformation'          => 'GPS विभागका नाम',
'exif-gpsdatestamp'                => 'GPS दिनांक',
'exif-gpsdifferential'             => 'GPS डिफरन्शियर करेक्शन',

# EXIF attributes
'exif-compression-1' => 'अनकॉम्प्रेस्स्ड',

'exif-unknowndate' => 'अज्ञात तारीख',

'exif-orientation-1' => 'सामान्य', # 0th row: top; 0th column: left
'exif-orientation-2' => 'हॉरिज़ॉन्टली बदला', # 0th row: top; 0th column: right
'exif-orientation-3' => '180° घूमाया', # 0th row: bottom; 0th column: right
'exif-orientation-4' => 'वर्टिकली बदला', # 0th row: bottom; 0th column: left
'exif-orientation-5' => '90° CCW घूमाया और वर्टिकली बदला', # 0th row: left; 0th column: top
'exif-orientation-6' => '90° CW घूमाया', # 0th row: right; 0th column: top
'exif-orientation-7' => '90° CW घूमाया और वर्टिकली बदला', # 0th row: right; 0th column: bottom
'exif-orientation-8' => '90° CCW घूमाया', # 0th row: left; 0th column: bottom

'exif-planarconfiguration-1' => 'चंकी फ़रमैट',
'exif-planarconfiguration-2' => 'प्लेनर फ़रमैट',

'exif-componentsconfiguration-0' => 'अस्तित्वमें नहीं',

'exif-exposureprogram-0' => 'अव्यक्त',
'exif-exposureprogram-1' => 'मैन्युअल',
'exif-exposureprogram-2' => 'सामान्य प्रोग्रॅम',
'exif-exposureprogram-3' => 'ऍपर्चर प्राथमिकता',
'exif-exposureprogram-4' => 'शटर प्राथमिकता',
'exif-exposureprogram-5' => 'क्रियेटीव्ह कार्यक्रम (फ़ील्ड की डेप्थ की तरफ बायस्‌ड)',
'exif-exposureprogram-6' => 'ऐक्शन कार्यक्रम (शटर की गती की तरफ बायस्‌ड)',
'exif-exposureprogram-7' => 'पोर्ट्रेट मोड (क्लोज़‍अप फ़ोटो के लिये)',
'exif-exposureprogram-8' => 'लैंडस्केप मोड (बैकग्राउंड के साथ लैंडस्केप फोटो)',

'exif-subjectdistance-value' => '$1 मीटर',

'exif-meteringmode-0'   => 'अज्ञात',
'exif-meteringmode-1'   => 'ऍव्हरेज',
'exif-meteringmode-2'   => 'सेंटरवेटेडएवरेज',
'exif-meteringmode-3'   => 'स्पॉट',
'exif-meteringmode-4'   => 'मल्टीस्पॉट',
'exif-meteringmode-5'   => 'पॅटर्न',
'exif-meteringmode-6'   => 'पार्शिअल',
'exif-meteringmode-255' => 'अन्य',

'exif-lightsource-0'   => 'अज्ञात',
'exif-lightsource-1'   => 'सूर्यप्रकाश',
'exif-lightsource-2'   => 'फ्लूरोसेंट',
'exif-lightsource-3'   => 'टंगस्ट्न (इनकॅन्‍डेसेंट प्रकाश)',
'exif-lightsource-4'   => 'फ्लॅश',
'exif-lightsource-9'   => 'अच्छा वातावरण',
'exif-lightsource-10'  => 'बादलसे युक्त वातावरण',
'exif-lightsource-11'  => 'शेड',
'exif-lightsource-12'  => 'डेलाईट फ्लूरोसेंट (D 5700 – 7100K)',
'exif-lightsource-13'  => 'डे व्हाईट फ्लूरोसेंट (N 4600 – 5400K)',
'exif-lightsource-14'  => 'कूल व्हाईट फ्लूरोसेंट (W 3900 – 4500K)',
'exif-lightsource-15'  => 'व्हाईट फ्लूरोसेंट (WW 3200 – 3700K)',
'exif-lightsource-17'  => 'प्रमाण प्रकाश A',
'exif-lightsource-18'  => 'प्रमाण प्रकाश B',
'exif-lightsource-19'  => 'प्रमाण प्रकाश C',
'exif-lightsource-21'  => 'D75',
'exif-lightsource-24'  => 'ISO स्टूडीयो टंगस्टन',
'exif-lightsource-255' => 'अन्य प्रकाश स्रोत',

'exif-focalplaneresolutionunit-2' => 'इंच',

'exif-sensingmethod-1' => 'अव्यक्त',
'exif-sensingmethod-2' => 'वन चीप कलर एरीया सेन्‍सर',
'exif-sensingmethod-3' => 'टू चीप कलर एरीया सेन्‍सर',
'exif-sensingmethod-4' => 'थ्री चीप कलर एरीया सेन्‍सर',
'exif-sensingmethod-5' => 'कलर सिक्वेण्शीयल एरीया सेंसर',
'exif-sensingmethod-7' => 'ट्रायलिनीयर सेंसर',
'exif-sensingmethod-8' => 'कलर सिक्वेंशीयल लिनीयर सेन्‍सर',

'exif-scenetype-1' => 'डायरेक्टली छायाचित्रीत चित्र',

'exif-customrendered-0' => 'सामान्य प्रक्रिया',
'exif-customrendered-1' => 'कस्टम प्रक्रिया',

'exif-exposuremode-0' => 'ऑटो एक्स्पोज़र',
'exif-exposuremode-1' => 'मैन्युअल एक्पोज़र',
'exif-exposuremode-2' => 'ऑटो ब्रॅकेट',

'exif-whitebalance-0' => 'ऑटो व्हाईट बैलेन्स',
'exif-whitebalance-1' => 'मॅन्यूअल व्हाईट बॅलेन्स',

'exif-scenecapturetype-0' => 'स्टॅन्डर्ड',
'exif-scenecapturetype-1' => 'लैंडस्केप',
'exif-scenecapturetype-2' => 'पोर्ट्रेट',
'exif-scenecapturetype-3' => 'नाईट सीन',

'exif-gaincontrol-0' => 'बिल्कुल नहीं',
'exif-gaincontrol-1' => 'लो गेन अप',
'exif-gaincontrol-2' => 'हाय गेन अप',
'exif-gaincontrol-3' => 'लो गेन डाउन',
'exif-gaincontrol-4' => 'हाय गेन डाउन',

'exif-contrast-0' => 'सामान्य',
'exif-contrast-1' => 'सॉफ्ट',
'exif-contrast-2' => 'हार्ड',

'exif-saturation-0' => 'सामान्य',
'exif-saturation-1' => 'निम्न सैचुरेशन',
'exif-saturation-2' => 'उच्च सैचुरेशन',

'exif-sharpness-0' => 'साधारण',
'exif-sharpness-1' => 'मृदू',
'exif-sharpness-2' => 'कठीन',

'exif-subjectdistancerange-0' => 'अज्ञात',
'exif-subjectdistancerange-1' => 'मैक्रो',
'exif-subjectdistancerange-2' => 'नजदीक से देखें',
'exif-subjectdistancerange-3' => 'दूर से देखें',

# Pseudotags used for GPSLatitudeRef and GPSDestLatitudeRef
'exif-gpslatitude-n' => 'उत्तरी अक्षांश',
'exif-gpslatitude-s' => 'दक्षिणी अक्षांश',

# Pseudotags used for GPSLongitudeRef and GPSDestLongitudeRef
'exif-gpslongitude-e' => 'पूर्वी रेखांश',
'exif-gpslongitude-w' => 'पश्चिमी रेखांश',

'exif-gpsstatus-a' => 'मेज़रमेंट चल रहा हैं',
'exif-gpsstatus-v' => 'मेज़रमेंट इन्टरोपरेबिलीटी',

'exif-gpsmeasuremode-2' => '२-बाजूओंवाली मेज़रमेंट',
'exif-gpsmeasuremode-3' => '३-बाजूओंवाली मेज़रमेंट',

# Pseudotags used for GPSSpeedRef and GPSDestDistanceRef
'exif-gpsspeed-k' => 'कि.मी. प्रति घंटा',
'exif-gpsspeed-m' => 'मील प्रति घंटा',
'exif-gpsspeed-n' => 'गांठ',

# Pseudotags used for GPSTrackRef, GPSImgDirectionRef and GPSDestBearingRef
'exif-gpsdirection-t' => 'असली दिशा',
'exif-gpsdirection-m' => 'मैग्नेटिक दिशा',

# External editor support
'edit-externally'      => 'बाहरी प्रणालीका इस्तेमाल करते हुए इस फ़ाईल को संपादित करें ।',
'edit-externally-help' => 'अधिक जानकारीके लिये [http://www.mediawiki.org/wiki/Manual:External_editors सेट‍अप जानकारीयाँ] देखें ।',

# 'all' in various places, this might be different for inflected languages
'recentchangesall' => 'सभी',
'imagelistall'     => 'सभी',
'watchlistall2'    => 'सभी',
'namespacesall'    => 'सभी',
'monthsall'        => 'सभी',

# E-mail address confirmation
'confirmemail'             => 'ई-मेल प्रमाणित करे',
'confirmemail_noemail'     => 'आपके [[Special:Preferences|सदस्य वरीयतायें]]में वैध इ-मेल एड्रेस नहीं दिया हुआ हैं।',
'confirmemail_text'        => '{{SITENAME}} पर उपलब्ध इ-मेल सुविधाओंका लाभ उठाने के लिये प्रमाणित एड्रेस होना जरूरी हैं।
आपके एड्रेस पर एक कन्फर्मेशन कोड भेजने के लिये नीचे दिये बटन पर क्लिक करें।
उस मेल में एक कोड से लदी एक कड़ी होगी;
आपके इ-मेल के प्रमाणिकरण के लिये इसे अपने ब्राउज़रमें खोलें।',
'confirmemail_pending'     => '<div class="error">आपको पहलेसे ही एक कन्फर्मेशन कोड भेजा गया हैं;
अगर आपने हालमें खाता खोला हैं, तो नये कोड की माँग करने से पहले कुछ पल उसका इंतज़ार करें।</div>',
'confirmemail_send'        => 'एक कन्फर्मेशन कोड भेजें',
'confirmemail_sent'        => 'कन्फर्मेशन इ-मेल भेज दिया।',
'confirmemail_oncreate'    => 'आपके इ-मेल पते पर एक कन्फर्मेशन कोड भेजा गया हैं।
लॉग इन करने के लिये इसकी आवश्यकता नहीं हैं, पर इस विकिपर उपलब्ध इ-मेल आधारित सुविधाओंका इस्तेमाल करने के लिये यह देना जरूरी हैं।',
'confirmemail_sendfailed'  => 'कन्फर्मेशन इ-मेल भेज नहीं पायें।
कृपया गलतीयोंके लिये इ-मेल एड्रेस जाँचें।

मेलर ने दिया: $1',
'confirmemail_invalid'     => 'गलत कन्फर्मेशन कोड।
कोड रद्द हो गया होने की संभावना हैं।',
'confirmemail_needlogin'   => 'आपका इ-मेल पता प्रमाणित करने के लिये, आपको $1 करना पडेगा।',
'confirmemail_success'     => 'आपका इ-मेल पता अभी प्रमाणित हो गया हैं।
अभी आप लॉग इन करके विकि का मज़ा ले सकतें हैं।',
'confirmemail_loggedin'    => 'आपके इ-मेल एड्रेस का प्रमाणिकरण पूरा हो गया हैं।',
'confirmemail_error'       => 'आपकी निश्चिती संजोते समय कुछ गलती हुई हैं।',
'confirmemail_subject'     => '{{SITENAME}} इ-मेल एड्रेस प्रमाणिकरण',
'confirmemail_body'        => 'किसीने, शायद आपने,  $1 आइपी एड्रेस से,
{{SITENAME}} पर  "$2" इस नाम से खाता खोलने की माँग की हैं।

यह खाता आपही का हैं और {{SITENAME}} पर उपलब्ध इ-मेल
सुविधा शुरू करने के लिये, नीचे दी गई कड़ी अपने ब्राउज़रमें खोलें:

$3

अगर यह माँग आपने *नहीं* की हैं, तो इसे रद्द करने के लिये
नीचे दी हुई कड़ी खोलें:

$5

यह निश्चिती कोड $4 को समाप्त हो जायेगा।',
'confirmemail_invalidated' => 'इ-मेल एड्रेस प्रमाणिकरण रद्द कर दिया गया हैं',
'invalidateemail'          => 'इ-मेल प्रमाणिकरण रद्द करें',

# Scary transclusion
'scarytranscludedisabled' => '[आंतरविकि ट्रान्स्क्लुडिंग बंद हैं]',
'scarytranscludefailed'   => '[$1 के लिये साचा मंगा नहीं पायें; माफ किजीये]',
'scarytranscludetoolong'  => '[URL बहुत लंबी; माफ किजीये]',

# Trackbacks
'trackbackbox'      => '<div id="mw_trackbacks">इस पन्ने के लिये ट्रैकबैक:<br />$1</div>',
'trackbackremove'   => ' ([$1 हटायें])',
'trackbacklink'     => 'ट्रैकबैक',
'trackbackdeleteok' => 'ट्रैकबैक को हटाया गया।',

# Delete conflict
'deletedwhileediting' => 'सूचना: आपके द्वारा संपादन शुरू होने के बाद यह पन्ना हटाया गया हैं!',
'confirmrecreate'     => "सदस्य [[User:$1|$1]] ([[User talk:$1|वार्ता]]) ने आपके द्वारा संपादन शुरू होने के बाद यह पन्ना निम्नलिखित कारण देकर हटाया हैं:
: ''$2''
क्या आप इसे फिरसे बनाना चाहतें हैं, इसकी निश्चिती करें।",
'recreate'            => 'फिरसे बनायें',

# HTML dump
'redirectingto' => '[[:$1]] की तरफ़ भेज रहें हैं...',

# action=purge
'confirm_purge'        => 'क्या आप यह पृष्ठ का कैश ख़ाली करने चाहिए?

$1',
'confirm_purge_button' => 'ओके',

# AJAX search
'searchcontaining' => 'उन लेखों को खोजे जिनमे $1 हो।',
'searchnamed'      => "''$1'' नाम से शुरू होने वाले पन्ने खोजें",
'articletitles'    => "लेख जो ''$1'' से शुरु होते हैं",
'hideresults'      => 'रिज़ल्ट छुपायें',
'useajaxsearch'    => 'AJAX खोज का इस्तेमाल करें',

# Separators for various lists, etc.
'autocomment-prefix' => '-',

# Multipage image navigation
'imgmultipageprev' => '← पिछला पन्ना',
'imgmultipagenext' => 'अगला पन्ना →',
'imgmultigo'       => 'जायें!',
'imgmultigoto'     => '$1 पन्ने पर जायें',

# Table pager
'ascending_abbrev'         => 'asc',
'descending_abbrev'        => 'ज़ानकारी',
'table_pager_next'         => 'अगला पन्ना',
'table_pager_prev'         => 'पिछला पन्ना',
'table_pager_first'        => 'पहला पन्ना',
'table_pager_last'         => 'आखिरी पन्ना',
'table_pager_limit'        => 'एक पन्नेपर $1 आइटम दर्शायें',
'table_pager_limit_submit' => 'जायें',
'table_pager_empty'        => 'रिज़ल्ट नहीं',

# Auto-summaries
'autosumm-blank'   => 'पृष्ठ से सम्पूर्ण विषयवस्तु हटा रहा है',
'autosumm-replace' => "पृष्ठ को '$1' से बदल रहा है।",
'autoredircomment' => '[[$1]] को अनुप्रेषित',
'autosumm-new'     => 'नया पृष्ठ: $1',

# Size units
'size-bytes'     => '$1 B',
'size-kilobytes' => '$1 KB',
'size-megabytes' => '$1 MB',
'size-gigabytes' => '$1 GB',

# Live preview
'livepreview-loading' => 'लोड हो रहा हैं...',
'livepreview-ready'   => 'लोड हो रहा हैं... तैयार!',
'livepreview-failed'  => 'लाइव झलक नहीं दिखा पायें। साधारण झलक देखें।',
'livepreview-error'   => 'संपर्क नहीं कर पायें: $1 "$2"। साधारण झलक देखें।',

# Friendlier slave lag warnings
'lag-warn-normal' => '$1 सैकेंदोंसे नये बदलाव इस सूची में शायद नहीं दर्शायें जायेंगे।',
'lag-warn-high'   => 'डाटाबेस के ज्यादा लैग के कारण, $1 सैकेंदोंसे नये बदलाव इस सूची में शायद नहीं दर्शायें जायेंगे।',

# Watchlist editor
'watchlistedit-numitems'       => 'आपकी ध्यानसूची में {{PLURAL:$1|1 शीर्षक|$1 शीर्षक}} हैं, जिसमें वार्ता पृष्ठ नहीं गिनें हैं।',
'watchlistedit-noitems'        => 'आपकी ध्यानसूचीमें शीर्षक नहीं हैं।',
'watchlistedit-normal-title'   => 'ध्यानसूची बदलें',
'watchlistedit-normal-legend'  => 'ध्यानसूची से शीर्षक हटायें',
'watchlistedit-normal-explain' => 'आपकी ध्यानसूची में उपलब्ध शीर्षक नीचे दिये गये हैं।
एक शीर्षक हटाने के लिये, उसके आगे दिये बक्से पर क्लिक करें, और शीर्षक हटायें पर क्लिक करें।
आप [[Special:Watchlist/raw|कच्ची ध्यानसूची का संपादन]] भी कर सकतें हैं।',
'watchlistedit-normal-submit'  => 'शीर्षक हटायें',
'watchlistedit-normal-done'    => 'आपकी ध्यानसूचीसे {{PLURAL:$1|1शीर्षक|$1 शीर्षक}} हटा दिये:',
'watchlistedit-raw-title'      => 'कच्ची ध्यानसूची बदलें',
'watchlistedit-raw-legend'     => 'कच्ची ध्यानसूची बदलें',
'watchlistedit-raw-explain'    => 'आपकी ध्यानसूची में उपलब्ध शीर्षक नीचे दिये गये हैं, और वे सूची से निकालकर या बढाकर बदलें जा सकतें हैं;
हर लाइन पर एक शीर्षक देकर।
जब खतम हो जायें, तो ध्यानसूची अपडेट पर क्लिक करें।
आप [[Special:Watchlist/edit|स्टैण्डर्ड संपादक का इस्तेमाल]] भी कर सकतें हैं।',
'watchlistedit-raw-titles'     => 'शीर्षक:',
'watchlistedit-raw-submit'     => 'ध्यानसूची अपडेट करें',
'watchlistedit-raw-done'       => 'आपकी ध्यानसूची अपडेट कर दी गई हैं',
'watchlistedit-raw-added'      => '{{PLURAL:$1|1शीर्षक|$1 शीर्षक}} बढा दिये:',
'watchlistedit-raw-removed'    => '{{PLURAL:$1|1शीर्षक|$1 शीर्षक}} हटा दिये:',

# Watchlist editing tools
'watchlisttools-view' => 'आधारित बदलाव देखें',
'watchlisttools-edit' => 'ध्यानसूची देखें एवं संपादित करें',
'watchlisttools-raw'  => 'रॉ ध्यानसूची देखें एवम्‌ संपादित करें',

# Iranian month names
'iranian-calendar-m1'  => 'फ़र्वर्दिन',
'iranian-calendar-m2'  => 'ओर्दिबेहेश्ट',
'iranian-calendar-m3'  => 'खोर्दाद',
'iranian-calendar-m4'  => 'तीर',
'iranian-calendar-m5'  => 'मोर्दाद',
'iranian-calendar-m6'  => 'शाहरीवार',
'iranian-calendar-m7'  => 'मेहर',
'iranian-calendar-m8'  => 'अबान',
'iranian-calendar-m9'  => 'अज़र',
'iranian-calendar-m10' => 'डे',
'iranian-calendar-m11' => 'बाहमान',
'iranian-calendar-m12' => 'एसफण्ड (Esfand)',

# Hebrew month names
'hebrew-calendar-m1'      => 'तिश्रेई (Tishrei)',
'hebrew-calendar-m2'      => 'शेस्वान (Cheshvan)',
'hebrew-calendar-m3'      => 'किस्लेव (Kislev)',
'hebrew-calendar-m4'      => 'टेवेट (Tevet)',
'hebrew-calendar-m5'      => 'शेवट (Shevat)',
'hebrew-calendar-m6'      => 'अडार',
'hebrew-calendar-m6a'     => 'अडार I (Adar)',
'hebrew-calendar-m6b'     => 'अडार II (Adar)',
'hebrew-calendar-m7'      => 'निसान (Nisan)',
'hebrew-calendar-m8'      => 'अय्यर (Iyar)',
'hebrew-calendar-m9'      => 'सिवान (Sivan)',
'hebrew-calendar-m10'     => 'तामुज़ (Tamuz)',
'hebrew-calendar-m11'     => 'एवी (Av)',
'hebrew-calendar-m12'     => 'एलुल (Elul)',
'hebrew-calendar-m1-gen'  => 'तिश्रेई (Tishrei)',
'hebrew-calendar-m2-gen'  => 'शेस्वान (Cheshvan)',
'hebrew-calendar-m3-gen'  => 'किस्लेव (Kislev)',
'hebrew-calendar-m4-gen'  => 'टेवेट (Tevet)',
'hebrew-calendar-m5-gen'  => 'शेवट (Shevat)',
'hebrew-calendar-m6-gen'  => 'अडार',
'hebrew-calendar-m6a-gen' => 'अडार I (Adar)',
'hebrew-calendar-m6b-gen' => 'अडार II (Adar)',
'hebrew-calendar-m7-gen'  => 'निसान (Nisan)',
'hebrew-calendar-m8-gen'  => 'अय्यर (Iyar)',
'hebrew-calendar-m9-gen'  => 'सिवान (Sivan)',
'hebrew-calendar-m10-gen' => 'तामुज़ (Tamuz)',
'hebrew-calendar-m11-gen' => 'एवी (Av)',
'hebrew-calendar-m12-gen' => 'एलुल (Elul)',

# Core parser functions
'unknown_extension_tag' => 'गलत एक्स्टेंशन टैग "$1"',

# Special:Version
'version'                          => 'रूपान्तर', # Not used as normal message but as header for the special page itself
'version-extensions'               => 'इन्स्टॉल की हुई एक्स्टेंशन',
'version-specialpages'             => 'विशेष पन्ने',
'version-parserhooks'              => 'पार्सर हूक',
'version-variables'                => 'वेरिएबल',
'version-other'                    => 'अन्य',
'version-mediahandlers'            => 'मीडिया हॅंडलर',
'version-hooks'                    => 'हूक',
'version-extension-functions'      => 'एक्सटेंशन कार्य',
'version-parser-extensiontags'     => 'पार्सर एक्स्टेंशन टैग',
'version-parser-function-hooks'    => 'पार्सर कार्य हूक',
'version-skin-extension-functions' => 'त्वचा एक्स्टेंशन क्रिया',
'version-hook-name'                => 'हूक नाम',
'version-hook-subscribedby'        => 'ने सदस्यत्व लिया',
'version-version'                  => 'अवतरण',
'version-license'                  => 'लाइसेन्स',
'version-software'                 => 'इन्स्टॉल की हुई प्रणाली',
'version-software-product'         => 'प्रोडक्ट',
'version-software-version'         => 'अवतरण',

# Special:FilePath
'filepath'         => 'फ़ाइल पाथ',
'filepath-page'    => 'फ़ाइल:',
'filepath-submit'  => 'पाथ',
'filepath-summary' => 'यह विशेष पृष्ठ फ़ाईल का पूरा पाथ देता हैं।
चित्र पूरे रिज़ोल्यूशनके साथ दिखता हैं, अन्य फ़ाईल प्रकार उनके संबंधित प्रोग्रेम डाइरेक्टरी से शुरू होते हैं।

फ़ाईलनाम "{{ns:image}}:" उपपद के बिना लिखें।',

# Special:FileDuplicateSearch
'fileduplicatesearch'          => 'फ़ाईल द्विरावृत्ति खोजें',
'fileduplicatesearch-summary'  => 'हैश वैल्यू के अनुसार फ़ाईल की द्विरावृत्ति खोजें।

फ़ाईलनाम "{{ns:image}}:" उपपद के बिना लिखें।',
'fileduplicatesearch-legend'   => 'द्विरावृत्ति के लिये खोजें',
'fileduplicatesearch-filename' => 'फ़ाईलनाम:',
'fileduplicatesearch-submit'   => 'खोज',
'fileduplicatesearch-info'     => '$1 × $2 पीक्सेल<br />फ़ाईल का आकार: $3<br />MIME प्रकार: $4',
'fileduplicatesearch-result-1' => 'फ़ाईल  "$1" में द्विरावृत्ति नही हैं।',
'fileduplicatesearch-result-n' => 'फ़ाईल "$1" में {{PLURAL:$2|1 द्विरावृत्ति|$2 द्विरावृत्तियाँ}} मिले हैं।',

# Special:SpecialPages
'specialpages'                   => 'खास पन्नें',
'specialpages-note'              => '----
* साधारण विशेष पृष्ठ।
* <span class="mw-specialpagerestricted">प्रतिबंधित विशेष पृष्ठ।</span>',
'specialpages-group-maintenance' => 'अनुरक्षण रिपोर्ट',
'specialpages-group-other'       => 'अन्य विशेष पृष्ठ',
'specialpages-group-login'       => 'सत्र प्रारम्भ / हस्ताक्षर करें',
'specialpages-group-changes'     => 'हाल ही में हुए परिवर्तन एवं अभिलेख',
'specialpages-group-media'       => 'मीडिया रिपोर्ट एवं अपलोड',
'specialpages-group-users'       => 'सदस्य एवं अधिकार',
'specialpages-group-highuse'     => 'अत्यधिक उपयोगी पृष्ठ',
'specialpages-group-pages'       => 'पृष्ठ सूचीयाँ',
'specialpages-group-pagetools'   => 'पृष्ठ औज़ार',
'specialpages-group-wiki'        => 'विकि डाटा और औज़ार',
'specialpages-group-redirects'   => 'विशेष पन्ने अनुप्रेषित कर रहें हैं',
'specialpages-group-spam'        => 'स्पैम औज़ार',

);
