<?php
/** Bengali (বাংলা)
 *
 * @ingroup Language
 * @file
 *
 * @author Bellayet
 * @author Zaheen
 * @author לערי ריינהארט
 */

$namespaceNames = array(
	NS_SPECIAL        => 'বিশেষ',
	NS_MAIN           => '',
	NS_TALK           => 'আলাপ',
	NS_USER           => 'ব্যবহারকারী',
	NS_USER_TALK      => 'ব্যবহারকারী_আলাপ',
	# NS_PROJECT set by $wgMetaNamespace
	NS_PROJECT_TALK   => '$1_আলাপ',
	NS_IMAGE          => 'চিত্র',
	NS_IMAGE_TALK     => 'চিত্র_আলাপ',
	NS_MEDIAWIKI_TALK => 'MediaWiki_আলাপ'
);
$datePreferences = false;
$digitTransformTable = array(
	'0' => '০',
	'1' => '১',
	'2' => '২',
	'3' => '৩',
	'4' => '৪',
	'5' => '৫',
	'6' => '৬',
	'7' => '৭',
	'8' => '৮',
	'9' => '৯'
);

$messages = array(
# User preference toggles
'tog-underline'               => 'সংযোগগুলির নিচে দাগ দেখানো হোক:',
'tog-highlightbroken'         => 'ভাঙা সংযোগগুলোকে <a href="" class="new">এই ভাবে</a> (বিকল্পে এই ভাবে<a href="" class="internal">?</a>) দেখানো হোক।',
'tog-justify'                 => 'অনুচ্ছেদগুলি যথাযথ ফাঁক দিয়ে সাজানো (justify) হোক',
'tog-hideminor'               => 'অনুল্লেখ্য সম্পাদনাগুলো সাম্প্রতিক পরিবর্তনে না দেখানো হোক',
'tog-extendwatchlist'         => 'সমস্ত প্রয়োগযোগ্য পরিবর্তন দেখানোর জন্য নজরতালিকা সম্প্রসারিত করা হোক।',
'tog-usenewrc'                => 'উন্নততর সাম্প্রতিক পরিবর্তনসমূহ (জাভাস্ক্রিপ্ট সংস্করণ)',
'tog-numberheadings'          => 'শিরোনামগুলোকে স্বয়ংক্রিয়ভাবে ক্রমাঙ্কিত করা হোক',
'tog-showtoolbar'             => 'সম্পাদনা টুলবার দেখানো হোক (জাভাস্ক্রিপ্ট)',
'tog-editondblclick'          => 'দুইবার ক্লিক করে পাতা সম্পাদনা করার ক্ষমতা দেয়া হোক (জাভাস্ক্রিপ্ট)',
'tog-editsection'             => '[সম্পাদনা] সংযোগের সাহায্যে পরিচ্ছেদ সম্পাদনা করার ক্ষমতা দেয়া হোক',
'tog-editsectiononrightclick' => 'পরিচ্ছেদের শিরোনামে ডান ক্লিকের মাধ্যমে <br />পরিচ্ছেদ সম্পাদনা করার ক্ষমতা দেয়া হোক (জাভাস্ক্রিপ্ট)',
'tog-showtoc'                 => 'সূচিপত্র দেখানো হোক (৩টির বেশি পরিচ্ছেদের শিরোনামবিশিষ্ট পাতার জন্য)',
'tog-rememberpassword'        => 'একাধিক সেশনের জন্য শব্দচাবি মনে রাখা হোক',
'tog-editwidth'               => 'সম্পাদনা বাক্সটি পূর্ণ প্রস্থে আছে',
'tog-watchcreations'          => 'আমার তৈরি পাতাগুলি আমার নজরতালিকায় যোগ করা হোক',
'tog-watchdefault'            => 'আমার সম্পাদিত পাতাগুলি আমার নজরতালিকায় যোগ করা হোক',
'tog-watchmoves'              => 'আমার সরিয়ে ফেলা পাতাগুলি আমার নজরতালিকায় যোগ করা হোক',
'tog-watchdeletion'           => 'আমার মুছে ফেলা পাতাগুলি আমার নজর তালিকায় যোগ করা হোক',
'tog-minordefault'            => 'শুরুতেই সব সম্পাদনাকে অনুল্লেখ্য বলে চিহ্নিত করা হোক',
'tog-previewontop'            => 'সম্পাদনা বাক্সের আগে প্রাকদর্শন দেখানো হোক',
'tog-previewonfirst'          => 'প্রথম সম্পাদনার ক্ষেত্রে প্রাকদর্শন দেখানো হোক',
'tog-nocache'                 => 'পাতা ক্যাশ করার ক্ষমতা নিষ্ক্রিয় করা হোক',
'tog-enotifwatchlistpages'    => 'আমার নজর তালিকায় আছে এমন পাতাতে পরিবর্তন হলে তা জানিয়ে আমাকে ই-মেইল করো',
'tog-enotifusertalkpages'     => 'আমার ব্যবহারকারী আলোচনা পাতার পরিবর্তন হলে আমাকে ই-মেইল করা হোক',
'tog-enotifminoredits'        => 'পাতাগুলির অনুল্লেখ্য সম্পাদনার জন্যও আমাকে ই-মেইল করা হোক',
'tog-enotifrevealaddr'        => 'বিজ্ঞপ্তি মেইলে আমার ই-মেইল ঠিকানা প্রকাশ করা হোক',
'tog-shownumberswatching'     => 'নজরদারী করছে, এমন ব্যবহারকারীর সংখ্যা দেখানো হোক',
'tog-fancysig'                => 'আপনার স্বাক্ষরে স্বয়ংক্রিয়ভাবে সংযোগ দিতে না চাইলে টিক দিন',
'tog-externaleditor'          => 'প্রাথমিক পছন্দ হিসেবে বহিঃস্থ সম্পাদক ব্যবহার করা হোক (কেবল দক্ষ ব্যবহারকারীদের জন্য, আপনার কম্পিউটারে বিশেষ সেটিংস প্রয়োজন)',
'tog-externaldiff'            => 'প্রাথমিক পছন্দ হিসেবে বহিঃস্থ পার্থক্য ব্যবহার করা হোক (কেবল দক্ষ ব্যবহারকারীদের জন্য, আপনার কম্পিউটারে বিশেষ সেটিংস প্রয়োজন)',
'tog-showjumplinks'           => '"ঝাঁপ দিন" বৈশিষ্ট্যের সংযোগ চালু করা হোক',
'tog-uselivepreview'          => 'তাৎক্ষণিক প্রাকদর্শনের ক্ষমতা চালু করা হোক (জাভাস্ক্রিপ্ট) (পরীক্ষামূলক)',
'tog-forceeditsummary'        => 'খালি সম্পাদনা সারাংশ প্রবেশ করানোর সময় আমাকে জানানো হোক',
'tog-watchlisthideown'        => 'আমার সম্পাদনাগুলি আমার নজরতালিকায় না দেখানো হোক',
'tog-watchlisthidebots'       => 'বটের করা সম্পাদনাগুলি নজরতালিকায় না দেখানো হোক',
'tog-watchlisthideminor'      => 'অনুল্লেখ্য সম্পাদনাগুলো নজর তালিকায় না দেখানো হোক',
'tog-nolangconversion'        => 'বিকল্প রুপান্তর রোধ করো',
'tog-ccmeonemails'            => 'অন্য ব্যবহারকারীর কাছে আমার পাঠানো ইমেইলের একটি অনুলিপি আমাকে পাঠানো হোক',
'tog-diffonly'                => 'পার্থক্যের নিচে পাতার বিষয়বস্তু না দেখানো হোক',
'tog-showhiddencats'          => 'লুকায়িত বিষয়শ্রেণীসমূহ দেখাও',

'underline-always'  => 'সব সময়',
'underline-never'   => 'কখনো নয়',
'underline-default' => 'ব্রাউজারে যেমনভাবে নির্দিষ্ট করা আছে',

'skinpreview' => '(প্রাকদর্শন)',

# Dates
'sunday'        => 'রবিবার',
'monday'        => 'সোমবার',
'tuesday'       => 'মঙ্গলবার',
'wednesday'     => 'বুধবার',
'thursday'      => 'বৃহস্পতিবার',
'friday'        => 'শুক্রবার',
'saturday'      => 'শনিবার',
'sun'           => 'রবিবার',
'mon'           => 'সোমবার',
'tue'           => 'মঙ্গলবার',
'wed'           => 'বুধবার',
'thu'           => 'রৃহস্পতিবার',
'fri'           => 'শুক্রবার',
'sat'           => 'শনিবার',
'january'       => 'জানুয়ারি',
'february'      => 'ফেব্রুয়ারি',
'march'         => 'মার্চ',
'april'         => 'এপ্রিল',
'may_long'      => 'মে',
'june'          => 'জুন',
'july'          => 'জুলাই',
'august'        => 'আগস্ট',
'september'     => 'সেপ্টেম্বর',
'october'       => 'অক্টোবর',
'november'      => 'নভেম্বর',
'december'      => 'ডিসেম্বর',
'january-gen'   => 'জানুয়ারি',
'february-gen'  => 'ফেব্রুয়ারি',
'march-gen'     => 'মার্চ',
'april-gen'     => 'এপ্রিল',
'may-gen'       => 'মে',
'june-gen'      => 'জুন',
'july-gen'      => 'জুলাই',
'august-gen'    => 'আগস্ট',
'september-gen' => 'সেপ্টেম্বর',
'october-gen'   => 'অক্টোবর',
'november-gen'  => 'নভেম্বর',
'december-gen'  => 'ডিসেম্বর',
'jan'           => 'জানুয়ারি',
'feb'           => 'ফেব্রুয়ারি',
'mar'           => 'মার্চ',
'apr'           => 'এপ্রিল',
'may'           => 'মে',
'jun'           => 'জুন',
'jul'           => 'জুলাই',
'aug'           => 'আগস্ট',
'sep'           => 'সেপ্টেম্বর',
'oct'           => 'অক্টোবর',
'nov'           => 'নভেম্বর',
'dec'           => 'ডিসেম্বর',

# Categories related messages
'pagecategories'           => '{{PLURAL:$1|বিষয়শ্রেণী|বিষয়শ্রেণীসমূহ}}',
'category_header'          => '"$1" বিষয়শ্রেণীতে অন্তর্ভুক্ত পাতাগুলি',
'subcategories'            => 'উপবিষয়শ্রেণীসমূহ',
'category-media-header'    => '"$1" বিষয়শ্রেণীতে অন্তর্ভুক্ত মিডিয়া ফাইলগুলি',
'category-empty'           => "''এই বিষয়শ্রণীতে বর্তমানে কোন পাতা বা মিডিয়া ফাইল নেই।''",
'hidden-categories'        => '{{PLURAL:$1|লুকায়িত বিষয়শ্রেণী|লুকায়িত বিষয়শ্রেণীসমূহ}}',
'hidden-category-category' => 'লুকায়িত বিষয়শ্রেণীসমূহ', # Name of the category where hidden categories will be listed
'listingcontinuesabbrev'   => 'আরও আছে',

'mainpagetext'      => "<big>'''মিডিয়াউইকি সফলভাবে ইন্সটল করা হয়েছে।'''</big>",
'mainpagedocfooter' => 'কী ভাবে উইকি সফটওয়্যারটি ব্যবহারকার করবেন, তা জানতে [http://meta.wikimedia.org/wiki/Help:Contents ব্যবহারকারী সহায়িকা] দেখুন।

== কোথা থেকে শুরু করবেন ==

* [http://www.mediawiki.org/wiki/Manual:Configuration_settings কনফিগারেশন সেটিংস তালিকা]
* [http://www.mediawiki.org/wiki/Manual:FAQ প্রশ্নোত্তরে মিডিয়াউইকি]
* [http://lists.wikimedia.org/mailman/listinfo/mediawiki-announce মিডিয়াউইকি রিলিজের মেইলিং লিস্ট]',

'about'          => 'বৃত্তান্ত',
'article'        => 'বিষয়বস্তু আছে এমন পাতা',
'newwindow'      => '(নতুন উইন্ডোতে খুলবে)',
'cancel'         => 'বাতিল করা হোক',
'qbfind'         => 'অনুসন্ধান করুন',
'qbbrowse'       => 'ঘুরে দেখুন',
'qbedit'         => 'সম্পাদনা করুন',
'qbpageoptions'  => 'এ পাতার বিকল্পসমূহ',
'qbpageinfo'     => 'পাতা-সংক্রান্ত তথ্য',
'qbmyoptions'    => 'আমার পছন্দ',
'qbspecialpages' => 'বিশেষ পাতাসমূহ',
'moredotdotdot'  => 'আরও...',
'mypage'         => 'আমার পাতা',
'mytalk'         => 'আমার আলাপ',
'anontalk'       => 'এই বেনামী ব্যবহারকারীর আলাপের পাতা',
'navigation'     => 'পরিভ্রমণ',
'and'            => 'এবং',

# Metadata in edit box
'metadata_help' => 'অধিউপাত্ত (metadata):',

'errorpagetitle'    => 'ত্রুটি',
'returnto'          => '$1 শিরোনামের পাতায় ফেরত যান।',
'tagline'           => '{{SITENAME}} থেকে',
'help'              => 'সাহায্য',
'search'            => 'অনুসন্ধান',
'searchbutton'      => 'অনুসন্ধান',
'go'                => 'চলো',
'searcharticle'     => 'চলো',
'history'           => 'পাতার ইতিহাস',
'history_short'     => 'ইতিহাস',
'updatedmarker'     => 'আমার শেষ পরিদর্শনের পর থেকে হালনাগাদকৃত',
'info_short'        => 'তথ্য',
'printableversion'  => 'ছাপার যোগ্য সংস্করণ',
'permalink'         => 'স্থায়ী সংযোগ',
'print'             => 'ছাপা হোক',
'edit'              => 'সম্পাদনা করুন',
'create'            => 'তৈরি করো',
'editthispage'      => 'সম্পাদনা করুন',
'create-this-page'  => 'পাতাটি তৈরি করো',
'delete'            => 'মুছে ফেলুন',
'deletethispage'    => 'এই পাতাটি মুছে ফেলুন',
'undelete_short'    => 'পুনঃস্থাপন {{PLURAL:$1|১টি সম্পাদনা|$1টি সম্পাদনাসমূহ}}',
'protect'           => 'সুরক্ষিত করুন',
'protect_change'    => 'সুরক্ষা পরিবর্তন করুন',
'protectthispage'   => 'সংরক্ষণ করুন',
'unprotect'         => 'সুরক্ষা সরিয়ে নিন',
'unprotectthispage' => 'সুরক্ষা সরিয়ে নিন',
'newpage'           => 'নতুন পাতা',
'talkpage'          => 'আলোচনা করুন',
'talkpagelinktext'  => 'আলোচনা',
'specialpage'       => 'বিশেষ পাতা',
'personaltools'     => 'ব্যক্তিগত হাতিয়ারসমূহ',
'postcomment'       => 'মন্তব্য করুন',
'articlepage'       => 'নিবন্ধ দেখুন',
'talk'              => 'আলোচনা',
'views'             => 'দৃষ্টিকোনসমূহ',
'toolbox'           => 'প্রয়োজনীয় সংযোগসমূহ',
'userpage'          => 'ব্যাবহারকারীর পাতা দেখুন',
'projectpage'       => 'মেটা-পাতা দেখুন',
'imagepage'         => 'ছবির পাতা দেখুন',
'mediawikipage'     => 'বার্তার পাতা দেখুন',
'templatepage'      => 'টেম্পলেট পাতা দেখুন',
'viewhelppage'      => 'সহায়িকা পাতা দেখুন',
'categorypage'      => 'বিষয়শ্রেণীর পাতাটি দেখুন',
'viewtalkpage'      => 'আলোচনা দেখুন',
'otherlanguages'    => 'অন্যান্য ভাষাসমূহ',
'redirectedfrom'    => '($1 থেকে ঘুরে এসেছে)',
'redirectpagesub'   => 'পুনর্নির্দেশ পাতা',
'lastmodifiedat'    => 'এ পাতায় শেষ পরিবর্তন হয়েছিল $2টার সময়, $1 তারিখে।', # $1 date, $2 time
'viewcount'         => 'এ পাতাটি $1 বার দেখা হয়েছে।',
'protectedpage'     => 'সুরক্ষিত পাতা',
'jumpto'            => 'ঝাঁপ দাও:',
'jumptonavigation'  => 'পরিভ্রমন',
'jumptosearch'      => 'অনুসন্ধান',

# All link text and link target definitions of links into project namespace that get used by other message strings, with the exception of user group pages (see grouppage) and the disambiguation template definition (see disambiguations).
'aboutsite'            => '{{SITENAME}} বৃত্তান্ত',
'aboutpage'            => 'Project:বৃত্তান্ত',
'bugreports'           => 'ত্রুটি বিবরণী',
'bugreportspage'       => 'Project:ত্রুটি বিবরণী',
'copyright'            => '$1 এর আওতায় প্রাপ্য।',
'copyrightpagename'    => '{{SITENAME}} কপিরাইট',
'copyrightpage'        => '{{ns:project}}:কপিরাইটসমূহ',
'currentevents'        => 'সমসাময়িক ঘটনা',
'currentevents-url'    => 'Project:সমসাময়িক ঘটনাসমূহ',
'disclaimers'          => 'দাবিত্যাগ',
'disclaimerpage'       => 'Project:সাধারণ দাবিত্যাগ',
'edithelp'             => 'সম্পাদনা সহায়িকা',
'edithelppage'         => 'Help:কিভাবে একটি পাতা সম্পাদনা করবেন',
'faq'                  => 'সম্ভাব্য প্রশ্নসমূহ',
'faqpage'              => 'Project:সম্ভাব্য প্রশ্নসমূহ',
'helppage'             => 'Help:সহায়িকা',
'mainpage'             => 'প্রধান পাতা',
'mainpage-description' => 'প্রধান পাতা',
'policy-url'           => 'Project:নীতি',
'portal'               => 'সম্প্রদায়ের প্রবেশদ্বার',
'portal-url'           => 'Project:সম্প্রদায়ের প্রবেশদ্বার',
'privacy'              => 'গোপনীয়তার নীতি',
'privacypage'          => 'Project:গোপনীয়তার নীতি',

'badaccess'        => 'অনুমোদন ত্রুটি',
'badaccess-group0' => 'আপনি যে কাজের জন্য অনুরোধ করেছেন, যে কাজটি সম্পন্ন করার অনুমতি নাই',
'badaccess-group1' => 'আপনার অনুরোধকৃত কাজের করার অনুমতি শুধু $1 গ্রুপের ব্যবহারকারীদেরই আছে।',
'badaccess-group2' => 'আপনি যে কাজটি করতে চাচ্ছেন তা কেবল $1 দলের একজন ব্যবহারকারী করতে পারেন।',
'badaccess-groups' => 'আপনি যে কাজটি করতে চাচ্ছেন তা কেবল $1 দলের একজন ব্যবহারকারী করতে পারেন।',

'versionrequired'     => 'মিডিয়াউইকির $1 সংস্করণ প্রয়োজন',
'versionrequiredtext' => 'এই পাতাটি ব্যবহার করার জন্য মিডিয়াউইকির $1 নং সংস্করণ প্রয়োজন। [[Special:Version|সংস্করণ পাতা]] দেখুন।',

'ok'                      => 'ঠিক আছে',
'retrievedfrom'           => "'$1' থেকে আনীত",
'youhavenewmessages'      => 'আপনার $1 ($2) এসেছে৷',
'newmessageslink'         => 'নতুন বার্তা',
'newmessagesdifflink'     => 'সর্বশেষ পরিবর্তন',
'youhavenewmessagesmulti' => 'আপনার $1টি নতুন বার্তা এসেছে',
'editsection'             => 'সম্পাদনা',
'editold'                 => 'সম্পাদনা করুন',
'viewsourceold'           => 'উৎস দেখাও',
'editsectionhint'         => 'পরিচ্ছেদ সম্পাদনা: $1',
'toc'                     => 'পরিচ্ছেদসমূহ',
'showtoc'                 => 'দেখাও',
'hidetoc'                 => 'আড়ালে রাখো',
'thisisdeleted'           => '$1 দেখানো বা পুনঃসৃষ্টি করা হোক?',
'viewdeleted'             => '$1 দেখানো হোক?',
'restorelink'             => '{{PLURAL:$1|একটি মুছে ফেলা সম্পাদনা|$1টি মুছে ফেলা সম্পাদনা}}',
'feedlinks'               => 'ফিড:',
'feed-invalid'            => 'গ্রাহক ফিডের ধরন অবৈধ।',
'site-rss-feed'           => '$1 আর এস এস ফিড',
'site-atom-feed'          => '$1 অ্যাটম ফিড',
'page-rss-feed'           => '"$1" আর এস এস ফিড',
'page-atom-feed'          => '"$1" অ্যাটম ফিড',
'red-link-title'          => '$1 (এখনও লেখা হয়নি)',

# Short words for each namespace, by default used in the namespace tab in monobook
'nstab-main'      => 'নিবন্ধ',
'nstab-user'      => 'ব্যবহারকারীর পাতা',
'nstab-media'     => 'মিডিয়া পাতা',
'nstab-special'   => 'বিশেষ পাতা',
'nstab-project'   => 'প্রকল্প পাতা',
'nstab-image'     => 'ফাইল',
'nstab-mediawiki' => 'বার্তা',
'nstab-template'  => 'টেম্পলেট',
'nstab-help'      => 'সহায়িকা',
'nstab-category'  => 'বিষয়শ্রেণী',

# Main script and global functions
'nosuchaction'      => 'এমন কোন কাজ নেই',
'nosuchactiontext'  => 'ইউআরএল টি দ্বারা নির্দিষ্ট কাজ এই উইকি শনাক্ত করতে পারেনি',
'nosuchspecialpage' => 'এমন কোন বিশেষ পাতা নেই',
'nospecialpagetext' => "<big>'''আপনি একটি অবৈধ বিশেষ পাতা অনুরোধ করেছেন।'''</big>

[[Special:SpecialPages|{{int:specialpages}}]]-এ বৈধ বিশেষ পাতাগুলির একটি তালিকা পাবেন।",

# General errors
'error'                => 'ত্রুটি',
'databaseerror'        => 'ডাটাবেস ত্রুটি',
'dberrortext'          => 'ডাটাবেজ কোয়েরি সিন্ট্যাক্সে (query syntax error) ত্রুটি ঘটেছে। 
সফটওয়্যারে কোন বাগের (bug) কারণে এমন হতে পারে।
সর্বশেষ ডাটাবেজ কোয়েরিটি ছিল এরকম:
<blockquote><tt>$1</tt></blockquote>
"<tt>$2</tt>" ফাংশনের ভিতর থেকে।
মাই এস কিউ এল এই ত্রুটি পাঠিয়েছে: "<tt>$3: $4</tt>"।',
'dberrortextcl'        => 'ডাটাবেজ কোয়েরি সিনট্যাক্স ত্রুটি ঘটেছে।
সর্বশেষ ডাটাবেজ কোয়েরিটি ছিল:
"$1"
"$2" ফাংশনের ভিতর থেকে।
মাই এস কিউ এল এই ত্রুটি দেখিয়েছে: "$3: $4"',
'noconnect'            => 'দুঃখিত! এই উইকিতে কিছু কারিগরি সমস্যা দেখা দিয়েছে, এবং ডাটাবেসের সাথে যোগাযোগ করতে পারছে না। <br />
$1',
'nodb'                 => 'ডাটাবেস $1 নির্বাচন করা যায়নি',
'cachederror'          => 'অনুরোধকৃত পাতার একটি ক্যাশ কপি নিচে দেখানো হল। এটি হালনাগাদকৃত না-ও হতে পারে।',
'laggedslavemode'      => 'সতর্কীকরণ: পাতাটি সম্ভবত সাম্প্রতি হালনাগাদকৃত নয়।',
'readonly'             => 'ডাটাবেসের ব্যবহার সীমাবদ্ধ',
'enterlockreason'      => 'তালাবদ্ধ করার কারণ কি তা বলুন, সাথে কখন তালা খুলবেন তার আনুমানিক সময় উল্লখ্য করুন',
'readonlytext'         => 'নতুন ভুক্তি এবং অন্যান্য সম্পাদনার জন্য ডাটাবেজ বর্তমানে বন্ধ করা আছে। সম্ভবত ডাটাবেজ রক্ষণাবেক্ষণের নিয়মিত কাজ চলছে। কিছুক্ষণ পরে এটি স্বাভাবিক অবস্থায় ফিরে আসবে।

প্রশাসক এই ব্যাখ্যা দিয়েছেন: $1',
'missingarticle-diff'  => '(পার্থক্য: $1, $2)',
'readonly_lag'         => 'ডাটাবেজ স্বয়ংক্রিয়ভাবে বন্ধ করে দেয়া হয়েছে, যাতে অধীন ডাটাবেজ সার্ভারগুলি প্রধান ডাটাবেজ সার্ভারের অবস্থায় আসতে পারে।',
'internalerror'        => 'আভ্যন্তরীণ ত্রুটি',
'internalerror_info'   => 'আভ্যন্তরীণ ত্রুটি: $1',
'filecopyerror'        => '"$1" থেকে "$2" ফাইল কপি করা যায়নি',
'filerenameerror'      => '"$1" ফাইলটির নাম বদলে "$2" করা সম্ভব হচ্ছে না।',
'filedeleteerror'      => '"$1" ফাইলটি মুছে ফেলা সম্ভব হচ্ছে না।',
'directorycreateerror' => '"$1" ডাইরেক্টরি তৈরি করা যায়নি।',
'filenotfound'         => '"$1" ফাইলটি খুঁজে পাওয়া যাচ্ছে না।',
'fileexistserror'      => '"$1" ফাইলে লেখা যাচ্ছে না: ফাইলটি আগেই আছে',
'unexpected'           => 'অপ্রত্যাশিত মান: "$1"="$2"।',
'formerror'            => 'ত্রুটি: ফরমটি জমা দেওয়া যায়নি',
'badarticleerror'      => 'এই পাতায় এই কাজটি করা সম্ভব নয়।',
'cannotdelete'         => 'এই পাতা বা ফাইলটি মোছা সম্ভব হল না। (সম্ভবতঃ অন্য কেউ আগেই এটিকে মুছে ফেলেছে)',
'badtitle'             => 'শিরোনামটি গ্রহনযোগ্য নয়।',
'badtitletext'         => 'অনুরোধকৃত পাতার শিরোনামটি অবৈধ, খালি কিংবা কোন ভুল আন্তঃভাষা বা আন্তঃউইকি শিরোনাম সংযোগ ছিল। এটিতে সম্ভবত এমন এক (একাধিক) ক্যারেক্টার আছে, যা (যেগুলি) শিরোনামে ব্যবহারযোগ্য নয়।',
'perfdisabled'         => 'দুঃখিত! এই ফিচারটি সাময়িকভাবে নিষ্ক্রিয় করা হয়েছে, কারণ এটি ডাটাবেজকে এত ধীর করে দেয় যে কেউ উইকি ব্যবহার করতে পারেন না।',
'perfcached'           => 'নিচের উপাত্তগুলো ক্যাশ থেকে নেয়া এবং সম্পূর্ণ হালনাগাদকৃত না-ও হতে পারে:',
'perfcachedts'         => 'নিচের উপাত্তগুলো ক্যাশ থেকে নেয়া এবং $1 তারিখে হালনাগাদ করা হয়েছে।',
'querypage-no-updates' => 'এই পাতার জন্য হালনাগাদ নিষ্ক্রিয় করা হয়েছে। এখানে রাখা উপাত্ত এ মুহূর্তে রিফ্রেশ করা হবে না।',
'wrong_wfQuery_params' => 'wfQuery()-তে ভুল প্যারামিটার দেয়া হয়েছে<br />
ফাংশন: $1<br />
কোয়েরি: $2',
'viewsource'           => 'উৎস দেখুন',
'viewsourcefor'        => '$1 এর জন্য',
'actionthrottled'      => 'কাজের গতি ধীরকরণ',
'actionthrottledtext'  => 'স্প্যাম-রোধী সমাধান হিসেবে এই কাজটি খুব কম সময়ে অনেক বেশিবার সম্পাদনা করার সীমা বেঁধে দেওয়া হয়েছে। আপনি সেই সীমা অতিক্রম করেছেন। অনুগ্রহ করে কয়েক মিনিট পরে আবার চেষ্টা করুন।',
'protectedpagetext'    => 'সম্পাদনা এড়াতে এ পাতাটির ব্যবহার নিয়ন্ত্রণ করা হয়েছে।',
'viewsourcetext'       => 'এ পাতাটি আপনি দেখতে এবং উৎসের অনুলিপি নিতে পারবেন:',
'protectedinterface'   => 'এই পাতার বিষয়বস্তু উইকি সফটওয়্যারের একটি ইন্টারফেস বার্তা প্রদান করে, তাই এটিকে সুরক্ষিত করে রাখা হয়েছে।',
'editinginterface'     => "'''সতর্কীকরণ:''' আপনি এমন একটি পাতা সম্পাদনা করছেন যা সফটওয়্যারের জন্য ইন্টারফেস টেক্সট প্রদান করে। এই পাতাতে সংঘটিত পরিবর্তন ব্যবহারকারী ইন্টারফেসে প্রভাব ফেলবে, যা অন্য ব্যবহারকারীরা দেখতে পাবেন। অনুবাদের জন্য অনুগ্রহ করে [http://translatewiki.net/wiki/Main_Page?setlang=bn Betawiki] ব্যবহার করার ব্যাপারটি বিবেচনা করুন। এটি মিডিয়াউইকি স্থানীয়করণ প্রকল্প।",
'sqlhidden'            => '(এস কিউ এল কোয়েরি লুকানো আছে)',
'cascadeprotected'     => 'এই পাতাটি সম্পাদনা থেকে সুরক্ষিত, কারণ পাতাটি নিচের {{PLURAL:$1|টি পাতার|টি পাতার}} অন্তর্গত, যে পাতা(গুলি) "প্রপাতাকার" (cascading) বৈশিষ্ট্য সহযোগে সুরক্ষিত করা হয়েছে:
$2',
'namespaceprotected'   => "'''$1''' নামস্থানে কোন পাতা আপনার সম্পাদনা করার অনুমতি নাই।",
'customcssjsprotected' => 'আপনার এ পাতা সম্পাদনা করার অনুমতি নাই, কারণ এ পাতায় অন্য ব্যবহারকারীর ব্যক্তিগত বিষয়বস্তু আছে।',
'ns-specialprotected'  => '{{ns:special}} নামস্থানে পাতাসমূহ সম্পাদনা করা যাবে না।',
'titleprotected'       => "[[User:$1|$1]]-কে এই শিরোনামের পাতা সৃষ্টি করতে বাধা দেয়া হচ্ছে। কারণ: ''$2''।",

# Login and logout pages
'logouttitle'                => 'ব্যবহারকারীর প্রস্থান (logout)',
'logouttext'                 => '<strong>আপনি এইমাত্র আপনার একাউন্ট থেকে বেরিয়ে গেছেন।</strong><br />
এ পরিস্থিতিতে আপনি বেনামে {{SITENAME}} ব্যবহার করতে পারেন, কিংবা আবার আপনার একাউন্টে (বা নতুন কোন একাউন্টে) প্রবেশ করতে পারেন। লক্ষ্য করুন যে {{SITENAME}} এর কিছু কিছু পাতা এখনও এমনভাবে পরিবেশিত হতে পারে যাতে মনে হবে আপনি এখনও আপনার একাউন্ট থেকে বেরিয়ে যান নি। এক্ষেত্রে আপনাকে আপনার ব্রাওজারের ক্যাশ পরিষ্কার (clear browser cache) করে নিতে হবে।',
'welcomecreation'            => '== স্বাগতম $1! ==

আপনার অ্যাকাউন্ট তৈরী হয়েছে। আপনার {{SITENAME}} পছন্দ স্থির করে নিতে ভুলবেন না কিন্তু।',
'loginpagetitle'             => 'ব্যবহারকারী লগ ইন',
'yourname'                   => 'ব্যবহারকারীর নাম (Username)',
'yourpassword'               => 'শব্দচাবি (Password)',
'yourpasswordagain'          => 'শব্দচাবিটি (password) আবার লিখুন',
'remembermypassword'         => 'আমাকে পরবর্তীতে মনে রাখা হোক',
'yourdomainname'             => 'আপনার ডোমেইন',
'externaldberror'            => 'হয় কোন বহিঃস্থ যাচাইকরণ ডাটাবেজ ত্রুটি ঘটেছে অথবা আপনার বহিঃস্থ অ্যাকাউন্ট হালনাগাদ করার অনুমতি নেই।',
'loginproblem'               => '<b>আপনার লগ্‌-ইন করতে সমস্যা হচ্ছে।</b><br />আবার চেষ্টা করুন!',
'login'                      => 'প্রবেশ করুন',
'nav-login-createaccount'    => 'প্রবেশ/নতুন অ্যাকাউন্ট',
'loginprompt'                => '{{SITENAME}}-তে সংযুক্ত হতে চাইলে আপনার ব্রাওজারের কুকি (cookies) অবশ্যই সক্রিয় (enabled) করতে হবে|',
'userlogin'                  => 'প্রবেশ/নতুন অ্যাকাউন্ট',
'logout'                     => 'প্রস্থান করুন',
'userlogout'                 => 'প্রস্থান',
'notloggedin'                => 'আপনি সংযুক্ত নন',
'nologin'                    => 'প্রবেশাধিকার নেই? $1।',
'nologinlink'                => 'নতুন অ্যাকাউন্ট খুলুন',
'createaccount'              => 'নতুন অ্যাকাউন্ট খুলুন',
'gotaccount'                 => 'আপনার কি ইতিমধ্যে একটি অ্যাকাউন্ট তৈরি করা আছে? $1 করুন।',
'gotaccountlink'             => 'প্রবেশ',
'createaccountmail'          => 'ই-মেইলের মাধ্যমে',
'badretype'                  => 'শব্দচাবি (password) দুটি মিলছেনা।',
'userexists'                 => 'এই ব্যবহারকারী নামটি অন্য কেঊ আগেই ব্যবহার করেছে। দয়া করে অন্য নাম বেছে নিন।',
'youremail'                  => 'ইমেইল *',
'username'                   => 'ব্যবহারকারীর নাম:',
'uid'                        => 'ব্যবহারকারী নং (ID):',
'prefs-memberingroups'       => '{{PLURAL:$1|দলের|দলসমূহের}} সদস্য:',
'yourrealname'               => 'আসল নাম *',
'yourlanguage'               => 'ভাষা:',
'yourvariant'                => 'বিকল্প',
'yournick'                   => 'স্বাক্ষর:',
'badsig'                     => 'অবৈধ স্বাক্ষর; এইচটিএমএল ট্যাগ পরীক্ষা করুন।',
'badsiglength'               => 'স্বাক্ষরটি অনেক লম্বা; যা অবশ্যই $1 {{PLURAL:$1|অক্ষরের|অক্ষরের}} কম হতে হবে।',
'email'                      => 'ই-মেইল',
'prefs-help-realname'        => 'আসল নাম দেওয়া অনাবশ্যক। যদি আসল নাম দেন, তবে আপনার কাজের স্বীকৃতি দানে তা ব্যবহার করা হবে।',
'loginerror'                 => 'লগ-ইন করতে সমস্যা হয়েছে',
'prefs-help-email'           => '* ই-মেইল (ঐচ্ছিক): এটি দেয়া থাকলে অন্যরা আপনার ব্যবহারকারী পাতার মাধ্যমে আপনার সাথে যোগাযোগ করতে পারবে।  সেজন্য আপনার পরিচয় তাদের জানা থাকা লাগবেনা।',
'prefs-help-email-required'  => 'ই-মেইল ঠিকানা আবশ্যক।',
'nocookiesnew'               => 'ব্যবহারকারীর অ্যাকাউন্টটি সৃষ্টি করা হয়েছে, কিন্তু আপনি এখনও অ্যাকাউন্টে প্রবেশ করেননি। {{SITENAME}}-তে কুকি ব্যবহার করে ব্যবহারকারীদের অ্যাকাউন্টে প্রবেশ করানো হয়। আপনার ব্রাউজারে কুকিগুলি নিষ্ক্রিয় করা আছে। অনুগ্রহ করে কুকিগুলি সক্রিয় করুন এবং আপনার নতুন ব্যবহারকারী নাম ও শব্দচাবি ব্যবহার করে অ্যাকাউন্টে প্রবেশ করুন।',
'nocookieslogin'             => '{{SITENAME}} এ কুকি (cookies) এর মাধ্যমে ব্যবহারকারীদের লগ-ইন সম্পন্ন করা হয়। আপনার ব্রাঊজারে কুকি বন্ধ করে দেওয়া আছে। কুকি চালু করে আবার চেষ্টা করুন।',
'noname'                     => 'আপনি সঠিক ব্যবহারকারী নাম নির্দিষ্ট করেননি।',
'loginsuccesstitle'          => 'প্রবেশ সফল',
'loginsuccess'               => "'''আপনি এইমাত্র \"\$1\" নামে {{SITENAME}}-তে প্রবেশ করেছেন।'''",
'nosuchuser'                 => '"$1" নামের কোন ব্যবহারকারী নেই। নামের বানান পরীক্ষা করুন, অথবা নতুন অ্যাকাউন্ট তৈরি করুন।',
'nosuchusershort'            => '"<nowiki>$1</nowiki>" নামের কোন ব্যবহারকারী নেই। নামের বানান পরীক্ষা করুন।',
'nouserspecified'            => 'আপনাকে অবশ্যই ব্যবহারকারী নাম নির্দিষ্ট করতে হবে।',
'wrongpassword'              => 'আপনি ভুল শব্দচাবি (password) ব্যবহার করেছেন। অনুগ্রহ করে আবার চেষ্টা করুন।',
'wrongpasswordempty'         => 'শব্দচাবি (password) প্রবেশের ঘরটি খালি ছিল। দয়াকরে আবার চেষ্টা করুন।',
'passwordtooshort'           => 'আপনার শব্দচাবি সঠিক নয় অথবা অনেক ছোট। শব্দচাবি অবশ্যই অন্তত $1 অক্ষরের এবং ব্যবহারকারী নামের থেকে পৃথক হতে হবে।',
'mailmypassword'             => 'নতুন শব্দচাবি আমার ইমেইলে পাঠাও',
'passwordremindertitle'      => '{{SITENAME}}-এর জন্য নতুন সাময়িক শব্দচাবি',
'passwordremindertext'       => 'কেউ (সম্ভবত আপনি, $1 আইপি ঠিকানাটি থেকে) অনুরোধ করেছেন যেন আমরা আপনাকে {{SITENAME}}-এর জন্য একটি নতুন শব্দচাবি পাঠাই ($4)।
"$2" নামের ব্যবহারকারীর বর্তমান শব্দচাবি "$3"।
আপনাকে এখন অ্যাকাউন্টে প্রবেশ করতে হবে ও শব্দচাবি বদলাতে হবে।

যদি আপনি ছাড়া অন্য কেউ এই অনুরোধ করে থাকে, কিংবা যদি আপনার পুরনো শব্দচাবিটি মনে পড়ে গিয়ে থাকে ও সেটি আর বদলাবার ইচ্ছা না থাকে, তাহলে এই বার্তাটি উপেক্ষা করতে পারেন এবং পুরনো শব্দচাবিটিই ব্যবহার করে যেতে পারেন।',
'noemail'                    => '"$1" ব্যবহারকারীর জন্য কোন ই-মেইল ঠিকানা সংরক্ষিত নাই।',
'passwordsent'               => 'একটি নতুন শব্দচাবি "$1" ব্যবহারকারীর ই-মেইল ঠিকানায় পাঠানো হয়েছে। দয়াকরে তা পাওয়ার পর আবার লগ্‌-ইন করুন।',
'blocked-mailpassword'       => 'আপনার আইপি ঠিকানাটি থেকে সম্পাদনা করতে বাধা আছে, তাই এই ঠিকানার অপব্যবহার করে শব্দচাবি ফেরত আনতে দেয়া যাবে না।',
'eauthentsent'               => 'মনোনীত ই-মেইল ঠিকানায় একটি নিশ্চিতকরণ ই-মেইল পাঠানো হয়েছে।
অ্যাকাউন্টটিতে অন্য যে কোন ই-মেইল পাঠানোর আগে আপনাকে এই ই-মেইলের নির্দেশগুলি অনুসরণ করতে হবে, যাতে অ্যাকাউন্টটি যে আসলেই আপনার, তা নিশ্চিত হয়।',
'throttled-mailpassword'     => 'বিগত $1 ঘন্টার মধ্যে ইতিমধ্যেই একবার শব্দচাবি বদলের তাগিদ পাঠানো হয়েছে। অপব্যবহার রোধকল্পে প্রতি $1 ঘন্টায় কেবল একবার শব্দচাবি বদলের তাগিদ পাঠানো যাবে।',
'mailerror'                  => 'ইমেইল পাঠাতে সমস্যা: $1',
'acct_creation_throttle_hit' => 'দুঃখিত, আপনি ইতিমধ্যে $1টি অ্যাকাউন্ট তৈরী করেছেন৷ এর বেশী আপনি তৈরী করতে পারবেন না৷',
'emailauthenticated'         => 'আপনার ই-মেইল ঠিকানাটি $1 তারিখে নিশ্চিত করা হয়েছে।',
'emailnotauthenticated'      => 'আপনার ই-মেইলের ঠিকানা <strong>এখনও যাচাই করা হয়নি</strong>। নিচের বৈশিষ্ট্যগুলোর (features) জন্য কোনো ই-মেইল পাঠানো হবে না।',
'noemailprefs'               => 'এই বৈশিষ্টটি কাজ করাতে হলে একটি ই-মেইল ঠিকানা নির্ধারণ করতে হবে।',
'emailconfirmlink'           => 'আপনার ই-মেইলের ঠিকানা নিশ্চিত করুন',
'invalidemailaddress'        => 'এই ই-মেইল ঠিকানাটি গ্রহণযোগ্য নয়, কারণ সম্ভবত এটি অবৈধ ফরম্যাটে লেখা। অনুগ্রহ করে সঠিক ফরম্যাটে লেখা ই-মেইল ঠিকানা প্রবেশ করান, কিংবা ক্ষেত্রটি খালি রাখুন।',
'accountcreated'             => 'অ্যাকাউন্ট তৈরি করা হয়েছে',
'accountcreatedtext'         => '$1 এর জন্য ব্যবহারকারী অ্যাকাউন্ট তৈরি করা হয়েছে।',
'createaccount-title'        => '{{SITENAME}}-এর জন্য অ্যাকাউন্ট সৃষ্টি',
'createaccount-text'         => 'কেউ $2-এর জন্য {{SITENAME}}-এ একটি অ্যাকাউন্ট সৃষ্টি করেছেন ($4)। "$2"-এর জন্য শব্দচাবি হল "$3"। আপনার এখন অ্যাকাউন্টে প্রবেশ করে শব্দচাবি পরিবর্তন করা উচিত।

যদি ভুল করে অ্যাকাউন্টটি সৃষ্টি হয়ে থাকে, তাহলে এই বার্তাটি উপেক্ষা করুন।',
'loginlanguagelabel'         => 'ভাষা: $1',

# Password reset dialog
'resetpass'               => 'অ্যাকাউন্টের শব্দচাবি নতুন (reset) করে দাও',
'resetpass_announce'      => 'আপন ই-মেইলকৃত সংকেত দ্বারা লগ-ইন আছেন। লগ-ইন পদ্ধতি সম্পূর্ণ করতে আপনাকে অবশ্যই একটি নতুন শব্দচাবি গ্রহণ করতে হবে:',
'resetpass_text'          => '<!-- এখানে লেখা যোগ করুন -->',
'resetpass_header'        => 'নতুন (reset) শব্দচাবি দাও',
'resetpass_submit'        => 'শব্দচাবি দাও এবং লগ্‌-ইন করো',
'resetpass_success'       => 'আপনার শব্দচাবি সাফল্যের সাথে পরিবর্তীত হয়েছে! এখন আপনি তে লগ-ইন হচ্ছেন...',
'resetpass_bad_temporary' => 'অস্থায়ী শব্দচাবিটি ভুল। আপনি হয়তো ইতিমধ্যে সফলভাবে শব্দচাবি পরিবর্তন করেছেন অথবা নতুন অস্থায়ী শব্দচাবির জন্য অনুরোধ করেছেন।',
'resetpass_forbidden'     => '{{SITENAME}}-এ শব্দচাবি পরিবর্তন করা যাবে না',
'resetpass_missing'       => 'কোন ফর্ম উপাত্ত নেই।',

# Edit page toolbar
'bold_sample'     => 'গাঢ় লেখা',
'bold_tip'        => 'গাঢ় লেখা',
'italic_sample'   => 'তীর্যক লেখা',
'italic_tip'      => 'তীর্যক লেখা',
'link_sample'     => 'সংযোগের শিরোনাম',
'link_tip'        => 'আভ্যন্তরীণ সংযোগ',
'extlink_sample'  => 'http://www.example.com সংযোগ শিরোনাম',
'extlink_tip'     => 'বহিঃসংযোগ (মনে রাখবেন http:// উপসর্গ)',
'headline_sample' => 'শিরোনাম',
'headline_tip'    => '২য় স্তরের শিরোনাম',
'math_sample'     => 'সূত্র এখানে লিখুন',
'math_tip'        => 'গাণিতিক সূত্র (LaTeX)',
'nowiki_sample'   => 'অ-ফরম্যাটকৃত টেক্সট এখানে প্রবিষ্ট করুন',
'nowiki_tip'      => 'উইকি ফরম্যাটিং উপেক্ষা করা হোক',
'image_tip'       => 'গ্রথিত ফাইল',
'media_tip'       => 'ফাইল সংযোগ',
'sig_tip'         => 'সময় ও তারিখসহ আপনার স্বাক্ষর',
'hr_tip'          => 'অনুভূমিক রেখা (কৃচ্ছ্রতার সাথে ব্যবহার করুন)',

# Edit pages
'summary'                   => 'সম্পাদনা সারাংশ',
'subject'                   => 'বিষয়/শিরোনাম',
'minoredit'                 => 'অনুল্লেখ্য',
'watchthis'                 => 'নজরে রাখুন',
'savearticle'               => 'সংরক্ষণ',
'preview'                   => 'প্রাকদর্শন',
'showpreview'               => 'প্রাকদর্শন',
'showlivepreview'           => 'তাৎক্ষণিক প্রাকদর্শন',
'showdiff'                  => 'পরিবর্তনসমূহ',
'anoneditwarning'           => 'আপনি লগ ইন করেননি। এই পাতার সম্পাদনার ইতিহাসে আপনার আইপি সংখ্যা সংরক্ষিত হবে।',
'missingsummary'            => "'''খেয়াল করুন''':  আপনি কিন্তু সম্পাদনার সারাংশ দেননি। আবার যদি \"সংরক্ষণ\" বোতামে ক্লিক করেন, তাহলে ঐ সারাংশ বাক্যটি ছাড়াই আপনার সম্পাদনা সংরক্ষিত হবে।",
'missingcommenttext'        => 'দয়াকরে নিচে মন্তব্য যোগ করুন।',
'missingcommentheader'      => "'''মনে রাখবেন:''' আপনি এই মন্তব্যের জন্য কোন বিষয়/শিরোনাম দেননি। আপনি যদি সংরক্ষণ বোতাম ক্লিক করেন, তাহলে আপনার সম্পাদনা কোন বিষয়/শিরোনাম ছাড়াই সংরক্ষিত হবে।",
'summary-preview'           => 'সারাংশ প্রাকদর্শন',
'subject-preview'           => 'বিষয়/শিরোনাম প্রাকদর্শন',
'blockedtitle'              => 'ব্যবহারকারীকে বাধা দেয়া হয়েছে',
'blockedtext'               => "আপনার ব্যবহারকারী নাম অথবা আইপি ঠিকানাকে নিষেধাজ্ঞা আরোপিত হয়েছে।
$1 আপনাকে নিষেধাজ্ঞা আরোপ করেছেন। এর কারণ হিসেবে বলা হয়েছেঃ:''$2''

* নিষেধাজ্ঞা আরোপিত হয়েছে:$8
* নিষেধাজ্ঞা প্রত্যাহার হবে: $6
* নিষেধাজ্ঞা আরোপ করেছেন: $7

আপনি  $1 অথবা [[{{MediaWiki:Grouppage-sysop}}|প্রশাসকবৃন্দের]] কারো সাথে এই নিষেধাজ্ঞা সংক্রান্ত বিষয়ে আলোচনা করতে পারেন।

আপনার ই-মেইল ঠিকানা যদি [[Special:Preferences|আপনার পছন্দ তালিকাতে]] যদি লিপিবদ্ধ করা না থাকে, তাহলে আপনি 'এ ব্যবহারকারীকে ইমেইল করো' বৈশিষ্টটি ব্যবহার করতে পারবেন না এবং এটি ব্যবহার করে আপনি আপনার নিষেধাজ্ঞা রোহিত করতে পারবেন না।
আপনার আইপি ঠিকানা $3, এবং আপনার নিষেধাজ্ঞা ক্রম হল #$5। দয়া করে যে কোন যোগাযোগের সময় যে কোন একটি অথবা উভয় সংখ্যা উল্লেখ করুন।",
'autoblockedtext'           => 'আপনার আইপি ঠিকানাকে স্বয়ংক্রিয়ভাবে বাধা দেয়া হয়েছে কারণ একই আইপি ঠিকানার আরেকজন ব্যবহারকারীকে $1 বাধা দিয়েছেন।
বাধাদানের যে কারণ দেয়া হয়েছে:

:\'\'$2\'\'

* বাধা শুরুর সময়: $8
* বাধা শেষের সময়: $6

আপনি $1-এর সাথেক কিংবা অন্য যেকোন
[[{{MediaWiki:Grouppage-sysop}}|প্রশাসকের]] সাথে যোগাযোগ করে বাধার ব্যাপারটি আলোচনা করতে পারেন।

লক্ষ্য করুন, যদি আপনি "এই ব্যবহারকারীকে ই-মেইল করুন" ফিচারটি ব্যবহার করতে চান, তবে আপনার [[Special:Preferences|ব্যবহারকারীর পছন্দগুলিতে]] একটি বৈধ ইমেইল ঠিকানা দেওয়া থাকতে হবে এবং আপনার সেটি ব্যবহারে কোন বাধা থাকতে পারবে না।

আপনার বাধা দানের আইডি হল $5। যেকোন প্রশ্ন করার আগে এই আইডি-টি উল্লেখ করুন।',
'blockednoreason'           => 'কোন কারণ দেওয়া হয়নি',
'blockedoriginalsource'     => "'''$1''' এর উৎস নিচে দেখানো হল:",
'blockededitsource'         => "'''$1''' এ '''আপনার সম্পাদনা''' করা লেখাগুলো নিচে দেখানো হল:",
'whitelistedittitle'        => 'সম্পাদনা করতে লগ্‌-ইন করতে হবে',
'whitelistedittext'         => 'পাতায় সম্পাদনা করতে আপশ্যই $1 করতে হবে।',
'confirmedittitle'          => 'সম্পাদনা করার জন্য ই-মেইল নিশ্চিতকরণ প্রয়োজন',
'confirmedittext'           => 'কোন সম্পাদনা করার আগে আপনার ই-মেইল ঠিকানাটি অবশ্যই নিশ্চিত করতে হবে। দয়া করে আপনার ই-মেইল ঠিকানাটি [[Special:Preferences|ব্যবহারকারীর পছন্দতালিকায়]] ঠিকমত দিন।',
'nosuchsectiontitle'        => 'এমন কোন অনুচ্ছেদ নাই',
'nosuchsectiontext'         => 'আপনি এমন একটি পরিচ্ছেদ সম্পাদনার চেষ্টা করেছেন, যার কোন অস্তিত্ব নেই। যেহেতু $1 নামে কোন পরিচ্ছেদ নেই, তাই আপনার সম্পাদনা সংরক্ষণ করার কোন স্থান নেই।',
'loginreqtitle'             => 'লগ্‌-ইন প্রয়োজন',
'loginreqlink'              => 'লগ-ইন',
'loginreqpagetext'          => 'অন্যান্য পাতা দেখতে হলে আপনাকে অবশ্যই লগ-ইন করতে হবে।',
'accmailtitle'              => 'শব্দচাবি পাঠানো হয়েছে৷',
'accmailtext'               => '"$1"-এর শব্দচাবি(password) $2-এর কাছে পাঠানো হয়েছে৷',
'newarticle'                => '(নতুন)',
'newarticletext'            => 'এই নিবন্ধটি এখনো {{SITENAME}} এ সংযুক্ত হয়নি। আপনি চাইলে নীচের বক্সে বিষয়টি নিয়ে কিছু লিখে ও রক্ষা করে এই নিবন্ধটি শুরু করতে পারেন । যদি ভুলবশত এখানে এসে থাকেন তাহলে ব্রাউজারের ব্যাক বোতামে ক্লিক করে আগের পাতায় ফিরে যান।',
'anontalkpagetext'          => "----''এটি একটি বেনামী ব্যবহারকারীর আলোচনা পাতা, যিনি এখনও কোন অ্যাকাউন্ট সৃষ্টি করেননি কিংবা তাঁর অ্যাকাউন্ট ব্যবহার করছেন না। আমরা তাই সাংখ্যিক আইপি ঠিকানা ব্যবহার করে তাঁকে শনাক্ত করছি। এরকম একটি আইপি ঠিকানা একাধিক ব্যবহারকারী অংশীদারী করতে পারেন। আপনি যদি একজন বেনামী ব্যবহারকারী হন, এবং যদি অনুভব করেন যে আপনার প্রতি অপ্রাসঙ্গিক মন্তব্য করা হয়েছে, অনুগ্রহ করে [[Special:UserLogin|একটি অ্যাকাউন্ট সৃষ্টি করুন বা অ্যাকাউন্টে প্রবেশ করুন]] যাতে অন্যান্য বেনামী ব্যবহারকারীদের সাথে ভবিষ্যত ভুল বোঝাবুঝি না হয়।''",
'noarticletext'             => 'বর্তমানে এই পাতায় কোন টেক্সট নেই। আপনি চাইলে অন্যান্য পাতায় [[Special:Search/{{PAGENAME}}|এই শিরোনামটি অনুসন্ধান করতে পারেন]] কিংবা [{{fullurl:{{FULLPAGENAME}}|action=edit}} এই পাতাটি সম্পাদনা করতে পারেন]।',
'userpage-userdoesnotexist' => '"$1" নামের কোন ব্যবহারকারী অ্যাকাউন্ট নিবন্ধিত হয়নি। অনুগ্রহ করে পরীক্ষা করে দেখুন আপনি এই পাতাটি সৃষ্টি/সম্পাদনা করতে চান কি না।',
'clearyourcache'            => "'''লক্ষ্য করুন:আপনার পছন্দগুলো রক্ষা করার পর পরিবর্তনগুলো দেখার জন্য আপনাকে ব্রাউজারের ক্যাশ এড়াতে হতে পারে।''' 
'''মোজিলা/ফায়ারফক্স/সাফারি:''' ''শিফট'' কী চেপে ধরে ''রিলোড''-এ ক্লিক করুন, কিংবা হয় ''কন্ট্রোল-F5'' অথবা ''কন্ট্রোল-R''(অ্যাপল ম্যাক-এ ''কমান্ড-R'') একসাথে চাপুন; 
'''কংকারার:''' কেবল ''রিলোড'' ক্লিক করলেই বা ''F5'' চাপলেই চলবে; 
'''অপেরা:''' ''Tools→Preferences''-এ গিয়ে ক্যাশ পরিষ্কার করে নিন;
'''ইন্টারনেট এক্সপ্লোরার:''' ''কন্ট্রোল'' চেপে ধরে ''রিফ্রেশ''-এ ক্লিক করুন, কিংবা ''কন্ট্রোল-F5'' চাপুন।",
'usercssjsyoucanpreview'    => '<strong>অণুসহায়িকা:</strong> "প্রাকদর্শন" বোতাম ব্যবহার করে আপনার নতুন সিএসএস/জাভাস্ক্রিপ্ট সংরক্ষণের আগে পরীক্ষা করে দেখুন।',
'usercsspreview'            => "'''মনে রাখবেন আপনি আপনার ব্যবহারকারী সিএসএস শুধুই প্রাকদর্শন করছেন। এটা এখনও সংরক্ষণ করা হয়নি!'''",
'userjspreview'             => "'''মনে রাখুন আপনি আপনার ব্যবহারকারী জাভাস্ক্রিপ্ট কেবলমাত্র পরীক্ষা/প্রাকদর্শন করছেন। এটা এখনও সংরক্ষণ করা হয়নি!'''",
'userinvalidcssjstitle'     => "'''সতর্কীকরণ:''' \"\$1\" নামে কোন আবরণ নেই। মনে রাখবেন, পছন্দমাফিক .css এবং .js পাতাগুলি ছোট হাতের শিরোনাম ব্যবহার করে, যেমন {{ns:user}}:Foo/monobook.css; কিন্তু এরকম শিরোনাম নয়: {{ns:user}}:Foo/Monobook.css",
'updated'                   => '(হালনাগাদ)',
'note'                      => '<strong>নোট:</strong>',
'previewnote'               => '<strong>এটি প্রাকদর্শন মাত্র। কোনো পরিবর্তন এখনও সংরক্ষণ করা হয়নি!</strong>',
'previewconflict'           => 'এই প্রাকদর্শনটি সম্পাদনা ক্ষেত্রের উপরের অংশটির টেক্সট সংরক্ষণ করলে যেরকম দেখাবে, তা দেখাচ্ছে।',
'session_fail_preview'      => '<strong>দুঃখিত! সেশন ডাটা হারিয়ে যাওয়ার কারণে আপনার সম্পাদনাটি সংরক্ষণ করা সম্ভব হয়নি। দয়া করে লেখাটি আবার জমা দেয়ার চেষ্টা করুন। যদি এতেও কাজ না হয়, তবে অ্যাকাউন্ট থেকে বেরিয়ে গিয়ে আবার অ্যাকাউন্টে প্রবেশ করে চেষ্টা করুন।</strong>',
'session_fail_preview_html' => "<strong>দুঃখিত! সেশন উপাত্ত হারিয়ে যাওয়ার কারণে আমরা আপনার সম্পাদনাটি প্রক্রিয়া করতে পারিনি।</strong>

''{{SITENAME}}-এ raw HTML সক্রিয় আছে বলে জাভাস্ক্রিপ্টভিত্তিক আক্রমণ থেকে প্রতিরক্ষার জন্য প্রাকদর্শনটি দেখানো হচ্ছে না।''

<strong>যদি এটি সম্পাদনার একটি বৈধ প্রচেষ্টা হয়, তবে অনুগ্রহ করে আবার চেষ্টা করুন। যদি তারপরেও কাজ না হয়, তবে অ্যাকাউন্ট থেকে বেরিয়ে গিয়ে আবার প্রবেশ করে চেষ্টা করুন।</strong>",
'token_suffix_mismatch'     => '<strong>আপনার সম্পাদনাটি প্রত্যাখ্যান করা হয়েছে, কারণ আপনার ক্লায়েন্ট প্রোগ্রামটি সম্পাদনা টেক্সটের বিরামচিহ্নগুলি গুলিয়ে ফেলেছে। পাতাটির টেক্সটে যাতে ক্ষতি না হয় সেজন্য সম্পাদনাটি প্রত্যাখ্যান করা হয়েছে। আপনি কোন ত্রুটিপূর্ণ ওয়েব-ভিত্তিক বেনামী প্রক্সি সেবা ব্যবহার করলে এরকম হতে পারে।</strong>',
'editing'                   => 'সম্পাদনা করছেন: $1',
'editingsection'            => 'সম্পাদনা করছেন $1 (অনুচ্ছেদ)',
'editingcomment'            => 'সম্পাদনা করছেন $1 (মন্তব্য)',
'editconflict'              => 'সম্পাদনা দ্বন্দ্ব: $1',
'explainconflict'           => "আপনি পাতাটি সম্পাদনা শুরু করার পর অন্য কেউ পাতাটিতে পরিবর্তন এনেছে।
টেক্সট এলাকার উপরের অংশে বর্তমানে টেক্সট যেভাবে আছে, তা দেখানো হয়েছে।
আপনার পরিবর্তনগুলি টেক্সট এলাকার নিচের অংশে দেখানো হয়েছে।
আপনাকে আপনার পরিবর্তনগুলি বর্তমানে বিদ্যমান টেক্সটের সাথে মিলিয়ে দিতে হবে।
আপনি \"সংরক্ষণ\" চাপলে '''শুধুমাত্র''' টেক্সট এলাকার উপরের অংশটি সংরক্ষিত হবে।",
'yourtext'                  => 'আপনার লেখা বিষয়বস্তু',
'storedversion'             => 'সংরক্ষিত সংস্করণ',
'nonunicodebrowser'         => '<strong>সতর্কীকরণ: আপনার ব্রাউজার ইউনিকোড-বন্ধুভাবাপন্ন নয়। আপনি যাতে বিপদ ছাড়াই পাতা সম্পাদনা করতে পারেন, সে জন্য সমাধান আছে: অ-আস্কি ক্যারেক্টারগুলি হেক্সাডেসিমাল কোড হিসেবে দেখানো হবে।</strong>',
'editingold'                => '<strong>সতর্কীকরণ: আপনি এই পাতাটির একটি পুরনো সংস্করণ সম্পাদনা করছেন।
যদি আপনি এটি সংরক্ষণ করেন, তবে ঐ সংস্করণের পরবর্তী অন্য সব সংশোধন হারিয়ে যাবে।</strong>',
'yourdiff'                  => 'পার্থক্য',
'copyrightwarning'          => 'অনুগ্রহ করে লক্ষ্য করুন {{SITENAME}}-তে সমস্ত অবদান $2-এর আওতায় প্রাপ্য (বিস্তারিত $1-তে দেখুন)। আপনার জমা দেয়া লেখা যে কেউ হৃদয়হীনভাবে সম্পাদনা করতে এবং যথেচ্ছভাবে পুনর্বিতরণ করতে পারেন। আপনি যদি এ ব্যাপারে একমত না হন, তাহলে এখানে আপনার লেখা জমা দেবেন না।<br />
আপনি আরো প্রতিজ্ঞা করছেন যে, এই লেখাগুলো আপনি নিজে লিখেছেন, বা সাধারণের ব্যবহারের জন্য উন্মুক্ত কোন উৎস থেকে সংগ্রহ করেছেন।
<strong>স্বত্ব সংরক্ষিত কোন লেখা স্বত্বাধিকারীর অনুমতি ছাড়া এখানে জমা দেবেন না!</strong>',
'copyrightwarning2'         => 'দয়া করে লক্ষ্য করুন: {{SITENAME}}-এর এই ভুক্তিতে আপনার লেখা বা অবদান অন্যান্য ব্যবহারকারীরা পরিবর্তন বা পরিবর্ধন করতে, এমনকি মুছে ফেলতে পারবেন। {{SITENAME}} এ আপনার সকল লেখালেখি/অবদান গনু ফ্রি ডকুমেন্টেশনের ($1) আওতায় বিনামূল্যে প্রাপ্য ও হস্তান্তরযোগ্য। আপনার জমা দেয়া লেখা যে কেউ হৃদয়হীনভাবে সম্পাদনা করতে এবং যথেচ্ছভাবে ব্যবহার করতে পারেন। আপনি যদি এ ব্যাপারে একমত না হন, তাহলে এখানে আপনার লেখা জমা দেবেন না। আপনি আরো প্রতিজ্ঞা করছেন যে, এই লেখাগুলো আপনি নিজে লিখেছেন (তবে কোন মৌলিক গবেষণা নয়) বা সাধারণের ব্যবহারের জন্য উন্মুক্ত কোন উৎস থেকে সংগ্রহ করেছেন। <strong>স্বত্ব সংরক্ষিত কোন লেখা স্বত্বাধিকারীর অনুমতি ছাড়া এখানে জমা দেবেন না।</strong>',
'longpagewarning'           => '<strong>সতর্কীকরণ: এই পাতাটি $1 কিলোবাইট দীর্ঘ; কিছু ব্রাউজারে ৩২ কিলোবাইটের চেয়ে দীর্ঘ পাতা সম্পাদনা করতে সমস্যা হতে পারে।
অনুগ্রহ করে পাতাটিকে একাধিক ক্ষুদ্রতর অংশে ভাগ করার চেষ্টা করুন।</strong>',
'longpageerror'             => '<strong>ত্রুটি: আপনার জমা দেয়া টেক্সটের পরিমাণ $1 কিলোবাইট, যা সর্বোচ্চ সীমা $2 কিলোবাইটের চেয়ে বেশি। এটি সংরক্ষণ করা সম্ভব নয়।</strong>',
'readonlywarning'           => '<strong>সতর্কীকরণ: রক্ষণাবেক্ষণের জন্য ডাটাবেজ বন্ধ রাখা হয়েছে, তাই আপনি আপনার সম্পাদনাগুলি এই মুহূর্তে সংরক্ষণ করতে পারবেন না। আপনি ইচ্ছা করলে টেক্সটটি কাট-অ্যান্ড-পেস্ট করে কোন টেক্সট ফাইলে ভবিষ্যতের জন্য সংরক্ষণ করে রাখতে পারেন।</strong>',
'protectedpagewarning'      => '<strong>সতর্কীকরণ: এই পাতাটি বন্ধ করা হয়েছে; কেবলমাত্র প্রশাসক মর্যাদার ব্যবহারকারীরাই এটি সম্পাদনা করতে পারবেন।</strong>',
'semiprotectedpagewarning'  => "'''নোট:''' এই পাতাটির ব্যবহার নিয়ন্ত্রণ করা হয়েছে তাই নিবন্ধনকৃত ব্যবহারকারী এটি সম্পাদনা করতে পারবেন।",
'cascadeprotectedwarning'   => "'''সতর্কীকরণ:''' এই পাতাটি বন্ধ করা হয়েছে, যাতে কেবল প্রশাসকের ক্ষমতাবিশিষ্ট ব্যবহারকারীরা এটি সম্পাদনা করতে পারেন, কারণ এই পাতাটি নিচের প্রপাতাকারে সুরক্ষিত (cascade-protected) {{PLURAL:$1|টি পাতায়|টি পাতায়}} অন্তর্ভুক্ত আছে:",
'titleprotectedwarning'     => '<strong>সতর্কীকরণ: এই পাতাটি বন্ধ করা আছে, যাতে কেবলমাত্র কিছু ব্যবহারকারী এটি সৃষ্টি করতে পারেন।</strong>',
'templatesused'             => 'এই পাতায় ব্যবহৃত টেম্পলেট:',
'templatesusedpreview'      => 'এই প্রাকদর্শনে ব্যবহৃত টেম্পলেটসমূহ:',
'templatesusedsection'      => 'এই অনুচ্ছেদে ব্যবহৃত টেম্পলেটসমূহ:',
'template-protected'        => '(সুরক্ষিত)',
'template-semiprotected'    => '(অর্ধ-সুরক্ষিত)',
'nocreatetitle'             => 'পাতা তৈরি নিয়ন্ত্রণ করা হয়েছে',
'nocreatetext'              => '{{SITENAME}}-এ নতুন পাতা সৃষ্টি করার ক্ষমতা সীমাবদ্ধ করা হয়েছে।
আপনি ফিরে গিয়ে ইতিমধ্যে বিদ্যমান কোন পাতা সম্পাদনা করতে পারেন, অথবা [[Special:UserLogin|অ্যাকাউন্টে প্রবেশ কিংবা অ্যাকাউন্ট সৃষ্টি করতে পারেন]]।',
'nocreate-loggedin'         => 'আপনার এই উইকিতে নতুন পাতা তৈরির অনুমতি নাই।',
'permissionserrors'         => 'অনুমতি ত্রুটিসমূহ',
'permissionserrorstext'     => 'আপনার এটা করার অনুমতি নেই, নিচের {{PLURAL:$1|টি কারণের|টি কারণের}} জন্য:',
'recreate-deleted-warn'     => "'''সতর্কীকরণ: আপনি এমন একটি পাতা সৃষ্টি করছেন যা পূর্বে মুছে দেয়া হয়েছিল।'''

আপনি পাতাটি আর সম্পাদনা করবেন কি না বিবেচনা করে দেখুন।
আপনার সুবিধার্থে পাতাটির অবলুপ্তি লগ এখানে দেয়া হল:",

# "Undo" feature
'undo-success' => 'সম্পাদনাটি বাতিল করা যাবে। অনুগ্রহ করে নিচের তুলনাটি পরীক্ষা করে দেখুন ও নিশ্চিত করুন যে এটাই আপনি করতে চান, এবং তারপর নিচের সম্পাদনাগুলি সংরক্ষণ করে সম্পাদনাটির বাতিল প্রক্রিয়া সমাপ্ত করুন।',
'undo-failure' => 'এ সম্পাদনা মধ্যবর্তী সম্পাদনাসমূহের কারণে পূর্বাবস্থায় ফিরিয়ে নেওয়া যাবে না।',
'undo-summary' => '[[Special:Contributions/$2|$2]] ([[User talk:$2|আলাপ]])-এর করা $1 সংশোধনটি বাতিল করা হোক',

# Account creation failure
'cantcreateaccounttitle' => 'অ্যাকাউন্ট তৈরি করা যাবে না',
'cantcreateaccount-text' => "[[User:$3|$3]] এই আইপি ঠিকানা('''$1''') থেকে অ্যাকাউন্ট সৃষ্টিতে বাধা দিয়েছেন।

$3-এর দেয়া কারণ হল ''$2''",

# History pages
'viewpagelogs'        => 'এই পাতার জন্য লগ্‌গুলো দেখুন',
'nohistory'           => 'এই পাতার কোন সম্পাদনার ইতিহাস নাই।',
'revnotfound'         => 'সংশোধন খুজে পাওয়া যাচ্ছে না',
'revnotfoundtext'     => 'আপনির পাতাটির যে পুরনো সংস্করণটি অনুরোধ করেছেন, তা খুঁজে পাওয়া যায়নি। পাতাটিতে যাবার জন্য আপনি যে URL-টি ব্যবহার করেছিলেন, অনুগ্রহ করে সেটি পরীক্ষা করে দেখুন।',
'currentrev'          => 'বর্তমান সংশোধন',
'revisionasof'        => '$1 তারিখের সংশোধন',
'revision-info'       => '$1-এ $2-এর করা সংশোধন',
'previousrevision'    => '←পুর্বের সংস্করণ',
'nextrevision'        => 'পরবর্তী সংস্করণ→',
'currentrevisionlink' => 'বর্তমান সংশোধন',
'cur'                 => 'বর্তমান',
'next'                => 'পরবর্তী',
'last'                => 'পূর্ববর্তী',
'page_first'          => 'প্রথম',
'page_last'           => 'শেষ',
'histlegend'          => 'পার্থক্য (Diff) নির্বাচন: যে সংস্করণগুলো তুলনা করতে চান, সেগুলো চিহ্নিত করে এন্টার বা নিচের বোতামটি টিপুন।<br />
নির্দেশিকা: (বর্তমান) = বর্তমান সংস্করণের সাথে পার্থক্য,(পূর্ববর্তী) =  পূর্বের সংস্করণের সাথে পার্থক্য, অ = অনুল্লেখ্য সম্পাদনা।',
'deletedrev'          => '[অবলুপ্ত]',
'histfirst'           => 'সবচেয়ে পুরনো',
'histlast'            => 'সাম্প্রতিক',
'historysize'         => '({{PLURAL:$1|১ বাইট|$1 বাইট}})',
'historyempty'        => '(খালি)',

# Revision feed
'history-feed-title'          => 'সংশোধন ইতিহাস',
'history-feed-description'    => 'এ উইকিতে এই পাতার সংশোধনের ইতিহাস',
'history-feed-item-nocomment' => '$2-এ $1', # user at time
'history-feed-empty'          => 'অনুরোধকৃত পাতাটির কোন অস্তিত্ব নেই।
হয়ত পাতাটি উইকি থেকে মুছে ফেলা হয়েছে, কিংবা নতুন নামকরণ করা হয়েছে।
প্রাসঙ্গিক নতুন পাতাগুলির জন্য [[Special:Search|উইকি অনুসন্ধানের]] চেষ্টা করুন।',

# Revision deletion
'rev-deleted-comment'         => '(মন্তব্য সরিয়ে নেওয়া হয়েছে)',
'rev-deleted-user'            => '(ব্যবহারকারীর নাম সরিয়ে নেওয়া হয়েছে)',
'rev-deleted-event'           => '(ভুক্তি সরিয়ে নেওয়া হয়েছে)',
'rev-deleted-text-permission' => '<div class="mw-warning plainlinks">
এই সংশোধনটি উন্মুক্ত আর্কাইভ থেকে সরিয়ে ফেলা হয়েছে।
[{{fullurl:Special:Log/delete|page={{FULLPAGENAMEE}}}} অবলুপ্তি লগে] এ ব্যাপারে বিস্তারিত বিবরণ থাকতে পারে।
</div>',
'rev-deleted-text-view'       => '<div class="mw-warning plainlinks">
এই সংশোধনটি উন্মুক্ত আর্কাইভ থেকে সরিয়ে ফেলা হয়েছে।
{{SITENAME}}-এর একজন প্রশাসক হিসেবে আপনি এটি দেখতে পারেন; [{{fullurl:Special:Log/delete|page={{FULLPAGENAMEE}}}} অবলুপ্তি লগে] এ ব্যাপারে বিস্তারিত বিবরণ থাকতে পারে।
</div>',
'rev-delundel'                => 'দেখাও/আড়াল করো',
'revisiondelete'              => 'অবলুপ্ত/পুনঃস্থাপন সংশোধনসমূহ',
'revdelete-nooldid-title'     => 'কোন লক্ষ্য সংশোধন নাই',
'revdelete-nooldid-text'      => 'এই কাজটি সম্পন্ন করার জন্য আপনি কোন লক্ষ্য সম্পাদনা বা সংশোধন নির্দিষ্ট করে দেননি।',
'revdelete-selected'          => "'''$1'''-এর {{PLURAL:$2|টি নির্বাচিত সংশোধন|টি নির্বাচিত সংশোধন}}:",
'logdelete-selected'          => "'''$1'''-এর জন্য {{PLURAL:$1|টি নির্বাচিত লগ-ঘটনা|টি নির্বাচিত লগ-ঘটনা}}:",
'revdelete-text'              => 'মুছে ফেলা সংশোধন ও ঘটনাগুলি এখনও পাতার ইতিহাস ও লগগুলিতে দেখা যাবে, কিন্তু তাদের বিষয়বস্তুর অংশবিশেষ সাধারণ জনগণের কাছে উন্মুক্ত থাকবে না।

{{SITENAME}}-এর অন্যান্য প্রশাসকেরা লুকানো বিষয়বস্তু দেখতে পারবেন এবং এই একই ইন্টারফেসের মাধ্যমে এগুলির মুছে ফেলা বাতিল করতে পারবেন, যদি না অতিরিক্ত কোন সীমাবদ্ধতা থেকে থাকে।',
'revdelete-legend'            => 'সীমাবদ্ধ করো',
'revdelete-hide-text'         => 'সংশোধিত লেখা আড়াল করো',
'revdelete-hide-name'         => 'কাজ এবং লক্ষ্য আড়াল করো',
'revdelete-hide-comment'      => 'সম্পাদনা মন্তব্য আড়াল করো',
'revdelete-hide-user'         => 'সম্পাদকে ব্যবহারকারীর নাম/আইপি আড়াল করো',
'revdelete-hide-restricted'   => 'এই সীমাবদ্ধতা প্রশাসক সহ সবার ক্ষেত্রে প্রয়োগ করো',
'revdelete-suppress'          => 'সব প্রশাসক ও অন্যান্যদের কাছ থেকে উপাত্ত লুকিয়ে রাখা হোক।',
'revdelete-hide-image'        => 'ফাইলের বিষয়বস্তু আড়াল করো',
'revdelete-unsuppress'        => 'সংশোধন পুনঃস্থাপনের উপর সীমাবদ্ধতা দূর করো',
'revdelete-log'               => 'লগ্‌ মন্তব্য:',
'revdelete-submit'            => 'নির্বাচিত সংশোধনে প্রয়োগ করো',
'revdelete-logentry'          => '[[$1]]-এর সংশোধন দৃশ্যমানতা পরিবর্তন করা হয়েছে',
'logdelete-logentry'          => '[[$1]]-এর ঘটনা দৃশ্যমানতা পরিবর্তন করা হয়েছে',
'revdelete-success'           => "'''সংশোধন দৃশ্যমানতা সফলভাবে স্থাপন করা হয়েছে।'''",
'logdelete-success'           => "'''ঘটনা দৃশ্যমানতা সফলভাবে স্থাপন করা হয়েছে।'''",

# History merging
'mergehistory'                     => 'পাতার ইতিহাসগুলি একত্র করা হোক',
'mergehistory-header'              => 'এই পাতাটির মাধ্যমে আপনি একটি উৎস পাতার ইতিহাস একটি নতুনতর পাতার সাথে একত্র করতে পারবেন।
পাতার ইতিহাসের পারম্পর্য যেন রক্ষা পায়, সে ব্যাপারটি নিশ্চিত করুন।',
'mergehistory-box'                 => 'দুইটি পাতার একত্রীকরণ সংশোধনগুলি:',
'mergehistory-from'                => 'উৎস পাতা:',
'mergehistory-into'                => 'গন্তব্য পাতা:',
'mergehistory-list'                => 'একীকরণযোগ্য সম্পাদনা ইতিহাস',
'mergehistory-merge'               => '[[:$1]]-এর নিচের সংশোধনগুলি [[:$2]]-এর সাথে একত্র করা যাবে। রেডিও বোতাম কলামটি ব্যবহার করে কেবলমাত্র নির্দেশিত সময় ও তার আগের সমস্ত সংশোধন একত্র করুন। লক্ষ্য করুন, পরিভ্রমণ সংযোগ ব্যবহার করলে কলামটি আদি অবস্থায় ফেরত যাবে।',
'mergehistory-go'                  => 'একত্রীকরণযোগ্য সম্পাদনাগুলি দেখানো হোক',
'mergehistory-submit'              => 'সংশোধনগুলি একত্র করা হোক',
'mergehistory-empty'               => 'কোন সংশোধন একত্র করা যাবে না.',
'mergehistory-success'             => '[[:$1]]-এর $3টি সংশোধন সফলভাবে [[:$2]]-এর সাথে একত্রিত করা হয়েছে।',
'mergehistory-fail'                => 'ইতিহাস একত্র করা গেল না। অনুগ্রহ করে পাতাটি ও সময়ের প্যারামিটারগুলি আবার পরীক্ষা করে দেখুন।',
'mergehistory-no-source'           => '$1 বলে কোন উৎস পাতার অস্তিত্ব নেই।',
'mergehistory-no-destination'      => '$1 বলে কোন গন্তব্য পাতার অস্তিত্ব নেই।',
'mergehistory-invalid-source'      => 'উৎস পাতার অবশ্যই একটি বৈধ শিরোনাম থাকতে হবে।',
'mergehistory-invalid-destination' => 'গন্তব্য পাতার একটি বৈধ শিরোনাম থাকতে হবে।',

# Merge log
'mergelog'           => 'একত্রীকরণ লগ',
'pagemerge-logentry' => '[[$1]]-কে [[$2]]-এ একত্র করা হয়েছে ($3 পর্যন্ত সংশোধনগুলিসহ)',
'revertmerge'        => 'একত্রীকরণ বাতিল করা হোক',
'mergelogpagetext'   => 'নিচে সবচেয়ে সাম্প্রতিক ঘটা এক পাতার ইতিহাসের সাথে অন্য পাতার ইতিহাসের একত্রীকরণের একটি তালিকা দেওয়া হল।',

# Diffs
'history-title'           => '"$1" এর সংশোধনের ইতিহাস',
'difference'              => '(সংশোধনগুলোর মধ্যে পার্থক্য)',
'lineno'                  => '$1 নং লাইন:',
'compareselectedversions' => 'নির্বাচিত সংস্করণগুলো তুলনা করো',
'editundo'                => 'বাতিল',
'diff-multi'              => '({{PLURAL:$1|একটি অন্তর্বর্তীকালীন সংশোধন|$1টি অন্তর্বর্তীকালীন সংশোধন}} দেখানো হয়নি।)',

# Search results
'searchresults'         => 'অনুসন্ধানের ফলাফল',
'searchresulttext'      => '{{SITENAME}} এ অনুসন্ধানের ব্যাপারে আরও তথ্যের জন্য [[{{MediaWiki:Helppage}}|{{int:help}}]] দেখুন।',
'searchsubtitle'        => "আপনি অনুসন্ধান করেছেন '''[[:$1]]'''",
'searchsubtitleinvalid' => "আপনি অনুসন্ধান করেছেন '''$1'''",
'noexactmatch'          => "'''\"\$1\" শিরোনামের কোন পাতা নেই।''' আপনি [[:\$1|পাতাটি সৃষ্টি করতে পারেন]]।",
'noexactmatch-nocreate' => "'''\"\$1\" শিরোনামের কোন পাতা নেই।'''",
'titlematches'          => 'নিবন্ধের শিরোনাম মিলেছে',
'notitlematches'        => 'কোন পাতার শিরোনামের সাথে মিলে নাই',
'textmatches'           => 'পাতার লেখার সাথে মিলেছে',
'notextmatches'         => 'কোন পাতার লেখার সাথে মিলে নাই',
'prevn'                 => 'পূর্ববর্তী $1টি',
'nextn'                 => 'পরবর্তী $1টি',
'viewprevnext'          => '($1) ($2) ($3) দেখানো হোক।',
'searchall'             => 'সমস্ত',
'showingresults'        => "নিচে '''$2''' নং থেকে শুরু করে প্রথম '''$1'''টি ফলাফল দেখানো হল।",
'showingresultsnum'     => "নিম্নে {{PLURAL:$3|'''1''' ফলাফল|'''$3''' ফলাফলসমূহ}} দেখানো হয়েছে যা শুরু হয়েছে #'''$2''' দিয়ে।",
'nonefound'             => "'''লক্ষ্য করুন''': অনেক সময় খুব সাধারণ শব্দ যেগুলি ইন্ডেক্স করা হয়নি, যেমন \"have\" এবং \"from\" দিয়ে অনুসন্ধান করলে, কিংবা একাধিক অনুসন্ধান পদ নির্দিষ্ট করলে (কেবল যে সমস্ত পাতাতে সবগুলি অনুসন্ধান পদ উপস্থিত আছে, সেগুলিই ফলাফলে দেখানো হবে) অনুসন্ধান সফল হয় না ।",
'powersearch'           => 'উন্নত অনুসন্ধান',
'searchdisabled'        => '{{SITENAME}} অনুসন্ধান এখন নিষ্ক্রিয় আছে। আপনি গুগলের মাধ্যমে অনুসন্ধান চালাতে পারেন। লক্ষ্য করুন যে {{SITENAME}}-এর বিষয়বস্তুর উপর গুগলের ইন্ডেক্সগুলি হালনাগাদ না-ও করা থাকতে পারে।',

# Preferences page
'preferences'              => 'আমার পছন্দ',
'mypreferences'            => 'আমার পছন্দ',
'prefs-edits'              => 'সম্পাদনার সংখ্যা:',
'prefsnologin'             => 'আপনি লগ-ইন করেননি',
'prefsnologintext'         => 'ব্যবহারকারীর পছন্দ ঠিক করতে আপনাকে অবশ্যই [[Special:UserLogin|লগ্‌-ইন]] থাকতে হবে।',
'prefsreset'               => 'স্টোরেজ থেকে পছন্দগুলি আদি অবস্থায় ফেরত নেওয়া হয়েছে।',
'qbsettings'               => 'কুইকবার',
'qbsettings-none'          => 'কিছুই না',
'qbsettings-fixedleft'     => 'স্থায়ী বাম',
'qbsettings-fixedright'    => 'স্থায়ী ডান',
'qbsettings-floatingleft'  => 'ভাসমান বাম',
'qbsettings-floatingright' => 'ভাসমান ডান',
'changepassword'           => 'শব্দচাবি (password) পরিবর্তন',
'skin'                     => 'আবরণ (Skin)',
'math'                     => 'গণিত',
'dateformat'               => 'তারিখের ফরম্যাট',
'datedefault'              => 'কোন পছন্দ নেই',
'datetime'                 => 'তারিখ ও সময়',
'math_failure'             => 'পার্স করতে ব্যর্থ',
'math_unknown_error'       => 'অজানা ত্রুটি',
'math_unknown_function'    => 'অজানা ফাংশন',
'math_lexing_error'        => 'লেক্সিং ত্রুটি',
'math_syntax_error'        => 'সিনট্যাক্স ত্রুটি',
'math_image_error'         => 'PNG রূপান্তর ব্যর্থ; latex, dvips, gs, এবং convert ঠিকমত ইন্সটল হয়েছে কি না পরীক্ষা করুন',
'math_bad_tmpdir'          => 'সাময়িক ম্যাথ ডিরেক্টরি সৃষ্টি করতে বা এতে লিখতে পারা যাচ্ছে না।',
'math_bad_output'          => 'ম্যাথ আউটপুট ডিরেক্টরি সৃষ্টি করতে বা এতে লিখতে পারা যাচ্ছে না।',
'math_notexvc'             => 'texvc executable হারানো গেছে; অনুগ্রহ করে কনফিগার করার জন্য math/README দেখুন।',
'prefs-personal'           => 'ব্যবহারকারীর প্রোফাইল',
'prefs-rc'                 => 'সাম্প্রতিক পরিবর্তনসমূহ',
'prefs-watchlist'          => 'নজর তালিকা',
'prefs-watchlist-days'     => 'সর্বোচ্চ দিনের নজর তালিকা দেখানোর জন্য:',
'prefs-watchlist-edits'    => 'সম্প্রসারিত নজর তালিকায় সর্বোচ্চ সংখ্যার পরিবর্তন দেখানোর জন্য:',
'prefs-misc'               => 'বিবিধ',
'saveprefs'                => 'সংরক্ষণ করো',
'resetprefs'               => 'আবার শুরু করো',
'oldpassword'              => 'পুরনো শব্দচাবি',
'newpassword'              => 'নতুন শব্দচাবি:',
'retypenew'                => 'নতুন শব্দচাবি আবার টাইপ করুন:',
'textboxsize'              => 'সম্পাদনা',
'rows'                     => 'সারি:',
'columns'                  => 'কলাম:',
'searchresultshead'        => 'অনুসন্ধান',
'resultsperpage'           => 'প্রতি পাতায় হিট:',
'contextlines'             => 'লাইন প্রতি হিটে:',
'contextchars'             => 'প্রতি লাইনে কন্‌টেক্সট সংখ্যা:',
'stub-threshold'           => '<a href="#" class="stub">অসম্পূর্ণ নিবন্ধের সংযোগগুলির</a> বিশেষ ফরম্যাটিঙের সীমা (বাইটে):',
'recentchangesdays'        => 'সাম্প্রতিক পরিবর্তনে দিনসমূহ দেখানোর জন্য:',
'recentchangescount'       => 'সাম্প্রতিক পরিবর্তনে প্রদর্শিত সম্পাদনার সংখ্যা:',
'savedprefs'               => 'আপনার পছন্দগুলো সংরক্ষণ করা হয়েছে।',
'timezonelegend'           => 'সময় বলয়',
'timezonetext'             => '¹আপনার স্থানীয় সময় থেকে সার্ভারের সময়ের (UTC) পার্থক্য (ঘন্টায়)।',
'localtime'                => 'স্থানীয় সময়',
'timezoneoffset'           => 'সময়পার্থক্য¹',
'servertime'               => 'সার্ভারের সময়',
'guesstimezone'            => 'ব্রাউজার থেকে পূরণ করো',
'allowemail'               => 'অন্য ব্যবহারকারীদেরকে আপনাকে ই-মেইল পাঠানোর অনুমতি দিন।',
'defaultns'                => 'নির্দিষ্ট করা না থাকলে এই নামস্থানগুলিতে অনুসন্ধান করা হোক:',
'default'                  => 'আদি অবস্থা',
'files'                    => 'ফাইল',

# User rights
'userrights'               => 'ব্যবহারকারী অধিকার ব্যবস্থাপনা', # Not used as normal message but as header for the special page itself
'userrights-lookup-user'   => 'ব্যবহারকারী দল ব্যবস্থাপনা করুন',
'userrights-user-editname' => 'ব্যবহারকারীর নাম লিখুন:',
'editusergroup'            => 'ব্যবহারকারীর দল সম্পাদনা করো',
'editinguser'              => "ব্যবহারকারী সম্পাদনা করছেন '''[[User:$1|$1]]''' ([[User talk:$1|{{int:talkpagelinktext}}]] | [[Special:Contributions/$1|{{int:contribslink}}]])",
'userrights-editusergroup' => 'ব্যবহারকারীর দল সম্পাদনা করো',
'saveusergroups'           => 'ব্যবহারকারীর দল সংরক্ষণ করো',
'userrights-groupsmember'  => 'সদস্য:',
'userrights-reason'        => 'পরিবর্তনের কারণ:',
'userrights-no-interwiki'  => 'আপনার অন্য উইকিতে ব্যবহারকারী অধিকার সম্পাদনা করার অনুমতি নেই।',
'userrights-nodatabase'    => '$1 ডাটাবেজটির হয় কোন অস্তিত্ব নেই অথবা এটি স্থানীয় ডাটাবেজ নয়।',
'userrights-nologin'       => 'ব্যবহারকারী অধিকার প্রযুক্ত করতে হলে আপনাকে কোন প্রশাসকের অ্যাকাউন্টে [[Special:UserLogin|প্রবেশ]] করতে হবে।',
'userrights-notallowed'    => 'আপনার অ্যাকাউন্ট থেকে ব্যবহারকারী অধিকার প্রযুক্ত করার অনুমতি নেই।',

# Groups
'group'               => 'দল:',
'group-autoconfirmed' => 'স্বয়ংক্রিয়ভাবে নিশ্চিতকৃত ব্যবহারকারীরা',
'group-bot'           => 'বট',
'group-sysop'         => 'প্রশাসক',
'group-bureaucrat'    => 'নীতি নির্ধারক',
'group-all'           => '(সমস্ত)',

'group-autoconfirmed-member' => 'স্বয়ংক্রিয়ভাবে নিশ্চিতকৃত ব্যবহারকারী',
'group-bot-member'           => 'বট',
'group-sysop-member'         => 'প্রশাসক',
'group-bureaucrat-member'    => 'নীতি নির্ধারক',

'grouppage-autoconfirmed' => '{{ns:project}}:স্বয়ংক্রিয়ভাবে নিশ্চিতকৃত ব্যবহারকারীরা',
'grouppage-bot'           => '{{ns:project}}:বটগুলি',
'grouppage-sysop'         => '{{ns:project}}:প্রশাসকেরা',
'grouppage-bureaucrat'    => '{{ns:project}}:আমলারা',

# User rights log
'rightslog'      => 'ব্যবহারকারীর অধিকার লগ',
'rightslogtext'  => 'এটি ব্যবহারকারী অধিকারে আনা পরিবর্তনগুলির একটি লগ।',
'rightslogentry' => '$1-কে $2 দল থেকে পরিবর্তন করে $3 দলের সদস্য করা হয়েছে',
'rightsnone'     => '(নেই)',

# Recent changes
'nchanges'                          => '$1 টি পরিবর্তন',
'recentchanges'                     => 'সাম্প্রতিক পরিবর্তনসমূহ',
'recentchangestext'                 => 'এই পাতায় উইকিটির সবচেয়ে সাম্প্রতিক পরিবর্তনগুলি অনুসরণ করুন।',
'recentchanges-feed-description'    => 'এই ফিডে উইকিটির সবচেয়ে সাম্প্রতিক পরিবর্তনগুলি অনুসরণ করুন।',
'rcnote'                            => 'বিগত <strong>$2</strong> দিনে সংঘটিত <strong>$1</strong>টি পরিবর্তন নীচে দেখানো হল (যেখানে বর্তমান সময় ও তারিখ $3)।',
'rcnotefrom'                        => "'''$2'''-এর পরে সংঘটিত পরিবর্তনগুলো নিচে দেখানো হল ('''$1'''টি)।",
'rclistfrom'                        => '$1-এর পর সংঘটিত নতুন পরিবর্তনগুলো দেখাও।',
'rcshowhideminor'                   => 'অনুল্লেখ্য পরিবর্তনগুলো $1',
'rcshowhidebots'                    => 'বটগুলো $1',
'rcshowhideliu'                     => 'প্রবেশ করেছেন এমন ব্যবহারকারীদের $1',
'rcshowhideanons'                   => 'বেনামী ব্যবহারকারীদের $1',
'rcshowhidepatr'                    => '$1 পরীক্ষিত সম্পাদনা',
'rcshowhidemine'                    => 'আমার সম্পাদনাগুলো $1',
'rclinks'                           => "'''প্রদর্শনের ধরন'''<br />
* বিগত ($2) দিনের শেষ ($1)টি পরিবর্তন দেখাও
* $3",
'diff'                              => 'পরিবর্তন',
'hist'                              => 'ইতিহাস',
'hide'                              => 'দেখিও না',
'show'                              => 'দেখাও',
'minoreditletter'                   => 'অ',
'newpageletter'                     => 'ন',
'boteditletter'                     => 'ব',
'number_of_watching_users_pageview' => '[$1 {{PLURAL:$1|জন ব্যবহারকারী|জন ব্যবহারকারী}} এই পাতার উপর নজর রাখছেন]',
'rc_categories'                     => 'এই বিষয়শ্রেণীগুলিতে সীমাবদ্ধ করা হোক ("|" দিয়ে আলাদা করে লিখুন)',
'rc_categories_any'                 => 'যেকোনো',
'newsectionsummary'                 => '/* $1 */ নতুন অনুচ্ছেদ',

# Recent changes linked
'recentchangeslinked'          => 'সম্পর্কিত পরিবর্তন',
'recentchangeslinked-title'    => '"$1"-এর সাথে সম্পর্কিত পরিবর্তনসমূহ',
'recentchangeslinked-noresult' => 'সংযোগকৃত পাতাগুলিতে প্রদত্ত সময়সীমার জন্য কোন পরিবর্তন হয়নি।',
'recentchangeslinked-summary'  => "একটি নির্দিষ্ট পাতা (অথবা নির্দিষ্ট বিষয়শ্রেণীতে) থেকে সংযুক্ত এ পাতার সাম্প্রতিক পরিবর্তনের তালিকা দেওয়া হয়েছে। আপনার [[Special:Watchlist|আপনার নজরতালিকায়]] রাখা পাতাগুলি '''গাঢ়''' করে দেখানো হয়েছে।",

# Upload
'upload'                      => 'আপলোড',
'uploadbtn'                   => 'ফাইল আপলোড করুন',
'reupload'                    => 'পুনরায় আপলোড করা হোক',
'reuploaddesc'                => 'আপলোড ফর্মে ফেরত যান।',
'uploadnologin'               => 'আপনি লগ-ইন করেননি।',
'uploadnologintext'           => 'আপলোড করতে হলে আপনাকে অবশ্যই আগে [[Special:UserLogin|লগ-ইন]] করতে হবে।',
'upload_directory_read_only'  => 'আপলোড ডিরেক্টরিটি ($1) ওয়েবসার্ভার কর্তৃক লিখনযোগ্য নয়।',
'uploaderror'                 => 'আপলোড এ সমস্যা হয়েছে',
'uploadtext'                  => "ফাইল আপলোড করতে নিচের ফরমটি ব্যবহার করুন। পূর্বে আপলোড করা ফাইল দেখতে বা খুঁজতে হলে [[Special:ImageList|পূর্বে আপলোড করা ফাইল এর তালিকা]] দেখুন। আপলোড করা ফাইল এর নাম  [[Special:Log/upload|আপলোডের ইতিহাস তালিকায়]] যোগ হয়ে থাকে।

কোনো নিবন্ধে ছবি যোগ করতে হলে নিচের উদাহরণ অনুযায়ী সংযোগ দিনঃ
'''<nowiki>[[{{ns:image}}:file.jpg]]</nowiki>''',
'''<nowiki>[[{{ns:image}}:file.png|alt text]]</nowiki>''' অথবা
'''<nowiki>[[{{ns:media}}:file.ogg]]</nowiki>'''",
'upload-permitted'            => 'যেসব ফাইলের ধরন অনুমোদিত: $1।',
'upload-preferred'            => 'যেসব ফাইলের ধরন পছন্দনীয়: $1।',
'upload-prohibited'           => 'যেসব ফাইলের ধরন নিষিদ্ধ: $1।',
'uploadlog'                   => 'আপলোড এর ইতিহাস তালিকা',
'uploadlogpage'               => 'আপলোড লগ',
'uploadlogpagetext'           => 'নিচে সবচেয়ে সম্প্রতি আপলোড করা ফাইলগুলোর তালিকা দেখুন।',
'filename'                    => 'ফাইলের নাম',
'filedesc'                    => 'সারাংশ',
'fileuploadsummary'           => 'সারাংশ:',
'filestatus'                  => 'কপিরাইট মর্যাদা:',
'filesource'                  => 'উৎস',
'uploadedfiles'               => 'আপলোডকৃত ফাইলগুলি',
'ignorewarning'               => 'সতর্কীকরণ উপেক্ষা করেই ফাইল সংরক্ষণ করা হোক।',
'ignorewarnings'              => 'সমস্ত সতর্কীকরণ উপেক্ষা করা হোক',
'minlength1'                  => 'ফাইলের নাম কমপক্ষে এক বর্ণের হতে হবে।',
'illegalfilename'             => '"$1" ফাইলনামটিতে এমন কিছু ক্যারেক্টার আছে যেগুলি পাতার শিরোনামে ব্যবহার করা অবৈধ। অনুগ্রহ করে ফাইলটি নতুন করে নামকরণ করুন এবং তারপর আপলোড করার চেষ্টা করুন।',
'badfilename'                 => 'ফাইলের নামটি পরিবর্তন করে $1" করা হয়েছে।',
'filetype-badmime'            => '"$1" MIME ধরনের ফাইল আপলোড করা যাবে না।',
'filetype-unwanted-type'      => "'''\".\$1\"''' ফাইল ধরনটি অবাঞ্ছনীয়। পছন্দনীয় ফাইল ধরনগুলি হল \$2।",
'filetype-banned-type'        => "'''\".\$1\"''' ফাইল ধরনটি অনুমোদিত নয়। অনুমোদিত ফাইল ধরনগুলি হল \$2।",
'filetype-missing'            => 'এই ফাইলটির কোন এক্সটেনশন নেই (যেমন ".jpg")।',
'large-file'                  => '$1-এর চেয়ে বড় আকারের ফাইল সুপারিশ করা হয় না; এই ফাইলটি $2।',
'largefileserver'             => 'সার্ভারে যতখানি অনুমোদিত তার চেয়ে এই ফাইলের আকার বড়।',
'emptyfile'                   => 'আপনি যে ফাইলটি আপলোড করেছেন, তা খালি মনে হচ্ছে। ফাইলের নামে টাইপিং ত্রুটির কারণে এরকম হতে পারে। অনুগ্রহ করে পরীক্ষা করে দেখুন আপনি আসলেই এই ফাইলটি আপলোড করতে চান কি না।',
'fileexists'                  => 'এই নামের একটি ফাইল ইতিমধ্যেই বিদ্যমান। অনুগ্রহ করে <strong><tt>$1</tt></strong> পরীক্ষা করে দেখুন, যদি আপনি এটি পরিবর্তনের ব্যাপারে নিশ্চিত না হন।',
'fileexists-extension'        => 'একই নামের আরেকটি ফাইল আছে:<br />
আপলোড করা ফাইলের নাম: <strong><tt>$1</tt></strong><br />
একই নামে বর্তমান ফাইলের নাম: <strong><tt>$2</tt></strong><br />
অনুগ্রহ করে একটি ভিন্ন নাম পছন্দ করুন।',
'fileexists-thumb'            => "<center>'''বিদ্যমান ছবি'''</center>",
'fileexists-thumbnail-yes'    => 'ফাইলটি একটি সংক্ষেপিত আকারের ছবি <i>(থাম্বনেইল)</i> বলে মনে হচ্ছে। অনুগ্রহ করে <strong><tt>$1</tt></strong> ফাইলটি পরীক্ষা করে দেখুন।<br />
যদি পরীক্ষাকৃত ফাইলটি একই ছবির মূল আকার হয়, তবে একটি অতিরিক্ত থাম্বনেইল আপলোড করার প্রয়োজন নেই।',
'file-thumbnail-no'           => 'ফাইলনামটি <strong><tt>$1</tt></strong> দিয়ে শুরু হয়েছে। মনে হচ্ছে, এটি একটি সংকুচিত আকারের ছবি  <i>(থাম্বনেইল)</i>।
আপনার কাছে যদি পূর্ণ রেজোলিউশনের ছবিটি থাকে, তবে সেটি আপলোড করুন, নতুবা অনুগ্রহ করে ফাইলনামটি পরিবর্তন করুন।',
'fileexists-forbidden'        => 'এই নামের একটি ফাইল ইতিমধ্যেই বিদ্যমান; অনুগ্রহ করে গিয়ে ফেরত যান এবং একটি নতুন নামের অধীনে এই ফাইলটি আপলোড করুন। [[Image:$1|thumb|center|$1]]',
'fileexists-shared-forbidden' => 'অংশীদারী ফাইল ভাণ্ডারে এই নামের একটি ফাইল ইতিমধ্যেই বিদ্যমান; অনুগ্রহ করে গিয়ে ফেরত যান এবং একটি নতুন নামের অধীনে এই ফাইলটি আপলোড করুন। [[Image:$1|thumb|center|$1]]',
'successfulupload'            => 'আপলোড সফল হয়েছে',
'uploadwarning'               => 'আপলোড সতর্কবাণী',
'savefile'                    => 'সংরক্ষণ',
'uploadedimage'               => '"[[$1]]" আপলোড করা হয়েছে।',
'overwroteimage'              => '"[[$1]]"-এর একটি নতুন সংস্করণ আপলোড করা হয়েছে',
'uploaddisabled'              => 'আপলোড নিষ্ক্রিয় আছে',
'uploaddisabledtext'          => '{{SITENAME}}-এ ফাইল আপলোড করার ক্ষমতা নিষ্ক্রিয় আছে।',
'uploadscripted'              => 'এই ফাইলে এমন HTML বা স্ক্রিপ্ট কোড আছে যা একটি ওয়েব ব্রাউজার ভুল বুঝতে পারে।',
'uploadcorrupt'               => 'ফাইলটি হয় নষ্ট অথবা এর এক্সটেনশনটি ভুল। অনুগ্রহ করে ফাইলটি পরীক্ষা করে দেখুন এবং আবার আপলোড করুন।',
'uploadvirus'                 => 'এই ফাইলটিতে ভাইরাস আছে! ব্যাখ্যা: $1',
'sourcefilename'              => 'উৎস ফাইলের নাম',
'destfilename'                => 'লক্ষ্য ফাইলের নাম',
'watchthisupload'             => 'এই পাতাটি নজরে রাখুন',
'filewasdeleted'              => 'এই নামের একটি ফাইল পূর্বে আপলোড করা হয়েছিল এবং তারপর মুছে ফেলা হয়েছিল। আপনি ফাইলটি আবার আপলোড করার আগে $1 পরীক্ষা করে দেখুন।',
'upload-wasdeleted'           => "'''সতর্কীকরণ: আপনি এমন একটি ফাইল আপলোড করছেন যা পূর্বে মুছে ফেলা হয়েছিল।'''

এই ফাইলটি আপলোড করা উচিত কি না বিবেচনা করে দেখুন।
ফাইলটির অবলুপ্তি লগ আপনার সুবিধার্থে এখানে দেওয়া হল:",
'filename-bad-prefix'         => 'আপনি যে ফাইলটি আপলোড করছেন, তার নাম <strong>"$1"</strong> দিয়ে শুরু হয়েছে। এ ধরনের নাম সাধারণত ডিজিটাল ক্যামেরাগুলি স্বয়ংক্রিয়ভাবে দিয়ে থাকে এবং এগুলি ব্যাখ্যামূলক নয়। অনুগ্রহ করে আপনার ফাইলের জন্য আরও ব্যাখ্যামূলক একটি নাম পছন্দ করুন।',

'upload-proto-error'      => 'ভুল প্রোটোকল',
'upload-proto-error-text' => 'দূরবর্তী আপলোডের জন্য URLগুলি <code>http://</code> বা <code>ftp://</code> দিয়ে শুরু হওয়া আবশ্যক।',
'upload-file-error'       => 'আভ্যন্তরীণ ত্রুটি',
'upload-file-error-text'  => 'সার্ভারে একটি সাময়িক ফাইল সৃষ্টি করতে গিয়ে আভ্যন্তরীণ ত্রুটি ঘটেছে। অনুগ্রহ করে একজন সিস্টেম প্রশাসকের সাথে যোগাযোগ করুন।',
'upload-misc-error'       => 'অজানা আপলোড ত্রুটি',
'upload-misc-error-text'  => 'আপলোড করার সময় অজানা ত্রুটি ঘটেছে। অনুগ্রহ করে যাচাই করুন URLটি বৈধ কি না এবং আবার চেষ্টা করুন। যদি এর পরেও সমস্যা হয়, তবে একজন সিস্টেম প্রশাসকের সাথে যোগাযোগ করুন।',

# Some likely curl errors. More could be added from <http://curl.haxx.se/libcurl/c/libcurl-errors.html>
'upload-curl-error6'       => 'URL-এ পৌঁছানো যায়নি',
'upload-curl-error6-text'  => 'প্রদত্ত URLটিতে পৌঁছানো যায়নি। অনুগ্রহ করে আবার পরীক্ষা করে দেখুন URLটি সঠিক কি না এবং সাইটটি চালু আছে কি না।',
'upload-curl-error28'      => 'আপলোড সময়োত্তীর্ণ',
'upload-curl-error28-text' => 'সাইটিটি উত্তর দিতে বেশি দেরি করেছে। অনুগ্রহ করে পরীক্ষা করে দেখুন সাইটটি চালু আছে কি না, এবং খানিকক্ষণ অপেক্ষা করে আবার চেষ্টা করুন। আপনি অন্য কোন অপেক্ষাকৃত কম ব্যস্ত সময়েও চেষ্টা করে দেখতে পারেন।',

'license'            => 'লাইসেন্সকরণ',
'nolicense'          => 'কিছুই নির্বাচন করা হয়নি',
'license-nopreview'  => '(প্রাকদর্শন লভ্য নয়)',
'upload_source_url'  => ' (একটি বৈধ, উন্মুক্ত URL)',
'upload_source_file' => ' (আপনার কম্পিউটারের একটি ফাইল)',

# Special:ImageList
'imagelist_search_for'  => 'ছবির নাম অনুসন্ধান:',
'imgfile'               => 'ফাইল',
'imagelist'             => 'ছবির তালিকা',
'imagelist_date'        => 'তারিখ',
'imagelist_name'        => 'নাম',
'imagelist_user'        => 'ব্যবহারকারী',
'imagelist_size'        => 'আকার',
'imagelist_description' => 'বিবরণ',

# Image description page
'filehist'                  => 'ফাইলের ইতিহাস',
'filehist-help'             => 'তারিখ/সময়ে ক্লিক করে দেখুন ফাইলটি তখন কী অবস্থায় ছিল।',
'filehist-deleteall'        => 'সব মুছে ফেলুন',
'filehist-deleteone'        => 'এটা মুছে ফেলুন',
'filehist-revert'           => 'পূর্বাবস্থায় ফেরত যান',
'filehist-current'          => 'বর্তমান',
'filehist-datetime'         => 'তারিখ/সময়',
'filehist-user'             => 'ব্যবহারকারী',
'filehist-dimensions'       => 'মাত্রা',
'filehist-filesize'         => 'ফাইলের আকার',
'filehist-comment'          => 'মন্তব্য',
'imagelinks'                => 'সংযোগসমূহ',
'linkstoimage'              => 'নিচের পাতা(গুলো) থেকে এই ছবিতে সংযোগ আছে:',
'nolinkstoimage'            => 'এই ফাইলে সংযোগ করে এমন কোন পাতা নেই।',
'sharedupload'              => 'এই ফাইলটি একটি অংশদারী আপলোড এবং অন্যান্য প্রকল্পে ব্যবহৃত হতে পারে।',
'shareduploadwiki'          => 'বিস্তারিত তথ্যের জন্য $1 দেখুন।',
'shareduploadwiki-linktext' => 'ফাইলের বিবরণ পাতা',
'noimage'                   => 'এই নামে কোনো ফাইল নেই, আপনি যা করতে পারেন, তা হলো $1।',
'noimage-linktext'          => 'এই ফাইলটিকে আপলোড করুন।',
'uploadnewversion-linktext' => 'এই ফাইলটির একটি নতুন সংস্করণ আপলোড করুন',

# File reversion
'filerevert'                => '$1 পূর্বাবস্থায় ফেরত নিন',
'filerevert-legend'         => 'ফাইল পূর্বাবস্থায় ফেরত নিন',
'filerevert-intro'          => "আপনি '''[[Media:$1|$1]]''' ফাইলটিকে [$3, $2 সময়ের $4 সংস্করণে] ফিরিয়ে নিচ্ছেন।",
'filerevert-comment'        => 'মন্তব্য:',
'filerevert-defaultcomment' => '$2, $1 সংস্করণে ফেরত যাওয়া হল',
'filerevert-submit'         => 'ফেরত যাওয়া হোক',
'filerevert-success'        => "'''[[Media:$1|$1]]''' ফাইলটি  [$3, $2-এর $4 সংস্করণে] ফেরত নেওয়া হয়েছে।",
'filerevert-badversion'     => 'প্রদত্ত তারিখ ও সময়ের জন্য এই ফাইলটির কোন স্থানীয় সংস্করণ নেই।',

# File deletion
'filedelete'             => '$1 মুছে ফেলা হোক',
'filedelete-legend'      => 'ফাইল মুছে ফেলা হোক',
'filedelete-intro'       => "আপনি '''[[Media:$1|$1]]''' ফাইলটি মুছে ফেলছেন।",
'filedelete-intro-old'   => "আপনি '''[[Media:$1|$1]]''' ফাইলটির [$4 $3, $2] সংস্করণটি মুছে ফেলছেন।",
'filedelete-comment'     => 'মন্তব্য:',
'filedelete-submit'      => 'মুছে ফেলা হোক',
'filedelete-success'     => "'''$1''' মুছে ফেলা হয়েছে।",
'filedelete-success-old' => '<span class="plainlinks">\'\'\'[[Media:$1|$1]]\'\'\' ফাইলটির এই $3, $2 সংস্করণটি মুছে ফেলা হয়েছে।</span>',
'filedelete-nofile'      => "{{SITENAME}}-এ '''$1''' ফাইলটির কোন অস্তিত্ব নেই।",
'filedelete-nofile-old'  => "নির্দেশিত বৈশিষ্ট্যগুলির জন্য '''$1'''-এর কোন আর্কাইভ সংস্করণ নেই।",
'filedelete-iscurrent'   => 'আপনি এই ফাইলটির সবচেয়ে সাম্প্রতিক সংস্করণটি মুছে ফেলার চেষ্টা করছেন। অনুগ্রহ করে প্রথমে একটি পূর্বতন সংস্করণে ফাইলটিকে ফেরত নিন।',

# MIME search
'mimesearch'         => 'MIME অনুসন্ধান',
'mimesearch-summary' => 'এই পাতার মাধ্যমে MIME-ধরন অনুসারে ফাইলগুলিকে ফিল্টার করা যায়। ইনপুট: contenttype/subtype, যেমন <tt>image/jpeg</tt>।',
'mimetype'           => 'MIME ধরন:',
'download'           => 'ডাউনলোড',

# Unwatched pages
'unwatchedpages' => 'নজরে না রাখা পাতাগুলি',

# List redirects
'listredirects' => 'তালিকা পুনর্নির্দেশগুলি',

# Unused templates
'unusedtemplates'     => 'অব্যবহৃত টেমপ্লেটগুলি',
'unusedtemplatestext' => 'টেমপ্লেট নামস্থানের যে সমস্ত পাতা অন্য কোন পাতায় অন্তর্ভুক্ত নয়, তাদের সবগুলির তালিকা এই পাতায় দেওয়া হল। টেমপ্লেটগুলি মুছে ফেলার আগে পরীক্ষা করে দেখুন অন্য কোথাও থেকে এগুলিতে সংযোগ আছে কি না।',
'unusedtemplateswlh'  => 'অন্যান্য সংযোগগুলি',

# Random page
'randompage'         => 'অজানা যেকোনো পাতা',
'randompage-nopages' => 'এই নামস্থানে কোন পাতা নেই।',

# Random redirect
'randomredirect'         => 'অনির্ধারিত পুনর্নির্দেশ',
'randomredirect-nopages' => 'এই নামস্থানে কোন পুনর্নির্দেশ নেই।',

# Statistics
'statistics'             => 'পরিসংখ্যান',
'sitestats'              => 'সাইট পরিসংখ্যান',
'userstats'              => 'ব্যবহারকারীর পরিসংখ্যান',
'sitestatstext'          => "ডাটাবেসে সর্বমোট {{PLURAL:\$1|'''1''' টি|'''\$1''' গুলো}} পাতা আছে।এগুলোর মধ্যে রয়েছে \"আলাপ\" পাতাগুলো, {{SITENAME}} বিষয়ক পাতাগুলো, '''অসম্পূর্ণ''' (stub) পাতাগুলো, পুনর্নিদেশগুলো, এবং অন্যান্য আরও পাতা যেগুলোতে সম্ভবত বিষয়বস্তুর অভাব রয়েছে। এগুলো বাদে এ উইকিতে সম্ভবত {{PLURAL:\$2|'''1''' টি|'''\$2''' গুলো}} পাতা আছে যেগুলোতে যথেষ্ট পরিমাণ বিষয়বস্তু সংযোজিত হয়েছে। '''\$8'''টি ফাইল আপলোড করা হয়েছে। এ {{SITENAME}} স্থাপন করার পর থেকে মোট '''\$3''' বার দেখা হয়েছে, এবং '''\$4''' বার সম্পাদনা করা হয়েছে। তাতে প্রতি পাতা গড়ে '''\$5''' বার সম্পাদিত এবং প্রতি সম্পাদনায় '''\$6''' বার দেখা হয়েছে।

[http://www.mediawiki.org/wiki/Manual:Job_queue কাজের সারির] দৈর্ঘ্য '''\$7'''।",
'userstatstext'          => "'''$1''' জন নিবন্ধিত ব্যবহারকারী আছেন। এঁদের মধ্যে '''$2''' (বা '''$4%''') জন প্রশাসক ($3 দেখুন)।",
'statistics-mostpopular' => 'সবচেয়ে বেশী বার দেখা পাতাসমূহ',

'disambiguations'      => 'দ্ব্যর্থতা-দূরীকরণ পাতাসমূহ',
'disambiguationspage'  => 'Template:দ্ব্যর্থতা_নিরসন',
'disambiguations-text' => "নিচের পাতাগুলি থেকে একটি '''দ্ব্যর্থতা নিরসন পাতা'''-তে সংযোগ আছে। এর পরিবর্তে এগুলি থেকে একটি উপযুক্ত বিষয়ে সংযোগ থাকা আবশ্যক।<br />যদি কোন পাতায় এমন কোন টেমপ্লেট থাকে যেটিতে [[MediaWiki:Disambiguationspage]] থেকে সংযোগ আছে, তবে সেই পাতাটিকে একটি দ্ব্যর্থতা নিরসন পাতা হিসেবে গণ্য করা হয়।",

'doubleredirects'     => 'দুইবার করা পুনর্নির্দেশনাগুলি',
'doubleredirectstext' => 'এই পাতায় এমন পাতাগুলির তালিকা আছে, যেগুলি অন্য পুনর্নির্দেশনা পাতায় পুনর্নির্দেশ করেছে। প্রতিটি সারিতে প্রথম ও দ্বিতীয় পুনর্নির্দেশনার জন্য সংযোগ আছে এবং দ্বিতীয় পুনর্নির্দেশনাটির লক্ষ্য সংযোগটিও দেওয়া আছে। এই লক্ষ্য সংযোগটিই সাধারণত "আসল" লক্ষ্য পাতা, যেটিতে প্রথম পুনর্নির্দেশনাটি থেকে সংযোগ থাকা উচিত।',

'brokenredirects'        => 'অকার্যকর পুনর্নির্দেশনাসমূহ',
'brokenredirectstext'    => 'নিচের পুনর্নির্দেশনাগুলি অস্তিত্বহীন পাতার দিকে নির্দেশ করছে:',
'brokenredirects-edit'   => '(সম্পাদনা)',
'brokenredirects-delete' => '(মুছে ফেলুন)',

'withoutinterwiki'         => 'ভাষার সংযোগহীন পাতাসমূহ',
'withoutinterwiki-summary' => 'এই পাতা সমূহ অন্য ভাষার সংস্করণের সাথে সংযুক্ত নয়:',
'withoutinterwiki-submit'  => 'দেখাও',

'fewestrevisions' => 'সবচেয়ে কমসংখ্যক সংশোধিত পাতাগুলি',

# Miscellaneous special pages
'nbytes'                  => '$1 বাইট',
'ncategories'             => '$1 টি বিষয়শ্রেণী',
'nlinks'                  => '$1টি সংযোগ',
'nmembers'                => '$1টি নিবন্ধ',
'nrevisions'              => '$1 বার সম্পাদিত',
'nviews'                  => '$1 {{PLURAL:$1|বার দেখা হয়েছে|বার দেখা হয়েছে}}',
'specialpage-empty'       => 'এই রিপোর্টের জন্য কোন ফলাফল নেই।',
'lonelypages'             => 'পিতৃহীন পাতা',
'lonelypagestext'         => '{{SITENAME}}-এর অন্য পাতাগুলি থেকে নিচের পাতাগুলিতে কোন সংযোগ নেই।',
'uncategorizedpages'      => 'যেসব পাতা শ্রেণীকরণ করা হয়নি',
'uncategorizedcategories' => 'যেসব বিষয়শ্রেণীর শ্রেণীকরণ প্রয়োজন',
'uncategorizedimages'     => 'যেসব ফাইলের শ্রেণীকরণ প্রয়োজন',
'uncategorizedtemplates'  => 'যেসব টেমপ্লেটের বিষয়শ্রেণী নেই',
'unusedcategories'        => 'অব্যবহৃত বিষয়শ্রেণীসমূহ',
'unusedimages'            => 'অব্যবহৃত ফাইলসমূহ',
'popularpages'            => 'জনপ্রিয় পাতাসমূহ',
'wantedcategories'        => 'বাঞ্ছনীয় বিষয়শ্রেণীগুলি',
'wantedpages'             => 'বাঞ্ছনীয় পাতাগুলি',
'mostlinked'              => 'যেসব পাতার প্রতি সবচেয়ে বেশি সংযোগ আছে',
'mostlinkedcategories'    => 'যেসব বিষয়শ্রেণীর প্রতি সবচেয়ে বেশি সংযোগ আছে',
'mostlinkedtemplates'     => 'যেসব টেমপ্লেটে সবচেয়ে বেশি সংযোগ আছে',
'mostcategories'          => 'সবচেয়ে বেশী বিষয়শ্রেণী-সমৃদ্ধ নিবন্ধসমূহ',
'mostimages'              => 'যেসব ফাইলের দিকে সবচেয়ে বেশি সংযোগ আছে',
'mostrevisions'           => 'সবচেয়ে বেশী বার সম্পাদিত নিবন্ধসমূহ',
'prefixindex'             => 'উপসর্গ নির্ঘণ্ট',
'shortpages'              => 'সংক্ষিপ্ত পাতাসমূহ',
'longpages'               => 'দীর্ঘ পাতাসমূহ',
'deadendpages'            => 'যেসব পাতা থেকে কোনো সংযোগ নেই',
'deadendpagestext'        => 'নিচের পাতাগুলি থেকে {{SITENAME}}-এর অন্য কোন পাতায় সংযোগ নেই।',
'protectedpages'          => 'সুরক্ষিত পাতাসমূহ',
'protectedpagestext'      => 'নিচের পাতাগুলিকে স্থানান্তর বা সম্পাদনা করা থেকে সুরক্ষিত করা হয়েছে।',
'protectedpagesempty'     => 'কোন পাতা বর্তমানে এই প্যারামিটারগুলিসহ সুরক্ষিত নয়।',
'protectedtitles'         => 'সুরক্ষিত শিরোনামগুলি',
'protectedtitlestext'     => 'নিচের শিরোনামগুলি দিয়ে পাতা সৃষ্টি করা যাবে না।',
'protectedtitlesempty'    => 'কোন শিরোনাম বর্তমানে এই প্যারামিটারগুলিসহ সুরক্ষিত নয়।',
'listusers'               => 'ব্যবহারকারীর তালিকা',
'newpages'                => 'নতুন পাতাসমূহ',
'newpages-username'       => 'ব্যবহারকারীর নাম:',
'ancientpages'            => 'পুরানো নিবন্ধ',
'move'                    => 'সরিয়ে ফেলুন',
'movethispage'            => 'সরিয়ে ফেলুন',
'unusedimagestext'        => 'অনুগ্রহ করে লক্ষ্য করুন যে অন্য ওয়েবসাইটগুলি থেকে কোন ছবিতে সরাসরি URL-এর মাধ্যমে সংযোগ দেওয়া থাকতে পারে, এবং সেজন্য সক্রিয়ভাবে ব্যবহৃত হওয়া সত্ত্বেও এখানে তালিকাভুক্ত হতে পারে।',
'unusedcategoriestext'    => 'নিচের বিষয়শ্রেণীগুলোর অস্তিত্ব আছে, যদিও কোনো নিবন্ধ বা অন্য কোনো বিষয়শ্রেণী এগুলোকে ব্যবহার করে না।',
'notargettitle'           => 'কোন লক্ষ্য নেই',
'notargettext'            => 'আপনি এই কাজটি সম্পাদনের জন্য কোন লক্ষ্য পাতা বা ব্যবহারকারী নির্দিষ্ট করে দেননি।',
'pager-newer-n'           => '{{PLURAL:$1|নতুনতর ১টি|নতুনতর $1টি}}',
'pager-older-n'           => '{{PLURAL:$1|আরও পুরনো ১টি|আরও পুরনো $1টি}}',

# Book sources
'booksources'               => 'বইয়ের উৎস',
'booksources-search-legend' => 'বইয়ের উৎসের জন্য অনুসন্ধান করা হোক',
'booksources-go'            => 'চলো',
'booksources-text'          => 'নতুন ও পুরাতন ব্যবহৃত বই বিক্রি করে, এমন কতগুলি সাইটের সংযোগের তালিকা নিচে দেওয়া হল, যে সাইটগুলিতে আপনার অনুসন্ধানকৃত বইগুলির উপর আরও তথ্য থাকতে পারে:',

# Special:Log
'specialloguserlabel'  => 'ব্যবহারকারী:',
'speciallogtitlelabel' => 'শিরোনাম:',
'log'                  => 'লগগুলি',
'all-logs-page'        => 'সব লগ',
'log-search-legend'    => 'লগগুলির জন্য অনুসন্ধান করা হোক',
'log-search-submit'    => 'চলো',
'alllogstext'          => '{{SITENAME}}-এর সবগুলি লগের সম্মিলিত প্রদর্শন।
আপনি লগের ধরন, ব্যবহারকারীর নাম, বা পাতার নাম নির্বাচন করে প্রদর্শনটির আকার কমিয়ে আনতে পারেন।',
'logempty'             => 'মিলে যায় এমন কিছু লগে পাওয়া যায়নি।',
'log-title-wildcard'   => 'এই টেক্সট দিয়ে শুরু হওয়া শিরোনামগুলি অনুসন্ধান করা হোক',

# Special:AllPages
'allpages'          => 'সব পাতা',
'alphaindexline'    => '$1 হতে $2',
'nextpage'          => 'পরবর্তী পাতা ($1)',
'prevpage'          => 'পূর্ববর্তী পাতা ($1)',
'allpagesfrom'      => 'এই অক্ষর দিয়ে শুরু হওয়া পাতাগুলো দেখাও:',
'allarticles'       => 'সমস্ত নিবন্ধ',
'allinnamespace'    => 'সমস্ত পাতা ($1 নামস্থান)',
'allnotinnamespace' => 'সমস্ত পাতা ($1 নামস্থান ব্যতিত)',
'allpagesprev'      => 'পূর্ববর্তী',
'allpagesnext'      => 'পরবর্তী',
'allpagessubmit'    => 'চলো',
'allpagesprefix'    => 'এই উপসর্গবিশিষ্ট পাতাগুলো দেখাও:',
'allpagesbadtitle'  => 'প্রদত্ত পাতার শিরোনামটি অবৈধ ছিল অথবা এটিতে কোন আন্তঃভাষা বা আন্তঃউইকি উপসর্গ ছিল। এটিতে এক বা একাধিক ক্যারেক্টার থাকতে পারে যা শিরোনামে ব্যবহার করা সম্ভব নয়।',
'allpages-bad-ns'   => '{{SITENAME}}-এ "$1" নামের কোন নামস্থান নেই।',

# Special:Categories
'categories'         => 'বিষয়শ্রেণীসমূহ',
'categoriespagetext' => 'এ উইকিতে বর্তমান বিষয়শ্রেণীসমূহ:',

# Special:ListUsers
'listusersfrom'      => 'সেই সব ব্যবহারকারী দেখাও যাদের নাম এই অক্ষর দিয়ে শুরু:',
'listusers-submit'   => 'দেখানো হোক',
'listusers-noresult' => 'কোন ব্যবহারকারী খুঁজে পাওয়া যায়নি।',

# E-mail user
'mailnologin'     => 'প্রাপকের ঠিকানা নেই',
'mailnologintext' => "অন্য ব্যবহারকারীদেরকে ই-মেইল পাঠাতে হলে আপনাকে অবশ্যই আগে [[Special:UserLogin|লগ-ইন]] করতে হবে এবং ''[[Special:Preferences|আপনার পছন্দ তালিকায়]] আপনার ই-মেইল ঠিকানাটি ঠিকমত দিতে হবে।",
'emailuser'       => 'ইমেইল করো',
'emailpage'       => 'ব্যবহারকারীকে ই-মেইল করুন',
'emailpagetext'   => 'যদি এই ব্যবহারকারীটি তার ব্যবহারকারী পছন্দগুলিতে কোন বৈধ ই-মেইল ঠিকানা প্রবেশ করিয়ে থাকেন, তাহলে নিচের ফর্মটি একটি মাত্র বার্তা পাঠাবে।
আপনি আপনার ব্যবহারকারী পছন্দে যে ই-মেইল দিয়েছেন, সেটি মেইলের "প্রেরক" ক্ষেত্রে দেখানো হবে, যাতে মেইলের প্রাপক আপনাকে উত্তর দিতে পারেন।',
'usermailererror' => 'মেইল অবজেক্ট ত্রুটি পাঠিয়েছে:',
'defemailsubject' => '{{SITENAME}} ই-মেইল',
'noemailtitle'    => 'ই-মেইল ঠিকানা নেই',
'noemailtext'     => 'এই ব্যবহারকারী কোন বৈধ ই-মেইল ঠিকানা নির্দিষ্ট করে দেননি, অথবা অন্য ব্যবহারকারীদের কাছ থেকে ই-মেইল গ্রহণ করতে চান না।',
'emailfrom'       => 'প্রেরক',
'emailto'         => 'প্রাপক',
'emailsubject'    => 'বিষয়',
'emailmessage'    => 'বার্তা',
'emailsend'       => 'প্রেরণ করো',
'emailccme'       => 'আমার বার্তার একটি অনুলিপি আমাকে ই-মেইল করা হোক।',
'emailccsubject'  => 'আপনার বার্তার অনুলিপি $1-কে: $2',
'emailsent'       => 'ই-মেইল প্রেরণ করা হয়েছে',
'emailsenttext'   => 'আপনার ই-মেইল বার্তা প্রেরণ করা হয়েছে।',

# Watchlist
'watchlist'            => 'আমার নজর তালিকা',
'mywatchlist'          => 'আমার নজর তালিকা',
'watchlistfor'         => "('''$1''' এর জন্য)",
'nowatchlist'          => 'আপনার নজরতালিকা খালি।',
'watchlistanontext'    => 'আপনার নজরতালিকার আইটেমগুলি দেখতে বা সম্পাদনা করতে অনুগ্রহ করে $1।',
'watchnologin'         => 'আপনি এখনও লগ-ইন করেননি।',
'watchnologintext'     => 'আপনার নজর তালিকা পরিবর্তনের জন্য আপনাকে অবশ্যই অ্যাকাউন্টে [[Special:UserLogin|প্রবেশ করতে হবে]]।',
'addedwatch'           => 'নজর তালিকায় যুক্ত হয়েছে',
'addedwatchtext'       => "\"<nowiki>\$1</nowiki>\" পাতাটি আপনার [[Special:Watchlist|নজরতালিকা]]-তে যোগ করা হয়েছে৷

ভবিষ্যতে এই পাতা ও এই পাতার সাথে সম্পর্কিত আলোচনা পাতায় সংঘটিত যাবতীয় পরিবর্তন এখানে তালিকাভুক্ত হবে৷
এছাড়া [[Special:RecentChanges|সাম্প্রতিক পরিবর্তনসমূহ]]তালিকায় এই পাতাটিকে '''গাঢ়''' অক্ষরে দেখানো হবে যাতে আপনি সহজেই পাতাটি শনাক্ত করতে পারেন৷

পরবর্তীতে আপনি যদি পাতাটিকে আপনার নজরতালিকা থেকে সরিয়ে ফেলতে চান, তবে \"নজর সরিয়ে নিন\" ট্যাবটিতে ক্লিক করবেন৷",
'removedwatch'         => 'নজর তালিকা থেকে সরিয়ে ফেলা হয়েছে',
'removedwatchtext'     => '"<nowiki>$1</nowiki>" পাতাটি আপনার নজরতালিকা থেকে সরিয়ে ফেলা হয়েছে৷',
'watch'                => 'নজরে রাখুন',
'watchthispage'        => 'নজরে রাখুন',
'unwatch'              => 'নজর সরিয়ে নিন',
'unwatchthispage'      => 'নজর সরিয়ে নিন',
'notanarticle'         => 'বিষয়বস্তু পাতা নয়',
'watchnochange'        => 'প্রদর্শিত সময়সীমার মধ্যে আপনার নজরতালিকায় রাখা কোন পাতায় কোন রকম সম্পাদনা ঘটেনি।',
'watchlist-details'    => '{{PLURAL:$1|টি পাতার|টি পাতার}} উপর নজর রাখা হচ্ছে (আলোচনা পাতাগুলি গণনায় না ধরে)।',
'wlheader-enotif'      => '* ই-মেইল এর মাধমে নির্দেশনার ব্যবস্থা চালু করা আছে।',
'wlheader-showupdated' => "* আপনার শেষ আগমনের পর থেকে যেসব পাতায় পরিবর্তন হয়েছে সেগুলি '''গাঢ়''' করে দেখানো হয়েছে",
'watchmethod-recent'   => 'নজরে রাখা পাতাগুলিতে সাম্প্রতিক পরিবর্তন পরীক্ষা করা হচ্ছে',
'watchmethod-list'     => 'নজরে রাখা পাতাগুলিতে সাম্প্রতিক পরিবর্তন পরীক্ষা করা হচ্ছে',
'watchlistcontains'    => 'আপনার নজরতালিকায় $1 টি পাতা রয়েছে।',
'iteminvalidname'      => "'$1'নং আইটেমে সমস্যা, অবৈধ নাম...",
'wlnote'               => "নিচে বিগত {{PLURAL:$2|১ ঘন্টায়|'''$2''' ঘন্টায়}} সংঘটিত {{PLURAL:$1|শেষ ১টি পরিবর্তন|শেষ '''$1'''টি পরিবর্তন}} দেখানো হল।",
'wlshowlast'           => 'দেখাও সর্বশেষ  $1 ঘন্টা $2 দিন $3',
'watchlist-show-bots'  => 'বট দ্বারা সম্পাদনাগুলো দেখাও',
'watchlist-hide-bots'  => 'বট দ্বারা সম্পাদনাগুলো দেখিও না',
'watchlist-show-own'   => 'আমার সম্পাদনাগুলো দেখাও',
'watchlist-hide-own'   => 'আমার সম্পাদনাগুলো দেখিও না',
'watchlist-show-minor' => 'অনুল্লেখ্য সম্পাদনাগুলো দেখাও',
'watchlist-hide-minor' => 'অনুল্লেখ্য সম্পাদনাগুলো দেখিও না',

# Displayed when you click the "watch" button and it is in the process of watching
'watching'   => 'নজর রাখা হচ্ছে...',
'unwatching' => 'নজর তুলে নেওয়া হচ্ছে...',

'enotif_mailer'                => '{{SITENAME}} বিজ্ঞপ্তি ই-মেইল প্রেরক',
'enotif_reset'                 => 'সমস্ত পাতা দেখা হয়েছে হিসেবে চিহ্নিত করুন',
'enotif_newpagetext'           => 'এটি একটি নতুন পাতা।',
'enotif_impersonal_salutation' => '{{SITENAME}} ব্যবহারকারী',
'changed'                      => 'পরিবর্তিত',
'created'                      => 'তৈরী হয়েছিল',
'enotif_subject'               => '{{SITENAME}}-এর $PAGETITLE শিরোনামের পাতাটি $PAGEEDITOR কর্তৃক $CHANGEDORCREATED হয়েছে',
'enotif_lastvisited'           => 'আপনার শেষ আগমনের পরে সংঘটিত সমস্ত পরিবর্তনের জন্য $1 দেখুন।',
'enotif_lastdiff'              => 'এই পরিবর্তনটি দেখার জন্য $1 দেখুন।',
'enotif_anon_editor'           => 'বেনামী ব্যবহারকারী $1',
'enotif_body'                  => 'প্রিয় $WATCHINGUSERNAME,

{{SITENAME}}-এর $PAGETITLE শিরোনামের পাতাটি $PAGEEDITDATE তারিখে $PAGEEDITOR $CHANGEDORCREATED করেছেন। পাতাটির বর্তমান সংস্করণের জন্য $PAGETITLE_URL দেখুন।

$NEWPAGE

সম্পাদকের সারাংশ: $PAGESUMMARY $PAGEMINOREDIT

সম্পাদকের সাথে যোগাযোগের উপায়:
ই-মেইল: $PAGEEDITOR_EMAIL
উইকি: $PAGEEDITOR_WIKI

পাতাটির পরবর্তী পরিবর্তনগুলির জন্য আর কোন বিজ্ঞপ্তি পাঠানো হবে না। এছাড়া আপনি আপনার নজরতালিকায় রাখা সবগুলি পাতা জন্য বিজ্ঞপ্তি ফ্ল্যাগ শুরুর অবস্থায় ফিরিয়ে নিতে পারেন।

            {{SITENAME}} বিজ্ঞপ্তি ব্যবস্থা

--
আপনার নজরতালিকা সেটিংস পরিবর্তন করতে চাইলে এখানে যান:
{{fullurl:{{ns:special}}:Watchlist/edit}}

ফিডব্যাক ও আরও সহযোগিতার জন্য:
{{fullurl:{{MediaWiki:Helppage}}}}',

# Delete/protect/revert
'deletepage'                  => 'পাতাটি মুছে ফেলা হোক',
'confirm'                     => 'নিশ্চিত করুন',
'excontent'                   => "বিষয়বস্তু ছিল: '$1'",
'excontentauthor'             => "বিষয়বস্তু ছিল: '$1' (এবং একমাত্র অবদানকারী ছিলেন '$2')",
'exbeforeblank'               => "মুছে ফেলার আগে বিষয়বস্তু ছিল: '$1'",
'exblank'                     => 'পাতাটি খালি ছিল',
'delete-legend'               => 'মুছে ফেলুন',
'historywarning'              => 'সতর্কীকরণ: আপনি যে পাতাটি মুছতে যাচ্ছেন তার একটি ইতিহাস আছে:',
'confirmdeletetext'           => 'আপনি একটি পাতা সেটির সমস্ত ইতিহাসসহ মুছে ফেলতে যাচ্ছেন।
অনুগ্রহ করে নিশ্চিত করুন আপনি আসলেই এটি করতে চান, আপনি এর ফলাফল সম্পর্কে অবহিত, এবং আপনি [[{{MediaWiki:Policy-url}}|নীতিমালা]] মেনে এটি করছেন।',
'actioncomplete'              => 'কাজটি নিষ্পন্ন হয়েছে',
'deletedtext'                 => '"<nowiki>$1</nowiki>" মুছে ফেলা হয়েছে। সাম্প্রতিক মুছে ফেলার ঘটনাগুলো $2-এ দেখুন।',
'deletedarticle'              => '"[[$1]]" মুছে ফেলা হয়েছে।',
'dellogpage'                  => 'পাতা অবলুপ্তি লগ্',
'dellogpagetext'              => 'নিচে সবচেয়ে সাম্প্রতিক অবলুপ্তিগুলোর একাটি তালিকা দেওয়া হল।',
'deletionlog'                 => 'পাতা অবলুপ্তি লগ্',
'reverted'                    => 'পূর্ববর্তী সংস্করণে ফিরে যাওয়া সফল হয়েছে।',
'deletecomment'               => 'মুছে ফেলার কারণ:',
'deleteotherreason'           => 'অন্য/অতিরিক্ত কারণ:',
'deletereasonotherlist'       => 'অন্য কারণ',
'deletereason-dropdown'       => '*মুছে ফেলার সাধারণ কারণগুলি
** লেখকের অনুরোধ
** কপিরাইট ভঙ্গ
** ধ্বংসপ্রবণতা',
'delete-toobig'               => 'এই পাতার অনেক বড় সম্পাদনার ইতিহাস রয়েছে, যা $1 সংশোধনের বেশি। {{SITENAME}} এর দূর্ঘটনাজনিত সমস্যা এড়াতে এই ধরনের পাতা মুছার ব্যপারে সীমাবদ্ধতা আরোপ করা হয়েছে।',
'rollback'                    => 'সম্পাদনা ফিরিয়ে নিন',
'rollback_short'              => 'ফিরিয়ে নিন',
'rollbacklink'                => 'রোলব্যাক',
'rollbackfailed'              => 'রোলব্যাক ব্যর্থ',
'cantrollback'                => 'পূর্বের সংস্করণে ফেরত যাওয়া সম্ভব হল না, সর্বশেষ সম্পাদনাকারী এই নিবন্ধটির একমাত্র লেখক।',
'alreadyrolled'               => '[[:$1]] পাতায় [[User:$2|$2]] ([[User talk:$2|আলাপ]])-এর করা শেষ সম্পাদনাটি রোলব্যাক করা যায়নি; অন্য কেউ ইতিমধ্যে পাতাটি সম্পাদনা বা রোলব্যাক করেছেন।

শেষ সম্পাদনা করেছেন [[User:$3|$3]] ([[User talk:$3|আলাপ]])।',
'editcomment'                 => 'সম্পাদনা মন্তব্যটি ছিল: "<i>$1</i>"।', # only shown if there is an edit comment
'revertpage'                  => '[[Special:Contributions/$2|$2]] ([[User_talk:$2|আলাপ]]) এর সম্পাদিত সংস্করণ হতে [[User:$1|$1]] এর সম্পাদিত সর্বশেষ সংস্করণে ফেরত যাওয়া হয়েছে।', # Additional available: $3: revid of the revision reverted to, $4: timestamp of the revision reverted to, $5: revid of the revision reverted from, $6: timestamp of the revision reverted from
'rollback-success'            => '$1-এর সম্পাদনাগুলি পূর্বাবস্থায় ফিরিয়ে নেওয়া হয়েছে; $2-এর করা শেষ সংস্করণে পাতাটি ফেরত নেওয়া হয়েছে।',
'sessionfailure'              => 'আপনার লগ ইন সেশনে একটি সমস্যা হয়েছে বলে মনে হচ্ছে;
সেশন হাইজ্যাক প্রতিরোধের উপায় হিসেবে এই কাজটি বাতিল করা হয়েছে।
অনুগ্রহ ব্রাউজারের "back" বোতাম চাপুন এবং যে পাতা থেকে এসেছিলেন, তা রিলোড করুন এবং আবার চেষ্টা করুন।',
'protectlogpage'              => 'সুরক্ষা লগ্‌',
'protectlogtext'              => 'নিচে পাতা বন্ধ ও খোলার একটি তালিকা দেয়া হল। বর্তমানে সক্রিয় পাতার সুরক্ষাগুলির তালিকা দেখতে [[Special:ProtectedPages|সুরক্ষিত পাতার তালিকা]] দেখুন।',
'protectedarticle'            => 'সুরক্ষিত "[[$1]]"',
'modifiedarticleprotection'   => '"[[$1]]"-এর জন্য সুরক্ষার স্তর পরিবর্তন করা হয়েছে',
'unprotectedarticle'          => '"[[$1]]"-এর সুরক্ষা সরিয়ে নেওয়া হয়েছে',
'protect-title'               => '"$1" সুরক্ষিত করা হচ্ছে',
'protect-legend'              => 'সুরক্ষা নিশ্চিত করুন',
'protectcomment'              => 'সুরক্ষার কারণ',
'protectexpiry'               => 'মেয়াদোত্তীর্ণ হবে:',
'protect_expiry_invalid'      => 'মেয়াদোত্তীর্ণ সময় অবৈধ।',
'protect_expiry_old'          => 'মেয়াদোত্তীর্ণ সময় অতীতে অবস্থিত।',
'protect-unchain'             => 'স্থানান্তরের অনুমতিগুলি খুলে দেওয়া হোক',
'protect-text'                => '<strong><nowiki>$1</nowiki></strong> পাতাটির জন্য সুরক্ষার স্তর আপনি এখানে দেখতে ও পরিবর্তন করতে পারেন।',
'protect-locked-blocked'      => 'বাধাপ্রাপ্ত অবস্থায় আপনি পাতাটির সুরক্ষা স্তর পরিবর্তন করতে পারবেন না। এখানে <strong>$1</strong> পাতাটির বর্তমান সেটিংস দেওয়া হল:',
'protect-locked-dblock'       => 'ডাটাবেজ বন্ধ থাকায় সুরক্ষা স্তর পরিবর্তন করা যাবে না।
এখানে <strong>$1</strong> পাতাটির বর্তমান সেটিংস দেওয়া হল:',
'protect-locked-access'       => 'আপনার অ্যাকাউন্ট থেকে পাতার সুরক্ষা স্তর পরিবর্তন করার অনুমতি নেই।
এখানে <strong>$1</strong> পাতাটির বর্তমান সেটিংস দেওয়া হল:',
'protect-cascadeon'           => 'এই পাতাটি বর্তমানে সুরক্ষিত আছে, কারণ পাতাটি নিচের {{PLURAL:$1|টি পাতায়|টি পাতায়}} অন্তর্ভুক্ত, যাতে (যেগুলিতে) প্রপাতাকারে সুরক্ষা চালু আছে। আপনি এই পাতাটির সুরক্ষা স্তর পরিবর্তন করতে পারেন, তবে এটি প্রপাতাকার সুরক্ষাটিতে কোন পরিবর্তন সাধন করবে না।',
'protect-default'             => '(আদি)',
'protect-fallback'            => '"$1" অনুমতি দরকার',
'protect-level-autoconfirmed' => 'বেনামী ব্যবহারকারীদের বাধা দাও',
'protect-level-sysop'         => 'কেবল প্রশাসকদের জন্য',
'protect-summary-cascade'     => 'প্রপাতাকার',
'protect-expiring'            => '$1 (UTC) সময়ে মেয়াদোত্তীর্ণ',
'protect-cascade'             => 'এই পাতায় অন্তর্ভুক্ত পাতাগুলিও সুরক্ষিত করা হোক (প্রপাতাকার সুরক্ষা)',
'protect-cantedit'            => 'আপনি এই পাতার সুরক্ষার স্তর পরিবর্তন করতে পারবেন না, কারণ আপনার তা সম্পাদনা করার অনুমতি নেই।',
'restriction-type'            => 'অনুমতি:',
'restriction-level'           => 'বাধার স্তর:',
'minimum-size'                => 'ন্যূনতম আকার',
'maximum-size'                => 'সর্বোচ্চ আকার:',
'pagesize'                    => '(বাইট)',

# Restrictions (nouns)
'restriction-edit'   => 'সম্পাদনা',
'restriction-move'   => 'সরিয়ে নেওয়া',
'restriction-create' => 'সৃষ্টি করা হোক',

# Restriction levels
'restriction-level-sysop'         => 'সম্পূর্ণ সুরক্ষিত',
'restriction-level-autoconfirmed' => 'অর্ধ-সুরক্ষিত',
'restriction-level-all'           => 'যেকোন স্তর',

# Undelete
'undelete'                     => 'মুছে ফেলা পাতাগুলি দেখুন',
'undeletepage'                 => 'মুছে ফেলা পাতাগুলি দেখুন ও ফিরিয়ে আনুন',
'viewdeletedpage'              => 'মুছে ফেলা হয়েছে, এমন পাতাগুলো দেখুন',
'undeletepagetext'             => 'নিচের পাতাগুলি মুছে ফেলা হয়েছে কিন্তু এগুলি এখনও আর্কাইভে আছে ও পুনরুদ্ধার করা সম্ভব। আর্কাইভ পর্যায়ক্রমিকভাবে পরিস্কার করা হতে পারে।',
'undeleteextrahelp'            => "সম্পূর্ণ পাতাটি পুনরুদ্ধার করার জন্য সবগুলি টিকবাক্স অনির্বাচিত করুন এবং '''''পুনরুদ্ধার''''' বোতামে ক্লিক করুন। নির্বাচিত পুনরুদ্ধারের জন্য যেসব সংশোধন পুনরুদ্ধার করতে চান, তার পাশের বাক্সে টিক দিন এবং '''''পুনরুদ্ধার''''' বোতামে ক্লিক করুন। '''''আদি অবস্থায় ফেরত''''' বোতামে ক্লিক করলে মন্তব্য রাখার এলাকা ও সবগুলি টিকবাক্স খালি করে দেওয়া হবে।",
'undeleterevisions'            => '$1 {{PLURAL:$1|টি সংশোধন|টি সংশোধন}} আর্কাইভে আছে',
'undeletehistory'              => 'আপনি যদি পাতাটি পুনরুদ্ধার করেন, তবে সবগুলি সংশোধন ইতিহাসে ফিরিয়ে আনা হবে।
যদি মুছে ফেলার পর একই নামে আরেকটি পাতা সৃষ্টি করা হয়ে থাকে, তবে পুনরুদ্ধারকৃত সংশোধনগুলি পূর্বের ইতিহাসে স্থান পাবে। আরও লক্ষ্য করুন যে ফাইল সংশোধনের উপর সীমাবদ্ধতা পুনরুদ্ধারের পর বাতিল হয়ে যায়।',
'undeleterevdel'               => 'শীর্ষে অবস্থিত সংশোধনটি যদি আংশিক মুছে যায়, তবে মুছে ফেলা বাতিল করা হবে না। এ ধরনের ক্ষেত্রে আপনাকে অবশ্যই নতুনতম মুছে ফেলা সংশোধনগুলি অনির্বাচিত করতে হবে। আপনার যেসব ফাইলের সংশোধন দেখার অনুমতি নেই, সেগুলি পুনরুদ্ধার করা হবে না।',
'undeletehistorynoadmin'       => 'এই পাতাটি মুছে ফেলা হয়েছে। মুছে ফেলার কারণ নিচের সারাংশে দেখানো হল। সেই সাথে মুছে ফেলার আগে যেসমস্ত ব্যবহারকারী পাতাটি সম্পাদনা করেছেন, তাদের সম্পর্কেও বিস্তারিত দেখানো হল। এই মুছে ফেলা সংশোধনগুলির বিষয়বস্তু  কেবল প্রশাসকদের কাছে লভ্য।',
'undelete-revision'            => '$3-এর করা $1 সংশোধন ($2 তারিখের) মুছে ফেলা হয়েছে:',
'undeleterevision-missing'     => 'সংশোধনটি অবৈধ কিংবা হারানো গেছে। আপনি হয়ত অচল সংযোগে ক্লিক করেছেন, কিংবা সংশোধনটি হয়ত বাতিল করে পাতাটি পূর্বাবস্থায় নেওয়া হয়েছে, অথবা সংশোধনটি আর্কাইভ থেকে মুছে ফেলা হয়েছে।',
'undelete-nodiff'              => 'পূর্বের কোন সংশোধন খুঁজে পাওয়া যায়নি।',
'undeletebtn'                  => 'পুনরুদ্ধার',
'undeletereset'                => 'আদি অবস্থায় ফেরত',
'undeletecomment'              => 'মন্তব্য:',
'undeletedarticle'             => '"[[$1]]"-কে পূর্বাবস্থায় ফেরত নেওয়া হয়েছে',
'undeletedrevisions'           => '{{PLURAL:$1|১টি সংশোধন|$1টি সংশোধন}} পুনরুদ্ধার করা হয়েছে',
'undeletedrevisions-files'     => '{{PLURAL:$1|১টি সংশোধন|$1টি সংশোধন}} এবং {{PLURAL:$2|১টি ফাইল|$2টি ফাইল}} পুনরুদ্ধার করা হয়েছে',
'undeletedfiles'               => '{{PLURAL:$1|১টি ফাইল|$1টি ফাইল}} পুনরুদ্ধার করা হয়েছে',
'cannotundelete'               => 'মুছে ফেলা বাতিল করা যায়নি; অন্য কেউ হয়ত আগেই পাতাটি মুছে ফেলা বাতিল করেছেন।',
'undeletedpage'                => "<big>'''$1 পুনরুদ্ধার করা হয়েছে'''</big>

সাম্প্রতিক মুছে ফেলা ও পুনরুদ্ধারের ঘটনাগুলির জন্য [[Special:Log/delete|অবলুপ্তি লগ]] দেখুন।",
'undelete-header'              => 'সাম্প্রতিক সময়ে মুছে ফেলা পাতাগুলি দেখতে [[Special:Log/delete|অবলুপ্তি লগ]] দেখুন।',
'undelete-search-box'          => 'মুছে ফেলা পাতাগুলিতে অনুসন্ধান',
'undelete-search-prefix'       => 'এই অক্ষর দিয়ে শুরু হওয়া পাতাগুলি দেখানো হোক:',
'undelete-search-submit'       => 'অনুসন্ধান',
'undelete-no-results'          => 'মিলে যায় এমন কোন পাতা অবলুপ্তি লগে পাওয়া যায়নি।',
'undelete-filename-mismatch'   => '$1 সময়টিকেটবিশিষ্ট ফাইল সংশোধনের মুছে ফেলা বাতিল করা গেল না: ফাইলের নাম মিলে যায়নি',
'undelete-bad-store-key'       => '$1 সময়টিকেটবিশিষ্ট ফাইল সংশোধনের মুছে ফেলা বাতিল করা গেল না: মুছে ফেলার আগে ফাইল হারিয়ে গিয়েছিল।',
'undelete-cleanup-error'       => 'অব্যবহৃত আর্কাইভ ফাইল "$1" মুছতে গিয়ে ত্রুটি ঘটেছে।',
'undelete-missing-filearchive' => 'ফাইল আর্কাইভ আইডি $1 পুনরুদ্ধার করা গেল না, কারণ এটি ডাটাবেজে নেই। হয়ত ইতিমধ্যেই এটির মুছে ফেলা বাতিল করা হয়েছে।',
'undelete-error-short'         => 'ফাইল মোছা বাতিল করতে গিয়ে ত্রুটি: $1',
'undelete-error-long'          => 'ফাইলটি মোছা বাতিল করতে গিয়ে ত্রুটি ঘটেছে:

$1',

# Namespace form on various pages
'namespace'      => 'নামস্থান:',
'invert'         => 'বিপরীত নির্বাচন',
'blanknamespace' => '(প্রধান)',

# Contributions
'contributions' => 'ব্যবহারকারীর অবদান',
'mycontris'     => 'আমার অবদান',
'contribsub2'   => '$1 ($2)-এর জন্য',
'nocontribs'    => 'এই শর্তগুলির সাথে মিলে যায়, এমন কোন পরিবর্তন খুঁজে পাওয়া যায়নি।',
'uctop'         => '(শীর্ষ)',
'month'         => 'এই মাস (বা তার আগে) থেকে:',
'year'          => 'এই বছর (এবং তার আগে) থেকে:',

'sp-contributions-newbies'     => 'শুধু নতুন অ্যাকাউন্টের অবদানসমূহ দেখাও',
'sp-contributions-newbies-sub' => 'নতুন অ্যাকাউন্টের জন্য',
'sp-contributions-blocklog'    => 'বাধা দানের লগ',
'sp-contributions-search'      => 'অবদানসমূহের জন্য অনুসন্ধান',
'sp-contributions-username'    => 'আইপি (IP) ঠিকানা অথবা ব্যবহারকারীর নাম:',
'sp-contributions-submit'      => 'অনুসন্ধান',

# What links here
'whatlinkshere'       => 'সংযোগকারী পাতাসমূহ',
'whatlinkshere-title' => 'যে পাতাগুলি থেকে $1-এ সংযোগ আছে',
'whatlinkshere-page'  => 'পাতা:',
'linklistsub'         => '(সংযোগসমূহের তালিকা)',
'linkshere'           => "নিচের পাতাসমূহ '''[[:$1]]''' পাতায় সংযুক্ত আছে:",
'nolinkshere'         => "কোনো পাতা থেকে '''[[:$1]]''' পাতায় সংযোগ নেই।",
'nolinkshere-ns'      => "নির্বাচিত নামস্থানে '''[[:$1]]'''-এর প্রতি কোন পাতা থেকে সংযোগ নেই।",
'isredirect'          => 'পুনর্নির্দেশ',
'istemplate'          => 'অন্তর্ভুক্তি',
'whatlinkshere-prev'  => '{{PLURAL:$1|পূর্ববর্তী|পূর্ববর্তী $1টি}}',
'whatlinkshere-next'  => '{{PLURAL:$1|পরবর্তী|পরবর্তী $1টি}}',
'whatlinkshere-links' => '← সংযোগগুলি',

# Block/unblock
'blockip'                     => 'ব্যবহারকারীকে বাধা দাও',
'blockip-legend'              => 'ব্যবহারকারীকে বাধা দেওয়া হোক',
'blockiptext'                 => 'কোন নির্দিষ্ট আইপি ঠিকানা বা ব্যবহারকারীর লেখার অধিকারে বাধা দিতে নিচের ফর্মটি ব্যবহার করুন।
এটি কেবলমাত্র ধ্বংসপ্রবণতা প্রতিরোধে ও [[{{MediaWiki:Policy-url}}|নীতিমালা]] মেনে সম্পাদন করা উচিত।
নিচে একটি নির্দিষ্ট কারণ দিন (উদাহরণস্বরূপ, যেসব পাতার ধ্বংসসাধন করা হয়েছে, সেগুলি উল্লেখ করতে পারেন)।',
'ipaddress'                   => 'আইপি ঠিকানা:',
'ipadressorusername'          => 'আইপি ঠিকানা বা ব্যবহারকারীর নাম:',
'ipbexpiry'                   => 'যখন মেয়াদোত্তীর্ণ হবে:',
'ipbreason'                   => 'কারণ:',
'ipbreasonotherlist'          => 'অন্য কারণ',
'ipbreason-dropdown'          => '*বাধা দানের সাধারণ কারণ
** মিথ্যা তথ্য ঢোকানো
** পাতা থেকে বিষয়বস্তু মুছে ফেলা
** বাইরের কোন সাইটের সংযোগ স্প্যাম করা
** পাতাগুলিতে অর্থহীন বিষয়বস্তু ঢোকানো
** ভীতি উদ্রেককারী আচরণ/হয়রানি
** একাধিক অ্যাকাউন্টের অপব্যবহার
** ব্যবহারকারী নাম অ-গ্রহণযোগ্য',
'ipbanononly'                 => 'কেবল বেনামী ব্যবহারকারীদের বাধা দেওয় হোক',
'ipbcreateaccount'            => 'অ্যাকাউন্ট সৃষ্টিতে বাধা দেওয়া হোক',
'ipbemailban'                 => 'ব্যবহারকারীকে ই-মেইল পাঠাতে বাধা দেওয়া হোক',
'ipbenableautoblock'          => 'এই ব্যবহারকারীর ব্যবহার করা সর্বশেষ আইপি ঠিকানা, এবং পরবর্তী যেসব আইপি ঠিকানা থেকে সম্পাদনার চেষ্টা করা হবে, সেগুলিকেও স্বয়ংক্রিয়ভাবে বাধা দেয়া হোক।',
'ipbsubmit'                   => 'এই ব্যবহারকারীকে বাধা দেয়া হোক',
'ipbother'                    => 'অন্য সময়:',
'ipboptions'                  => '২ ঘন্টা:2 hours,১ দিন:1 day,৩ দিন:3 days,১ সপ্তাহ:1 week,২ সপ্তাহ:2 weeks,১ মাস:1 month,৩ মাস:3 months,৬ মাস:6 months,১ বছর:1 year,অসীম:infinite', # display1:time1,display2:time2,...
'ipbotheroption'              => 'অন্যান্য',
'ipbotherreason'              => 'অন্য/আরও কারণ:',
'ipbhidename'                 => 'বাধাদানের লগ, সক্রিয় বাধাদানের তালিকা, এবং ব্যবহারকারী তালিকা থেকে ব্যবহারকারী নাম/আইপি ঠিকানা লুকিয়ে রাখা হোক',
'badipaddress'                => 'আইপি (IP) ঠিকানাটি অগ্রহনযোগ্য',
'blockipsuccesssub'           => 'বাধা সফল',
'blockipsuccesstext'          => '[[Special:Contributions/$1|$1]] কে বাধা দেয়া হয়েছে
<br />বাধা দেয়া পুনর্বিবেচনা করতে হলে [[Special:IPBlockList|বাধা দেয়া আইপি ঠিকানার তালিকা]] দেখুন।',
'ipb-edit-dropdown'           => 'বাধাদানের কারণ সম্পাদনা করুন',
'ipb-unblock-addr'            => '$1-এর উপর থেকে বাধা তুলে নেওয়া হোক',
'ipb-unblock'                 => 'ব্যবহারকারী বা আইপি ঠিকানার উপর থেকে বাধা তুলে নেওয়া হোক',
'ipb-blocklist-addr'          => '$1-এর জন্য বিদ্যমান বাধাগুলি দেখুন',
'ipb-blocklist'               => 'বিদ্যমান বাধাগুলি দেখুন',
'unblockip'                   => 'ব্যবহারকারীর উপর থেকে বাধা তুলে নেওয়া হোক',
'unblockiptext'               => 'নিচের ফর্মটি ব্যবহার করে পূর্বে বাধা দেওয়া কোন আইপি ঠিকানা বা ব্যবহারকারীর সাইটে লেখার অধিকার পুনঃপ্রতিষ্ঠা করুন।',
'ipusubmit'                   => 'এই ঠিকানা থেকে বাধা তুলে নেওয়া হোক',
'unblocked'                   => '[[User:$1|$1]]-এর উপর বাধা তুলে নেওয়া হয়েছে',
'unblocked-id'                => '$1 বাধাটি তুলে নেওয়া হয়েছে',
'ipblocklist'                 => 'নিষিদ্ধ ঘোষিত আইপি ঠিকানা ও ব্যবহারকারী নামের তালিকা',
'ipblocklist-legend'          => 'বাধা দেওয়া কোন ব্যবহারকারীকে অনুসন্ধান করুন',
'ipblocklist-username'        => 'ব্যবহারকারী নাম বা আইপি ঠিকানা:',
'ipblocklist-submit'          => 'অনুসন্ধান',
'blocklistline'               => '$1 তারিখে  $2,  $3 ($4) কে বাধা দিয়েছেন।',
'infiniteblock'               => 'অসীম',
'expiringblock'               => 'শেষ হবে $1',
'anononlyblock'               => 'শুধু বেনামীদের',
'noautoblockblock'            => 'স্বয়ংক্রিয় বাধাদান নিষ্ক্রিয় করা হয়েছে',
'createaccountblock'          => 'অ্যাকাউন্ট সৃষ্টিতে বাধা দেওয়া হয়েছে',
'emailblock'                  => 'ই-মেইল বাধা দেয়া হয়েছে',
'ipblocklist-empty'           => 'বাধাতালিকা খালি।',
'ipblocklist-no-results'      => 'অনুরুদ্ধ আইপি ঠিকানা বা ব্যবহারকারী নামটির উপর কোন বাধা নেই।',
'blocklink'                   => 'বাধা দাও',
'unblocklink'                 => 'বাধা তুলে নেওয়া হোক',
'contribslink'                => 'অবদান',
'autoblocker'                 => 'আপনাকে স্বয়ংক্রিয়ভাবে বাধা দেওয়া হয়েছে, কারণ আপনার আইপি ঠিকানাটি সম্প্রতি "[[User:$1|$1]]" ব্যবহার করেছেন।   $1-কে বাধাদানের কারণ: "$2"',
'blocklogpage'                => 'বাধা দানের লগ্‌',
'blocklogentry'               => '[[$1]]এর উপর $2 $3 মেয়াদের জন্য নিষেধাজ্ঞা আরোপিত হয়েছে।',
'blocklogtext'                => 'এটি ব্যবহারকারীদেরকে বাধা দানের বা বাধা তুলে নেওয়ার লগ। স্বয়ংক্রিয়ভাবে বাধাদানকৃত আইপি ঠিকানাগুলি এখানে তালিকাবদ্ধ করা হয়নি। বর্তমানে সক্রিয় নিষিদ্ধকরণ ও বাধাদানের তালিকার জন্য [[Special:IPBlockList|আইপি বাধাদান তালিকা]] দেখুন।',
'unblocklogentry'             => '$1-এর উপর বাধা তুলে নেয়া হয়েছে',
'block-log-flags-anononly'    => 'কেবল বেনামী ব্যবহারকারীরা',
'block-log-flags-nocreate'    => 'অ্যাকাউন্ট সৃষ্টি নিষ্ক্রিয় করা হয়েছে',
'block-log-flags-noautoblock' => 'স্বয়ংক্রিয় বাধাদান নিষ্ক্রিয়',
'block-log-flags-noemail'     => 'ই-মেইলে বাধা আছে',
'range_block_disabled'        => 'প্রশাসকের পক্ষে আইপি ঠিকানার শ্রেণী বাধাদানের ক্ষমতা নিষ্ক্রিয় আছে।',
'ipb_expiry_invalid'          => 'মেয়াদোত্তীর্ণকাল অবৈধ।',
'ipb_already_blocked'         => '"$1"-কে ইতিমধ্যে বাধা দেওয়া হয়েছে',
'ipb_cant_unblock'            => 'ত্রুটি: $1 ব্লক আইডি খুঁজে পাওয়া যায়নি। হয়ত ইতিমধ্যেই এটির উপর থেকে বাধা তুলে নেওয়া হয়েছে।',
'ipb_blocked_as_range'        => 'ত্রুটি: $1 আইপি ঠিকানাটিকে সরাসরি বাধা দেওয়া হয়নি এবং বাধা তুলে নেওয়া যাবে না। তবে ঠিকানাটি $2 সীমার অন্তর্ভুক্ত এবং সেটি থেকে বাধা তুলে নেওয়া সম্ভব।',
'ip_range_invalid'            => 'অবৈধ আইপি শ্রেণী',
'blockme'                     => 'আমাকে বাধা দেওয়া হোক',
'proxyblocker'                => 'প্রক্সি বাধাদানকারী',
'proxyblocker-disabled'       => 'এই ফাংশনটি নিষ্ক্রিয়।',
'proxyblockreason'            => 'আপনার আইপি ঠিকানাকে বাধা দেয়া হয়েছে কারণ এটি একটি উন্মুক্ত প্রক্সি। অনুগ্রহ করে আপনার ইন্টারনেট সেবা প্রদানকারী কোম্পানির সাথে কারিগরি সহায়তার ব্যাপারে যোগাযোগ করুন এবং এই গুরুত্বপূর্ণ নিরাপত্তা সমস্যার ব্যাপারে তাদেরকে অবহিত করুন।',
'proxyblocksuccess'           => 'নিষ্পন্ন হয়েছে।',
'sorbsreason'                 => 'আপনার আইপি ঠিকানাটি {{SITENAME}}-এর ব্যবহার করা DNSBL-এ উন্মুক্ত প্রক্সি হিসেবে তালিকাভুক্ত আছে।',
'sorbs_create_account_reason' => 'আপনার আইপি ঠিকানাটি {{SITENAME}}-এর ব্যবহার করা DNSBL-এ উন্মুক্ত প্রক্সি হিসেবে তালিকাভুক্ত আছে। আপনি কোন অ্যাকাউন্ট সৃষ্টি করতে পারবেন না।',

# Developer tools
'lockdb'              => 'ডাটাবেজ বন্ধ করে দেওয়া হোক',
'unlockdb'            => 'ডাটাবেজ খুলে দেওয়া হোক',
'lockdbtext'          => 'ডাটাবেজ বন্ধ করে দিলে কোন ব্যবহারকারী পাতা সম্পাদনা করতে, তাদের পছন্দ পরিবর্তন করতে, তাদের নজরতালিকা সম্পাদনা করতে, এবং ডাটাবেজে পরিবর্তন আনে এমন কোন কিছু করতে পারবেন না।
অনুগ্রহ করে নিশ্চিত করুন যে আপনি এটাই করতে চান, এবং আপনার রক্ষণাবেক্ষণ শেষ হবার পর ডাটাবেজ আবার খুলে দেবেন।',
'unlockdbtext'        => 'ডাটাবেজ খুলে দিলে সব ব্যবহারকারী পাতা সম্পাদনা করতে, তাদের পছন্দ পরিবর্তন করতে, তাদের নজরতালিকা সম্পাদনা করতে, এবং ডাটাবেজে পরিবর্তন সাধন করে, এমন অন্যান্য কাজ করতে পারবেন।
অনুগ্রহ করে নিশ্চিত করুন যে আপনি এটাই করতে চান।',
'lockconfirm'         => 'হ্যাঁ, আমি আসলেই ডাটাবেজ বন্ধ করতে চাই।',
'unlockconfirm'       => 'হ্যাঁ, আমি আসলেই ডাটাবেজ খুলে দিতে চাই।',
'lockbtn'             => 'ডাটাবেজ বন্ধ করা হোক',
'unlockbtn'           => 'ডাটাবেজ খুলে দেওয়া হোক',
'locknoconfirm'       => 'আপনি নিশ্চিতকরণ বাক্সে টিক দেননি।',
'lockdbsuccesssub'    => 'ডাটাবেজ সফলভাবে বন্ধ করে দেওয়া হয়েছে',
'unlockdbsuccesssub'  => 'ডাটাবেজ খুলে দেওয়া হয়েছে',
'lockdbsuccesstext'   => 'ডাটাবেজ বন্ধ করা হয়েছে
<br />আপনার রক্ষণাবেক্ষণ সম্পন্ন হবার পর [[Special:UnlockDB|ডাটাবেজ খুলে দিতে]] ভুলবেন না।',
'unlockdbsuccesstext' => 'ডাটাবেজ খুলে দেওয়া হয়েছে।',
'lockfilenotwritable' => 'ডাটাবেজ বন্ধ করার ফাইলটি লিখনযোগ্য নয়। ডাটাবেজ বন্ধ করতে বা খুলতে চাইলে ফাইলটিকে ওয়েব সার্ভার কর্তৃক লিখনযোগ্য হতে হবে।',
'databasenotlocked'   => 'ডাটাবেজ বন্ধ নয়।',

# Move page
'move-page-legend'        => 'পাতাটি সরিয়ে ফেলুন',
'movepagetext'            => "নিচের ফর্মটি ব্যবহার করে একটি পাতার শিরোনাম পরিবর্তন করা যাবে, এবং সেই সাথে নতুন শিরোনামে এর সমগ্র ইতিহাস স্থানান্তর করা যাবে।
পুরনো শিরোনামটি নতুন শিরোনামটির প্রতি একটি পুনর্নির্দেশনা ধারণ করবে।
পুরনো শিরোনামের প্রতি সংযোগগুলিতে কোন পরিবর্তন করা হবে না; তাই দ্বি-পুনর্নির্দেশনা বা অচল পুনর্নির্দেশনাগুলি পরীখকা করে দেখতে ভুলবেন না।
সংযোগগুলি যাতে তাদের লক্ষ্যে পৌঁছায়, তা নিশ্চিত করার দায়িত্ব আপনার।

লক্ষ্য করুন যে যদি নতুন শিরোনামে ইতিমধ্যেই একটি পাতা থেকে থাকে, তবে উৎস পাতাটি সেই শিরোনামে স্থানান্তর করা হবে '''না''', যদি না নতুন শিরোনামের পাতাটি খালি থাকে বা একটি পুননির্দেশনা হয় এবং এর কোন অতীত সম্পাদনা ইতিহাস না থাকে। অর্থাৎ আপনি ভুল করে নাম পরিবর্তন করলে সহজেই পুরনো নামে ফেরত যেতে পারবেন, কিন্তু ইতিমধ্যে বিদ্যমান কোন পাতার উপরে লিখতে পারবেন না।

'''সতর্কীকরণ!'''
কোন জনপ্রিয় পাতার ক্ষেত্রে এই পরিবর্তনটি খুবই আকস্মিক হতে পারে; অগ্রসর হবার আগে এই কাজটির ফলাফল কী হতে পারে, সে ব্যাপারে অনুগ্রহ করে নিশ্চিত হোন।",
'movepagetalktext'        => "পাতাটির সাথে সাথে সংশ্লিষ্ট আলোচনা পাতাটিও স্বয়ংক্রিয়ভাবে সরানো হবে '''যদি না:'''
*খালি নয় এমন একটি আলাপ পাতা নতুন শিরোনামটির অধীনে ইতিমধ্যেই বিদ্যমান থাকে, অথবা
*আপনি নিচের বাক্সটি থেকে টিক সরিয়ে নিতে পারেন।

এসব ক্ষেত্রে আপনি চাইলে নিজের হাতে পাতাটিকে সরাতে বা একত্রীকরণ করতে পারেন।",
'movearticle'             => 'যে পাতা সরিয়ে ফেলা হবে',
'movenotallowed'          => 'আপনার {{SITENAME}}-তে পাতা সরানোর অনুমতি নেই।',
'newtitle'                => 'এই নতুন শিরোনামে',
'move-watch'              => 'এই পাতাটি নজরে রাখুন',
'movepagebtn'             => 'পাতা সরান',
'pagemovedsub'            => 'সরিয়ে নেওয়া হয়েছে',
'articleexists'           => 'হয় এই শিরোনামের একটি নিবন্ধ ইতোমধ্যে সৃষ্টি হযে গেছে, অথবা আপনি যে শিরোনামটি পছন্দ করেছেন তা গ্রহণযোগ্য নয়। দয়া করে অন্য একটি শিরোনাম দিয়ে চেষ্টা করুন।',
'cantmove-titleprotected' => 'আপনি এই অবস্থানে পাতাটিকে স্থানান্তর করতে পারেন না, কারণ এই নতুন শিরোনামটি সৃষ্টি করা থেকে সুরক্ষিত।',
'talkexists'              => "'''পাতাটি সফলভাবে সরানো গেলেও আলোচনা পাতাটিকে সরানো যায়নি, কারণ নতুন শিরোনামের অধীনে ইতিমধ্যেই একটি আলোচনা পাতা বিদ্যমান। অনুগ্রহ নিজের হাতে এগুলিকে একত্র করুন।'''",
'movedto'                 => 'সরানো হয়েছে এখানে:',
'movetalk'                => 'সংশ্লিষ্ট আলাপের পাতা সরিয়ে নাও',
'1movedto2'               => '[[$1]]-কে [[$2]]-এ সরিয়ে নেওয়া হয়েছে',
'1movedto2_redir'         => '[[$1]]-কে [[$2]]-তে পুনর্নির্দেশনার সাহায্যে সরিয়ে নেওয়া হয়েছে',
'movelogpage'             => 'পাতা স্থানান্তর লগ্',
'movelogpagetext'         => 'সরানো পাতাগুলির একটি তালিকা নিচে দেয়া হল।',
'movereason'              => 'কারণ',
'revertmove'              => 'পূর্বাবস্থায় ফেরত নেওয়া হোক',
'delete_and_move'         => 'মুছে ফেলা হোক ও সরানো হোক',
'delete_and_move_text'    => '==মুছে ফেলা আবশ্যক==

"[[:$1]]" শিরোনামের গন্তব্য পাতাটি ইতিমধ্যেই বিদ্যমান। আপনি কি স্থানান্তর সফল করার জন্য পাতাটি মুছে দিতে চান?',
'delete_and_move_confirm' => 'হ্যাঁ, পাতাটি মুছে ফেলা হোক',
'delete_and_move_reason'  => 'স্থানান্তরের স্বার্থে মুছে ফেলা হয়েছে',
'selfmove'                => 'উৎস ও গন্তব্য পাতা একই শিরোনামের; কোন পাতা একই শিরোনামের আরেক পাতায় সরানো যাবে না।',
'immobile_namespace'      => 'উৎস বা গন্তব্য পাতা বিশেষ ধরনের; ঐ নামস্থানে বা ঐ নামস্থান থেকে পাতা সরানো যাবে না।',

# Export
'export'            => 'রপ্তানি পাতাগুলি',
'exporttext'        => 'আপনি কোন একটি নির্দিষ্ট পাতার বা অনেকগুলি পাতার একটি সেটের বিষয়বস্তু এবং সম্পাদনা ইতিহাস XML-এ আবৃত করে রপ্তানি করতে পারেন। এটি মিডিয়াউইকি সফটওয়্যার ব্যবহারকারী অন্য একটি উইকিতে [[Special:Import|আমদানি পাতার]] মাধ্যমে আমদানি করা সম্ভব।

পাতা রপ্তানি করতে চাইলে নিচের টেক্সট বাক্সে শিরোনামগুলি প্রবেশ করান, প্রতি লাইনে একটি শিরোনাম দিয়ে, এবং নির্বাচন করুন আপনি বর্তমান সংস্করণসহ সবগুলি পুরনো সংস্করণ পাতার ইতিহাসের লাইনসহ রপ্তানি করতে চান, নাকি কেবল সর্বশেষ সম্পাদনাটির তথ্যসহ বর্তমান সংস্করণটি রপ্তানি করতে চান।

দ্বিতীয় ক্ষেত্রটিতে আপনি একটি সংযোগও ব্যবহার করতে পারেন, যেমন "[[{{MediaWiki:Mainpage}}]]" পাতাটির জন্য [[{{ns:special}}:Export/{{MediaWiki:Mainpage}}]]।',
'exportcuronly'     => 'সম্পূর্ণ ইতিহাস নয়, কেবল বর্তমান সংশোধনটি অন্তর্ভুক্ত করা হোক',
'exportnohistory'   => "----
'''লক্ষ্য করুন:''' কর্মদক্ষতা-সম্পর্কিত কারণের জন্য এই ফর্মের মাধ্যমে কোন পাতার সমগ্র ইতিহাস রপ্তানি করা নিষ্ক্রিয় করা হয়েছে।",
'export-submit'     => 'রপ্তানি করা হোক',
'export-addcattext' => 'এই বিষয়শ্রেণী থেকে পাতা যোগ করা হোক:',
'export-addcat'     => 'যোগ করা হোক',
'export-download'   => 'ফাইল হিসেবে সংরক্ষণ করা হোক',

# Namespace 8 related
'allmessages'               => 'সিস্টেম বার্তাসমূহ',
'allmessagesname'           => 'নাম',
'allmessagesdefault'        => 'আদি টেক্সট',
'allmessagescurrent'        => 'বর্তমান টেক্সট',
'allmessagestext'           => 'নিচে মিডিয়াউইকি: নামস্থানে অন্তর্ভুক্ত সিস্টেম বার্তাগুলোর তালিকা দেওয়া হল।
Please visit [http://www.mediawiki.org/wiki/Localisation MediaWiki Localisation] and [http://translatewiki.net Betawiki] if you wish to contribute to the generic MediaWiki localisation.',
'allmessagesnotsupportedDB' => "'''{{ns:special}}:Allmessages''' ব্যবহার করা যাবে না কারণ '''\$wgUseDatabaseMessages''' বন্ধ করে রাখা আছে।",
'allmessagesfilter'         => 'বার্তা নামের ফিল্টার:',
'allmessagesmodified'       => 'শুধু পরিবর্তিত অংশগুলো দেখাও',

# Thumbnails
'thumbnail-more'           => 'বড় করো',
'filemissing'              => 'ফাইল হারিয়ে গেছে',
'thumbnail_error'          => 'থাম্বনেইল সৃষ্টি করতে গিয়ে ত্রুটি: $1',
'djvu_page_error'          => 'DjVu পাতা সীমার বাইরে',
'djvu_no_xml'              => 'DjVu ফাইলের জন্য XML আনতে পারা যায়নি।',
'thumbnail_invalid_params' => 'থাম্বনেইল প্যারামিটারগুলি অবৈধ',
'thumbnail_dest_directory' => 'গন্তব্য ডিরেক্টরি তৈরি করা যায়নি',

# Special:Import
'import'                     => 'পাতা আমদানি',
'importinterwiki'            => 'আন্তঃউইকি আমদানি',
'import-interwiki-text'      => 'আমদানির জন্য একটি উইকি ও পাতার শিরোনাম নির্বাচন করুন।
সংশোধনের তারিখগুলি এবং সম্পাদকদের নামগুলি সংরক্ষণ করা হবে।
সমস্ত আন্তঃউইকি আমদানিগুলি [[Special:Log/import|আমদানি লগে]] লিপিবদ্ধ আছে।',
'import-interwiki-history'   => 'এই পাতার সমস্ত ইতিহাসের সংস্করণের অনুলিপি করা হোক',
'import-interwiki-submit'    => 'আমদানি',
'import-interwiki-namespace' => 'পাতাগুলি এই নামস্থানে স্থানান্তর করা হোক:',
'importtext'                 => 'অনুগ্রহ করে Special:Export সরঞ্জামটি ব্যবহার করে ফাইলটি উৎস উইকি থেকে রপ্তানি করুন, আপনার ডিস্কে এটি সংরক্ষণ  করুন এবং তারপর সেটি এখানে আপলোড করুন।',
'importstart'                => 'পাতা আমদানি করা হচ্ছে...',
'import-revision-count'      => '$1 {{PLURAL:$1|টি সংশোধন|টি সংশোধন}}',
'importnopages'              => 'আমদানি করার মত কোন পাতা নেই।',
'importfailed'               => 'আমদানি ব্যর্থ: $1',
'importunknownsource'        => 'আমদানি উৎসের ধরন অজানা',
'importcantopen'             => 'আমদানি ফাইল খোলা যায়নি',
'importbadinterwiki'         => 'খারাপ আন্তঃউইকি সংযোগ',
'importnotext'               => 'খালি বা কোন টেক্সট নেই',
'importsuccess'              => 'আমদানি সফল!',
'importhistoryconflict'      => 'পরস্পর-বিরোধী ইতিহাস সংশোধন বিদ্যমান (এই পাতাটি সম্ভবত আগেও আমদানি করা হয়েছে)',
'importnosources'            => 'কোন আন্তঃউইকি আমদানি উৎস সংজ্ঞায়িত করা হয়নি এবং সরাসরি ইতিহাস আপলোডের ক্ষমতা নিষ্ক্রিয় করা হয়েছে।',
'importnofile'               => 'কোন আমদানি ফাইল আপলোড করা হয়নি।',
'importuploaderrorsize'      => 'আমদানি ফাইল আপলোড ব্যর্থ। ফাইলটির আকার অনুমোদিত আপলোডের আকারের চেয়ে বড়।',
'importuploaderrorpartial'   => 'আমদানি ফাইল আপলোড ব্যর্থ। ফাইলটি কেবল আংশিকভাবে আপলোড করা হয়েছে।',
'importuploaderrortemp'      => 'আমদানি ফাইলের আপলোড ব্যর্থ। একটি সাময়িক ফোল্ডার হারানো গেছে।',

# Import log
'importlogpage'                    => 'আমদানি লগ',
'importlogpagetext'                => 'প্রশাসক কর্তৃক অন্যান্য উইকি থেকে সম্পাদনা ইতিহাসসহ পাতা আমদানি।',
'import-logentry-upload'           => 'ফাইল আপলোডের মাধ্যমে [[$1]] আমদানি করা হয়েছে',
'import-logentry-upload-detail'    => '$1 {{PLURAL:$1|টি সংশোধন|টি সংশোধন}}',
'import-logentry-interwiki'        => '$1 উইকি-স্থানান্তরিত',
'import-logentry-interwiki-detail' => '$2-এর করা $1 {{PLURAL:$1|সংশোধন|টি সংশোধন}}',

# Tooltip help for the actions
'tooltip-pt-userpage'             => 'আমার ব্যবহারকারী পাতা',
'tooltip-pt-anonuserpage'         => 'যে আইপি ঠিকানা থেকে আপনি সম্পাদনা করছেন, তার ব্যবহারকারী পাতা',
'tooltip-pt-mytalk'               => 'আমার আলাপের পাতা',
'tooltip-pt-anontalk'             => 'এই আইপি ঠিকানা থেকে করা সম্পাদনার উপর আলোচনা',
'tooltip-pt-preferences'          => 'আমার পছন্দ',
'tooltip-pt-watchlist'            => 'যে পাতাগুলির পরিবর্তন আপনি নজরে রেখেছেন, তাদের তালিকা',
'tooltip-pt-mycontris'            => 'আমার অবদানের তালিকা',
'tooltip-pt-login'                => 'আপনাকে লগ ইন করতে উৎসাহিত করা হচ্ছে, কিন্তু এটা আবশ্যকীয় নয়।',
'tooltip-pt-anonlogin'            => 'আপনাকে লগ ইন করতে উৎসাহ দেয়া হচ্ছে, তবে এটা বাধ্যতামূলক নয়।',
'tooltip-pt-logout'               => 'প্রস্থান',
'tooltip-ca-talk'                 => 'বিষয়বস্তু পাতা সম্পর্কে আলোচনা',
'tooltip-ca-edit'                 => 'আপনি এই পাতা সম্পাদনা করতে পারেন। অনুগ্রহ করে সংরক্ষণের আগে প্রাকদর্শন করুন।',
'tooltip-ca-addsection'           => 'এই আলোচনায় একটি মন্তব্য যোগ করো।',
'tooltip-ca-viewsource'           => 'এই পাতাটি সুরক্ষিত। আপনি পাতাটির সোর্স দেখতে পারেন।',
'tooltip-ca-history'              => 'এই পাতার পুরনো সংস্করণগুলি।',
'tooltip-ca-protect'              => 'এই পাতাকে সুরক্ষিত করো',
'tooltip-ca-delete'               => 'পাতাটি মুছে ফেলো',
'tooltip-ca-undelete'             => 'পাতাটি মুছে ফেলার আগে যে সম্পাদনাগুলি করা হয়েছিল, সেগুলি উদ্ধার করা হোক।',
'tooltip-ca-move'                 => 'এই পাতাকে সরিয়ে ফেলো',
'tooltip-ca-watch'                => 'এই পাতাটিকে আপনার নজর তালিকায় যোগ করুন',
'tooltip-ca-unwatch'              => 'এই পাতাটি আপনার নজর তালিকা থেকে সরিয়ে ফেলুন',
'tooltip-search'                  => 'অনুসন্ধান {{SITENAME}}',
'tooltip-search-go'               => 'যদি থাকে, তবে ঠিক এই নামের পাতায় চলো',
'tooltip-search-fulltext'         => 'এই টেক্সটের জন্য পাতাগুলিতে অনুসন্ধান করা হোক',
'tooltip-p-logo'                  => 'প্রধান পাতা',
'tooltip-n-mainpage'              => 'প্রধান পাতায় যান',
'tooltip-n-portal'                => 'প্রকল্পের বৃত্তান্ত, আপনার করণীয়, কোথায় অনুসন্ধান করবেন',
'tooltip-n-currentevents'         => 'বর্তমান ঘটনাবলির পটভূমিক তথ্য',
'tooltip-n-recentchanges'         => 'উইকিতে সাম্প্রতিক পরিবর্তগুলির তালিকা',
'tooltip-n-randompage'            => 'অনির্ধারিত যেকোন পাতা খুলুন',
'tooltip-n-help'                  => 'সাহায্য খুঁজে নিন',
'tooltip-t-whatlinkshere'         => 'যে সব উইকি পাতা থেকে এখানে সংযোগ আছে',
'tooltip-t-recentchangeslinked'   => 'এই পাতা থেকে সংযোগ আছে, এমন পাতাগুলিতে সাম্প্রতিক পরিবর্তন',
'tooltip-feed-rss'                => 'এই পাতার জন্য আরএসএস ফিড',
'tooltip-feed-atom'               => 'এই পাতার জন্য অ্যাটম ফিড',
'tooltip-t-contributions'         => 'এই ব্যবহারকারীর অবদানগুলির তালিকা দেখুন',
'tooltip-t-emailuser'             => 'এই ব্যবহারকারীকে একটি ই-মেইল পাঠান',
'tooltip-t-upload'                => 'ফাইল আপলোড করুন',
'tooltip-t-specialpages'          => 'সব বিশেষ পাতার তালিকা',
'tooltip-t-print'                 => 'এ পাতার ছাপানোর উপযোগী সংস্করণ',
'tooltip-t-permalink'             => 'পাতাটির এই সংস্করণের স্থায়ী সংযোগ',
'tooltip-ca-nstab-main'           => 'বিষয়বস্তু পাতাটি দেখুন',
'tooltip-ca-nstab-user'           => 'ব্যহারকারী পাতাটি দেখুন',
'tooltip-ca-nstab-media'          => 'মিডিয়া পাতাটি দেখুন',
'tooltip-ca-nstab-special'        => 'এটি একটি বিশেষ পাতা, আপনি এটি সম্পাদনা করতে পারবেন না',
'tooltip-ca-nstab-project'        => 'প্রকল্প পাতাটি দেখুন',
'tooltip-ca-nstab-image'          => 'ফাইলের পাতাটি দেখুন',
'tooltip-ca-nstab-mediawiki'      => 'সিস্টেম বার্তাটি দেখুন',
'tooltip-ca-nstab-template'       => 'টেমপ্লেটটি দেখুন',
'tooltip-ca-nstab-help'           => 'সাহায্য পাতাটি দেখুন',
'tooltip-ca-nstab-category'       => 'বিষয়শ্রেণী পাতাটি দেখুন',
'tooltip-minoredit'               => 'এটিকে অনুল্লেখ্য সম্পাদনা হিসেবে চিহ্নিত করা হোক',
'tooltip-save'                    => 'আপনার পরিবর্তনগুলি সংরক্ষিত হোক',
'tooltip-preview'                 => 'অনুগ্রহ করে সংরক্ষণের আগে আপনার পরিবর্তনগুলি প্রাকদর্শন করুন!',
'tooltip-diff'                    => 'আপনি টেক্সটে কী কী পরিবর্তন করেছেন, তা দেখানো হোক।',
'tooltip-compareselectedversions' => 'এই পাতার দুইটি নির্বাচিত সংস্করণের মধ্যে তুলনা দেখুন।',
'tooltip-watch'                   => 'এই পাতাটি আমার নজর তালিকায় যোগ করো',
'tooltip-recreate'                => 'মুছে ফেলা সত্ত্বেও পাতাটি পুনরায় সৃষ্টি করুন',
'tooltip-upload'                  => 'আপলোড শুরু করো',

# Metadata
'nodublincore'      => 'Dublin Core RDF metadata এই সার্ভারের জন্য নিষ্ক্রিয়।',
'nocreativecommons' => 'ক্রিয়েটিভ কমন্‌স RDF metadata এই সার্ভারের জন্য নিষ্ক্রিয়।',
'notacceptable'     => 'আপনার ক্লায়েন্ট পড়তে পারে এমন ফরম্যাটে উইকি সার্ভার উপাত্ত সরবরাহ করতে পারছে না।',

# Attribution
'anonymous'        => '{{SITENAME}} এর বেনামী ব্যবহারকারীবৃন্দ',
'siteuser'         => '{{SITENAME}} ব্যবহারকারী $1',
'lastmodifiedatby' => 'এই পাতাটিতে শেষ পরিবর্তন হয়েছিল $2, $1 by $3।', # $1 date, $2 time, $3 user
'othercontribs'    => '$1-এর কাজের উপর ভিত্তি করে।',
'others'           => 'অন্যান্য',
'siteusers'        => '{{SITENAME}} ব্যবহারকারী $1',
'creditspage'      => 'পাতার স্বীকৃতি',
'nocredits'        => 'এই পাতাটির জন্য কোন কৃতিত্ব-সম্পর্কিত তথ্য নেই।',

# Spam protection
'spamprotectiontitle' => 'স্প্যাম প্রতিরক্ষা ফিল্টার',
'spamprotectiontext'  => 'আপনি যে পাতাটি সংরক্ষণ করতে চেয়েছিলেন, তাতে স্প্যাম ফিল্টার বাধা দিয়েছে। সম্ভবত বহিঃস্থ কোন সাইটের প্রতি কোন সংযোগের কারণে এমন ঘটেছে।',
'spamprotectionmatch' => 'নিচের টেক্সটটি আমাদের স্প্যাম ফিল্টারকে সক্রিয় করেছে: $1',
'spambot_username'    => 'মিডিয়াউইকি স্প্যাম পরিস্কার',
'spam_reverting'      => '$1-এর প্রতি কোন সংযোগ নেই, এমন সর্বশেষ সংস্করণে ফেরত নেওয়া হচ্ছে।',
'spam_blanking'       => '$1-এর প্রতি সংযোগ অন্তর্ভুক্ত আছে এমন সমস্ত সংশোধন খালি করা হচ্ছে',

# Info page
'infosubtitle'   => 'পাতার তথ্য',
'numedits'       => 'সম্পাদনার সংখ্যা (পাতা): $1',
'numtalkedits'   => 'সম্পাদনার সংখ্যা (আলাপের পাতা): $1',
'numwatchers'    => 'নজরকারীর সংখ্যা: $1',
'numauthors'     => 'পৃথক (নিবন্ধ) লেখকের সংখ্যা: $1',
'numtalkauthors' => 'পৃথক লেখকের সংখ্যা(আলাপের পাতা): $1',

# Math options
'mw_math_png'    => 'সবসময় পিএনজি (PNG) দেখাও',
'mw_math_simple' => 'খুব সরল হলে এইচটিএমএল (HTML), নতুবা পিএনজি (PNG)',
'mw_math_html'   => 'সম্ভব হলে এইচটিএমএল (HTML), নতুবা পিএনজি (PNG)',
'mw_math_source' => 'টেক (TeX) আকারে রেখে দাও (টেক্সট ব্রাউজারগুলোর জন্য)',
'mw_math_modern' => 'আধুনিক ব্রাউজারগুলোর জন্য সুপারিশকৃত',
'mw_math_mathml' => 'সম্ভব হলে ম্যাথএমএল (MathML) (পরীক্ষামূলক)',

# Patrolling
'markaspatrolleddiff'                 => 'পরীক্ষিত বলে চিহ্নিত করুন',
'markaspatrolledtext'                 => 'এই নিবন্ধটিকে পরীক্ষিত বলে চিহ্নিত করুন',
'markedaspatrolled'                   => 'পরীক্ষিত বলে চিহ্নিত করুন',
'markedaspatrolledtext'               => 'আপনার নির্বাচিত সংস্করণ পরীক্ষিত বলে চিহ্নিত করা হয়েছে।',
'rcpatroldisabled'                    => 'সাম্প্রতিক পরিবর্তন প্যাট্রোল নিষ্ক্রিয়',
'rcpatroldisabledtext'                => 'সাম্প্রতিক পরিবর্তন প্যাট্রোল ফিচারটি বর্তমানে নিষ্ক্রিয় আছে।',
'markedaspatrollederror'              => 'পরীক্ষিত বলে চিহ্নিত করা যাবে না',
'markedaspatrollederrortext'          => 'পরীক্ষিত বলে চিহ্নিত করতে আপনাকে একটি সংস্করণ নির্দিষ্ট  করতে হবে।',
'markedaspatrollederror-noautopatrol' => 'আপনার নিজের পাতাকে পরীক্ষিত বলে চিহ্নিত করার অনুমতি আপনার নাই।',

# Patrol log
'patrol-log-page' => 'পরীক্ষণ লগ',
'patrol-log-line' => '$2 গুলোর $1 কে পরীক্ষিত বলে চিহ্নিত করা হয়েছে $3',
'patrol-log-auto' => '(স্বয়ংক্রিয়)',

# Image deletion
'deletedrevision'                 => 'মুছে ফেলা পুরাতন সংশোধন $1',
'filedeleteerror-short'           => 'ফাইল মুছতে গিয়ে ত্রুটি: $1',
'filedeleteerror-long'            => 'ফাইলটি মুছার সময় ত্রুটি দেখা দিয়েছে:

$1',
'filedelete-missing'              => 'ফাইল "$1" মুছে ফেলা যাবে না, কারণ ফাইলটি ডাটাবেজে নেই।',
'filedelete-old-unregistered'     => 'নির্ধারিত ফাইলের সংশোধন "$1" ডাটাবেজে নেই।',
'filedelete-current-unregistered' => 'নির্ধারিত ফাইল "$1" ডাটাবেজে নেই।',
'filedelete-archive-read-only'    => '"$1" আর্কাইভ ডিরেক্টরিটি ওয়েবসার্ভার কর্তৃক লিখনযোগ্য নয়।',

# Browsing diffs
'previousdiff' => '← পূর্বের পার্থক্য',
'nextdiff'     => 'পরবর্তী পার্থক্য →',

# Media information
'mediawarning'         => "'''সতর্কীকরণ''': এই ফাইলটিতে ক্ষতিকর কোড থাকতে পারে। এটি নির্বাহ করলে আপনার সিস্টেমে ক্ষতি হতে পারে।<hr />",
'imagemaxsize'         => 'ছবির বিবরণ পাতায় প্রদর্শিত ছবির আকারের সর্বোচ্চ সীমা:',
'thumbsize'            => 'থাম্বনেইল আকার:',
'widthheightpage'      => '$1×$2, $3 পাতাসমূহ',
'file-info'            => '(ফাইলের আকার: $1, MIME ধরণ: $2)',
'file-info-size'       => '($1 × $2 pixel, ফাইলের আকার: $3, MIME ধরণ: $4)',
'file-nohires'         => '<small>এর চেয়ে বেশি রেজোলিউশন লভ্য নয়।</small>',
'svg-long-desc'        => '(SVG ফাইল, সাধারণত $1 × $2 pixels, ফাইলের আকার: $3)',
'show-big-image'       => 'পূর্ণ রেজোলিউশন',
'show-big-image-thumb' => '<small>আকারের প্রাকদর্শন: $1 × $2 pixels</small>',

# Special:NewImages
'newimages'             => 'নতুন ফাইলের গ্যালারি',
'imagelisttext'         => 'নিচে $1টি ফাইলের একটি তালিকা $2 সাজিয়ে দেখানো হল।',
'showhidebots'          => '($1 বট)',
'noimages'              => 'দেখার মত কিছু নেই।',
'ilsubmit'              => 'অনুসন্ধান',
'bydate'                => 'তারিখ অনুযায়ী',
'sp-newimages-showfrom' => '$1 হতে শুরু করে নতুন ছবিগুলো দেখাও',

# Bad image list
'bad_image_list' => 'ফরম্যাটটি এরকম:

কেবল তালিকা আইটেমগুলি (* দিয়ে শুরু হওয়া লাইনগুলি) গণ্য করা হবে। কোন লাইনের প্রথম সংযোগটিকে অবশ্যই কোন অচল ফাইলের প্রতি সংযোগ হতে হবে।
একই লাইনের পরবর্তী সমস্ত সংযোগ ব্যতিক্রম হিসেবে গণ্য করা হবে, অর্থাৎ যেসমস্ত পাতায় ফাইলটি ইনলাইন হিসেবে বিদ্যমান।',

# Metadata
'metadata'          => 'অধি-উপাত্ত',
'metadata-help'     => 'এই ফাইলে অতিরিক্ত কিছু তথ্য আছে। সম্ভবত যে ডিজিটাল ক্যামেরা বা স্ক্যানারের মাধ্যমে এটি তৈরি বা ডিজিটায়িত করা হয়েছিল, সেটি কর্তৃক তথ্যগুলি যুক্ত হয়েছে। যদি ফাইলটি তার আদি অবস্থা থেকে পরিবর্তিত হয়ে থাকে, কিছু কিছু বিবরণ পরিবর্তিত ফাইলটির জন্য প্রযোজ্য না-ও হতে পারে।',
'metadata-expand'   => 'সম্প্রসারিত সবিস্তারে দেখাও',
'metadata-collapse' => 'সম্প্রসারিত সবিস্তারে দেখিও না',
'metadata-fields'   => 'এই বার্তায় তালিকাভুক্ত EXIF metadata ক্ষেত্রগুলি ছবির পাতায় প্রদর্শন করা হবে, যখন অধি-উপাত্ত সারণিটি সংকুচিত করা হবে। অন্য ক্ষেত্রগুলি স্বাভাবিক অবস্থায় লুক্কায়িত থাকবে।
* make
* model
* datetimeoriginal
* exposuretime
* fnumber
* focallength', # Do not translate list items

# EXIF tags
'exif-imagewidth'                  => 'চওড়া',
'exif-imagelength'                 => 'লম্বা',
'exif-bitspersample'               => 'উপাদানপ্রতি বিট',
'exif-compression'                 => 'সংকোচন পদ্ধতি',
'exif-photometricinterpretation'   => 'পিক্সেল গঠন',
'exif-orientation'                 => 'দিকমুখিতা',
'exif-samplesperpixel'             => 'উপাদানের সংখ্যা',
'exif-planarconfiguration'         => 'উপাত্ত বিন্যাস',
'exif-ycbcrsubsampling'            => 'Y থেকে C-এর সাবস্যাম্পলিং অনুপাত',
'exif-ycbcrpositioning'            => 'Y ও C অবস্থান',
'exif-xresolution'                 => 'অনুভূমিক রেজোলিউশন',
'exif-yresolution'                 => 'উল্লম্ব রেজোলিউশন',
'exif-resolutionunit'              => 'X ও Y রেজোলিউশনের একক',
'exif-stripoffsets'                => 'ছবির উপাত্তের অবস্থান',
'exif-rowsperstrip'                => 'প্রতি স্ট্রিপে সারির সংখ্যা',
'exif-stripbytecounts'             => 'প্রতি সংকুচিত স্ট্রিপে বাইটের পরিমাণ',
'exif-jpeginterchangeformat'       => 'JPEG SOI-তে অফসেট করা হয়েছে',
'exif-jpeginterchangeformatlength' => 'JPEG উপাত্তের বাইট',
'exif-transferfunction'            => 'স্থানান্তর ফাংশন',
'exif-whitepoint'                  => 'শ্বেত বিন্দু বর্ণালীময়তা',
'exif-primarychromaticities'       => 'মৌলিকত্বের বর্ণালীময়তা',
'exif-ycbcrcoefficients'           => 'রঙ জগৎ রূপান্তর মেট্রিক্স সহগগুলি',
'exif-referenceblackwhite'         => 'কালো-সাদা নির্দেশক মানের জোড়',
'exif-datetime'                    => 'ফাইল পরিবর্তনের তারিখ ও সময়',
'exif-imagedescription'            => 'ছবির শিরোনাম',
'exif-make'                        => 'ক্যামেরার তৈরিকারক',
'exif-model'                       => 'ক্যামেরা মডেল',
'exif-software'                    => 'ব্যবহৃত সফটওয়্যার',
'exif-artist'                      => 'স্রষ্টা',
'exif-copyright'                   => 'কপিরাইট ধারক',
'exif-exifversion'                 => 'Exif সংস্করণ',
'exif-flashpixversion'             => 'সমর্থিত Flashpix সংস্করণ',
'exif-colorspace'                  => 'রঙ জগৎ',
'exif-componentsconfiguration'     => 'প্রতিটি উপাদানের অর্থ',
'exif-compressedbitsperpixel'      => 'ছবি সংকোচন মোড',
'exif-pixelydimension'             => 'ছবির বৈধ প্রস্থ',
'exif-pixelxdimension'             => 'ছবির বৈধ উচ্চতা',
'exif-makernote'                   => 'প্রস্তুতকারকের নোট',
'exif-usercomment'                 => 'ব্যবহারকারীর মন্তব্য',
'exif-relatedsoundfile'            => 'সংশ্লিষ্ট অডিও ফাইল',
'exif-datetimeoriginal'            => 'উপাত্ত উৎপাদনের তারিখ ও সময়',
'exif-datetimedigitized'           => 'ডিজিটালকরণের তারিখ ও সময়',
'exif-subsectime'                  => 'তারিখসময় উপসেকেন্ড',
'exif-subsectimeoriginal'          => 'তারিখসময়মূল উপসেকেন্ড',
'exif-subsectimedigitized'         => 'তারিখসময়ডিজিটালকৃত উপসেকেন্ড',
'exif-exposuretime'                => 'আলোকসম্পাত কাল',
'exif-exposuretime-format'         => '$1 সেকেন্ড ($2)',
'exif-fnumber'                     => 'F নম্বর',
'exif-exposureprogram'             => 'আলোকসম্পাত প্রোগ্রাম',
'exif-spectralsensitivity'         => 'বর্ণালী সংবেদনশীলতা',
'exif-isospeedratings'             => 'আইএসও দ্রুতি মূল্যায়ন',
'exif-oecf'                        => 'আলোক-ইলেকট্রনিক রূপান্তর গুণনীয়ক',
'exif-shutterspeedvalue'           => 'শাটার দ্রুতি',
'exif-aperturevalue'               => 'উণ্মেষ',
'exif-brightnessvalue'             => 'উজ্জ্বলতা',
'exif-exposurebiasvalue'           => 'আলোকসম্পাত প্রবণতা',
'exif-maxaperturevalue'            => 'সর্বোচ্চ ভূমি আলোকসম্পাত',
'exif-subjectdistance'             => 'বিষয়বস্তুর দূরত্ব',
'exif-meteringmode'                => 'মিটারিং মোড',
'exif-lightsource'                 => 'বাতির উৎস',
'exif-flash'                       => 'ফ্ল্যাশ',
'exif-focallength'                 => 'লেন্সের ফোকাস দৈর্ঘ্য',
'exif-subjectarea'                 => 'বিষয়বস্তুর ক্ষেত্রফল',
'exif-flashenergy'                 => 'ফ্ল্যাশ শক্তি',
'exif-spatialfrequencyresponse'    => 'স্থানিক কম্পাংক উত্তর',
'exif-focalplanexresolution'       => 'X ফোকাস তলের রেজোলিউশন',
'exif-focalplaneyresolution'       => 'Y ফোকাস তলের রেজোলিউশন',
'exif-focalplaneresolutionunit'    => 'ফোকাস তল রেজোলিউশন একক',
'exif-subjectlocation'             => 'বিষয়বস্তুর অবস্থান',
'exif-exposureindex'               => 'আলোকসম্পাত সূচক',
'exif-sensingmethod'               => 'সংবেদন পদ্ধতি',
'exif-filesource'                  => 'ফাইল সোর্স',
'exif-scenetype'                   => 'দৃশ্যের ধরন',
'exif-cfapattern'                  => 'CFA বিন্যাস',
'exif-customrendered'              => 'পছন্দমাফিক ছবি প্রক্রিয়াকরণ',
'exif-exposuremode'                => 'আলোকসম্পাত মোড',
'exif-whitebalance'                => 'সাদা ভারসাম্য',
'exif-digitalzoomratio'            => 'ডিজিটাল জুম অনুপাত',
'exif-focallengthin35mmfilm'       => '৩৫ মিমি ফিল্মে ফোকাস দৈর্ঘ্য',
'exif-scenecapturetype'            => 'দৃশ্য গ্রহণ ধরন',
'exif-gaincontrol'                 => 'দৃশ্য নিয়ন্ত্রণ',
'exif-contrast'                    => 'বৈপরীত্য',
'exif-saturation'                  => 'সম্পৃক্ততা',
'exif-sharpness'                   => 'স্পষ্টতা',
'exif-devicesettingdescription'    => 'যন্ত্রাংশের সেটিংসের বিবরণ',
'exif-subjectdistancerange'        => 'বিষয়বস্তুর দূরত্বের সীমা',
'exif-imageuniqueid'               => 'অদ্বিতীয় ছবি আইডি',
'exif-gpsversionid'                => 'GPS ট্যাগ সংস্করণ',
'exif-gpslatituderef'              => 'উত্তর বা দক্ষিণ অক্ষাংশ',
'exif-gpslatitude'                 => 'অক্ষাংশ',
'exif-gpslongituderef'             => 'পূর্ব বা পশ্চিম দ্রাঘিমা',
'exif-gpslongitude'                => 'দ্রাঘিমা',
'exif-gpsaltituderef'              => 'উচ্চতা নির্দেশক',
'exif-gpsaltitude'                 => 'উচ্চতা',
'exif-gpstimestamp'                => 'GPS সময় (পারমাণবিক ঘড়ি)',
'exif-gpssatellites'               => 'পরিমাপে ব্যবহৃত উপগ্রহগুলি',
'exif-gpsstatus'                   => 'গ্রাহকের অবস্থা',
'exif-gpsmeasuremode'              => 'পরিমাপ মোড',
'exif-gpsdop'                      => 'পরিমাপ নির্ভুলতা',
'exif-gpsspeedref'                 => 'দ্রুতি একক',
'exif-gpsspeed'                    => 'GPS গ্রাহকের দ্রুতি',
'exif-gpstrackref'                 => 'চলনের দিকের দির্দেশক',
'exif-gpstrack'                    => 'চলনের দিক',
'exif-gpsimgdirectionref'          => 'ছবির দিকের নির্দেশক',
'exif-gpsimgdirection'             => 'ছবির দিক',
'exif-gpsmapdatum'                 => 'প্রভূমিতিক জরিপ উপাত্ত ব্যবহার করা হয়েছে',
'exif-gpsdestlatituderef'          => 'গন্তব্যের অক্ষাংশের নির্দেশক',
'exif-gpsdestlatitude'             => 'গন্তব্যের অক্ষাংশ',
'exif-gpsdestlongituderef'         => 'গন্তব্যের দ্রাঘিমার নির্দেশক',
'exif-gpsdestlongitude'            => 'গন্তব্যের দ্রাঘিমা',
'exif-gpsdestbearingref'           => 'গন্তব্যের নতি কোণের নির্দেশক',
'exif-gpsdestbearing'              => 'দূরত্বের উন্নতি কোণ',
'exif-gpsdestdistanceref'          => 'গন্তব্য থেকে দূরত্বের নির্দেশক',
'exif-gpsdestdistance'             => 'গন্তব্য থেকে দূরত্ব',
'exif-gpsprocessingmethod'         => 'GPS প্রক্রিয়াকরণ পদ্ধতির নাম',
'exif-gpsareainformation'          => 'GPS এলাকার নাম',
'exif-gpsdatestamp'                => 'GPS তারিখ',
'exif-gpsdifferential'             => 'GPS ডিফারেনশিয়াল সংশোধন',

# EXIF attributes
'exif-compression-1' => 'অসংকুচিত',

'exif-unknowndate' => 'অজানা তারিখ',

'exif-orientation-1' => 'সাধারণ', # 0th row: top; 0th column: left
'exif-orientation-2' => 'অনুভূমিকভাবে উল্টানো', # 0th row: top; 0th column: right
'exif-orientation-3' => '১৮০° ঘোরানো', # 0th row: bottom; 0th column: right
'exif-orientation-4' => 'উল্লম্বভাবে উল্টানো', # 0th row: bottom; 0th column: left
'exif-orientation-5' => 'ঘড়ির কাঁটার বিপরীতে ৯০° ঘোরানো এবং উল্লম্বভাবে উল্টানো', # 0th row: left; 0th column: top
'exif-orientation-6' => 'ঘড়ির কাঁটার দিকে ৯০° ঘোরানো', # 0th row: right; 0th column: top
'exif-orientation-7' => 'ঘড়ির কাঁটার দিকে ৯০° ঘোরানো এবং উল্লম্বভাবে উল্টানো', # 0th row: right; 0th column: bottom
'exif-orientation-8' => 'ঘড়ির কাঁটার বিপরীত দিকে ৯০° ঘোরানো', # 0th row: left; 0th column: bottom

'exif-planarconfiguration-1' => 'খণ্ড ফরম্যাট',
'exif-planarconfiguration-2' => 'সমতলীয় ফরম্যাট',

'exif-componentsconfiguration-0' => 'বিদ্যমান নয়',

'exif-exposureprogram-0' => 'অসংজ্ঞায়িত',
'exif-exposureprogram-1' => 'হস্তচালিত',
'exif-exposureprogram-2' => 'সাধারণ প্রোগ্রাম',
'exif-exposureprogram-3' => 'আলোকসম্পাত অগ্রাধিকার',
'exif-exposureprogram-4' => 'শাটার অগ্রাধিকার',
'exif-exposureprogram-5' => 'সৃষ্টিশীল প্রোগ্রাম (ক্ষেত্রের গভীরতার প্রতি পক্ষপাতবিশিষ্ট)',
'exif-exposureprogram-6' => 'অ্যাকশন প্রোগ্রাম (শাটার দ্রুতির প্রতি পক্ষপাতবিশিষ্ট)',
'exif-exposureprogram-7' => 'প্রতিকৃতি মোড (পটভূমিকে ফোকাসের বাইরে রেখে ক্লোজ-আপ ছবি তোলার জন্য)',
'exif-exposureprogram-8' => 'ল্যান্ডস্কেপ মোড (পটভূমি ফোকাসে রেখে তোলা ল্যান্ডস্কেপ আলোকচিত্রের জন্য)',

'exif-subjectdistance-value' => '$1 মিটার',

'exif-meteringmode-0'   => 'অজানা',
'exif-meteringmode-1'   => 'গড়',
'exif-meteringmode-2'   => 'কেন্দ্র ওজনকৃত গড়',
'exif-meteringmode-3'   => 'স্পট',
'exif-meteringmode-4'   => 'মাল্টিস্পট',
'exif-meteringmode-5'   => 'বিন্যাস',
'exif-meteringmode-6'   => 'আংশিক',
'exif-meteringmode-255' => 'অন্য',

'exif-lightsource-0'   => 'অজানা',
'exif-lightsource-1'   => 'দিনের আলো',
'exif-lightsource-2'   => 'প্রতিপ্রভ',
'exif-lightsource-3'   => 'টাংস্টেন (ভাস্বর বাতি)',
'exif-lightsource-4'   => 'ফ্ল্যাশ',
'exif-lightsource-9'   => 'চমৎকার আবহাওয়া',
'exif-lightsource-10'  => 'মেঘাচ্ছন্ন আবহাওয়া',
'exif-lightsource-11'  => 'ছায়া',
'exif-lightsource-12'  => 'দিবালোক প্রতিপ্রভ (D 5700 – 7100K)',
'exif-lightsource-13'  => 'দিন সাদা প্রতিপ্রভ (N 4600 – 5400K)',
'exif-lightsource-14'  => 'শীতল সাদা প্রতিপ্রভ (W 3900 – 4500K)',
'exif-lightsource-15'  => 'সাদা প্রতিপ্রভ (WW 3200 – 3700K)',
'exif-lightsource-17'  => 'আদর্শ আলো A',
'exif-lightsource-18'  => 'আদর্শ আলো B',
'exif-lightsource-19'  => 'আদর্শ আলো C',
'exif-lightsource-24'  => 'ISO স্টুডিও টাংস্টেন',
'exif-lightsource-255' => 'অন্য আলোক উৎস',

'exif-focalplaneresolutionunit-2' => 'ইঞ্চি',

'exif-sensingmethod-1' => 'অসংজ্ঞায়িত',
'exif-sensingmethod-2' => 'এক-চিপ রঙ এলাকা সংবেদক',
'exif-sensingmethod-3' => 'দুই-চিপ রঙ ক্ষেত্র সংবেদক',
'exif-sensingmethod-4' => 'তিন-চিপ রঙ ক্ষেত্র সংবেদক',
'exif-sensingmethod-5' => 'রঙ ক্রমায়িত ক্ষেত্র সংবেদক',
'exif-sensingmethod-7' => 'ত্রিরৈখিক সংবেদক',
'exif-sensingmethod-8' => 'রঙ ক্রমায়িত রৈখিক সংবেদক',

'exif-scenetype-1' => 'সরাসরি ফটো তোলা ছবি',

'exif-customrendered-0' => 'স্বাভাবিক প্রক্রিয়া',
'exif-customrendered-1' => 'পছন্দমাফিক প্রক্রিয়া',

'exif-exposuremode-0' => 'স্বয়ংক্রিয় আলোকসম্পাত',
'exif-exposuremode-1' => 'হাতে করা আলোকসম্পাত',
'exif-exposuremode-2' => 'স্বয়ংক্রিয় ব্র‌্যাকেট',

'exif-whitebalance-0' => 'স্বয়ংক্রিয় সাদা ভারসাম্য',
'exif-whitebalance-1' => 'হাতে করা সাদা ভারসাম্য',

'exif-scenecapturetype-0' => 'আদর্শ',
'exif-scenecapturetype-1' => 'ল্যান্ডস্কেপ',
'exif-scenecapturetype-2' => 'প্রতিকৃতি',
'exif-scenecapturetype-3' => 'রাত্রীকালীন দৃশ্য',

'exif-gaincontrol-0' => 'কিছুই না',
'exif-gaincontrol-1' => 'নিম্ন গেইন আপ',
'exif-gaincontrol-2' => 'উচ্চ গেইন আপ',
'exif-gaincontrol-3' => 'নিম্ন গেইন ডাউন',
'exif-gaincontrol-4' => 'উচ্চ গেইন ডাউন',

'exif-contrast-0' => 'সাধারণ',
'exif-contrast-1' => 'নরম',
'exif-contrast-2' => 'কঠিন',

'exif-saturation-0' => 'সাধারণ',
'exif-saturation-1' => 'নিম্ন সম্পৃক্তি',
'exif-saturation-2' => 'উচ্চ সম্পৃক্তি',

'exif-sharpness-0' => 'সাধারণ',
'exif-sharpness-1' => 'নরম',
'exif-sharpness-2' => 'কঠিন',

'exif-subjectdistancerange-0' => 'অজানা',
'exif-subjectdistancerange-1' => 'ম্যাক্রো',
'exif-subjectdistancerange-2' => 'নিকট দৃষ্টি',
'exif-subjectdistancerange-3' => 'দূর দৃষ্টি',

# Pseudotags used for GPSLatitudeRef and GPSDestLatitudeRef
'exif-gpslatitude-n' => 'উত্তর অক্ষাংশ',
'exif-gpslatitude-s' => 'দক্ষিণ অক্ষাংশ',

# Pseudotags used for GPSLongitudeRef and GPSDestLongitudeRef
'exif-gpslongitude-e' => 'পূর্ব দ্রাঘিমাংশ',
'exif-gpslongitude-w' => 'পশ্চিম দ্রাঘিমাংশ',

'exif-gpsstatus-a' => 'পরিমাপ চলছে',
'exif-gpsstatus-v' => 'পরিমাপ একত্রীকরণ-ক্ষমতা',

'exif-gpsmeasuremode-2' => 'দ্বিমাত্রিক পরিমাপ',
'exif-gpsmeasuremode-3' => 'ত্রিমাত্রিক পরিমাপ',

# Pseudotags used for GPSSpeedRef and GPSDestDistanceRef
'exif-gpsspeed-k' => 'কিলোমিটার প্রতি ঘন্টা',
'exif-gpsspeed-m' => 'মাইল প্রতি ঘন্টা',
'exif-gpsspeed-n' => 'নট',

# Pseudotags used for GPSTrackRef, GPSImgDirectionRef and GPSDestBearingRef
'exif-gpsdirection-t' => 'প্রকৃত দিক',
'exif-gpsdirection-m' => 'চৌম্বক দিক',

# External editor support
'edit-externally'      => 'ফাইলটি অন্য কোন সফটওয়্যার দিয়ে সম্পাদনা করুন',
'edit-externally-help' => 'আরও তথ্যের জন্য [http://www.mediawiki.org/wiki/Manual:External_editors সেটআপ নির্দেশমালা] দেখুন।',

# 'all' in various places, this might be different for inflected languages
'recentchangesall' => 'সমস্ত',
'imagelistall'     => 'সমস্ত',
'watchlistall2'    => 'সবগুলো',
'namespacesall'    => 'সমস্ত',
'monthsall'        => 'সমস্ত',

# E-mail address confirmation
'confirmemail'            => 'ই-মেইলের ঠিকানা নিশ্চিত করুন',
'confirmemail_noemail'    => 'আপনার [[Special:Preferences|ব্যবহারকারী পছন্দগুলিতে]] কোন বৈধ ই-মেইল ঠিকানা দেয়া হয়নি।',
'confirmemail_text'       => '{{SITENAME}}-এ ই-মেইল ফিচারগুলি ব্যবহার করার আগে আপনাকে আপনার ই-মেইল ঠিকানা নিশ্চিত করতে হবে। নিচের বোতামটি চেপে আপনার ই-মেইল ঠিকানায় একটি নিশ্চিতকরণ চিঠি পাঠান। এই চিঠিতে একটি কোড ধারণকারী সংযোগ থাকবে; আপনার ই-মেইল ঠিকানা যা বৈধ, তা নিশ্চিত করতে আপনার ব্রাউজারে এই সংযোগটি লোড করুন।',
'confirmemail_pending'    => '<div class="error">
আপনার কাছে ইতিমধ্যেই একটি নিশ্চিতকরণ কোড ই-মেইলে পাঠানো হয়েছে; যদি আপনি সম্প্রতি অ্যাকাউন্ট সৃষ্টি করে থাকেন, তবে নতুন একটি কোড অনুরোধ করার আগে কয়েক মিনিট অপেক্ষা করুন।
</div>',
'confirmemail_send'       => 'নিশ্চিতকরণ ই-মেইল /কোড পাঠাও।',
'confirmemail_sent'       => 'নিশ্চিতকরণ ই-মেইল পাঠানো হয়েছে।',
'confirmemail_oncreate'   => 'আপনার ই-মেইল ঠিকানায় একটি নিশ্চিতকরণ কোড পাঠানো হয়েছে।
অ্যাকাউন্টে প্রবেশ করার জন্য এই কোড আবশ্যক নয়, কিন্তু উইকিতে ই-মেইলভিত্তিক কোন ফিচার চালু করতে চাইলে আপনাকে এই কোডটি প্রদান করতে হবে।',
'confirmemail_sendfailed' => 'নিশ্চিতকরণ ই-মেইলটি পাঠানো সম্ভব হলো না। ইমেইল ঠিকানাটি ঠিকভাবে লিখেছেন কিনা, সেটি যাচাই করে দেখুন।',
'confirmemail_invalid'    => 'নিশ্চিতকরণের কোডটি সঠিক নয়। সম্ভবতঃ এটি পুরানো হয়ে গেছে।',
'confirmemail_needlogin'  => 'আপনার ই-মেইল ঠিকানা নিশ্চিত করতে আপনার $1 প্রয়োজন।',
'confirmemail_success'    => 'আপনার ই-মেইল ঠিকানাটি নিশ্চিত করা হয়েছে। আপনি এখন লগ-ইন করতে পারেন।',
'confirmemail_loggedin'   => 'আপনার ই-মেইল ঠিকানাটি নিশ্চিত করা হয়েছে।',
'confirmemail_error'      => 'আপনার নিশ্চিতকরণ সংরক্ষণ করতে হয়তো কিছু সমস্যা হয়েছিল',
'confirmemail_subject'    => '{{SITENAME}} ই-মেইল ঠিকানা নিশ্চিতকরণ',
'confirmemail_body'       => 'কেউ, সম্ভবত আপনি, $1 আইপি ঠিকানা থেকে, এই ই-মেইল ঠিকানাটি দিয়ে {{SITENAME}}-এ "$2" নামে অ্যাকাউন্ট খুলেছেন।

এই অ্যাকাউন্টটি যে আসলেই আপনার তা নিশ্চিত করার জন্য এবং {{SITENAME}}-এ ই-মেইল ফিচারগুলি সক্রিয় করার জন্য আপনার ব্রাউজারে এই সংযোগটি খুলুন:

$3

যদি আপনি এই ব্যক্তি *না* হন, তবে সংযোগটি অনুসরণ করবেন না। $4-এ নিশ্চিতকরণ কোডটি মেয়াদোত্তীর্ণ হয়ে যাবে।',

# Scary transclusion
'scarytranscludedisabled' => '[আন্তঃউইকি আন্তঃভুক্তি নিষ্ক্রিয়]',
'scarytranscludefailed'   => '[$1 এর জন্য টেম্পলেট আনা অসফল হয়েছে; দুঃখিত]',
'scarytranscludetoolong'  => '[URLটি অতিরিক্ত দীর্ঘ; দুঃখিত]',

# Trackbacks
'trackbackbox'      => '<div id="mw_trackbacks">
অনুসরণকারী সংযোগগুলি:<br />
$1
</div>',
'trackbackremove'   => ' ([$1 অবলুপ্ত])',
'trackbacklink'     => 'অনুসরণকারী সংযোগ',
'trackbackdeleteok' => 'অনুসরণকারী সংযোগটি সফলভাবে মুছে ফেলা হয়েছে।',

# Delete conflict
'deletedwhileediting' => 'সতর্কীকরণ: আপনি পাতাটি সম্পাদনা শুরু করার পর পাতাটিকে মুছে ফেলা হয়েছে!',
'confirmrecreate'     => "আপনি সম্পাদনা শুরু করার পর ব্যবহারকারী [[User:$1|$1]] ([[User talk:$1|আলাপ]]) এই পাতাটি মুছে দিয়েছেন, নিচের কারণ দেখিয়ে:
: ''$2''
আপনি সত্যিই যে পাতাটি পুনরায় সৃষ্টি করতে চান, তা দয়া করে নিশ্চিত করুন।",
'recreate'            => 'পুনরায় তৈরি করো',

# HTML dump
'redirectingto' => '[[:$1]] পাতায় পুনঃনির্দেশিত হচ্ছে...',

# action=purge
'confirm_purge'        => 'এই পাতার ক্যাশে পরিষ্কার করতে চান?

$1',
'confirm_purge_button' => 'ঠিক আছে',

# AJAX search
'searchcontaining' => "''$1'' আছে এমন নিবন্ধগুলো অনুসন্ধান করো।",
'searchnamed'      => "''$1'' শিরোনামের পাতা অনুসন্ধান করো।",
'articletitles'    => "যেসব পাতা ''$1'' দিয়ে শুরু হয়েছে, তাদের তালিকা",
'hideresults'      => 'ফলাফলগুলো দেখিও না',
'useajaxsearch'    => 'এজ্যাক্স (AJAX) অনুসন্ধান ব্যবহার করা হোক',

# Multipage image navigation
'imgmultipageprev' => '← পূর্ববর্তী পাতা',
'imgmultipagenext' => 'পরবর্তী পাতা →',
'imgmultigo'       => 'চলো!',

# Table pager
'ascending_abbrev'         => 'আরোহণ',
'descending_abbrev'        => 'অবতরণ',
'table_pager_next'         => 'পরবর্তী পাতা',
'table_pager_prev'         => 'পূর্ববর্তী পাতা',
'table_pager_first'        => 'প্রথম পাতা',
'table_pager_last'         => 'শেষ পাতা',
'table_pager_limit'        => 'প্রতি পাতায় $1 গুলো বিষয়বস্তু দেখাও',
'table_pager_limit_submit' => 'চলো',
'table_pager_empty'        => 'ফলাফল শূন্য',

# Auto-summaries
'autosumm-blank'   => 'পাতার সমস্ত বিষয়বস্তু মুছে ফেলা হল',
'autosumm-replace' => "পাতাকে '$1' দিয়ে প্রতিস্থাপিত করা হল",
'autoredircomment' => '[[$1]]-এ পুনর্নির্দেশ করা হল',
'autosumm-new'     => 'নতুন পাতা: $1',

# Size units
'size-bytes'     => '$1 বাইট',
'size-kilobytes' => '$1 কিলোবাইট',
'size-megabytes' => '$1 মেগাবাইট',
'size-gigabytes' => '$1 গিগাবাইট',

# Live preview
'livepreview-loading' => 'লোডিং…',
'livepreview-ready'   => 'লোডিং… প্রস্তুত!',
'livepreview-failed'  => 'তাৎক্ষণিক প্রাকদর্শন কাজ করছে না! সাধারণ প্রাকদর্শন চেষ্টা করুন।',
'livepreview-error'   => 'সংযোগ প্রদানে সম্ভব নয়: $1 "$2"। সাধারণ প্রাকদর্শন চেষ্টা করুণ।',

# Friendlier slave lag warnings
'lag-warn-normal' => '$1 সেকেন্ড আগের পরিবর্তন হয়তো তালিকায় দেখনো হয়নি।',
'lag-warn-high'   => 'ডাটাবেজ সার্ভারের অত্যধিক বিলম্বের কারণে $1 সেকেন্ডের চেয়ে নতুন পরিবর্তনগুলি এই তালিকায় না-ও দেখানো হতে পারে।',

# Watchlist editor
'watchlistedit-numitems'       => 'আপনার নজরতালিকায় আলোচনা পাতাগুলি বাদ দিয়ে {{PLURAL:$1|১টি শিরোনাম|$1টি শিরোনাম}} রয়েছে।',
'watchlistedit-noitems'        => 'আপনার নজর তালিকায় কোন পাতার শিরোনাম নাই।',
'watchlistedit-normal-title'   => 'নজর তালিকা সম্পাদনা করো',
'watchlistedit-normal-legend'  => 'নজর তালিকা থেকে শিরোনামসমূহ মুছে ফেলো',
'watchlistedit-normal-explain' => 'আপনার নজরতালিকায় রাখা পাতার শিরোনামগুলি নিচে দেখানো হয়েছে। কোন শিরোনাম সরিয়ে নিতে চাইলে পাশের বাক্সে টিক দিন এবং "শিরোনামগুলি সরিয়ে ফেলা হোক"-এ ক্লিক করুন। আপনি [[Special:Watchlist/raw|মূল তালিকাটিও]] সম্পাদনা করতে পারেন।',
'watchlistedit-normal-submit'  => 'শিরোনামগুলি সরিয়ে ফেলা হোক',
'watchlistedit-normal-done'    => '{{PLURAL:$1|1 শিরোনাম|$1 শিরোনামসমূহ}} আপনার নজর তালিকা থেকে মুছে ফেলা হয়েছে:',
'watchlistedit-raw-title'      => 'অশোধিত নজর তালিকা সম্পাদনা করুন',
'watchlistedit-raw-legend'     => 'অশোধিত নজরতালিকা সম্পাদনা করুন',
'watchlistedit-raw-explain'    => 'আপনার নজরতালিকায় রাখা পাতার শিরোনামগুলি নিচে দেখানো হয়েছে। এই তালিকাতে নতুন শিরোনাম যোগ করা যাবে বা শিরোনাম সরিয়ে নেওয়া যাবে। একটি শিরোনামের জন্য একটি লাইন বরাদ্দ। শেষ হলে "নজরতালিকা হালনাগাদ করা হোক"-এ ক্লিক করুন। আপনি [[Special:Watchlist/edit|আদর্শ সম্পাদনা সরঞ্জাম]]-ও ব্যবহার করতে পারেন।',
'watchlistedit-raw-titles'     => 'শিরোনাম:',
'watchlistedit-raw-submit'     => 'নজরতালিকা হালনাগাদ করা হোক',
'watchlistedit-raw-done'       => 'আপনার নজর তালিকা হালনাগাদ করা হয়েছে।',
'watchlistedit-raw-added'      => '{{PLURAL:$1|1 শিরোনাম|$1 শিরোনামসমূহ}} যোগ করা হয়েছে:',
'watchlistedit-raw-removed'    => '{{PLURAL:$1|1 শিরোনাম|$1 শিরোনামসমূহ}} মুছে ফেলা হয়েছে:',

# Watchlist editing tools
'watchlisttools-view' => 'সম্পর্কিত পরিবর্তনসমূহ দেখুন',
'watchlisttools-edit' => 'নজর তালিকা দেখুন এবং সম্পাদনা করুন',
'watchlisttools-raw'  => 'অশোধিত নজর তালিকা সম্পাদনা করো',

# Core parser functions
'unknown_extension_tag' => 'অজানা এক্সটেনশন ট্যাগ "$1"',

# Special:Version
'version'                  => 'সংস্করণ', # Not used as normal message but as header for the special page itself
'version-software-product' => 'পণ্য',
'version-software-version' => 'সংস্করণ',

# Special:FilePath
'filepath'        => 'ফাইলের পাথ',
'filepath-page'   => 'ফাইল:',
'filepath-submit' => 'পথ',

# Special:FileDuplicateSearch
'fileduplicatesearch-submit' => 'অনুসন্ধান',

# Special:SpecialPages
'specialpages'                   => 'বিশেষ পাতাসমূহ',
'specialpages-note'              => '----
* সাধারণ বিশেষ পাতাসমূহ।
* <span class="mw-specialpagerestricted">সীমাবদ্ধ বিশেষ পাতাসমূহ।</span>',
'specialpages-group-maintenance' => 'রক্ষণাবেক্ষণের কার্যবিবরণীসমূহ',
'specialpages-group-other'       => 'অন্যান্য বিশেষ পাতাসমূহ',
'specialpages-group-login'       => 'অ্যাকাউন্টে প্রবেশ',
'specialpages-group-changes'     => 'সাম্প্রতিক পরিবর্তন ও লগসমূহ',
'specialpages-group-media'       => 'মিডিয়া বিবরণী ও আপলোডসমূহ',
'specialpages-group-users'       => 'ব্যবহারকারীবৃন্দ ও অধিকারসমূহ',
'specialpages-group-highuse'     => 'অধিক ব্যবহৃত পাতাগুলি',
'specialpages-group-pages'       => 'পাতার তালিকা',
'specialpages-group-pagetools'   => 'পাতা সংক্রান্ত সরঞ্জাম',
'specialpages-group-wiki'        => 'উইকি উপাত্ত এবং সরঞ্জামসমূহ',
'specialpages-group-redirects'   => 'বিশেষ পাতাগুলি পুনর্নির্দেশ করা হচ্ছে',
'specialpages-group-spam'        => 'স্প্যামরোধী হাতিয়ার',

# Special:BlankPage
'blankpage'              => 'খালি পাতা',
'intentionallyblankpage' => 'এই পাতাটি ইচ্ছা করে খালি রাখা হয়েছে',

);
