<?php
/** Kannada (ಕನ್ನಡ)
 *
 * @ingroup Language
 * @file
 *
 * @author Ashwath Mattur <ashwatham@gmail.com> http://en.wikipedia.org/wiki/User:Ashwatham
 * @author HPN
 * @author Hari Prasad Nadig <hpnadig@gmail.com> http://en.wikipedia.org/wiki/User:Hpnadig
 * @author Mana
 * @author NamwikiTL
 * @author Shushruth
 * @author לערי ריינהארט
 */

$namespaceNames = array(
	NS_MEDIA            => 'ಮೀಡಿಯ',
	NS_SPECIAL          => 'ವಿಶೇಷ',
	NS_MAIN             => '',
	NS_TALK             => 'ಚರ್ಚೆಪುಟ',
	NS_USER             => 'ಸದಸ್ಯ',
	NS_USER_TALK        => 'ಸದಸ್ಯರ_ಚರ್ಚೆಪುಟ',
	# NS_PROJECT set by $wgMetaNamespace
	NS_PROJECT_TALK     => '$1_ಚರ್ಚೆ',
	NS_IMAGE            => 'ಚಿತ್ರ',
	NS_IMAGE_TALK       => 'ಚಿತ್ರ_ಚರ್ಚೆಪುಟ',
	NS_MEDIAWIKI        => 'ಮೀಡಿಯವಿಕಿ',
	NS_MEDIAWIKI_TALK   => 'ಮೀಡೀಯವಿಕಿ_ಚರ್ಚೆ',
	NS_TEMPLATE         => 'ಟೆಂಪ್ಲೇಟು',
	NS_TEMPLATE_TALK    => 'ಟೆಂಪ್ಲೇಟು_ಚರ್ಚೆ',
	NS_HELP             => 'ಸಹಾಯ',
	NS_HELP_TALK        => 'ಸಹಾಯ_ಚರ್ಚೆ',
	NS_CATEGORY         => 'ವರ್ಗ',
	NS_CATEGORY_TALK    => 'ವರ್ಗ_ಚರ್ಚೆ'
);

$digitTransformTable = array(
	'0' => '೦', # &#x0ce6;
	'1' => '೧', # &#x0ce7;
	'2' => '೨', # &#x0ce8;
	'3' => '೩', # &#x0ce9;
	'4' => '೪', # &#x0cea;
	'5' => '೫', # &#x0ceb;
	'6' => '೬', # &#x0cec;
	'7' => '೭', # &#x0ced;
	'8' => '೮', # &#x0cee;
	'9' => '೯', # &#x0cef;
);

$messages = array(
# User preference toggles
'tog-underline'               => 'ಲಿಂಕುಗಳ ಕೆಳಗೆ ಗೆರೆ ತೋರಿಸಿ',
'tog-highlightbroken'         => 'ಮುರಿದಿರುವ ಕೊಂಡಿಗಳನ್ನು <a href="" class="new">ಈ ರೀತಿ</a> (ಅಥವ: ಈ ರೀತಿ<a href="" class="internal">?</a>) ಬದಲಾಯಿಸು .',
'tog-justify'                 => 'ಪರಿಚ್ಛೇದಗಳ ಬದಿಗಳನ್ನು ಸಮನಾಗಿಸು',
'tog-hideminor'               => 'ಚಿಕ್ಕಪುಟ್ಟ ಬದಲಾವಣೆಗಳನ್ನು ಅಡಗಿಸಿ',
'tog-extendwatchlist'         => 'ಸಂಬಂಧಿತ ಎಲ್ಲಾ ಬದಲಾವಣೆಗಳನ್ನು ತೋರುವಂತೆ ಪಟ್ಟಿಯನ್ನು ವಿಸ್ತರಿಸಿ',
'tog-usenewrc'                => "ಹೆಚ್ಚು ಮಾಹಿತಿಯುಳ್ಳ 'ಇತ್ತೀಚಿನ ಬದಲಾವಣೆಗಳು' ಪುಟ (JavaScript)",
'tog-numberheadings'          => 'ತಲೆಬರಹಗಳಿಗೆ ಅಂಕಿಗಳನ್ನು ತೋರಿಸು',
'tog-showtoolbar'             => 'ಸಂಪಾದನೆಯ ಉಪಕರಣಗಳ ಪಟ್ಟಿಯನ್ನು ತೋರು (JavaScript)',
'tog-editondblclick'          => 'ಎರಡು ಬಾರಿ ಕ್ಲಿಕ್ ಮಾಡಿದಾಗ ಪುಟವು ಸಂಪಾದಿಸುವಂತಾಗಲಿ (JavaScript)',
'tog-editsection'             => 'ಪುಟದ ವಿಭಾಗಗಳನ್ನು [ಬದಲಾಯಿಸು] ಕೊಂಡಿಗಳನ್ನು ಒತ್ತುವುದರಿಂದ ಸಂಪಾದನೆ ಮಾಡುವಂತೆ ಇರಲಿ',
'tog-editsectiononrightclick' => 'ಪುಟದ ವಿಭಾಗಗಳನ್ನು ಅವುಗಳ ಶೀರ್ಷಿಕೆಯನ್ನು ಎರಡು ಬಾರಿ ಕ್ಲಿಕ್ ಮಾಡಿ ಸಂಪಾದನೆ ಮಾಡುವಂತೆ ಇರಲಿ (JavaScript)',
'tog-showtoc'                 => 'ಪರಿವಿಡಿಯನ್ನು ತೋರಿಸು (ಮೂರಕ್ಕಿಂತ ಹೆಚ್ಚು ತಲೆಬರಹಗಳನ್ನು ಹೊಂದಿರುವ ಪುಟಗಳಿಗೆ)',
'tog-rememberpassword'        => 'ಈ ಗಣಕಯಂತ್ರದಲ್ಲಿ ನನ್ನ ಲಾಗಿನ್ ನೆನಪಿನಲ್ಲಿಟ್ಟುಕೊ',
'tog-editwidth'               => 'ಸಂಪಾದನೆ ಚೌಕವು ಪೂರ್ಣ ವಿಸ್ತಾರವನ್ನು ಹೊಂದಿರಲಿ',
'tog-watchcreations'          => 'ನಾನು ಪ್ರಾರಂಭಿಸುವ ಲೇಖನಗಳನ್ನು ನನ್ನ ವೀಕ್ಷಣಾಪಟ್ಟಿಗೆ ಸೇರಿಸು',
'tog-watchdefault'            => 'ನಾನು ಸಂಪಾದಿಸುವ ಪುಟಗಳನ್ನು ವೀಕ್ಷಣಾಪಟ್ಟಿಗೆ ಸೇರಿಸು',
'tog-watchmoves'              => 'ನಾನು ಸ್ಥಳಾಂತರಿಸುವ ಪುಟಗಳನ್ನು ನನ್ನ ವೀಕ್ಷಣಾಪಟ್ಟಿಗೆ ಸೇರಿಸು',
'tog-watchdeletion'           => 'ನಾನು ಅಳಿಸುವ ಪುಟಗಳನ್ನು ನನ್ನ ವೀಕ್ಷಣಾ ಪಟ್ಟಿಗೆ ಸೇರಿಸು',
'tog-minordefault'            => 'ನನ್ನ ಎಲ್ಲಾ ಸಂಪಾದನೆಗಳನ್ನು ಚುಟುಕಾದವು ಎಂದು ಗುರುತು ಮಾಡು',
'tog-previewontop'            => 'ಮುನ್ನೋಟವನ್ನು ಸಂಪಾದನೆ ಚೌಕದ ಮುಂಚೆ ತೋರು',
'tog-previewonfirst'          => 'ಮೊದಲ ಬದಲಾವಣೆಯ ನಂತರ ಮುನ್ನೋಟವನ್ನು ತೋರಿಸು',
'tog-nocache'                 => 'ಪುಟಗಳನ್ನು cache ಮಾಡಬೇಡ',
'tog-enotifwatchlistpages'    => 'ನನ್ನ ವೀಕ್ಷಣಾ ಪಟ್ಟಿಯಲ್ಲಿರುವ ಯಾವುದಾದರೂ ಪುಟವು ಬದಲಾದಾಗ ನನಗೆ ಇ-ಅಂಚೆ ಕಳುಹಿಸು.',
'tog-enotifusertalkpages'     => 'ನನ್ನ ಚರ್ಚೆ ಪುಟ ಬದಲಾದರೆ ನನಗೆ ಇ-ಅಂಚೆ ಕಳುಹಿಸು',
'tog-enotifminoredits'        => 'ಚಿಕ್ಕ-ಪುಟ್ಟ ಬದಲಾವಣೆಗಳಾದಾಗಲೂ ಇ-ಅಂಚೆ ಕಳುಹಿಸು',
'tog-enotifrevealaddr'        => 'ಪ್ರಕಟಣೆ ಇ-ಅಂಚೆಗಳಲ್ಲಿ ನನ್ನ ಇ-ಅಂಚೆ ವಿಳಾಸ ತೋರು',
'tog-shownumberswatching'     => 'ಪುಟವನ್ನು ವೀಕ್ಷಿಸುತ್ತಿರುವ ಸದಸ್ಯರ ಸಂಖ್ಯೆಯನ್ನು ತೋರಿಸು',
'tog-fancysig'                => 'ಸರಳ ಸಹಿಗಳು (ಕೊಂಡಿ ಇಲ್ಲದಿರುವಂತೆ)',
'tog-externaleditor'          => 'ಬಾಹ್ಯ ಸಂಪಾದನೆ ಸಲಕರಣೆಯನ್ನು ಯಾವಾಗಲೂ ಉಪಯೋಗಿಸು (ಅನುಭವ ಹೊಂದಿರುವ ಬಳಕೆದಾರರಿಗೆ ಮಾತ್ರ, ನಿಮ್ಮ ಗಣಕಯಂತ್ರದಲ್ಲಿ ವಿಶೇಷ ಬದಲಾವಣೆಗಳು ಬೇಕಾಗುತ್ತದೆ)',
'tog-externaldiff'            => 'ಬಾಹ್ಯ ಮುನ್ನೋಟವನ್ನು ಯಾವಗಲೂ ಉಪಯೋಗಿಸು (ಅನುಭವ ಹೊಂದಿರುವ ಬಳಕೆದಾರರಿಗೆ ಮಾತ್ರ, ನಿಮ್ಮ ಗಣಕಯಂತ್ರದಲ್ಲಿ ವಿಶೇಷ ಬದಲಾವಣೆಗಳು ಬೇಕಾಗುತ್ತದೆ)',
'tog-uselivepreview'          => 'ನೇರ ಮುನ್ನೋಟವನ್ನು ಉಪಯೋಗಿಸು (JavaScript) (ಪ್ರಾಯೋಗಿಕ)',
'tog-forceeditsummary'        => 'ಸಂಪಾದನೆ ಸಾರಾಂಶವನ್ನು ಖಾಲಿ ಬಿಟ್ಟಲ್ಲಿ ನೆನಪಿಸು',
'tog-watchlisthideown'        => 'ವೀಕ್ಷಣಾ ಪಟ್ಟಿಯಲ್ಲಿ ನನ್ನ ಸಂಪಾದನೆಗಳನ್ನು ತೋರಿಸಬೇಡ',
'tog-watchlisthidebots'       => 'ವೀಕ್ಷಣಾಪಟ್ಟಿಯಲ್ಲಿ ಬಾಟ್ ಸಂಪಾದನೆಗಳನ್ನು ಅಡಗಿಸು',
'tog-watchlisthideminor'      => 'ಚಿಕ್ಕ ಬದಲಾವಣೆಗಳನ್ನು ವೀಕ್ಷಣಾ ಪಟ್ಟಿಯಿಂದ ಅಡಗಿಸು',
'tog-ccmeonemails'            => 'ಇತರರಿಗೆ ನಾನು ಕಳುಹಿಸುವ ಇ-ಅಂಚೆಯ ಪ್ರತಿಯನ್ನು ನನಗೂ ಕಳುಹಿಸು',
'tog-diffonly'                => 'ವ್ಯತ್ಯಾಸಗಳ ಕೆಳಗಿರುವ ಪುಟದ ವಿವರಗಳನ್ನು ತೋರಿಸಬೇಡ',
'tog-showhiddencats'          => 'ಅಡಗಿಸಲ್ಪಟ್ಟ ವರ್ಗಗಳನ್ನು ತೋರಿಸು',

'underline-always'  => 'ಯಾವಾಗಲೂ',
'underline-never'   => 'ಎಂದಿಗೂ ಇಲ್ಲ',
'underline-default' => 'ಬ್ರೌಸರ್‍ನ ಯಥಾಸ್ಥಿತಿ',

'skinpreview' => '(ಮುನ್ನೋಟ)',

# Dates
'sunday'        => 'ಭಾನುವಾರ',
'monday'        => 'ಸೋಮವಾರ',
'tuesday'       => 'ಮಂಗಳವಾರ',
'wednesday'     => 'ಬುಧವಾರ',
'thursday'      => 'ಗುರುವಾರ',
'friday'        => 'ಶುಕ್ರವಾರ',
'saturday'      => 'ಶನಿವಾರ',
'sun'           => 'ಭಾನು',
'mon'           => 'ಸೋಮ',
'tue'           => 'ಮಂಗಳ',
'wed'           => 'ಬುಧ',
'thu'           => 'ಗುರು',
'fri'           => 'ಶುಕ್ರ',
'sat'           => 'ಶನಿ',
'january'       => 'ಜನವರಿ',
'february'      => 'ಫೆಬ್ರುವರಿ',
'march'         => 'ಮಾರ್ಚ್',
'april'         => 'ಏಪ್ರಿಲ್',
'may_long'      => 'ಮೇ',
'june'          => 'ಜೂನ್',
'july'          => 'ಜುಲೈ',
'august'        => 'ಆಗಸ್ಟ್',
'september'     => 'ಸೆಪ್ಟೆಂಬರ್',
'october'       => 'ಅಕ್ಟೋಬರ್',
'november'      => 'ನವೆಂಬರ್',
'december'      => 'ಡಿಸೆಂಬರ್',
'january-gen'   => 'ಜನವರಿ',
'february-gen'  => 'ಫ್ರೆಬ್ರುವರಿ',
'march-gen'     => 'ಮಾರ್ಚ್',
'april-gen'     => 'ಏಪ್ರಿಲ್',
'may-gen'       => 'ಮೇ',
'june-gen'      => 'ಜೂನ್',
'july-gen'      => 'ಜುಲೈ',
'august-gen'    => 'ಆಗಸ್ಟ್',
'september-gen' => 'ಸೆಪ್ಟಂಬರ್',
'october-gen'   => 'ಅಕ್ಟೋಬರ್',
'november-gen'  => 'ನವೆಂಬರ್',
'december-gen'  => 'ಡಿಸೆಂಬರ್',
'jan'           => 'ಜನವರಿ',
'feb'           => 'ಫೆಬ್ರುವರಿ',
'mar'           => 'ಮಾರ್ಚ್',
'apr'           => 'ಏಪ್ರಿಲ್',
'may'           => 'ಮೇ',
'jun'           => 'ಜೂನ್',
'jul'           => 'ಜುಲೈ',
'aug'           => 'ಆಗಸ್ಟ್',
'sep'           => 'ಸೆಪ್ಟಂಬರ್',
'oct'           => 'ಅಕ್ಟೋಬರ್',
'nov'           => 'ನವೆಂಬರ್',
'dec'           => 'ಡಿಸೆಂಬರ್',

# Categories related messages
'pagecategories'                 => '{{PLURAL:$1|ವರ್ಗ|ವರ್ಗಗಳು}}',
'category_header'                => '"$1" ವರ್ಗದಲ್ಲಿರುವ ಲೇಖನಗಳು',
'subcategories'                  => 'ಉಪವರ್ಗಗಳು',
'category-media-header'          => '"$1" ವರ್ಗದಲ್ಲಿರುವ ಚಿತ್ರ/ಶಬ್ದ ಫೈಲುಗಳು',
'category-empty'                 => "''ಈ ವರ್ಗದಲ್ಲಿ ಸದ್ಯದಲ್ಲಿ ಯಾವುದೇ ಪುಟಗಳಾಗಲಿ ಅಥವ ಚಿತ್ರಗಳಾಗಲಿ ಇಲ್ಲ.''",
'hidden-categories'              => '{{PLURAL:$1|ಅಡಗಿಸಲ್ಪಟ್ಟ ವರ್ಗ|ಅಡಗಿಸಲ್ಪಟ್ಟ ವರ್ಗಗಳು}}',
'hidden-category-category'       => 'ಅಡಗಿಸಲ್ಪಟ್ಟಿರುವ ವರ್ಗಗಳು', # Name of the category where hidden categories will be listed
'category-subcat-count'          => '{{PLURAL:$2|ಈ ವರ್ಗದಲ್ಲಿ ಈ ಕೆಳಗಿನ ಉಪವರ್ಗ ಇದೆ.|ಈ ವರ್ಗದಲ್ಲಿ ಈ ಕೆಳಗಿನ {{PLURAL:$1|ಉಪವರ್ಗವನ್ನು|$1 ಉಪವರ್ಗಗಳನ್ನು}} ಸೇರಿಸಿ, ಒಟ್ಟು $2 ಇವೆ.}}',
'category-subcat-count-limited'  => 'ಈ ವರ್ಗದಲ್ಲಿ ಕೆಳಗೆ ತೋರಿಸಿರುವ {{PLURAL:$1|ಉಪವರ್ಗ|$1 ಉಪವರ್ಗಗಳು}} ಇವೆ.',
'category-article-count'         => '{{PLURAL:$2|ಈ ವರ್ಗದಲ್ಲಿ ಈ ಕೆಳಗಿನ ಪುಟವೊಂದು ಇದೆ.|ಈ ವರ್ಗದಲ್ಲಿ ಈ ಕೆಳಗಿನ {{PLURAL:$1|ಪುಟವನ್ನು|$1 ಪುಟಗಳನ್ನು}} ಸೇರಿಸಿ, ಒಟ್ಟು $2 ಪುಟಗಳು ಇವೆ.}}',
'category-article-count-limited' => 'ಪ್ರಸಕ್ತ ವರ್ಗದಲ್ಲಿ ಈ ಕೆಳಗಿನ {{PLURAL:$1|ಪುಟ ಇದೆ|$1 ಪುಟಗಳು ಇವೆ}}.',
'category-file-count'            => '{{PLURAL:$2|ಈ ವರ್ಗದಲ್ಲಿ ಈ ಕೆಳಗಿನ ಫೈಲು ಇದೆ.|ಈ ವರ್ಗದಲ್ಲಿ ಈ ಕೆಳಗಿನ {{PLURAL:$1|ಫೈಲನ್ನು|$1 ಫೈಲುಗಳನ್ನು}} ಸೇರಿಸಿ, ಒಟ್ಟು $2 ಇವೆ.}}',
'category-file-count-limited'    => 'ಪ್ರಸಕ್ತ ವರ್ಗದಲ್ಲಿ ಈ ಕೆಳಗಿನ {{PLURAL:$1|ಫೈಲು ಇದೆ|$1 ಫೈಲುಗಳು ಇವೆ}}.',
'listingcontinuesabbrev'         => 'ಮುಂದು.',

'mainpagetext'      => 'ವಿಕಿ ತಂತ್ರಾಂಶವನ್ನು ಯಶಸ್ವಿಯಾಗಿ ಅನುಸ್ಥಾಪಿಸಲಾಯಿತು.',
'mainpagedocfooter' => 'ವಿಕಿ ತಂತ್ರಾಂಶವನ್ನು ಬಳಸುವ ಬಗ್ಗೆ ಮಾಹಿತಿಗೆ [http://meta.wikimedia.org/wiki/Help:Contents ಬಳಕೆದಾರರಿಗೆ ನಿರ್ದೇಶನ ಪುಟ] ನೋಡಿ.

== ಪ್ರಾರಂಭಿಸುವುದು ==

* [http://www.mediawiki.org/wiki/Manual:Configuration_settings Configuration settings list]
* [http://www.mediawiki.org/wiki/Manual:FAQ ಮೀಡಿಯವಿಕಿ FAQ]
* [http://lists.wikimedia.org/mailman/listinfo/mediawiki-announce MediaWiki release mailing list]',

'about'          => 'ನಮ್ಮ ಬಗ್ಗೆ',
'article'        => 'ಲೇಖನ ಪುಟ',
'newwindow'      => '(ಹೊಸ ಕಿಟಕಿಯನ್ನು ತೆರೆಯುತ್ತದೆ)',
'cancel'         => 'ವಜಾ ಮಾಡಿ',
'qbfind'         => 'ಹುಡುಕು',
'qbbrowse'       => 'ವಿಹರಿಸು',
'qbedit'         => 'ಸಂಪಾದಿಸು',
'qbpageoptions'  => 'ಈ ಪುಟ',
'qbpageinfo'     => 'ಸನ್ನಿವೇಶ',
'qbmyoptions'    => 'ನನ್ನ ಪುಟಗಳು',
'qbspecialpages' => 'ವಿಶೇಷ ಪುಟಗಳು',
'moredotdotdot'  => 'ಇನ್ನಷ್ಟು...',
'mypage'         => 'ನನ್ನ ಪುಟ',
'mytalk'         => 'ನನ್ನ ಚರ್ಚೆ',
'anontalk'       => 'ಈ ಐ.ಪಿ ಗೆ ಮಾತನಾಡಿ',
'navigation'     => 'ಸಂಚರಣೆ',
'and'            => 'ಮತ್ತು',

# Metadata in edit box
'metadata_help' => 'ಮೂಲಮಾಹಿತಿ:',

'errorpagetitle'    => 'ದೋಷ',
'returnto'          => '$1 ಗೆ ಹಿಂತಿರುಗಿ.',
'tagline'           => '{{SITENAME}} ಇಂದ',
'help'              => 'ಸಹಾಯ',
'search'            => 'ಹುಡುಕು',
'searchbutton'      => 'ಹುಡುಕು',
'go'                => 'ಹೋಗು',
'searcharticle'     => 'ಹೋಗು',
'history'           => 'ಪುಟದ ಚರಿತ್ರೆ',
'history_short'     => 'ಇತಿಹಾಸ',
'updatedmarker'     => 'ನನ್ನ ಕೊನೆಯ ವೀಕ್ಷಣೆಯ ನಂತರ ಬದಲಾಗಿರುವವು',
'info_short'        => 'ಮಾಹಿತಿ',
'printableversion'  => 'ಪ್ರಿಂಟ್ ಆವೃತ್ತಿ',
'permalink'         => 'ಸ್ಥಿರ ಸಂಪರ್ಕ',
'print'             => 'ಮುದ್ರಿಸು',
'edit'              => 'ಸಂಪಾದಿಸಿ (edit this page)',
'create'            => 'ಸೃಷ್ಟಿಸು',
'editthispage'      => 'ಈ ಪುಟವನ್ನು ಬದಲಾಯಿಸಿ',
'create-this-page'  => 'ಈ ಪುಟವನ್ನು ಸೃಷ್ಟಿಸು',
'delete'            => 'ಅಳಿಸಿ',
'deletethispage'    => 'ಈ ಪುಟವನ್ನು ಅಳಿಸಿ',
'undelete_short'    => '{{PLURAL:$1|ಒಂದು ಸಂಪಾದನೆಯ|$1 ಸಂಪಾದನೆಗಳ}} ಅಳಿಸುವಿಕೆಯನ್ನು ತೊಡೆದುಹಾಕು',
'protect'           => 'ಸಂರಕ್ಷಿಸು',
'protect_change'    => 'ಸಂರಕ್ಷಣೆಯನ್ನು ಬದಲಾಯಿಸಿ',
'protectthispage'   => 'ಈ ಪುಟವನ್ನು ಸಂರಕ್ಷಿಸಿ',
'unprotect'         => 'ಸಂರಕ್ಷಣೆ ತೆಗೆ',
'unprotectthispage' => 'ಈ ಪುಟದ ಸಂರಕ್ಷಣೆಯನ್ನು ತಗೆಯಿರಿ',
'newpage'           => 'ಹೊಸ ಪುಟ',
'talkpage'          => 'ಈ ಪುಟದ ಬಗ್ಗೆ ಚರ್ಚೆ ಮಾಡಿ',
'talkpagelinktext'  => 'ಚರ್ಚೆ',
'specialpage'       => 'ವಿಶೇಷ ಪುಟ',
'personaltools'     => 'ವೈಯಕ್ತಿಕ ಉಪಕರಣಗಳು',
'postcomment'       => 'ನಿಮ್ಮ ಮಾತನ್ನು ಲಗತ್ತಿಸಿ',
'articlepage'       => 'ಲೇಖನ ಪುಟವನ್ನು ವೀಕ್ಷಿಸಿ',
'talk'              => 'ಚರ್ಚೆ',
'views'             => 'ನೋಟಗಳು',
'toolbox'           => 'ಉಪಕರಣ',
'userpage'          => 'ಸದಸ್ಯರ ಪುಟ ತೋರು',
'projectpage'       => 'ಯೋಜನೆಯ ಪುಟವನ್ನು ನೋಡು',
'imagepage'         => 'ಚಿತ್ರದ ಪುಟವನ್ನು ವೀಕ್ಷಿಸಿ',
'mediawikipage'     => 'ಸಂದೇಶ ಪುಟವನ್ನು ನೋಡು',
'templatepage'      => 'ಟೆಂಪ್ಲೇಟು ಪುಟವನ್ನು ವೀಕ್ಷಿಸಿ',
'viewhelppage'      => 'ಸಹಾಯ ಪುಟ ತೋರು',
'categorypage'      => 'ವರ್ಗ ಪುಟ ತೋರು',
'viewtalkpage'      => 'ಚರ್ಚೆಯನ್ನು ವೀಕ್ಷಿಸಿ',
'otherlanguages'    => 'ಇತರ ಭಾಷೆಗಳು',
'redirectedfrom'    => '($1 ಇಂದ ಪುನರ್ನಿರ್ದೇಶಿತ)',
'redirectpagesub'   => 'ಪುನರ್ನಿರ್ದೇಶನ ಪುಟ',
'lastmodifiedat'    => 'ಈ ಪುಟವನ್ನು ಕೊನೆಯಾಗಿ $2, $1 ರಂದು ಬದಲಾಯಿಸಲಾಗಿತ್ತು.', # $1 date, $2 time
'viewcount'         => 'ಈ ಪುಟವನ್ನು {{PLURAL:$1|೧ ಬಾರಿ|$1 ಬಾರಿ}} ವೀಕ್ಷಿಸಲಾಗಿದೆ.',
'protectedpage'     => 'ಸಂರಕ್ಷಿತ ಪುಟ',
'jumpto'            => 'ಇಲ್ಲಿಗೆ ಹೋಗು:',
'jumptonavigation'  => 'ಸಂಚರಣೆ',
'jumptosearch'      => 'ಹುಡುಕು',

# All link text and link target definitions of links into project namespace that get used by other message strings, with the exception of user group pages (see grouppage) and the disambiguation template definition (see disambiguations).
'aboutsite'            => 'ಕನ್ನಡ {{SITENAME}} ಬಗ್ಗೆ',
'aboutpage'            => 'Project:ನಮ್ಮ ಬಗ್ಗೆ',
'bugreports'           => 'ದೋಷ ವರದಿಗಳು',
'bugreportspage'       => 'Project:ದೋಷ ವರದಿಗಳು',
'copyright'            => 'ಇದು ಈ ಕಾಪಿರೈಟ್‌ನಲ್ಲಿ ಲಭ್ಯವಿದೆ $1.',
'copyrightpagename'    => '{{SITENAME}} ಕಾಪಿರೈಟ್',
'copyrightpage'        => '{{ns:project}}:ಕೃತಿಸ್ವಾಮ್ಯತೆಗಳು',
'currentevents'        => 'ಪ್ರಚಲಿತ',
'currentevents-url'    => 'Project:ಪ್ರಚಲಿತ',
'disclaimers'          => 'ಅಬಾಧ್ಯತೆಗಳು',
'disclaimerpage'       => 'Project:ಸಾಮಾನ್ಯ ಅಬಾಧ್ಯತೆಗಳು',
'edithelp'             => 'ಸಂಪಾದನೆಗೆ ಸಹಾಯ',
'edithelppage'         => 'Help:ಸಂಪಾದನೆ',
'faq'                  => 'ಸಾಮಾನ್ಯವಾಗಿ ಕೇಳಲಾಗುವ ಪ್ರಶ್ನೆಗಳು',
'faqpage'              => 'Project:ಸಾಮಾನ್ಯವಾಗಿ ಕೇಳಲಾಗುವ ಪ್ರಶ್ನೆಗಳು',
'helppage'             => 'Help:ಪರಿವಿಡಿ',
'mainpage'             => 'ಮುಖ್ಯ ಪುಟ',
'mainpage-description' => 'ಮುಖ್ಯ ಪುಟ',
'policy-url'           => 'Project:ನಿಯಮಾವಳಿಗಳು',
'portal'               => 'ಸಮುದಾಯ ಪುಟ',
'portal-url'           => 'Project:ಸಮುದಾಯ ಪುಟ',
'privacy'              => 'ಖಾಸಗಿ ಮಾಹಿತಿಯ ಬಗ್ಗೆ ನಿಲುವು',
'privacypage'          => 'Project:ಖಾಸಗಿಮಾಹಿತಿ ನಿಯಮ',

'badaccess'        => 'ಅನುಮತಿ ದೋಷ',
'badaccess-group0' => 'ನೀವು ಕೋರಿರುವ ಕ್ರಿಯೆಯನ್ನು ನಿರ್ವಹಿಲು ನಿಮಗೆ ಅನುಮತಿ ಇಲ್ಲ.',
'badaccess-group1' => 'ನೀವು ಕೋರಿರುವ ಕ್ರಿಯೆಯು ಕೇವಲ $1 ಗುಂಪಿಗೆ ಸೇರಿರುವ ಬಳಕೆದಾರರಿಗೆ ಸೀಮಿತ.',
'badaccess-group2' => 'ನೀವು ಕೋರಿರುವ ಕ್ರಿಯೆಯು ಕೇವಲ $1 ಗುಂಪುಗಳಲ್ಲಿ ಒಂದಕ್ಕೆ ಸೇರಿರುವ ಬಳಕೆದಾರರಿಗೆ ಸೀಮಿತ.',
'badaccess-groups' => 'ನೀವು ಕೋರಿರುವ ಕ್ರಿಯೆಯು ಕೇವಲ $1 ಗುಂಪುಗಳಲ್ಲಿ ಒಂದಕ್ಕೆ ಸೇರಿರುವ ಬಳಕೆದಾರರಿಗೆ ಸೀಮಿತ.',

'versionrequired'     => 'ಮೀಡಿಯವಿಕಿಯ $1 ನೇ ಅವೃತ್ತಿ ಬೇಕಾಗುತ್ತದೆ',
'versionrequiredtext' => 'ಈ ಪುಟವನ್ನು ವೀಕ್ಷಿಸಲು ಮೀಡಿಯವಿಕಿಯ $1 ನೇ ಆವೃತ್ತಿ ಬೇಕಾಗಿದೆ. [[Special:Version|ಆವೃತ್ತಿ]] ಪುಟವನ್ನು ನೋಡಿ.',

'ok'                      => 'ಸರಿ',
'retrievedfrom'           => '"$1" ಇಂದ ಪಡೆಯಲ್ಪಟ್ಟಿದೆ',
'youhavenewmessages'      => 'ನಿಮಗೆ $1 ಇವೆ ($2).',
'newmessageslink'         => 'ಹೊಸ ಸಂದೇಶಗಳು',
'newmessagesdifflink'     => 'ಕೊನೆಯ ಬದಲಾವಣೆ',
'youhavenewmessagesmulti' => '$1 ಅಲ್ಲಿ ನಿಮಗೆ ಹೊಸ ಸಂದೇಶಗಳಿವೆ',
'editsection'             => 'ಬದಲಾಯಿಸಿ',
'editold'                 => 'ಬದಲಾಯಿಸಿ',
'viewsourceold'           => 'ಮೂಲವನ್ನು ನೋಡು',
'editsectionhint'         => '$1 ವಿಭಾಗ ಸಂಪಾದಿಸಿ',
'toc'                     => 'ಪರಿವಿಡಿ',
'showtoc'                 => 'ತೋರಿಸು',
'hidetoc'                 => 'ಅಡಗಿಸು',
'thisisdeleted'           => '$1 ಅನ್ನು ನೋಡಬೇಕೆ ಅಥವ ಹಿಂದಿನಂತಾಗಿಸಬೇಕೆ?',
'viewdeleted'             => '$1 ಅನ್ನು ನೋಡಬೇಕೆ?',
'restorelink'             => '{{PLURAL:$1|೧ ಅಳಿಸಲ್ಪಟ್ಟ ಸಂಪಾದನೆ|$1 ಅಳಿಸಲ್ಪಟ್ಟ ಸಂಪಾದನೆಗಳು}}',
'feedlinks'               => 'ಫೀಡ್:',
'feed-invalid'            => 'ಸಿಂಧುವಲ್ಲದ ಪ್ರಕಾರದ ಫೀಡು.',
'feed-unavailable'        => '{{SITENAME}} ಅಲ್ಲಿ ಸಿಂಡಿಕೇಶನ್ ಫೀಡುಗಳು ಲಭ್ಯವಿಲ್ಲ',
'site-rss-feed'           => '$1 RSS ಫೀಡು',
'site-atom-feed'          => '$1 Atom ಫೀಡು',
'page-rss-feed'           => '"$1" RSS ಫೀಡು',
'page-atom-feed'          => '"$1" ಪುಟದ Atom ಫೀಡು',
'red-link-title'          => '$1 (ಇನ್ನೂ ಸೃಷ್ಟಿತವಾಗಿಲ್ಲ)',

# Short words for each namespace, by default used in the namespace tab in monobook
'nstab-main'      => 'ಲೇಖನ',
'nstab-user'      => 'ಸದಸ್ಯರ ಪುಟ',
'nstab-media'     => 'ಮೀಡಿಯ ಪುಟ',
'nstab-special'   => 'ವಿಶೇಷ',
'nstab-project'   => 'ಬಗ್ಗೆ',
'nstab-image'     => 'ಚಿತ್ರ',
'nstab-mediawiki' => 'ಸಂದೇಶ',
'nstab-template'  => 'ಟೆಂಪ್ಲೇಟು',
'nstab-help'      => 'ಸಹಾಯ',
'nstab-category'  => 'ವರ್ಗ',

# Main script and global functions
'nosuchaction'      => 'ಆ ರೀತಿಯ ಕೃತ್ಯ ಯಾವುದೂ ಇಲ್ಲ',
'nosuchactiontext'  => 'ಈ URL ನೇಮಿಸಿದ ಕೃತ್ಯವು ಈ ವಿಕಿಯಿಂದ ಗುರುತಿಸಬಲ್ಲದಲ್ಲ',
'nosuchspecialpage' => 'ಆ ಹೆಸರಿನ ವಿಶೇಷ ಪುಟ ಇಲ್ಲ',
'nospecialpagetext' => "<big>'''ನೀವು ಅಸ್ಥಿತ್ವದಲ್ಲಿರದ ವಿಶೇಷ ಪುಟವನ್ನು ಕೋರಿರುವಿರಿ.'''</big>

ಅಸ್ಥಿತ್ವದಲ್ಲಿರುವ ವಿಶೇಷ ಪುಟಗಳ ಪಟ್ಟಿ [[Special:SpecialPages|{{int:specialpages}}]] ಅಲ್ಲಿದೆ.",

# General errors
'error'                => 'ದೋಷ',
'databaseerror'        => 'ಡೇಟಬೇಸ್ ದೋಷ',
'dberrortext'          => 'ಡೇಟಾಬೇಸ್ ಕೋರಿಕೆಯ ರಚನೆಯಲ್ಲಿ ದೋಷವೊಂದು ಉಂಟಾಗಿದೆ.
ಇದು ತಂತ್ರಾಂಶದಲ್ಲಿನ ದೋಶದಿಂದ ಆಗಿರಬಹುದು.
ಕೊನೆಯದಾಗಿ ಪ್ರಯತ್ನಿಸಲಾದ ಡೇಟಾಬೇಸ್ ಕೋರಿಕೆಯು:
<blockquote><tt>$1</tt></blockquote>
ಉಂಟಾಗಿದ್ದು "<tt>$2</tt>" function ಒಳಗಿಂದ.
MySQL ಹಿಂದಿರುಗಿಸಿದ ದೋಷ "<tt>$3: $4</tt>".',
'dberrortextcl'        => 'ಡೇಟಾಬೇಸ್ ಪ್ರಶ್ನೆಯ ವಿನ್ಯಾಸದಲ್ಲಿ ದೋಷ ಉಂಟಾಗಿದೆ.
ಕೊನೆಯದಾಗಿ ಪ್ರಯತ್ನಿಸಲಾದ ಡೇಟಾಬೇಸ್ ಪ್ರಶ್ನೆಯು:
"$1"
ಇದು ಉಂಟಾಗಿದ್ದು "$2" function ಒಳಗಿಂದ.
MySQL ಹಿಂದಿರುಗಿಸಿದ ದೋಷ "$3: $4"',
'noconnect'            => 'ಕ್ಷಮಿಸಿ! ಸದ್ಯಕ್ಕೆ ವಿಕಿಯು ತಾಂತ್ರಿಕ ತೊಂದರೆಗಳನ್ನು ಅನುಭವಿಸುತ್ತಿದೆ ಮತ್ತು ಡೇಟಾಬೇಸ್ ಸರ್ವರ್ ಅನ್ನು ಸಂಪರ್ಕಿಸಲು ಸಾಧ್ಯವಾಗುತ್ತಿಲ್ಲ. <br />
$1',
'nodb'                 => 'ಡೇಟಬೇಸ್ $1 ಅನ್ನು ಆರಿಸಲಾಗಲಿಲ್ಲ',
'cachederror'          => 'ಕೆಳಗೆ ತೋರಿಸಲಾಗುತ್ತಿರುವುದು ನೀವು ಕೋರಿದ ಪುಟದ cache ಪ್ರತಿ. ಇದು ಪುಟದ ಹಾಲಿ ಸ್ಥಿತಿಯನ್ನು ಬಿಂಬಿಸುತ್ತಿಲ್ಲದಿರಬಹುದು.',
'laggedslavemode'      => 'ಎಚ್ಚರ: ಪುಟದಲ್ಲಿ ಇತ್ತೀಚಿನ ಬದಲಾವಣೆಗಳು ಕಾಣದಿರಬಹುದು.',
'readonly'             => 'ಡೇಟಬೇಸ್ ಮುಚ್ಚಲಾಗಿದೆ',
'enterlockreason'      => 'ಡೇಟಬೇಸ್ ಮುಚ್ಚುತಿರುವ ಕಾರಣವನ್ನು ಮತ್ತು ಮತ್ತೆ ಅದನ್ನು ತೆರೆಯುವ ಅಂದಾಜಿತ ಕಾಲವನ್ನು ತಿಳಿಸಿ',
'readonlytext'         => 'ಹೊಸ ಸೇರ್ಪಡೆಗಳನ್ನು ಮತ್ತು ಇತರ ಬದಲಾವಣೆಗಳನ್ನು ಮಾಡಲಾಗದಂತೆ ಡೇಟಾಬೇಸ್ ಅನ್ನು ಸದ್ಯಕ್ಕೆ ಮುಚ್ಚಲಾಗಿದೆ. ಇದು ಪ್ರಾಯಶಃ ನಿಯತಕಾಲಿಕೆ ದುರಸ್ತಿಗೆ ಇರಬಹುದು ಮತ್ತು ಅದರ ನಂತರ ಸಾಮಾನ್ಯ ಸ್ಥಿತಿಗೆ ಹಿಂದಿರುಗುತ್ತದೆ.

ಡೇಟಾಬೇಸ್ ಅನ್ನು ಮುಚ್ಚಿದ ನಿರ್ವಾಹಕ ನೀಡಿರುವ ಕಾರಣ: $1',
'missingarticle-diff'  => '(ವ್ಯತ್ಯಾಸ: $1, $2)',
'readonly_lag'         => 'ಅಡಿಯಲ್ಲಿರುವ ಡೇಟಾಬೇಸ್ ಸರ್ವರ್‍ಗಳು ಮೂಲ ಸರ್ವರ್ ಒಂದಿಗೆ ಸಮಾನತೆಗೆ ಬರುವವರೆಗೂ ಡೇಟಾಬೇಸ್ ಅನ್ನು ಯಾಂತ್ರಿಕವಾಗಿ ಮುಚ್ಚಲಾಗಿದೆ',
'internalerror'        => 'ಆಂತರಿಕ ದೋಷ',
'internalerror_info'   => 'ಆಂತರಿಕ ದೋಷ: $1',
'filecopyerror'        => '"$1" ಫೈಲ್ ಅನ್ನು "$2" ಗೆ ನಕಲಿಸಲಾಗಲಿಲ್ಲ.',
'filerenameerror'      => '"$1" ಫೈಲನ್ನು "$2" ಎಂದು ಮರುನಾಮಕರಣ ಮಾಡಲು ಆಗಲಿಲ್ಲ.',
'filedeleteerror'      => '"$1" ಫೈಲ್ ಅನ್ನು ಅಳಿಸಲಾಗಲಿಲ್ಲ.',
'directorycreateerror' => '"$1" ನಿದರ್ಶಕವನ್ನು ಸೃಷ್ಟಿಸಲಾಗಲಿಲ್ಲ.',
'filenotfound'         => '"$1" ಫೈಲನ್ನು ಹುಡುಕಲಾಗಲಿಲ್ಲ.',
'fileexistserror'      => 'ಫೈಲು "$1" ಅನ್ನು ಬರೆಯಲಾಗಲಿಲ್ಲ: ಫೈಲು ಆಗಲೆ ಇದೆ',
'unexpected'           => 'ಅನಿರೀಕ್ಷಿತ ಮೌಲ್ಯ: "$1"="$2".',
'formerror'            => 'ದೋಷ: ಅರ್ಜಿ ಕಳುಹಿಸಲಾಗಲಿಲ್ಲ',
'badarticleerror'      => 'ಈ ಪುಟದ ಮೇಲೆ ನೀವು ಪ್ರಯತ್ನಿಸಿದ ಕಾರ್ಯವನ್ನು ನಡೆಸಲಾಗದು.',
'cannotdelete'         => 'ಈ ಪುಟ ಅಥವಾ ಚಿತ್ರವನ್ನು ಅಳಿಸಲಾಗಲಿಲ್ಲ. (ಬೇರೊಬ್ಬ ಸದಸ್ಯರಿಂದ ಆಗಲೇ ಅಳಿಸಲ್ಪಟ್ಟಿರಬಹುದು.)',
'badtitle'             => 'ಸರಿಯಿಲ್ಲದ ಹೆಸರು',
'badtitletext'         => 'ನೀವು ಕೋರಿದ ಪುಟದ ಶೀರ್ಷಿಕೆ ಸಿಂಧುವಲ್ಲದ್ದು ಅಥವ ಖಾಲಿ ಅಥವ ಸರಿಯಾದ ಕೊಂಡಿಯಲ್ಲದ ಅಂತರ-ಭಾಷೆ/ಅಂತರ-ವಿಕಿ ಸಂಪರ್ಕವಾಗಿದೆ. 
ಅದರಲ್ಲಿ ಒಂದು ಅಥವ ಹೆಚ್ಚು ಶೀರ್ಷಿಕೆಯಲ್ಲಿ ಬಳಸಲು ನಿಷಿದ್ಧವಾಗಿರುವ ಅಕ್ಷರಗಳು ಇರಬಹುದು.',
'perfdisabled'         => 'ಕ್ಷಮಿಸಿ! ಈ ಲಕ್ಷಣವು ಡೇಟಾಬೇಸ್ ಅನ್ನು ಯಾರೂ ಉಪಯೋಗಿಸಲು ಆಗದಷ್ಟು ನಿಧಾನವಾಗಿಸುತ್ತ ಇರುವುದರಿಂದ ಇದನ್ನು ತಾತ್ಕಾಲಿಕವಾಗಿ ಸ್ಥಗಿತಗೊಳಿಸಲಾಗಿದೆ.',
'perfcached'           => 'ಈ ಕೆಳಗಿನ ಮಾಹಿತಿಯು cache ಇಂದ ಬಂದಿರುವುದು ಮತ್ತು ಪ್ರಸಕ್ತ ಸ್ಥಿತಿಯನ್ನು ಬಿಂಬಿಸದಿರಬಹುದು.',
'perfcachedts'         => 'ಈ ಕೆಳಗಿನ ಮಾಹಿತಿ cache ಆಗಿರುವುದು, ಮತ್ತು ಇದರ ಕೊನೆಯ ಬದಲಾವಣೆ ಆಗಿರುವುದು $1.',
'querypage-no-updates' => 'ಈ ಪುಟದ ಅಪ್ಡೇಟ್‍ಗಳನ್ನು ಪ್ರಸಕ್ತವಾಗಿ ನಿಲುಗಡೆ ಮಾಡಲಾಗಿದೆ. ಇಲ್ಲಿರುವ ಮಾಹಿತಿಯನ್ನು ಸದ್ಯಕ್ಕೆ ನವೀಕರಿಸಲಾಗುವುದಿಲ್ಲ.',
'viewsource'           => 'ಆಕರ ವೀಕ್ಷಿಸು',
'viewsourcefor'        => '$1 ಪುಟಕ್ಕೆ',
'protectedpagetext'    => 'ಈ ಪುಟವನ್ನು ಸಂಪಾದನೆ ಮಾಡಲಾಗದಂತೆ ಸಂರಕ್ಷಿಸಲಾಗಿದೆ.',
'viewsourcetext'       => 'ಈ ಪುಟದ ಮೂಲವನ್ನು ನೀವು ವೀಕ್ಷಿಸಬಹುದು ಮತ್ತು ನಕಲು ಮಾಡಬಹುದು:',
'protectedinterface'   => 'ಈ ಪುಟವು ತಂತ್ರಾಂಶವು ಉಪಯೋಗಿಸುವ ಪಠ್ಯವನ್ನು ದೊರಕಿಸುತ್ತದೆ. ದುರುಪಯೋಗ ಆಗದಿರಲೆಂದು ಇದನ್ನು ಸಂರಕ್ಷಿಸಲಾಗಿದೆ.',
'editinginterface'     => "'''ಎಚ್ಚರಿಕೆ:''' ನೀವು ತಂತ್ರಾಂಶವು ತಾಣವನ್ನು ಪ್ರದರ್ಶಿಸಲು ಉಪಯೋಗಿಸುವ ಪಠ್ಯವನ್ನು ಹೊಂದಿರುವ ಪುಟವೊಂದನ್ನು ಸಂಪಾದಿಸುತ್ತಿರುವಿರಿ.
ಈ ಪುಟದಲ್ಲಾಗುವ ಬದಲಾವಣೆಗಳು ಇತರ ಬಳಕೆದಾರರಿಗೆ ತಾಣವು ಕಾಣುವ ರೀತಿಯನ್ನು ಬದಲಾಯಿಸುತ್ತದೆ.
ಅನುವಾದಗಳನ್ನು ಮಾಡುತ್ತಿದ್ದರೆ, ದಯವಿಟ್ಟು ಮೀಡಿಯವಿಕಿಯ ಪ್ರಾಂತೀಯತೆ ಯೋಜನೆ [http://translatewiki.net/wiki/Main_Page?setlang=kn ಬೀಟವಿಕಿಯಲ್ಲಿ] ಮಾಡಿ.",
'cascadeprotected'     => 'ಈ ಪುಟವು ಸಂಪಾದನೆ ಮಾಡಲಾಗದಂತೆ ಸಂರಕ್ಷಿಸಲಾಗಿದೆ. ಇದಕ್ಕೆ ಕಾರಣ ಈ ಪುಟವನ್ನು ಈ ಕೆಳಗಿನ ತಡಸಲು-ಸಂರಕ್ಷಣೆ ಅಳವಡಿಸಲಾದ {{PLURAL:$1|ಪುಟದಲ್ಲಿ|ಪುಟಗಳಲ್ಲಿ}} ಉಪಯೋಗಿಸಲಾಗಿದೆ:
$2',
'namespaceprotected'   => "ನಿಮಗೆ '''$1''' ಪುಟಪ್ರಬೇಧಕ್ಕೆ ಸೇರಿರುವ ಪುಟಗಳನ್ನು ಸಂಪಾದಿಸುವ ಅನುಮತಿ ಇಲ್ಲ.",
'customcssjsprotected' => 'ಈ ಪುಟದಲ್ಲಿ ಬೇರೆ ಬಳಕೆದಾರರ ವಯಕ್ತಿಕ ನಿದರ್ಶನಗಳು ಇರುವುದರಿಂದ ನಿಮಗೆ ಈ ಪುಟವನ್ನು ಸಂಪಾದಿಸುವ ಅನುಮತಿ ಇಲ್ಲ.',
'ns-specialprotected'  => 'ವಿಶೇಷ ಪುಟಗಳನ್ನು ಸಂಪಾದಿಸಲು ಆಗುವುದಿಲ್ಲ.',
'titleprotected'       => "ಈ ಹೆಸರಿನ ಪುಟವನ್ನು ಸೃಷ್ಟಿಸಲಾಗದಂತೆ [[User:$1|$1]] ಅವರು ಸಂರಕ್ಷಿಸಿದ್ದಾರೆ.
ಸಂರಕ್ಷಣೆಗೆ ನೀಡಿರುವ ಕಾರಣ: ''$2''.",

# Login and logout pages
'logouttitle'                => 'ಸದಸ್ಯ ಲಾಗೌಟ್',
'logouttext'                 => '<strong>ನೀವು ಈಗ ಲಾಗ್ ಔಟ್ ಆಗಿರುವಿರಿ.</strong>

ನೀವು {{SITENAME}} ಅನ್ನು ಅನಾಮಧೇಯವಾಗಿ ಉಪಯೋಗಿಸಬಹುದು, ಅಥವ ಮತ್ತೆ ಇದೇ ಹೆಸರಿನಲ್ಲಿ ಅಥವ ಬೇರೆ ಹೆಸರಿನಲ್ಲಿ ಲಾಗ್ ಇನ್ ಆಗಬಹುದು.
ಗಮನಿಸಿ: ನಿಮ್ಮ ಬ್ರೌಸರ್‍ನ cache ಅನ್ನು ಅಳಿಸುವವರೆಗೂ ಕೆಲವು ಪುಟಗಳು ನೀವಿನ್ನೂ ಲಾಗ್ ಇನ್ ಆಗಿರುವಂತೆ ಪ್ರದರ್ಶಿತವಾಗಬಹುದು.',
'welcomecreation'            => '== ಸುಸ್ವಾಗತ, $1! ==
ನಿಮ್ಮ ಅಕೌಂಟನ್ನು ಸೃಷ್ಟಿಸಲಾಗಿದೆ. 
ನಿಮ್ಮ [[Special:Preferences|{{SITENAME}} ಪ್ರಾಶಸ್ತ್ಯಗಳನ್ನು]] ಬದಲಾಯಿಸುವುದನ್ನು ಮರೆಯಬೇಡಿ.',
'loginpagetitle'             => 'ಬಳಕೆದಾರ ಲಾಗ್ ಇನ್',
'yourname'                   => 'ನಿಮ್ಮ ಬಳಕೆಯ ಹೆಸರು',
'yourpassword'               => 'ನಿಮ್ಮ ಪ್ರವೇಶಪದ',
'yourpasswordagain'          => 'ಪ್ರವೇಶ ಪದ ಮತ್ತೊಮ್ಮೆ ಟೈಪ್ ಮಾಡಿ',
'remembermypassword'         => 'ಈ ಗಣಕಯಂತ್ರದಲ್ಲಿ ನನ್ನ ಪ್ರವೇಶ ಪದವನ್ನು ನೆನಪಿನಲ್ಲಿಟ್ಟುಕೊ',
'loginproblem'               => '<b>ನಿಮ್ಮ ಲಾಗಿನ್ ನಲ್ಲಿ ತೊ೦ದರೆಯಾಯಿತು.</b><br />ಮತ್ತೆ ಪ್ರಯತ್ನಿಸಿ!',
'login'                      => 'ಲಾಗ್ ಇನ್',
'nav-login-createaccount'    => 'ಲಾಗ್ ಇನ್ - log in',
'loginprompt'                => '{{SITENAME}} ತಾಣಕ್ಕೆ ಲಾಗ್ ಇನ್ ಆಗಲು ನಿಮ್ಮ ಗಣಕಯಂತ್ರದಲ್ಲಿ ಕುಕೀ (cookie) ಸೌಲಭ್ಯವಿರಬೇಕು.',
'userlogin'                  => 'ಲಾಗ್ ಇನ್ - log in',
'logout'                     => 'ಲಾಗ್ ಔಟ್',
'userlogout'                 => 'ಲಾಗ್ ಔಟ್',
'notloggedin'                => 'ಲಾಗಿನ್ ಆಗಿಲ್ಲ',
'nologin'                    => 'ಲಾಗ್ ಇನ್ ಇಲ್ಲವೇ? $1.',
'nologinlink'                => 'ಖಾತೆಯನ್ನು ಸೃಷ್ಟಿಸಿ',
'createaccount'              => 'ಹೊಸ ಖಾತೆ ತೆರೆಯಿರಿ',
'gotaccount'                 => 'ಈಗಾಗಲೇ ಖಾತೆಯಿದೆಯೇ? $1.',
'gotaccountlink'             => 'ಲಾಗ್ ಇನ್',
'createaccountmail'          => 'ಇ-ಅಂಚೆಯ ಮೂಲಕ',
'badretype'                  => 'ನೀವು ಕೊಟ್ಟ ಪ್ರವೇಶಪದಗಳು ಬೇರೆಬೇರೆಯಾಗಿವೆ.',
'userexists'                 => 'ನೀವು ನೀಡಿದ ಸದಸ್ಯರ ಹೆಸರು ಆಗಲೆ ಬಳಕೆಯಲ್ಲಿದೆ. ದಯವಿಟ್ಟು ಬೇರೊಂದು ಹೆಸರನ್ನು ಆಯ್ಕೆ ಮಾಡಿ.',
'youremail'                  => 'ಇ-ಅಂಚೆ:',
'username'                   => 'ಸದಸ್ಯತ್ವದ ಹೆಸರು:',
'uid'                        => 'ಬಳಕೆದಾರ ID:',
'prefs-memberingroups'       => 'ಈ {{PLURAL:$1|ಗುಂಪಿನ|ಗುಂಪುಗಳ}} ಸದಸ್ಯ:',
'yourrealname'               => 'ನಿಜ ಹೆಸರು:',
'yourlanguage'               => 'ಭಾಷೆ:',
'yournick'                   => 'ಸಹಿ:',
'badsiglength'               => 'ನಿಮ್ಮ ಅಡ್ಡಹೆಸರು ತುಂಬಾ ಉದ್ದವಾಗಿದೆ.
ಅದು $1 {{PLURAL:$1|ಅಕ್ಷರಕ್ಕಿಂತ|ಅಕ್ಷರಗಳಿಗಿಂತ}} ಕಡಿಮೆ ಇರಬೇಕು.',
'email'                      => 'ಇ-ಅಂಚೆ',
'prefs-help-realname'        => 'ನಿಜ ಹೆಸರು ನೀಡುವುದು ಐಚ್ಛಿಕ. ನೀವು ಅದನ್ನು ನೀಡಿದಲ್ಲಿ ನಿಮ್ಮ ಕಾಣಿಕೆಗಳಿಗೆ ನಿಮಗೆ ಮನ್ನಣೆ ನೀಡಲಾಗುವುದು.',
'loginerror'                 => 'ಲಾಗಿನ್ ದೋಷ',
'prefs-help-email'           => 'ಇ-ಅಂಚೆ ವಿಳಾಸ ಕಡ್ಡಾಯವಲ್ಲ, ಆದರೆ ನೀವು ಅದನ್ನು ನೀಡಿದರೆ ಬೇರೆಯವರು ನಿಮ್ಮನ್ನು ಇತರರಿಗೆ ತಿಳಿಯದಂತೆ ನಿಮ್ಮ ಸದಸ್ಯ ಪುಟ ಅಥವ ಚರ್ಚೆ ಪುಟದ ಮೂಲಕ ಸಂಪರ್ಕಿಸಬಹುದು.',
'prefs-help-email-required'  => 'ಇ-ಅಂಚೆ ವಿಳಾಸ ಬೇಕಾಗಿದೆ.',
'nocookiesnew'               => 'ನಿಮ್ಮ ಬಳಕೆದಾರ ಖಾತೆಯು ಸೃಷ್ಟಿತವಾಗಿದೆ, ಆದರೆ ನೀವು ಲಾಗ್ ಇನ್ ಆಗಿಲ್ಲ.
{{SITENAME}} ಲಾಗ್ ಇನ್ ಮಾಡಲು cookieಗಳನ್ನು ಉಪಯೋಗಿಸುತ್ತದೆ.
ನಿಮ್ಮ ಗಣಕಯಂತ್ರದಲ್ಲಿ cookieಗಳು ನಿಷಿದ್ಧವಾಗಿದೆ.
ದಯವಿಟ್ಟು ಈ ನಿಷೇಧವನ್ನು ತೆಗೆದು, ನಿಮ್ಮ ಬಳಕೆದಾರ ಹೆಸರು ಮತ್ತು ಪ್ರವೇಶಪದಗಳನ್ನು ಉಪಯೋಗಿಸಿ ಲಾಗ್ ಇನ್ ಆಗಿ.',
'nocookieslogin'             => '{{SITENAME}} ಬಳಕೆದಾರರನ್ನು ಲಾಗ್ ಇನ್ ಮಾಡಲು cookieಗಳನ್ನು ಉಪಯೋಗಿಸುತ್ತದೆ.
ನಿಮ್ಮ ಗಣಕಯಂತ್ರದಲ್ಲ್ cookieಗಳ ಉಪಯೋಗ ನಿಷಿದ್ಧವಾಗಿದೆ.
ದಯವಿಟ್ಟು ಆ ನಿಷೇಧವನ್ನು ತೆಗೆದು ಮತ್ತೊಮ್ಮೆ ಪ್ರಯತ್ನಿಸಿ.',
'noname'                     => 'ನೀವು ಸರಿಯಾದ ಬಳಕೆದಾರ ಹೆಸರನ್ನು ಸೂಚಿಸಿಲ್ಲ.',
'loginsuccesstitle'          => 'ಲಾಗಿನ್ ಯಶಸ್ವಿ',
'loginsuccess'               => 'ನೀವು ಈಗ "$1" ಆಗಿ ವಿಕಿಪೀಡಿಯಕ್ಕೆ ಲಾಗಿನ್ ಆಗಿದ್ದೀರಿ.',
'nosuchuser'                 => '"$1" ಹೆಸರಿನ ಯಾವ ಸದಸ್ಯರೂ ಇಲ್ಲ.
ಕಾಗುಣಿತವನ್ನು ಪರೀಕ್ಷಿಸಿ, ಅಥವಾ ಕೆಳಗಿನ ಫಾರ್ಮ್ ಅನ್ನು ಉಪಯೋಗಿಸಿ ಹೊಸ ಸದಸ್ಯತ್ವವನ್ನು ಸೃಷ್ಟಿಸಿ.',
'nosuchusershort'            => '"<nowiki>$1</nowiki>" ಹೆಸರಿನ ಸದಸ್ಯರು ಯಾರೂ ಇಲ್ಲ.
ಹೆಸರಲ್ಲಿ ಕಾಗುಣಿತ ತಪ್ಪಿದೆಯೆ ಎಂದು ಪರೀಕ್ಷಿಸಿ.',
'nouserspecified'            => 'ನೀವು ಒಂದು ಸದಸ್ಯತ್ವದ ಹೆಸರನ್ನು ಸೂಚಿಸಬೇಕು.',
'wrongpassword'              => 'ತಪ್ಪು ಪ್ರವೇಶ ಪದ ನೀಡಿರುವಿರಿ. ಮತ್ತೊಮ್ಮೆ ಪ್ರಯತ್ನಿಸಿ.',
'wrongpasswordempty'         => 'ಖಾಲಿ ಪ್ರವೇಶ ಪದವನ್ನು ನೀಡಿರುವಿರಿ. ಮತ್ತೊಮ್ಮೆ ಪ್ರಯತ್ನಿಸಿ.',
'passwordtooshort'           => 'ನಿಮ್ಮ ಪ್ರವೇಶಪದ ಸಿಂಧುವಲ್ಲ ಅಥವ ತುಂಬ ಚಿಕ್ಕದಾಗಿದೆ.
ಅದು ಕನಿಷ್ಟ {{PLURAL:$1|೧ ಅಕ್ಷರವನ್ನು|$1 ಅಕ್ಷರಗಳನ್ನು}} ಹೊಂದಿರಬೇಕು ಮತ್ತು ನಿಮ್ಮ ಬಳಕೆಯ ಹೆಸರಿಂದ ಭಿನ್ನವಾಗಿರಬೇಕು.',
'mailmypassword'             => 'ಹೊಸ ಪ್ರವೇಶ ಪದವನ್ನು ಇ-ಅಂಚೆ ಮೂಲಕ ಕಳುಹಿಸಿ',
'passwordremindertitle'      => '{{SITENAME}}ಗೆ ಹೊಸ ತಾತ್ಕಾಲಿಕ ಪ್ರವೇಶ ಪದ',
'passwordremindertext'       => '{{SITENAME}} ($4) ಸೈಟಿಗೆ ಹೊಸ ಪ್ರವೇಶಪದವನ್ನು $1 ಐ.ಪಿ. ವಿಳಾಸದಿಂದ ಕೋರಲಾಗಿದೆ.
ಸದಸ್ಯ "$2" ಅವರ ಹೊಸ ಪ್ರವೇಶಪದ ಈಗ "$3".
ನೀವು ಲಾಗ್ ಇನ್ ಆಗಿ ತಮ್ಮ ಪ್ರವೇಶಪದವನ್ನು ಬದಲಾಯಿಸಿ. 

ನೀವು ಈ ಕೋರಿಕೆಯನ್ನು ಮಾಡಿಲ್ಲದಿದ್ದರೆ, ಅಥವ ನೀವು ನಿಮ್ಮ ಹಳೆಯ ಪ್ರವೇಶಪದವನ್ನು ನೆನಪಿಸಿಕೊಂಡರೆ ಈ ಮಾಹಿತಿಗೆ ಗಮನ ನೀಡದೆ ನಿಮ್ಮ ಹಳೆಯ ಪ್ರವೇಶಪದವನ್ನು ಉಪಯೋಗಿಸಲು ಮುಂದುವರೆಸಿರಿ.',
'noemail'                    => 'ಸದಸ್ಯ "$1" ಅವರ ಹೆಸರಿನಲ್ಲಿ ಯಾವ ಇ-ಅಂಚೆ ವಿಳಾಸವೂ ದಾಖಲಾಗಿಲ್ಲ.',
'passwordsent'               => '"$1" ಅವರ ಹೆಸರಿನಲ್ಲಿ ನೋಂದಾಯಿತವಾದ ಇ-ಅಂಚೆ ವಿಳಾಸಕ್ಕೆ ಹೊಸ ಪ್ರವೇಶಪದವನ್ನು ಕಳುಹಿಸಲಾಗಿದೆ.
ಅದನ್ನು ಪಡೆದ ಮೇಲೆ ಮತ್ತೆ ಲಾಗಿನ್ ಆಗಿ.',
'blocked-mailpassword'       => 'ನಿಮ್ಮ IP ವಿಳಾಸವನ್ನು ಸಂಪಾದನೆ ಮಾಡದಂತೆ ತಡೆ ಹಿಡಿಯಲಾಗಿದೆ. ದುರ್ಬಳಕೆ ಆಗದಿರಲೆಂದು ಈ ವಿಳಾಸದಿಂದ ಪ್ರವೇಶಪದ ಹಿಂಪಡೆಯುವ ಸೌಲಭ್ಯವನ್ನು ತಡೆ ಹಿಡಿಯಲಾಗಿದೆ.',
'eauthentsent'               => 'ನೀವು ನೊಂದಾಯಿಸಿದ ಇ-ಅಂಚೆ ವಿಳಾಸಕ್ಕೆ ಧೃಡೀಕರಣ ಅಂಚೆಯನ್ನು ಕಳುಹಿಸಲಾಗಿದೆ. 
ಈ ವಿಳಾಸಕ್ಕೆ ಮುಂದೆ ಯಾವುದೇ ಇ-ಅಂಚೆ ಕಳುಹಿಸಲ್ಪಡುವ ಮುನ್ನ ನೀವು ಈ ಕಳುಹಿಸಿರುವ ಅಂಚೆಯಲ್ಲಿನ ನಿರ್ದೇಶನಗಳನ್ನು ಪಾಲಿಸಿ, ಈ ವಿಳಾಸವು ನಿಮ್ಮದೇ ಎಂದು ಧೃಡೀಕರಿಸಬೇಕು.',
'throttled-mailpassword'     => 'ಕಳೆದ $1 ಗಂಟೆಗಳ ಒಳಗೆ ಒಂದು ಪ್ರವೇಶ ಪದವನ್ನು ಕಳುಹಿಸಲಾಗಿದೆ.
ದುರುಪಯೋಗಗಳನ್ನು ತಡೆಗಟ್ಟಲು ಪ್ರವೇಶಪದಗಳನ್ನು ಪ್ರತಿ {{PLURAL:$1|ಗಂಟೆಗೆ|$1 ಗಂಟೆಗಳಲ್ಲಿ}} ಕೇವಲ ಒಂದು ಬಾರಿ ಕಳುಹಿಸಲಾಗುವುದು.',
'mailerror'                  => 'ಅಂಚೆ ಕಳುಹಿಸುವಲ್ಲಿ ದೋಷ: $1',
'acct_creation_throttle_hit' => 'ಕ್ಷಮಿಸಿ, ನೀವಾಗಲೇ $1 ಖಾತೆಗಳನ್ನು ತೆರೆದಿದ್ದೀರಿ. ಇನ್ನು ಖಾತೆಗಳನ್ನು ತೆರೆಯಲಾಗುವುದಿಲ್ಲ.',
'emailauthenticated'         => 'ನಿಮ್ಮ ಇ-ಅಂಚೆ ವಿಳಾಸ $1 ಅಂದು ಧೃಡೀಕೃತವಾಗಿದೆ.',
'emailnotauthenticated'      => 'ನಿಮ್ಮ ಇ-ಅಂಚೆ ವಿಳಾಸ ಇನ್ನೂ ಧೃಡೀಕೃತವಾಗಿಲ್ಲ. 
ಈ ಕೆಳಗಿನ ವೈಶಿಷ್ಟತೆಗಳಿಗೆ ಇ-ಅಂಚೆಯನ್ನು ನಿಮಗೆ ಕಳುಹಿಸಲು ಆಗುವುದಿಲ್ಲ.',
'noemailprefs'               => 'ಈ ಸೌಲಭ್ಯಗಳು ಕೆಲಸ ಮಾಡಬೇಕಾದರೆ ಒಂದು ಇ-ಅಂಚೆ ವಿಳಾಸವನ್ನು ನಮೂದಿಸಿ.',
'emailconfirmlink'           => 'ನಿಮ್ಮ ಇ-ಅಂಚೆ ವಿಳಾಸವನ್ನು ಧೃಡೀಕರಿಸಿ',
'invalidemailaddress'        => 'ಈ ಇ-ಅಂಚೆ ವಿಳಾಸವು ಸರಿಯಾದ ಪ್ರಕಾರದಲ್ಲಿ ಇಲ್ಲದಿರುವುದರಿಂದ ಇದನ್ನು ಸ್ವೀಕಾರ ಮಾಡಲಾಗುವುದಿಲ್ಲ.
ದಯವಿಟ್ಟು ಸರಿಯಾದ ಪ್ರಕಾರದ ವಿಳಾಸವನ್ನು ಸೇರಿಸಿ ಅಥವ ಆ ಚೌಕವನ್ನು ಖಾಲಿ ಬಿಡಿ.',
'accountcreated'             => 'ಖಾತೆಯನ್ನು ಸೃಷ್ಟಿಸಲಾಯಿತು',
'accountcreatedtext'         => '$1 ಅವರ ಬಳಕೆದಾರ ಖಾತೆ ಸೃಷ್ಟಿಸಲ್ಪಟ್ಟಿದೆ.',
'createaccount-title'        => '{{SITENAME}} ತಾಣಕ್ಕೆ ಬಳಕೆದಾರ ಖಾತೆ ಸೃಷ್ಟಿ ಮಾಡುವಿಕೆ',
'createaccount-text'         => 'ನಿಮ್ಮ ಇ-ಅಂಚೆ ವಿಳಾಸ ನೀಡಿ {{SITENAME}} ($4) ಅಲ್ಲಿ ಯಾರೊ "$2" ಹೆಸರಿನ ಖಾತೆಯೊಂದನ್ನು ತೆಗೆದಿದ್ದಾರೆ, ಮತ್ತು ಅದರ ಪ್ರವೇಶ ಪದ "$3".
ನೀವು ಲಾಗ್ ಇನ್ ಆಗಿ ನಿಮ್ಮ ಪ್ರವೇಶ ಪದವನ್ನು ಬದಲಾಯಿಸಬೇಕು.

ಆ ಖಾತೆ ತಪ್ಪಾಗಿ ತೆಗೆದಿದ್ದಲ್ಲಿ, ಈ ಸಂದೇಶವನ್ನು ನೀವು ಅಲಕ್ಷಿಸಬಹುದು.',
'loginlanguagelabel'         => 'ಭಾಷೆ: $1',

# Password reset dialog
'resetpass'               => 'ಖಾತೆಯ ಪ್ರವೇಶಪದವನ್ನು ಬದಲಾಯಿಸಿ',
'resetpass_announce'      => 'ನೀವು ತಾತ್ಕಾಲಿಕ ಇ-ಅಂಚೆ ಕೋಡ್ ಅನ್ನು ಉಪಯೋಗಿಸಿ ಲಾಗ್ ಇನ್ ಆಗಿರುವಿರಿ.
ಲಾಗ್ ಇನ್ ಪೂರ್ಣಗೊಳಿಸಲು ನೀವಿಲ್ಲ ಹೊಸ ಪ್ರವೇಶಪದ ನೀಡಬೇಕು:',
'resetpass_header'        => 'ನಿಮ್ಮ ಗುಪ್ತಪದ ರಿಸೆಟ್ ಮಾಡಿ',
'resetpass_submit'        => 'ಪ್ರವೇಶ ಪದವನ್ನು ನಿಶ್ಚಯಿಸಿ ಲಾಗ್ ಇನ್ ಆಗಿ',
'resetpass_success'       => 'ನಿಮ್ಮ ಪ್ರವೇಶ ಪದವನ್ನು ಯಶಸ್ವಿಯಾಗಿ ಬದಲಾಯಿಸಲಾಗಿದೆ. ಈಗ ನಿಮ್ಮನ್ನು ಲಾಗ್ ಇನ್ ಮಾಡಲಾಗುತ್ತಿದೆ...',
'resetpass_bad_temporary' => 'ಸರಿಯಾಗಿರದ ತಾತ್ಕಾಲಿಕ ಪ್ರವೇಶಪದ.
ನೀವಾಗಲೆ ಯಶಸ್ವಿಯಾಗಿ ನಿಮ್ಮ ಪ್ರವೇಶಪದವನ್ನು ಬದಲಾಯಿಸಿರಬಹುದು ಅಥವ ಹೊಸ ತಾತ್ಕಾಲಿಕ ಪ್ರವೇಶಪದ ಒಂದನ್ನು ಕೋರಿರಬಹುದು.',
'resetpass_forbidden'     => '{{SITENAME}} ಅಲ್ಲಿ ಪ್ರವೇಶಪದಗಳನ್ನು ಬದಲಾಯಿಸುವಂತಿಲ್ಲ.',

# Edit page toolbar
'bold_sample'     => 'ದಪ್ಪಗಿನ ಅಚ್ಚು',
'bold_tip'        => 'ದಪ್ಪಗಿನ ಅಚ್ಚು',
'italic_sample'   => 'ಓರೆ ಅಕ್ಷರಗಳು',
'italic_tip'      => 'ಓರೆ ಅಕ್ಷರಗಳು',
'link_sample'     => 'ಸಂಪರ್ಕದ ಹೆಸರು',
'link_tip'        => 'ಆಂತರಿಕ ಸಂಪರ್ಕ',
'extlink_sample'  => 'http://www.example.com ಸಂಪರ್ಕ ಶೀರ್ಷಿಕೆ',
'extlink_tip'     => 'ಬಾಹ್ಯ ಸಂಪರ್ಕ (http:// ಇಂದ ಶುರು ಮಾಡಿ)',
'headline_sample' => 'ಶಿರೋಲೇಖ',
'headline_tip'    => '೨ನೇ ಮಟ್ಟದ ತಲೆಬರಹ',
'math_sample'     => 'ಇಲ್ಲಿ ಸೂತ್ರವನ್ನು ಅಳವಡಿಸಿ',
'math_tip'        => 'ಗಣಿತ ಸೂತ್ರ (LaTeX)',
'nowiki_sample'   => 'ಈ ಜಾಗದಲ್ಲಿ ಬರೆಯಲ್ಪಟ್ಟದ್ದು ವಿಕೀಕರಣ ಆಗುವುದಿಲ್ಲ',
'nowiki_tip'      => 'ವಿಕಿ ರಚನಕ್ರಮವನ್ನು ಅಲಕ್ಷಿಸು',
'image_tip'       => 'ಅಳವಡಿಸಲ್ಪಟ್ಟ ಫೈಲು',
'media_tip'       => 'ಫೈಲಿಗೆ ಕೊಂಡಿ',
'sig_tip'         => 'ಸಮಯಮುದ್ರೆಯೊಂದಿಗೆ ನಿಮ್ಮ ಸಹಿ',
'hr_tip'          => 'ಅಡ್ಡ ಗೆರೆ (ಆದಷ್ಟು ಕಡಿಮೆ ಉಪಯೋಗಿಸಿ)',

# Edit pages
'summary'                   => 'ಸಾರಾಂಶ',
'subject'                   => 'ವಿಷಯ/ತಲೆಬರಹ',
'minoredit'                 => 'ಇದು ಚುಟುಕಾದ ಬದಲಾವಣೆ',
'watchthis'                 => 'ಈ ಪುಟವನ್ನು ವೀಕ್ಷಿಸಿ',
'savearticle'               => 'ಪುಟವನ್ನು ಉಳಿಸಿ',
'preview'                   => 'ಮುನ್ನೋಟ',
'showpreview'               => 'ಮುನ್ನೋಟ',
'showdiff'                  => 'ಬದಲಾವಣೆಗಳನ್ನು ತೋರಿಸು',
'anoneditwarning'           => "'''ಎಚ್ಚರ:''' ನೀವು ಲಾಗ್ ಇನ್ ಆಗಿಲ್ಲ. ನಿಮ್ಮ ಐಪಿ ವಿಳಾಸವು ಪುಟದ ಸಂಪಾದನೆಗಳ ಇತಿಹಾಸದಲ್ಲಿ ದಾಖಲಾಗುತ್ತದೆ.",
'missingsummary'            => "'''ಗಮನಿಸಿ:''' ನಿಮ್ಮ ಸಂಪಾದನೆಯ ಸಾರಾಂಶವನ್ನು ನೀವು ನೀಡಿಲ್ಲ. ಮತ್ತೊಮ್ಮೆ \"ಉಳಿಸು\" ಗುಂಡಿಯನ್ನು ಒತ್ತಿದರೆ, ಸಾರಾಂಶವಿಲ್ಲದೆಯೇ ನಿಮ್ಮ ಸಂಪಾದನೆಯನ್ನು ಉಳಿಸಲಾಗುವುದು.",
'missingcommentheader'      => "'''ಗಮನಿಸಿ:''' ಈ ವ್ಯಾಖ್ಯಾನದ ವಿಷಯ ಅಥವ ತಲೆಬರಹ ನೀವು ಸೂಚಿಸಿಲ್ಲ.
ಮತ್ತೊಮೆ ಉಳಿಸಿ ಅನ್ನು ಒತ್ತಿದರೆ ನಿಮ್ಮ ಸಂಪಾದನೆಯನ್ನು ಹಾಗೆಯೇ ಉಳಿಸಲಾಗುವುದು.",
'summary-preview'           => 'ತಾತ್ಪರ್ಯ ಮುನ್ನೋಟ',
'subject-preview'           => 'ವಿಷಯದ/ತಲೆಬರಹದ ಮುನ್ನೋಟ',
'blockedtitle'              => 'ಈ ಸದಸ್ಯರನ್ನು ತಡೆ ಹಿಡಿಯಲಾಗಿದೆ.',
'blockedtext'               => "<big>'''ನಿಮ್ಮ ಸದಸ್ಯತ್ವವನ್ನು ಅಥವ IP ವಿಳಾಸವನ್ನು ನಿರ್ಬಂಧಿಸಲಾಗಿದೆ.'''</big>

\$1 ಅವರು ಈ ನಿರ್ಬಂಧನೆಯನ್ನು ಒಡ್ಡಿರುವರು. 
ಇದಕ್ಕೆ ಅವರು ನೀಡಿರುವ ಕಾರಣ: ''\$2''.

* ನಿರ್ಬಂಧನೆಯ ಪ್ರಾರಂಭ: \$8
* ನಿರ್ಬಂಧನೆ ಮುಗಿಯುವುದು: \$6
* ನಿರ್ಬಂಧನೆ ಹೇರಲ್ಪಟ್ಟವರು: \$7

ನೀವು \$1 ಅಥವ ಇತರ [[{{MediaWiki:Grouppage-sysop}}|ನಿರ್ವಾಹಕರನ್ನು]] ಈ ನಿರ್ಬಂಧನೆಯನ್ನು ಚರ್ಚಿಸಲು ಸಂಪರ್ಕಿಸಬಹುದು.
ನೀವು 'ಸದಸ್ಯರಿಗೆ ಇ-ಅಂಚೆ ಕಳುಹಿಸಿ' ಸೌಲಭ್ಯವನ್ನು ಉಪಯೋಗಿಸಲು ನಿಮ್ಮ \"[[Special:Preferences|ನನ್ನ ಪ್ರಾಶಸ್ತ್ಯಗಳು]]\" ಪುಟದಲ್ಲಿ ನಿಮ್ಮ ಇ-ಅಂಚೆ ವಿಳಾಸವನ್ನು ನೀಡಿರಬೇಕು. ಈಗ ಆ ಪುಟವನ್ನು ನೀವು ಉಪಯೋಗಿಸದಂತೆ ನಿರ್ಬಂಧಿಸಲಾಗಿಲ್ಲ.
ನಿಮ್ಮ ಪ್ರಸಕ್ತ IP ವಿಳಾಸವು \$3, ಮತ್ತು ಈ ನಿರ್ಭಂಧನೆಯ ಕ್ರಮಸಂಖ್ಯೆ (ID) #\$5. 
ದಯವಿಟ್ಟು ನಿಮ್ಮ ಸಂಪರ್ಕಗಳಲ್ಲಿ ಈ ಸಂಖ್ಯೆಗಳನ್ನು ಸೇರಿಸಿ.",
'autoblockedtext'           => '$1 ಅವರಿಂದ ತಡೆಹಿಡಿಯಲ್ಪಟ್ಟ ಇನ್ನೊಬ್ಬ ಬಳಕೆದಾರ ನಿಮ್ಮ IP ವಿಳಾಸವನ್ನು ಉಪಯೋಗಿಸುತ್ತಿದ್ದರಿಂದ ಅ ವಿಳಾಸವನ್ನು ಯಾಂತ್ರಿಕವಾಗಿ ತಡೆಹಿಡಿಯಲ್ಪಟ್ಟಿದೆ.
ತಡೆಗೆ ನೀಡಿರುವ ಕಾರಣ:

:\'\'$2\'\'

* ತಡೆಯ ಪ್ರಾರಂಭ: $8
* ತಡೆಯ ಅಂತ್ಯ: $6

ನೀವು $1 ಅವರನ್ನು ಅಥವ ಇತರ [[{{MediaWiki:Grouppage-sysop}}|ನಿರ್ವಾಹಕರನ್ನು]] ಈ ತಡೆಯನ್ನು ಚರ್ಚಿಸಲು ಸಂಪರ್ಕಿಸಬಹುದು.
ಗಮನಿಸಿ: ನಿಮ್ಮ [[Special:Preferences|ಬಳಕೆದಾರ ಪ್ರಾಶಸ್ತ್ಯಗಳಲ್ಲಿ]] ಧೃಡೀಕೃತ ಇ-ಅಂಚೆ ವಿಳಾಸ ನೀಡಿದ್ದಲ್ಲಿ ಮತ್ತು ಅದನ್ನು ಉಪಯೋಗಿಸದಂತೆ ತಡೆಹಿಡಿಯಲ್ಪಟ್ಟಿಲ್ಲದಿದ್ದಲ್ಲಿ ಮಾತ್ರ "ಸದಸ್ಯರಿಗೆ ಇ-ಅಂಚೆ ಕಳಿಸಿ" ಸೌಲಭ್ಯವನ್ನು ಉಪಯೋಗಿಸಬಹುದು.

ಈ ತಡೆಯ ಸಂಖ್ಯೆ $5.
ನೀವು ಸಂಪರ್ಕಿಸಿದಾಗ ದಯವಿಟ್ಟು ಈ ಸಂಖ್ಯೆಯನ್ನು ಸೇರಿಸಿ.',
'blockednoreason'           => 'ಯಾವ ಕಾರಣವೂ ನೀಡಲಾಗಿಲ್ಲ',
'blockedoriginalsource'     => "'''$1''' ರ ಮೂಲವನ್ನು ಕೆಳಗೆ ತೋರಲಾಗಿದೆ:",
'blockededitsource'         => "'''$1''' ಪುಟದಲ್ಲಿನ '''ನಿಮ್ಮ ಸಂಪಾದನೆಗಳ''' ಪಠ್ಯವನ್ನು ಕೆಳಗೆ ತೋರಲಾಗಿದೆ:",
'whitelistedittitle'        => 'ಸಂಪಾದನೆ ಮಾಡಲು ಲಾಗ್ ಇನ್ ಆಗಿರಬೇಕು',
'whitelistedittext'         => 'ಪುಟಗಳನ್ನು ಸಂಪಾದಿಸಲು ನೀವು $1 ಆಗಬೇಕು.',
'confirmedittitle'          => 'ಸಂಪಾದನೆ ಮಾಡಲು ಇ-ಅಂಚೆ ಧೃಡೀಕರಣ ಬೇಕು',
'confirmedittext'           => 'ಪುಟಗಳನ್ನು ಸಂಪಾದಿಸುವ ಮುನ್ನ ನೀವು ನಿಮ್ಮ ಇ-ಅಂಚೆ ವಿಳಾಸವನ್ನು ಧೃಡೀಕರಿಸಬೇಕು.
ದಯವಿಟ್ಟು [[Special:Preferences|ಬಳಕೆದಾರ ಆಯ್ಕೆಗಳು]] ಪುಟದಲ್ಲಿ ತಮ್ಮ ಇ-ಅಂಚೆ ವಿಳಾಸವನ್ನು ನಮೂದಿಸಿ ಮತ್ತು ಧೃಡೀಕರಿಸಿ.',
'nosuchsectiontitle'        => 'ಆ ಹೆಸರಿನ ವಿಭಾಗ ಯಾವುದೂ ಇಲ್ಲ',
'nosuchsectiontext'         => 'ನೀವು ಅಸ್ಥಿತ್ವದಲ್ಲಿ ಇರದ ಒಂದು ವಿಭಾಗವನ್ನು ಸಂಪಾದಿಸಲು ಪ್ರಯತ್ನಿಸಿದಿರಿ.
ವಿಭಾಗ $1 ಇರದಿರುವುದರಿಂದ, ನಿಮ್ಮ ಸಂಪಾದನೆಯನ್ನು ಉಳಿಸಲು ಯಾವುದೇ ಜಾಗ ಇಲ್ಲ.',
'loginreqtitle'             => 'ಲಾಗಿನ್ ಆಗಬೇಕು',
'loginreqlink'              => 'ಲಾಗ್ ಇನ್',
'loginreqpagetext'          => 'ಇತರ ಪುಟಗಳನ್ನು ನೋಡಲು ನೀವು $1 ಆಗಬೇಕು.',
'accmailtitle'              => 'ಪ್ರವೇಶ ಪದ ಕಳುಹಿಸಲಾಯಿತು.',
'accmailtext'               => "'$1'ನ ಪ್ರವೇಶ ಪದ $2 ಗೆ ಕಳುಹಿಸಲಾಗಿದೆ",
'newarticle'                => '(ಹೊಸತು)',
'newarticletext'            => "ಇನ್ನೂ ಅಸ್ಥಿತ್ವದಲ್ಲಿ ಇರದ ಪುಟದ ಲಿಂಕ್ ಅನ್ನು ನೀವು ಒತ್ತಿರುವಿರಿ.
ಈ ಪುಟವನ್ನು ಸೃಷ್ಟಿಸಲು ಕೆಳಗಿನ ಚೌಕದಲ್ಲಿ ಬರೆಯಲು ಆರಂಭಿಸಿರಿ.
(ಹೆಚ್ಚು ಮಾಹಿತಿಗೆ [[{{MediaWiki:Helppage}}|ಸಹಾಯ ಪುಟ]] ನೋಡಿ).
ಈ ಪುಟಕ್ಕೆ ನೀವು ತಪ್ಪಾಗಿ ಬಂದಿದ್ದಲ್ಲಿ ನಿಮ್ಮ ಬ್ರೌಸರ್‍ನ '''back''' ಬಟನ್ ಅನ್ನು ಒತ್ತಿ.",
'anontalkpagetext'          => "----''ಇದು ಖಾತೆಯೊಂದನ್ನು ಹೊಂದಿರದ ಅನಾಮಧೇಯ ಬಳಕೆದಾರರೊಬ್ಬರ ಚರ್ಚೆ ಪುಟ. ಖಾತೆಯಿಲ್ಲದಿರುವುದರಿಂದ ಅವರನ್ನು ಗುರುತಿಸಲು ಅವರ IP ವಿಳಾಸವನ್ನು ಉಪಯೋಗಿಸುತ್ತಿದ್ದೇವೆ.
ಈ ರೀತಿಯ IP ವಿಳಾಸವು ಅನೇಕ ಬಳಕೆದಾರರಿಂದ ಉಪಯೋಗದಲ್ಲಿರಬಹುದು.
ನೀವು ಅನಾಮಧೇಯ ಬಳಕೆದಾರರಾಗಿದ್ದಲ್ಲಿ, ಹಾಗು ನಿಮಗೆ ಸಂಬಂಧವಿಲ್ಲದಂತ ಸಂದೇಶಗಳು ಬರುತ್ತಿವೆ ಎಂದು ಅನಿಸಿದರೆ, ಮುಂದೆ ಬೇರೆ ಅನಾಮಧೇಯ ಬಳಕೆದಾರರೊಂದಿಗೆ ತಪ್ಪಾಗಿ ಗುರುತಿಸಬಾರದೆಂದಿದ್ದರೆ ದಯವಿಟ್ಟು [[Special:UserLogin|ಸದಸ್ಯರಾಗಿ ಅಥವ ಲಾಗ್ ಇನ್ ಆಗಿ]].''",
'noarticletext'             => 'ಈ ಪುಟದಲ್ಲಿ ಸದ್ಯಕ್ಕೆ ಏನೂ ಇಲ್ಲ, ನೀವು ಇತರ ಪುಟಗಳಲ್ಲಿ [[Special:Search/{{PAGENAME}}|ಈ ಹೆಸರನ್ನು ಹುಡುಕಬಹುದು]] ಅಥವ [{{fullurl:{{FULLPAGENAME}}|action=edit}} ಈ ಪುಟವನ್ನು ಸಂಪಾದಿಸಬಹುದು].',
'userpage-userdoesnotexist' => 'ಬಳಕೆದಾರ ಖಾತೆ "$1" ದಾಖಲಾಗಿಲ್ಲ. ನೀವು ಇದೇ ಪುಟವನ್ನು ಸೃಷ್ಟಿ/ಸಂಪಾದನೆ ಮಾಡಬೇಕೆಂದಿರುವಿರಿ ಎಂದು ಖಾತ್ರಿ ಮಾಡಿಕೊಳ್ಳಿ.',
'usercssjsyoucanpreview'    => "<strong>ಗಮನಿಸಿ:</strong> ಉಳಿಸುವ ಮುನ್ನ 'ಮುನ್ನೋಟ' ಗುಂಡಿಯನ್ನು ಉಪಯೋಗಿಸಿ ನಿಮ್ಮ ಹೊಸ CSS/JS ಅನ್ನು ಪ್ರಯೋಗ ಮಾಡಿ.",
'usercsspreview'            => "'''ನೆನಪಿಡಿ: ನೀವು ಇಲ್ಲಿ ಕೇವಲ ನಿಮ್ಮ ಬಳಕೆದಾರ CSSನ ಮುನ್ನೋಟ ನೋಡುತ್ತಿರುವಿರಿ, ಅದನ್ನಿನ್ನೂ ಉಳಿಸಲಾಗಿಲ್ಲ!'''",
'userjspreview'             => "'''ಗಮನಿಸಿ: ನೀವು ನಿಮ್ಮ ಬಳಕೆದಾರ JavaScriptನ ಮುನ್ನೋಟ ನೋಡುತ್ತಿರುವಿರಿ ಅಥವ ಪ್ರಯೋಗ ಮಾಡುತ್ತಿರುವಿರಿ. ಅದನ್ನಿನ್ನೂ ಉಳಿಸಲಾಗಿಲ್ಲ!'''",
'note'                      => '<strong>ಸೂಚನೆ:</strong>',
'previewnote'               => '<strong>ಇದು ಕೇವಲ ಮುನ್ನೋಟ; ಪುಟವನ್ನು ಇನ್ನೂ ಉಳಿಸಲಾಗಿಲ್ಲ ಎಂಬುದನ್ನು ಮರೆಯದಿರಿ!</strong>',
'editing'                   => "'$1' ಲೇಖನ ಬದಲಾಯಿಸಲಾಗುತ್ತಿದೆ",
'editingsection'            => '$1 (ವಿಭಾಗ) ಅನ್ನು ಸಂಪಾದಿಸುತ್ತಿರುವಿರಿ',
'editingcomment'            => '$1 (ಚರ್ಚೆ) ಸಂಪಾದಿಸಲಾಗುತ್ತಿದೆ',
'explainconflict'           => "ನೀವು ಈ ಪುಟವನ್ನು ಸಂಪಾದಿಸಲು ಪ್ರಾರಂಭ ಮಾಡಿದ ಮೇಲೆ ಬೇರೊಬ್ಬರು ಯಾರೊ ಪುಟವನ್ನು ಬದಲಾಯಿಸಿದ್ದಾರೆ.
ಮೇಲಿನ ಬರವಣಗೆ ಚೌಕದಲ್ಲಿ ಪುಟದ ಪ್ರಸಕ್ತ ಸ್ವರೂಪ ತೋರಿಸಲಾಗಿದೆ.
ನೀವು ಮಾಡಿದ ಸಂಪಾದನೆಗಳನ್ನು ಕೆಳಗಿನ ಬರವಣಗೆ ಚೌಕದಲ್ಲಿ ತೋರಿಸಲಾಗಿದೆ.
ನಿಮ್ಮ ಸಂಪಾದನೆಗಳನ್ನು ಪ್ರಸಕ್ತ ಸ್ವರೂಪದ ಲೇಖನದಲ್ಲಿ ನೀವು ಸೇರಿಸಬೇಕಾಗುತ್ತದೆ.
ನೀವು ಪುಟವನ್ನು ಉಳಿಸಿದಾಗ '''ಮೇಲಿನ ಚೌಕದಲ್ಲಿ ನೀವು ಮಾಡುವ ಬದಲಾವಣೆಗಳನ್ನು ಮಾತ್ರ''' ಉಳಿಸಲಾಗುತ್ತದೆ.",
'yourtext'                  => 'ನಿಮ್ಮ ಸಂಪಾದನೆ',
'storedversion'             => 'ಈಗಾಗಲೇ ಉಳಿಸಲಾಗಿರುವ ಆವೃತ್ತಿ',
'editingold'                => '<strong>ಎಚ್ಚರಿಕೆ: ಈ ಪುಟದ ಹಳೆಯ ಆವೃತ್ತಿಯನ್ನು ಬದಲಾಯಿಸುತ್ತಿದ್ದೀರಿ. ಈ ಬದಲಾವಣೆಗಳನ್ನು ಉಳಿಸಿದಲ್ಲಿ, ನಂತರದ ಆವೃತ್ತಿಗಳೆಲ್ಲವೂ ಕಳೆದುಹೋಗುತ್ತವೆ.</strong>',
'yourdiff'                  => 'ವ್ಯತ್ಯಾಸಗಳು',
'copyrightwarning'          => 'ದಯವಿಟ್ಟು ಗಮನಿಸಿ: {{SITENAME}} ಸೈಟಿನಲ್ಲಿ ನಿಮ್ಮ ಎಲ್ಲಾ ಕಾಣಿಕೆಗಳನ್ನೂ $2 ಅಡಿಯಲ್ಲಿ ಬಿಡುಗಡೆ ಮಾಡಲಾಗುತ್ತದೆ (ಮಾಹಿತಿಗೆ $1 ನೋಡಿ). ನಿಮ್ಮ ಸಂಪಾದನೆಗಳನ್ನು ಬೇರೆಯವರು ನಿರ್ಧಾಕ್ಷಿಣ್ಯವಾಗಿ ಬದಲಾಯಿಸಿ ಬೇರೆ ಕಡೆಗಳಲ್ಲಿ ಹಂಚಬಹುದು. ಇದಕ್ಕೆ ನಿಮ್ಮ ಒಪ್ಪಿಗೆ ಇದ್ದರೆ ಮಾತ್ರ ಇಲ್ಲಿ ಸಂಪಾದನೆ ಮಾಡಿ.<br />
ಅಲ್ಲದೆ ನಿಮ್ಮ ಸಂಪಾದನೆಗಳನ್ನು ಸ್ವತಃ ರಚಿಸಿದ್ದು, ಅಥವ ಕೃತಿಸ್ವಾಮ್ಯತೆಯಿಂದ ಮುಕ್ತವಾಗಿರುವ ಕಡೆಯಿಂದ ಪಡೆದಿದ್ದು ಎಂದು ಪ್ರಮಾಣಿಸುತ್ತಿರುವಿರಿ.
<strong>ಕೃತಿಸ್ವಾಮ್ಯತೆಯ ಅಡಿಯಲ್ಲಿರುವ ರಚನೆಗಳನ್ನು ಅನುಮತಿ ಇಲ್ಲದೆ ಇಲ್ಲಿಗೆ ಹಾಕಬೇಡಿ!</strong>',
'copyrightwarning2'         => 'ದಯವಿಟ್ಟು ಗಮನಿಸಿ: {{SITENAME}} ಸೈಟಿನಲ್ಲಿ ನಿಮ್ಮ ಎಲ್ಲಾ ಸಂಪಾದನೆಗಳನ್ನು ಬೇರೆಯವರು ಬದಲಾಯಿಸಬಹುದು ಅಥವ ಅಳಿಸಬಹುದು.
ನಿಮ್ಮ ಬರಹಗಳನ್ನು ಬೇರೆಯವರು ನಿರ್ದಾಕ್ಷಿಣ್ಯವಾಗಿ ಸಂಪಾದನೆ ಮಾಡುವುದು ನಿಮಗೆ ಇಷ್ಟವಿಲ್ಲದಿದ್ದರೆ ಇಲ್ಲಿ ಸಂಪಾದನೆ ಮಾಡಬೇಡಿ.<br />
ಅಲ್ಲದೆ ನಿಮ್ಮ ಸಂಪಾದನೆಗಳನ್ನು ನೀವೇ ಸ್ವತಃ ರಚಿಸಿದ್ದು, ಅಥವ ಕೃತಿಸ್ವಾಮ್ಯತೆಯಿಂದ ಮುಕ್ತವಾಗಿರುವ ಕಡೆಯಿಂದ ಪಡೆದಿದ್ದು ಎಂದು ನೀವು ಪ್ರಮಾಣಿಸುತ್ತಿರುವಿರಿ (ಮಾಹಿತಿಗೆ $1 ನೋಡಿ).
<strong>ಕೃತಿಸ್ವಾಮ್ಯತೆಯ ಅಡಿಯಲ್ಲಿರುವ ರಚನೆಗಳನ್ನು ಅನುಮತಿ ಇಲ್ಲದೆ ಇಲ್ಲಿಗೆ ಹಾಕಬೇಡಿ!</strong>',
'longpagewarning'           => '<strong>ಎಚ್ಚರ: ಈ ಪುಟ $1 ಕಿಲೋಬೈಟ್‍ಗಳಷ್ಟು ಉದ್ದ ಇದೆ; ಕೆಲವು ಬ್ರೌಸರ್‍ಗಳಲ್ಲಿ ೩೨ ಕಿಲೋಬೈಟ್‍ಗಳಿಗಿಂತ ಉದ್ದದ ಪುಟಗಳನ್ನು ಸಂಪಾದನೆ ಮಾಡುವುದು ಕಷ್ಟ. ಪುಟವನ್ನು ಆದಷ್ಟು ವಿಭಾಗಗಳಾಗಿ ವಿಂಗಡಿಸಲು ಪ್ರಯತ್ನಿಸಿ.</strong>',
'longpageerror'             => '<strong>ದೋಷ: ನೀವು ಸಲ್ಲಿಸಿರುವ ಪಠ್ಯವು $1 ಕಿಲೊಬೈಟ್ ಉದ್ದದ್ದಾಗಿದೆ. ಇದು ನಿಯಮಿತವಾಗಿರುವ ಗರಿಷ್ಠವಾದ $2 ಕಿಲೊಬೈಟ್‍ಗಳಿಗಿಂತ ಹೆಚ್ಚಾಗಿದೆ.
ಆದ್ದರಿಂದ ಇದನ್ನು ಉಳಿಸಲು ಆಗುವುದಿಲ್ಲ.</strong>',
'readonlywarning'           => '<strong>ಗಮನಿಸಿ: ಡೇಟಾಬೇಸ್ ಅನ್ನು ದುರಸ್ತಿಗಾಗಿ ಮುಚ್ಚಲಾಗಿದೆ. ಹಾಗಾಗಿ ನಿಮ್ಮ ಸಂಪಾದನೆಗಳನ್ನು ಈಗ ಉಳಿಸಲು ಆಗುವುದಿಲ್ಲ.
ನಿಮ್ಮ ಸಂಪಾದನೆಯನ್ನು ನೀವು ಬೇರೆ ಕಡೆ ಉಳಿಸಿ ನಂತರ ಇಲ್ಲಿಗೆ cut-n-paste ಮಾಡಬಹುದು.</strong>',
'protectedpagewarning'      => '<strong>ಎಚ್ಚರಿಕೆ: ಈ ಪುಟವನ್ನು ಸಂರಕ್ಷಿಸಲಾಗಿದೆ. ಇದನ್ನು ಕೇವಲ ನಿರ್ವಾಹಕರು ಬದಲಾಯಿಸಬಹುದು.</strong>',
'semiprotectedpagewarning'  => "'''ಗಮನಿಸಿ:''' ಈ ಪುಟವನ್ನು ಕೇವಲ ನೊಂದಯಿತ ಸದಸ್ಯರು ಸಂಪಾದನೆ ಮಾಡಬರುವಂತೆ ಸಂರಕ್ಷಿಸಲಾಗಿದೆ.",
'cascadeprotectedwarning'   => "'''ಎಚ್ಚರಿಕೆ:''' ಈ ಪುಟವು ಕೆಳಗೆ ಪಟ್ಟಿ ಮಾಡಿರುವ ತಡಸಲು-ಸಂರಕ್ಷಣೆ ಹೊಂದಿರುವ {{PLURAL:$1|ಪುಟದಲ್ಲಿ|ಪುಟಗಳಲ್ಲಿ}} ಸೇರಿರುವುದರಿಂದ, ಇದನ್ನು ಕೇವಲ ನಿರ್ವಾಹಕರು ಸಂಪಾದಿಸಬಹುದಂತೆ ಸಂರಕ್ಷಿಸಲಾಗಿದೆ :",
'titleprotectedwarning'     => '<strong>ಎಚ್ಚರಿಕೆ:  ಈ ಪುಟವನ್ನು ಕೆಲ ಬಳಕೆದಾರರು ಮಾತ್ರ ಸೃಷ್ಟಿಸಬಹುದಂತೆ ಸಂರಕ್ಷಿಸಲಾಗಿದೆ. </strong>',
'templatesused'             => 'ಈ ಪುಟದಲ್ಲಿ ಉಪಯೋಗಿಸಲಾಗಿರುವ ಟೆಂಪ್ಲೇಟುಗಳು:',
'templatesusedpreview'      => 'ಈ ಮುನ್ನೋಟದಲ್ಲಿ ಉಪಯೋಗಿಸಲ್ಪಟ್ಟಿರುವ ಟೆಂಪ್ಲೇಟುಗಳು:',
'templatesusedsection'      => 'ಈ ವಿಭಾಗದಲ್ಲಿ ಉಪಯೋಗಿಸಲ್ಪಟ್ಟಿರುವ ಟೆಂಪ್ಲೇಟುಗಳು:',
'template-protected'        => '(ಸಂರಕ್ಷಿತ)',
'template-semiprotected'    => '(ಅರೆ-ಸಂರಕ್ಷಿತ)',
'hiddencategories'          => 'ಈ ಪುಟವು {{PLURAL:$1|೧ ಗುಪ್ತ ವರ್ಗಕ್ಕೆ|$1 ಗುಪ್ತ ವರ್ಗಗಳಿಗೆ}} ಸೇರಿದೆ:',
'nocreatetitle'             => 'ಪುಟವನ್ನು ಸೃಷ್ಟಿಸುವುದನ್ನು ನಿಯಮಿಸಲಾಗಿದೆ',
'nocreatetext'              => '{{SITENAME}} ಅಲ್ಲಿ ಹೊಸ ಪುಟಗಳನ್ನು ಸೃಷ್ಟಿಸಲು ಕೆಲವು ನಿಬಂಧನೆಗಳಿವೆ.
ನೀವು ಹಿಂದಿರುಗಿ ಆಗಲೇ ಅಸ್ಥಿತ್ವದಲ್ಲಿರುವ ಪುಟವೊಂದನ್ನು ಸಂಪಾದಿಸಿ, ಅಥವ [[Special:UserLogin|ಲಾಗ್ ಇನ್ ಆಗಿ ಅಥವ ಹೊಸ ಸದಸ್ಯರಾಗಿ]].',
'nocreate-loggedin'         => '{{SITENAME}} ಅಲ್ಲಿ ಹೊಸ ಪುಟಗಳನ್ನು ಸೃಷ್ಟಿಸಲು ನಿಮಗೆ ಅನುಮತಿ ಇಲ್ಲ.',
'permissionserrors'         => 'ಅನುಮತಿಗಳ ದೋಷಗಳು',
'permissionserrorstext'     => 'ನಿಮಗೆ ಅದನ್ನು ಮಾಡಲು ಅನುಮತಿ ಇಲ್ಲ, ಅದಕ್ಕೆ {{PLURAL:$1|ಕಾರಣ|ಕಾರಣಗಳು}}:',
'recreate-deleted-warn'     => "'''ಎಚ್ಚರಿಕೆ: ಹಿಂದೆ ಅಳಿಸಲಾದ ಪುಟವನ್ನು ನೀವು ಮತ್ತೆ ಸೃಷ್ಟಿಸುತ್ತಿರುವಿರಿ.'''

ಈ ಪುಟವನ್ನು ಸಂಪಾದಿಸಲು ಸಮರ್ಪಕ ಕಾರಣವಿದೆಯೆ ಎಂದು ದಯವಿಟ್ಟು ಆಲೋಚಿಸಿ.
ಪುಟದ ಅಳಿಸುವಿಕೆ ದಿನಚರಿಯನ್ನು ಈ ಕೆಳಗೆ ನೀಡಲಾಗಿದೆ:",

# Parser/template warnings
'expensive-parserfunction-warning'  => 'ಎಚ್ಚರಿಕೆ: ಈ ಪುಟದಲ್ಲಿ ಬಹುತೇಕ ದುಬಾರಿ parser function ಕರೆಗಳಿವೆ.

ಇವು $2ಕ್ಕಿಂತ ಕಡಿಮೆಯಿರಬೇಕು, ಈಗ ಇವು $1ರಷ್ಟು ಇವೆ.',
'expensive-parserfunction-category' => 'ಬಹುತೇಕ ದುಬಾರಿ parser function ಕರೆಗಳಿರುವ ಪುಟಗಳು',

# Account creation failure
'cantcreateaccounttitle' => 'ಖಾತೆಯನ್ನು ಸೃಷ್ಟಿಸಲಾಗುತ್ತಿಲ್ಲ',

# History pages
'viewpagelogs'        => 'ಈ ಪುಟಗಳ ದಾಖಲೆಗಳನ್ನು ವೀಕ್ಷಿಸಿ',
'nohistory'           => 'ಈ ಪುಟಕ್ಕೆ ಬದಲಾವಣೆಗಳ ಇತಿಹಾಸ ಇಲ್ಲ.',
'revnotfound'         => 'ಆವೃತ್ತಿ ಸಿಗಲಿಲ್ಲ',
'revnotfoundtext'     => 'ನೀವು ಕೋರಿದ ಪುಟದ ಹಳೆ ಆವೃತ್ತಿ ಸಿಗಲಿಲ್ಲ. ದಯವಿಟ್ಟು ಈ ಪುಟವನ್ನು ತಲುಪಲು ಉಪಯೋಗಿಸಿದ URL ಅನ್ನು ಒಮ್ಮೆ ಪರೀಕ್ಷಿಸಿ.',
'currentrev'          => 'ಈಗಿನ ತಿದ್ದುಪಡಿ',
'revisionasof'        => '$1 ದಿನದ ಆವೃತ್ತಿ',
'revision-info'       => '$2 ಅವರು $1 ಅಂದು ಸಂಪಾದನೆ ಮಾಡಿದ ನಂತರದ ಆವೃತ್ತಿ',
'previousrevision'    => '←ಹಿಂದಿನ ಪರಿಷ್ಕರಣೆ',
'nextrevision'        => 'ಮುಂದಿನ ಪರಿಷ್ಕರಣೆ',
'currentrevisionlink' => 'ಈಗಿನ ಪರಿಷ್ಕರಣೆ',
'cur'                 => 'ಸದ್ಯದ',
'next'                => 'ಮುಂದಿನದು',
'last'                => 'ಕೊನೆಯ',
'page_first'          => 'ಮೊದಲ',
'page_last'           => 'ಕೊನೆಯ',
'histlegend'          => 'ವ್ಯತ್ಯಾಸಗಳ ಆಯ್ಕೆ: ಹೋಲಿಕೆ ಮಾಡಬೇಕು ಎಂದಿರುವ ಎರಡು ಆವೃತ್ತಿಗಳ ಪಕ್ಕದಲ್ಲಿ ಇರುವ ಗುಂಡಿಗಳನ್ನು ಗುರುತು ಮಾಡಿ. ನಂತರ enter ಅನ್ನು ಒತ್ತಿ ಅಥವ ಪಟ್ಟಿಯ ಅಂತ್ಯದಲ್ಲಿರುವ ಗುಂಡಿಯನ್ನು ಒತ್ತಿ.<br />
ಆಖ್ಯಾನ: (ಈಗಿನ) = ಪ್ರಸಕ್ತ ಆವೃತ್ತಿಯೊಂದಿಗೆ ವ್ಯತ್ಯಾಸಗಳು,
(ಕೊನೆಯ) = ಹಿಂದಿನ ಆವೃತ್ತಿಯೊಂದಿಗೆ ವ್ಯತ್ಯಾಸಗಳು, ಚು = ಚುಟುಕಾದ ಬದಲಾವಣೆ.',
'deletedrev'          => '[ಅಳಿಸಲಾಗಿದೆ]',
'histfirst'           => 'ಅತ್ಯಂತ ಮುಂಚಿನ',
'histlast'            => 'ಅತ್ಯಂತ ಇತ್ತೀಚಿನ',
'historysize'         => '({{PLURAL:$1|೧ ಬೈಟ್|$1 ಬೈಟ್‍ಗಳು}})',
'historyempty'        => '(ಖಾಲಿ)',

# Revision feed
'history-feed-title'          => 'ಬದಲಾವಣೆಗಳ ಇತಿಹಾಸ',
'history-feed-description'    => 'ವಿಕಿಯ ಈ ಪುಟದ ಬದಲಾವಣೆಗಳ ಇತಿಹಾಸ',
'history-feed-item-nocomment' => '$1 $2 ಅಲ್ಲಿ', # user at time
'history-feed-empty'          => 'ನೀವು ಕೋರಿರುವ ಪುಟ ಅಸ್ಥಿತ್ವದಲ್ಲಿ ಇಲ್ಲ.
ಅದು ವಿಕಿಯಿಂದ ಅಳಿಸಲ್ಪಟ್ಟಿರಬಹುದು ಅಥವ ಪುನರ್ನಾಮಕಾರಣಗೊಂಡಿರಬಹುದು.
ಸಂಬಂಧಿತ ಹೊಸ ಪುಟಗಳನ್ನು [[Special:Search|ಹುಡುಕಲು ಪ್ರಯತ್ನಿಸಿ]].',

# Revision deletion
'rev-deleted-comment'       => '(ಕಮೆ೦ಟ್ ತೆಗೆದು ಹಾಕಲಾಗಿದೆ)',
'rev-deleted-user'          => '(ಬಳಕೆದಾರ ಹೆಸರು ತಗೆಯಲ್ಪಟ್ಟಿದೆ)',
'rev-deleted-event'         => '(ದಾಖಲೆ ಕ್ರಿಯೆ ತೆಗೆಯಲಾಯಿತು)',
'rev-delundel'              => 'ತೋರಿಸು/ಅಡಗಿಸು',
'revdelete-selected'        => '[[:$1]]ರ ಆಯ್ಕೆಯಾಗಿರುವ {{PLURAL:$2|ಆವೃತ್ತಿ|ಆವೃತ್ತಿಗಳು}}:',
'revdelete-text'            => 'ಅಳಿಸಲ್ಪಟ್ಟಿರುವ ಬದಲಾವಣೆಗಳು ಮತ್ತು ಘಟನೆಗಳು ಪುಟದ ಇತಿಹಾಸದಲ್ಲಿ ತೋರುತ್ತದೆ, ಆದರೆ ಅದರಲ್ಲಿನ ಮಾಹಿತಿಯು ಸಾರ್ವಜನಿಕರಿಗೆ ದೊರೆಯುವುದಿಲ್ಲ.

{{SITENAME}} ಅಲ್ಲಿನ ಇತರ ನಿರ್ವಾಹಕರು ಹೀಗೆ ಅಡಗಿಸಲ್ಪಟ್ಟ ಮಾಹಿತಿಯನ್ನು ಪಡೆಯಬಹುದು ಮತ್ತು ಅದರ ಅಳಿಸುವಿಕೆಯನ್ನು ಇದೇ ವ್ಯವಸ್ಥೆಯ ಪ್ರಕಾರ ರದ್ದುಮಾಡಬಹುದು. ಹೆಚ್ಚುವರಿ ನಿಬಂಧನಗಳಿದ್ದರೆ ಹಾಗೆ ಮಾಡಲಾಗುವುದಿಲ್ಲ.',
'revdelete-legend'          => 'ಕಾಣಿಸುವಿಕೆಯ ನಿಬಂಧನೆಗಳನ್ನು ನಿಶ್ಚಯಿಸು',
'revdelete-hide-text'       => 'ಬದಲಾವಣೆಯ ಪಠ್ಯವನ್ನು ಅಡಗಿಸು',
'revdelete-hide-name'       => 'ಕಾರ್ಯ ಮತ್ತು ಗುರಿಗಳನ್ನು ಅಡಗಿಸು',
'revdelete-hide-comment'    => 'ಸಂಪಾದನೆ ವಿವರಣೆ ಅಡಗಿಸು',
'revdelete-hide-user'       => 'ಸಂಪಾದಕರ ಬಳಕೆಯ ಹೆಸರು/IP ಅಡಗಿಸು',
'revdelete-hide-restricted' => 'ಈ ನಿಬಂಧನೆಗಳನ್ನು ನಿರ್ವಾಹಕರಿಗೂ ಅನ್ವಯಿಸು ಮತ್ತು ಈ interface ಗೆ ಬೀಗ ಹಾಕು',
'revdelete-suppress'        => 'ನಿರ್ವಾಹಕರಿಂದ ಮತ್ತಿತರರಿಂದ ಬಂದ ಮಾಹಿತಿಯನ್ನು ಅಡಗಿಸು',
'revdelete-hide-image'      => 'ಫೈಲಿನಲ್ಲಿರುವ ಮಾಹಿತಿಯನ್ನು ಅಡಗಿಸು',
'revdelete-unsuppress'      => 'ಪುನಃ ಸ್ಥಾಪಿಸಿದ ಬದಲಾವಣೆಗಳ ಮೇಲಿನ ನಿಬಂಧನೆಗಳನ್ನು ತೆಗೆ',
'revdelete-log'             => 'ದಾಖಲೆ ವಿವರಣೆ:',
'revdelete-submit'          => 'ಆಯ್ಕೆ ಮಾಡಿದ ಬದಲಾವಣೆಗೆ ಅನ್ವಯಿಸು',
'revdelete-logentry'        => '[[$1]] ರ ಸಂಪಾದನೆಯ ಕಾಣಿಸುವಿಕೆಯನ್ನು ಬದಲಾಯಿಸಲಾಯಿತು',
'revdel-restore'            => 'ಕಾಣಿಸುವಿಕೆಯನ್ನು ಬದಲಾಯಿಸು',
'pagehist'                  => 'ಪುಟದ ಇತಿಹಾಸ',
'deletedhist'               => 'ಅಳಿಸಲ್ಪಟ್ಟ ಇತಿಹಾಸ',
'revdelete-content'         => 'ಮಾಹಿತಿ',
'revdelete-summary'         => 'ಸಂಪಾದನೆಯ ತಾತ್ಪರ್ಯ',
'revdelete-uname'           => 'ಬಳಕೆಯ ಹೆಸರು',
'revdelete-restricted'      => 'ನಿರ್ವಾಹಕರಿಗೆ ನಿಬಂಧನೆಗಳನ್ನು ಅನ್ವಯಿಸಲಾಯಿತು',
'revdelete-unrestricted'    => 'ನಿರ್ವಾಹಕರ ನಿಬಂಧನೆಗಳನ್ನು ತೆಗೆಯಲಾಯಿತು',
'revdelete-hid'             => '$1 ಅಡಗಿಸಲಾಯಿತು',

# History merging
'mergehistory'                     => 'ಪುಟ ಇತಿಹಾಸಗಳನ್ನು ವಿಲೀನಗೊಳಿಸು',
'mergehistory-header'              => 'ಈ ಪುಟವು ಒಂದು ಮೂಲ ಪುಟದ ಬದಲಾವಣೆಗಳ ಇತಿಹಾಸವನ್ನು ಇನ್ನೊಂದು ಪುಟದೊಳಕ್ಕೆ ಸೇರ್ಪಡೆ ಮಾಡಲು ನಿಮಗೆ ಸಹಾಯ ಮಾಡುತ್ತದೆ.
ದಯವಿಟ್ಟು ಈ ಬದಲಾವಣೆಯು ಪುಟದ ಇತಿಹಾಸದ ಕ್ರಮಾಂಕವನ್ನು ಕಾಪಾಡುತ್ತದೆಂದು ಖಾತ್ರಿ ಮಾಡಿ.',
'mergehistory-box'                 => 'ಈ ಎರಡು ಪುಟಗಳ ಸಂಪಾದನೆಗಳನ್ನು ಸೇರ್ಪಡೆ ಮಾಡು:',
'mergehistory-from'                => 'ಮೂಲ ಪುಟ:',
'mergehistory-into'                => 'ಸೇರ್ಪಡೆ ಸ್ವೀಕರಿಸುವ ಪುಟ:',
'mergehistory-list'                => 'ಸೇರ್ಪಡೆ ಮಾಡಬಹುದಾದಂತ ಸಂಪಾದನೆಗಳ ಇತಿಹಾಸ',
'mergehistory-merge'               => '[[:$1]] ಪುಟದ ಈ ಕೆಳಗಿನ ಬದಲಾವಣೆಗಳನ್ನು [[:$2]] ಒಳಗೆ ಸೇರ್ಪಡೆ ಮಾಡಬಹುದು.
ರೇಡಿಯೊ ಗುಂಡಿಗಳ ಸಾಲನ್ನು ಉಪಯೋಗಿಸಿ ತೋರಿಸಲಾಗಿರುವ ಕಾಲದ ಮುಂಚಿನ ಬದಲಾವಣೆಗಳನ್ನು ಮಾತ್ರ ಸೇರ್ಪಡೆ ಮಾಡಿ.
ಗಮನಿಸಿ: ಸಂಚರಣೆ ಕೊಂಡಿಗಳನ್ನು ಉಪಯೋಗಿಸಿದಲ್ಲಿ ಈ ಸಾಲು ವಸ್ತುಸ್ಥಿತಿಗೆ ಹಿಂತಿರುಗುತ್ತದೆ.',
'mergehistory-go'                  => 'ವಿಲೀನಗೊಳಿಸಬಹುದಾದ ಸಂಪಾದನೆಗಳನ್ನು ತೋರಿಸು',
'mergehistory-submit'              => 'ಆವೃತ್ತಿಗಳನ್ನು ವಿಲೀನಗೊಳಿಸು',
'mergehistory-empty'               => 'ಯಾವ ಸಂಪಾದನೆಗಳನ್ನೂ ಸೇರ್ಪಡೆ ಮಾಡಲು ಆಗುವುದಿಲ್ಲ.',
'mergehistory-success'             => '[[:$1]] ಪುಟದ $3 {{PLURAL:$3|ಬದಲಾವಣೆಯನ್ನು|ಬದಲಾವಣೆಗಳನ್ನು}} [[:$2]] ಒಳಗೆ ಯಶಸ್ವಿಯಾಗಿ ಸೇರ್ಪಡೆ ಮಾಡಲಾಯಿತು.',
'mergehistory-fail'                => 'ಇತಿಹಾಸಗಳ ಸೇರ್ಪಡೆಯು ಸಾಧ್ಯವಾಗಲಿಲ್ಲ. ದಯವಿಟ್ಟು ಪುಟದ ಮತ್ತು ಕಾಲದ ಮಾಹಿತಿಗಳನ್ನು ಮತ್ತೊಮ್ಮೆ ಪರಿಶೀಲಿಸಿ.',
'mergehistory-no-source'           => 'ಮೂಲ ಪುಟ $1 ಅಸ್ಥಿತ್ವದಲ್ಲಿ ಇಲ್ಲ.',
'mergehistory-no-destination'      => 'ಸೇರ್ಪಡೆಯನ್ನು ಸ್ವೀಕರಿಸಬೇಕಾದ ಪುಟ $1 ಅಸ್ಥಿತ್ವದಲ್ಲಿಲ್ಲ.',
'mergehistory-invalid-source'      => 'ಮೂಲ ಪುಟ ಸರಿಯಾದ ಶೀರ್ಷಿಕೆಯಾಗಿರಬೇಕು.',
'mergehistory-invalid-destination' => 'ಸೇರ್ಪಡೆಯನ್ನು ಸ್ವೀಕರಿಸಬೇಕಾದ ಪುಟದ ಶೀರ್ಷಿಕೆ ಸರಿಯಾಗಿರಬೇಕು.',
'mergehistory-autocomment'         => '[[:$1]] ಅನ್ನು [[:$2]] ಪುಟದೊಳಗೆ ವಿಲೀನಗೊಳಿಸಲಾಯಿತು',
'mergehistory-comment'             => '[[:$1]] ಅನ್ನು [[:$2]] ಒಳಗೆ ಸೇರಿಸಲಾಗಿದೆ: $3',

# Merge log
'mergelog'           => 'ಸೇರ್ಪಡೆಯ ದಾಖಲೆ',
'pagemerge-logentry' => '[[$1]] ಅನ್ನು [[$2]] ಒಳಗೆ ಸೇರಿಸಲಾಗಿದೆ ($3 ರವರೆಗಿನ ಬದಲಾವಣೆಗಳು)',
'revertmerge'        => 'ಸೇರ್ಪಡೆಯನ್ನು ತೊಡೆದುಹಾಕು',
'mergelogpagetext'   => 'ಒಂದು ಪುಟದ ಇತಿಹಾಸವನ್ನು ಇನ್ನೊಂದರೊಳಗೆ ಇತ್ತೀಚೆಗೆ ಸೇರ್ಪಡೆ ಮಾಡಲಾಗಿರುವ ಪಟ್ಟಿ ಕೆಳಗಿದೆ.',

# Diffs
'history-title'           => '"$1" ಪುಟದ ಬದಲಾವಣೆಗಳ ಇತಿಹಾಸ',
'difference'              => '(ಆವೃತ್ತಿಗಳ ನಡುವಿನ ವ್ಯತ್ಯಾಸ)',
'lineno'                  => '$1 ನೇ ಸಾಲು:',
'compareselectedversions' => 'ಆಯ್ಕೆ ಮಾಡಿದ ಆವೃತ್ತಿಗಳನ್ನು ಹೊಂದಾಣಿಕೆ ಮಾಡಿ ನೋಡಿ',
'editundo'                => 'ಹಿಂದಿನಂತೆ',
'diff-multi'              => '(ಮಧ್ಯದಲ್ಲಿ ಆಗಿರುವ {{PLURAL:$1|೧ ಬದಲಾವಣೆಯನ್ನು|$1 ಬದಲಾವಣೆಗಳನ್ನು}} ತೋರಿಸಲಾಗಿಲ್ಲ.)',

# Search results
'searchresults'             => 'ಶೋಧನೆಯ ಫಲಿತಾಂಶಗಳು',
'searchresulttext'          => '{{SITENAME}} ಅಲ್ಲಿ ಹುಡುಕಾಟ ನಡೆಸುವ ಬಗ್ಗೆ ಹೆಚ್ಚಿನ ಮಾಹಿತಿಗೆ [[{{MediaWiki:Helppage}}|{{int:help}}]] ಅನ್ನು ನೋಡಿ.',
'searchsubtitle'            => "'''[[:$1]]''' ಅನ್ನು ಹುಡುಕಿದಿರಿ",
'searchsubtitleinvalid'     => "'''$1''' ಅನ್ನು ಹುಡುಕಿದಿರಿ",
'noexactmatch'              => "'''\"\$1\" ಹೆಸರಿನ ಯಾವ ಪುಟವೂ ಇಲ್ಲ.''' ನೀವು ಅದನ್ನು [[:\$1|ಸೃಷ್ಟಿಸಬಹುದು]].",
'noexactmatch-nocreate'     => "'''\"\$1\" ಹೆಸರಿನ ಯಾವ ಪುಟವೂ ಇಲ್ಲ.'''",
'toomanymatches'            => 'ತುಂಬಾ ಫಲಿತಾಂಶಗಳು ದೊರೆತಿವೆ, ದಯವಿಟ್ಟು ಬೇರೆ ಪದಪುಂಜವನ್ನು ಪ್ರಯತ್ನಿಸಿ',
'titlematches'              => 'ಹೊಂದಿಕೆಯಿರುವ ಪುಟ ಶೀರ್ಷಿಕೆಗಳು',
'notitlematches'            => 'ಯಾವ ಪುಟ ಶೀರ್ಷಿಕೆಗಳೂ ಹೊಂದಿಕೆ ತೋರಲಿಲ್ಲ',
'textmatches'               => 'ಪುಟದ ಪಠ್ಯದಲ್ಲಿನ ಹೋಲಿಕೆಗಳು',
'notextmatches'             => 'ಯಾವ ಪುಟದ ಪಠ್ಯದಲ್ಲೂ ಹೋಲಿಕೆಗಳಿಲ್ಲ',
'prevn'                     => 'ಹಿಂದಿನ $1',
'nextn'                     => 'ಮುಂದಿನ $1',
'viewprevnext'              => 'ವೀಕ್ಷಿಸು ($1) ($2) ($3)',
'search-result-size'        => '$1 ({{PLURAL:$2|೧ ಪದ|$2 ಪದಗಳು}})',
'search-result-score'       => 'ಸಂಬದ್ಧತೆ: $1%',
'search-redirect'           => '(ಪುನರ್ನಿರ್ದೇಶನ $1)',
'search-section'            => '(ವಿಭಾಗ $1)',
'search-interwiki-caption'  => 'ಬಳಗದ ಇತರ ಯೋಜನೆಗಳು',
'search-interwiki-default'  => '$1 ಫಲಿತಾಂಶಗಳು:',
'search-interwiki-more'     => '(ಹೆಚ್ಚು)',
'search-mwsuggest-enabled'  => 'ಸಲಹೆಗಳೊಂದಿಗೆ',
'search-mwsuggest-disabled' => 'ಯಾವುದೇ ಸಲಹೆಗಳಿಲ್ಲ',
'search-relatedarticle'     => 'ಸಂಬಂಧಿತ',
'mwsuggest-disable'         => 'AJAX ಸಲಹೆಗಳನ್ನು ತೋರದಿರು',
'searchrelated'             => 'ಸಂಬಂಧಿತ',
'searchall'                 => 'ಎಲ್ಲಾ',
'showingresults'            => "ಕೆಳಗೆ #'''$2''' ಇಂದ ಶುರುವಾದ {{PLURAL:$1|'''೧''' ಫಲಿತಾಂಶದ|'''$1''' ಫಲಿತಾಂಶಗಳ}}ವರೆಗೂ ತೋರಿಸಲಾಗುತ್ತಿದೆ.",
'showingresultsnum'         => "ಕೆಳಗೆ #'''$2''' ಇಂದ ಶುರುವಾಗಿ {{PLURAL:$3|'''೧''' ಫಲಿತಾಂಶವನ್ನು|'''$3''' ಫಲಿತಾಂಶಗಳನ್ನು}} ತೋರಿಸಲಾಗುತ್ತಿದೆ.",
'showingresultstotal'       => "ಒಟ್ಟು '''$3''' ಶೋಧನೆಯ ಫಲಿತಾಂಶಗಳಲ್ಲಿ '''$1 - $2''' ಕೆಳಗೆ ತೋರಿಸಲಾಗುತ್ತಿದೆ",
'powersearch'               => 'ಹುಡುಕಿ',
'powersearch-legend'        => 'ಮುಂದುವರೆದ ಹುಡುಕಾಟ',
'search-external'           => 'ಬಾಹ್ಯ ಹುಡುಕಾಟ',
'searchdisabled'            => '{{SITENAME}} ಹುಡುಕಾಟ ಸದ್ಯಕ್ಕೆ ಸ್ಥಗಿತವಾಗಿದೆ.
ಈ ವೇಳೆಯಲ್ಲಿ ನೀವು ಗೂಗಲ್ ಉಪಯೋಗಿಸಿ ಹುಡುಕಾಟ ನಡೆಸಬಹುದು.
ಗಮನಿಸಿ: ಅವರ {{SITENAME}} ಮಾಹಿತಿಯು ಪ್ರಸಕ್ತವಾಗಿಲ್ಲದಿರಬಹುದು.',

# Preferences page
'preferences'              => 'ಪ್ರಾಶಸ್ತ್ಯಗಳು',
'mypreferences'            => 'ನನ್ನ ಪ್ರಾಶಸ್ತ್ಯಗಳು',
'prefs-edits'              => 'ಸಂಪಾದನೆಗಳ ಸಂಖ್ಯೆ:',
'prefsnologin'             => 'ಲಾಗಿನ್ ಆಗಿಲ್ಲ',
'prefsnologintext'         => 'ಬಳಕೆದಾರ ಪ್ರಾಶಸ್ತ್ಯಗಳನ್ನು ಬದಲಾಯಿಸಲು ನೀವು [[Special:UserLogin|ಲಾಗ್ ಇನ್]] ಆಗಿರಬೇಕು.',
'prefsreset'               => 'ಮುಂಚೆ ಉಳಿಸಲ್ಪಟ್ಟ ಮಾಹಿತಿಯಿಂದ ಪ್ರಾಶಸ್ತ್ಯಗಳನ್ನು reset ಮಾಡಲಾಯಿತು.',
'qbsettings-none'          => 'ಯಾವುದೂ ಇಲ್ಲ',
'qbsettings-floatingleft'  => 'ಎಡಕ್ಕ ತೇಲುತ್ತಿದೆ',
'qbsettings-floatingright' => 'ಬಲಕ್ಕೆ ತೇಲುತ್ತಿದೆ',
'changepassword'           => 'ಪ್ರವೇಶ ಪದ ಬದಲಾಯಿಸಿ',
'skin'                     => 'ಚರ್ಮ',
'math'                     => 'ಗಣಿತ',
'dateformat'               => 'ದಿನಾಂಕದ ಫಾರ್ಮ್ಯಾಟ್',
'datedefault'              => 'ಯಾವುದೇ ಪ್ರಾಶಸ್ತ್ಯ ಇಲ್ಲ',
'datetime'                 => 'ದಿನ ಮತ್ತು ಸಮಯ',
'math_unknown_error'       => 'ತಿಳಿದಿಲ್ಲದ ದೋಷ',
'math_image_error'         => 'PNGಗೆ ಬದಲಾವಣೆ ವಿಫಲವಾಯಿತು;
latex, dvips, gs, ಸರಿಯಾಗಿ ಸ್ಥಾಪಿತವಾಗಿದೆಯೆ ಎಂದು ಖಾತ್ರಿ ಮಾಡಿ ಬದಲಾಯಿಸಿ',
'prefs-personal'           => 'ಬಳಕೆದಾರರ ಬಗ್ಗೆ',
'prefs-rc'                 => 'ಇತ್ತೀಚಿನ ಬದಲಾವಣೆಗಳು',
'prefs-watchlist'          => 'ವೀಕ್ಷಣಾಪಟ್ಟಿ',
'prefs-watchlist-days'     => 'ವೀಕ್ಷಣಾಪಟ್ಟಿಯಲ್ಲಿ ತೋರಿಸಲಾಗುವ ದಿನಗಳು:',
'prefs-watchlist-edits'    => 'ವಿಸ್ತೃತ ವೀಕ್ಷಣಾಪಟ್ಟಿಯಲ್ಲಿ ತೋರಿಸಬೇಕಾದ ಗರಿಷ್ಠ ಬದಲಾವಣೆಗಳು:',
'prefs-misc'               => 'ಇತರೆ',
'saveprefs'                => 'ಉಳಿಸಿ',
'resetprefs'               => 'ಉಳಿಸಿಲ್ಲದ ಬದಲಾವಣೆಗಳನ್ನು ಅಳಿಸು',
'oldpassword'              => 'ಹಳೆಯ ಪ್ರವೇಶ ಪದ',
'newpassword'              => 'ಹೊಸ ಪ್ರವೇಶ ಪದ',
'retypenew'                => 'ಹೊಸ ಪ್ರವೇಶಪದವನ್ನು ಮತ್ತೆ ಟೈಪಿಸು:',
'textboxsize'              => 'ಸಂಪಾದನೆ',
'rows'                     => 'ಸಾಲುಗಳು:',
'searchresultshead'        => 'ಹುಡುಕು',
'resultsperpage'           => 'ಪ್ರತಿ ಪುಟದಲ್ಲಿ ಫಲಿತಾಂಶಗಳು:',
'recentchangesdays'        => 'ಇತ್ತೀಚಿನ ಬದಲಾವಣೆಗಳಲ್ಲಿ ತೋರಿಸಬೇಕಾದ ದಿನಗಳು:',
'recentchangescount'       => 'ಇತ್ತೀಚೆಗಿನ ಬದಲಾವಣೆಗಳಲ್ಲಿರುವ ವಿಷಯಗಳ ಸಂಖ್ಯೆ',
'savedprefs'               => 'ನಿಮ್ಮ ಇಚ್ಛೆಗಳನ್ನು ಉಳಿಸಲಾಯಿತು.',
'timezonelegend'           => 'ಟೈಮ್ ಝೋನ್',
'timezonetext'             => '¹ನಿಮ್ಮ ಸ್ಥಳೀಯ ಸಮಯಕ್ಕೂ ಸರ್ವರ್‍ನ ಸಮಯಕ್ಕೂ (UTC) ಇರುವ ಗಂಟೆಗಳ ವ್ಯತ್ಯಾಸ.',
'localtime'                => 'ಸ್ಥಳೀಯ ಸಮಯ',
'timezoneoffset'           => 'ವ್ಯತ್ಯಾಸ¹',
'servertime'               => 'ಸರ್ವರ್ ಕಾಲ',
'guesstimezone'            => 'ಬ್ರೌಸರ್ ಇಂದ ತುಂಬು',
'allowemail'               => 'ಬೇರೆ ಸದಸ್ಯರಿಂದ ಈ-ಮೈಲ್‍ಗಳನ್ನು ಸ್ವೀಕರಿಸು',
'defaultns'                => 'ಮೂಲಸ್ಥಿತಿಯಲ್ಲಿ ಈ ಪುಟಪ್ರಬೇಧಗಳಲ್ಲಿ ಹುಡುಕಿ:',
'default'                  => 'ಮೂಲಸ್ಥಿತಿ',
'files'                    => 'ಫೈಲುಗಳು',

# User rights
'userrights'                  => 'ಬಳಕೆದಾರ ಹಕ್ಕುಗಳ ನಿರ್ವಹಣೆ', # Not used as normal message but as header for the special page itself
'userrights-lookup-user'      => 'ಬಳಕೆದಾರ ಗುಂಪುಗಳನ್ನು ನಿರ್ವಹಿಸು',
'userrights-user-editname'    => 'ಬಳಕೆದಾರ ಹೆಸರನ್ನು ಸೂಚಿಸಿ:',
'editusergroup'               => 'ಬಳಕೆದಾರ ಗುಂಪುಗಳನ್ನು ಸಂಪಾದಿಸು',
'editinguser'                 => "'''[[User:$1|$1]]''' ([[User talk:$1|{{int:talkpagelinktext}}]] | [[Special:Contributions/$1|{{int:contribslink}}]]) ಅವರ ಸದಸ್ಯತ್ವದ ಹಕ್ಕುಗಳನ್ನು ಬದಲಾಗಿಸಲಾಗುತ್ತಿದೆ.",
'userrights-editusergroup'    => 'ಬಳಕೆದಾರ ಗುಂಪುಗಳನ್ನು ಸಂಪಾದಿಸು',
'saveusergroups'              => 'ಬಳಕೆದಾರ ಗುಂಪುಗಳನ್ನು ಉಳಿಸು',
'userrights-groupsmember'     => 'ಗುಂಪುಗಳ ಸದಸ್ಯತ್ವ:',
'userrights-groups-help'      => 'ನೀವು ಈ ಬಳಕೆದಾರ ಸೇರಿರುವ ಗುಂಪುಗಳನ್ನು ಬದಲಾಯಿಸಬಹುದು.
* ಚೌಕವು ತುಂಬಿದ್ದರೆ ಬಳಕೆದಾರ ಆ ಗುಂಪಿನಲ್ಲಿದ್ದಾರೆ ಎಂದು ಅರ್ಥ.
* ಚೌಕವು ಖಾಲಿ ಇದ್ದರೆ ಬಳಕೆದಾರ ಆ ಗುಂಪಿಗೆ ಸೇರಿಲ್ಲ.
* <nowiki>*</nowiki> ಚಿಹ್ನೆಯು ನೀವು ಒಮ್ಮೆ ಆ ಗುಂಪಿಗೆ ಸೇರಿಸಿದಲ್ಲಿ ಅದರಿಂದ ಮತ್ತೆ ತೆಗೆಯಲು ಬರುವುದಿಲ್ಲ, ಅಥವ ಅದರ ತಿರುಗುಮುರುಗು ಎಂದರ್ಥ.',
'userrights-reason'           => 'ಬದಲಾವಣೆಗೆ ಕಾರಣ:',
'userrights-no-interwiki'     => 'ಇತರ ವಿಕಿಗಳಲ್ಲಿ ನಿಮಗೆ ಬಳಕೆದಾರ ಹಕ್ಕುಗಳನ್ನು ಬದಲಾಯಿಸುವ ಅನುಮತಿಯಿಲ್ಲ.',
'userrights-nodatabase'       => 'ಡೇಟಾಬೇಸ್ $1 ಅಸ್ಥಿತ್ವದಲ್ಲಿಲ್ಲ ಅಥವ ಸ್ಥಳೀಯವಾದುದಲ್ಲ.',
'userrights-nologin'          => 'ಬಳಕೆದಾರ ಹಕ್ಕುಗಳನ್ನು ನೇಮಿಸಲು ನೀವು ನಿರ್ವಾಹಕ ಖಾತೆಯೊಂದಕ್ಕೆ [[Special:UserLogin|ಲಾಗ್ ಇನ್]] ಆಗಬೇಕು.',
'userrights-notallowed'       => 'ಬಳಕೆದಾರ ಹಕ್ಕುಗಳನ್ನು ನೇಮಿಸಲು ನಿಮ್ಮ ಖಾತೆಗೆ ಅನುಮತಿಯಿಲ್ಲ.',
'userrights-changeable-col'   => 'ನೀವು ಬದಲಾಯಿಸಬಲ್ಲ ಗುಂಪುಗಳು',
'userrights-unchangeable-col' => 'ನೀವು ಬದಲಾಯಿಸಲಾಗದಂತಹ ಗುಂಪುಗಳು',

# Groups
'group'               => 'ಗುಂಪು:',
'group-user'          => 'ಬಳಕೆದಾರರು',
'group-autoconfirmed' => 'ಸ್ವಧೃಡೀಕೃತ ಬಳಕೆದಾರರು',
'group-bot'           => 'ಬಾಟ್‍ಗಳು',
'group-sysop'         => 'ನಿರ್ವಾಹಕರು',
'group-bureaucrat'    => 'ಮೇಲ್ವಿಚಾರಕರು',
'group-suppress'      => 'ನಿಗ ಇಡುವವರು',
'group-all'           => '(ಎಲ್ಲವೂ)',

'group-user-member'          => 'ಬಳಕೆದಾರ',
'group-autoconfirmed-member' => 'ಸ್ವಧೃಡೀಕೃತ ಬಳಕೆದಾರ',
'group-bot-member'           => 'ಬಾಟ್',
'group-sysop-member'         => 'ನಿರ್ವಾಹಕ',
'group-bureaucrat-member'    => 'ಮೇಲ್ವಿಚಾರಕ',
'group-suppress-member'      => 'ನಿಗ ಇಡುವವ',

'grouppage-user'          => '{{ns:project}}:ಬಳಕೆದಾರರು',
'grouppage-autoconfirmed' => '{{ns:project}}:ಸ್ವಧೃಡೀಕೃತ ಬಳಕೆದಾರರು',
'grouppage-bot'           => '{{ns:project}}:ಬಾಟ್‍ಗಳು',
'grouppage-sysop'         => '{{ns:project}}:ನಿರ್ವಾಹಕರು',
'grouppage-bureaucrat'    => '{{ns:project}}:ಮೇಲ್ವಿಚಾರಕರು',
'grouppage-suppress'      => '{{ns:project}}:ನಿಗ ಇಡುವವ',

# Rights
'right-edit'           => 'ಪುಟಗಳನ್ನು ಬದಲಾಯಿಸಿ',
'right-createpage'     => 'ಪುಟಗಳನ್ನು ಸೃಷ್ಟಿಸಿ (ಚರ್ಚಾ ಪುಟಗಳಲ್ಲಿ ಇಲ್ಲದ್ದು)',
'right-upload'         => 'ಕಡತಗಳನ್ನು ಅಪ್ಲೋಡ್ ಮಾಡು',
'right-delete'         => 'ಪುಟಗಳನ್ನು ಅಳಿಸಿ',
'right-bigdelete'      => 'ಜಾಸ್ತಿ ಇತಿಹಾಸವಿರುವ ಪುಟಗಳನ್ನು ಅಳಿಸಿ',
'right-deleterevision' => 'ಪುಟದ ಕೆಲ ಆವೃತ್ತಿಗಳನ್ನು ಅಳಿಸಿ ಹಾಗು ಉಳಿಸಿ',

# User rights log
'rightslog'      => 'ಸದಸ್ಯರ ಹಕ್ಕುಗಳ ದಾಖಲೆಗಳು',
'rightslogtext'  => 'ಇದು ಬಳಕೆದಾರ ಹಕ್ಕುಗಳ ಬದಲಾವಣೆಗಳ ದಾಖಲೆ.',
'rightslogentry' => '$1 ಅವರ ಗುಂಪು ಸದಸ್ಯತ್ವವನ್ನು $2 ಇಂದ $3 ಗೆ ಬದಲಾಯಿಸಲಾಯಿತು',
'rightsnone'     => '(ಯಾವೂ ಇಲ್ಲ)',

# Recent changes
'nchanges'                          => '$1 {{PLURAL:$1|ಬದಲಾವಣೆ|ಬದಲಾವಣೆಗಳು}}',
'recentchanges'                     => 'ಇತ್ತೀಚೆಗಿನ ಬದಲಾವಣೆಗಳು',
'recentchangestext'                 => 'ವಿಕಿಗೆ ಮಾಡಲ್ಪಟ್ಟ ಇತ್ತೀಚಿನ ಬದಲಾವಣೆಗಳನ್ನು ಈ ಪುಟದಲ್ಲಿ ನೀವು ಕಾಣಬಹುದು.',
'recentchanges-feed-description'    => 'ವಿಕಿಯಲ್ಲಿ ಆಗುವ ಹೊಸ ಬದಲಾವಣೆಗಳ ಮೇಲೆ ನಿಗ ಇಡಲು ಉಪಯೋಗವಾಗುವ ಫೀಡು.',
'rcnote'                            => "$5, $4 ವರೆಗೆ ಹಿಂದಿನ {{PLURAL:$2|ದಿನದಲ್ಲಿ|'''$2''' ದಿನಗಳಲ್ಲಿ}} ಮಾಡಲಾಗಿರುವ {{PLURAL:$1|'''೧''' ಬದಲಾವಣೆ|'''$1''' ಬದಲಾವಣೆಗಳು}} ಕೆಳಗಿವೆ.",
'rcnotefrom'                        => "'''$2''' ಇಂದ ಆಗಿರುವ ಬದಲಾವಣೆಗಳು ಕೆಳಗಿವೆ (ಕೊನೆಯ '''$1'''ರವರೆಗೆ ತೋರಿಸಲಾಗಿದೆ).",
'rclistfrom'                        => '$1 ಇಂದ ಪ್ರಾರಂಭಿಸಿ ಮಾಡಲಾದ ಬದಲಾವಣೆಗಳನ್ನು ನೋಡಿ',
'rcshowhideminor'                   => 'ಚಿಕ್ಕಪುಟ್ಟ ಬದಲಾವಣೆಗಳನ್ನು $1',
'rcshowhidebots'                    => 'ಬಾಟ್‍ಗಳನ್ನು $1',
'rcshowhideliu'                     => 'ಲಾಗ್-ಇನ್ ಆಗಿರುವ ಸದಸ್ಯರು $1',
'rcshowhideanons'                   => 'ಅನಾಮಧೇಯ ಸದಸ್ಯರು $1',
'rcshowhidepatr'                    => '$1 ಪರೀಕ್ಷಿತ ಸಂಪಾದನೆಗಳು',
'rcshowhidemine'                    => 'ನನ್ನ ಸಂಪಾದನೆಗಳನ್ನು $1',
'rclinks'                           => 'ಕೊನೆಯ $2 ದಿನಗಳಲ್ಲಿ ಮಾಡಿದ $1 ಕೊನೆಯ ಬದಲಾವಣೆಗಳನ್ನು ನೋಡಿ <br />$3',
'diff'                              => 'ವ್ಯತ್ಯಾಸ',
'hist'                              => 'ಇತಿಹಾಸ',
'hide'                              => 'ಅಡಗಿಸು',
'show'                              => 'ತೋರಿಸು',
'minoreditletter'                   => 'ಚು',
'newpageletter'                     => 'ಹೊ',
'boteditletter'                     => 'ಬಾ',
'number_of_watching_users_pageview' => '[$1 ವೀಕ್ಷಿಸುತ್ತಿರುವ {{PLURAL:$1|ಸದಸ್ಯ|ಸದಸ್ಯರು}}]',
'rc_categories'                     => 'ವರ್ಗಗಳಿಗೆ ಮಾತ್ರ ಸೀಮಿತವಾಗಿಸು ("|" ಇಂದ ಬೇರ್ಪಡಿಸು)',
'rc_categories_any'                 => 'ಯಾವುದೇ',
'newsectionsummary'                 => '/* $1 */ ಹೊಸ ವಿಭಾಗ',

# Recent changes linked
'recentchangeslinked'          => 'ಸಂಬಂಧಪಟ್ಟ ಬದಲಾವಣೆಗಳು',
'recentchangeslinked-title'    => '"$1" ಪುಟಕ್ಕೆ ಸಂಬಂಧಿಸಿದ ಬದಲಾವಣೆಗಳು',
'recentchangeslinked-noresult' => 'ಸೂಚಿತ ಕಾಲದಲ್ಲಿ ಸಂಪರ್ಕ ಹೊಂದಿರುವ ಪುಟಗಳಲ್ಲಿ ಯಾವ ಬದಲಾವಣೆಗಳೂ ಇಲ್ಲ.',
'recentchangeslinked-summary'  => "ಒಂದು ನಿರ್ದಿಷ್ಟ ಪುಟದಿಂದ (ಅಥವ ನಿರ್ದಿಷ್ಟ ವರ್ಗಕ್ಕೆ ಸೇರಿರುವ ಪುಟಗಳಿಂದ) ಸಂಪರ್ಕ ಹೊಂದಿರುವ ಪುಟಗಳಲ್ಲಿ ಇತ್ತೀಚೆಗೆ ಮಾಡಲಾಗಿರುವ ಬದಲಾವಣೆಗಳನ್ನು ಈ ಕೆಳಗೆ ಪಟ್ಟಿ ಮಾಡಲಾಗಿದೆ. 
[[Special:Watchlist|ನಿಮ್ಮ ವೀಕ್ಷಣಾಪಟ್ಟಿಯಲ್ಲಿ]] ಇರುವ ಪುಟಗಳು '''ದಪ್ಪ ಅಕ್ಷರ'''ಗಳಲ್ಲಿ ಇವೆ.",
'recentchangeslinked-page'     => 'ಪುಟದ ಹೆಸರು:',
'recentchangeslinked-to'       => 'ಇದರ ಬದಲಿಗೆ ನೇಮಿತ ಪುಟಕ್ಕೆ ಕೊಂಡಿಯನ್ನು ಹೊಂದಿರುವ ಪುಟಗಳಲ್ಲಿನ ಬದಲಾವಣೆಗಳನ್ನು ತೋರು',

# Upload
'upload'                      => 'ಫೈಲ್ ಅಪ್ಲೋಡ್',
'uploadbtn'                   => 'ಫೈಲನ್ನು ಅಪ್ಲೋಡ್ ಮಾಡಿ',
'reupload'                    => 'ಮರು-ಅಪ್ಲೋಡ್',
'reuploaddesc'                => 'ಅಪ್ಲೋಡ್ ಅನ್ನು ನಿಲ್ಲಿಸಿ ಮತ್ತೆ ಅಪ್ಲೋಡ್ ವಕ್ಕಣೆಗೆ ಹಿಂದಿರುಗಿ',
'uploadnologin'               => 'ಲಾಗಿನ್ ಆಗಿಲ್ಲ',
'uploadnologintext'           => 'ಫೈಲುಗಳನ್ನು ಅಪ್ಲೋಡ್ ಮಾಡಲು ನೀವು [[Special:UserLogin|ಲಾಗ್ ಇನ್]] ಆಗಬೇಕು.',
'uploaderror'                 => 'ಅಪ್ಲೋಡ್ ದೋಷ',
'upload-permitted'            => 'ಅಂಗೀಕೃತ ಫೈಲು ಮಾದರಿಗಳು: $1.',
'upload-preferred'            => 'ಐಚ್ಛಿಕ ಫೈಲು ಮಾದರಿಗಳು: $1.',
'upload-prohibited'           => 'ನಿರ್ಭಂಧಿತ ಫೈಲು ಮಾದರಿಗಳು: $1.',
'uploadlog'                   => 'ಅಪ್ಲೋಡ್ ದಾಖಲೆಗಳು',
'uploadlogpage'               => 'ಅಪ್ಲೋಡ್ ದಾಖಲೆ',
'uploadlogpagetext'           => 'ಇತ್ತೀಚೆಗೆ ಅಪ್ಲೋಡ್ ಆಗಿರುವ ಫೈಲುಗಳ ಪಟ್ಟಿ ಕೆಳಗಿದೆ.
ಈ ಫೈಲುಗಳನ್ನು ನೇರವಾಗಿ ವೀಕ್ಷಿಸಲು [[Special:NewImages|ಹೊಸ ಫೈಲುಗಳ ವೀಕ್ಷಣಾಲಯ]] ನೋಡಿ.',
'filename'                    => 'ಕಡತದ ಹೆಸರು',
'filedesc'                    => 'ಸಾರಾಂಶ',
'fileuploadsummary'           => 'ತಾತ್ಪರ್ಯ:',
'filestatus'                  => 'ಕೃತಿಸ್ವಾಮ್ಯತೆಯ ಸ್ಥಿತಿ:',
'filesource'                  => 'ಆಕರ:',
'uploadedfiles'               => 'ಅಪ್ಲೋಡ್ ಆಗಿರುವ ಫೈಲುಗಳು',
'ignorewarning'               => 'ಎಚ್ಚರಿಕೆಯನ್ನು ಕಡೆಗಣಿಸಿ ಫೈಲನ್ನು ಉಳಿಸಿ',
'ignorewarnings'              => 'ಎಲ್ಲಾ ಎಚ್ಚರಗಳನ್ನೂ ಕಡೆಗಣಿಸು',
'minlength1'                  => 'ಫೈಲಿನ ಹೆಸರುಗಳು ಕನಿಷ್ಠ ಒಂದು ಅಕ್ಷರವನ್ನು ಹೊಂದಿರಬೇಕು.',
'illegalfilename'             => 'ಫೈಲಿನ ಹೆಸರು "$1" ಶೀರ್ಷಿಕೆಗಳಲ್ಲಿ ನಿಷಿದ್ಧವಾಗಿರುವ ಚಿಹ್ನೆಗಳನ್ನು ಹೊಂದಿದೆ.
ದಯವಿಟ್ಟು ಫೈಲಿನ ಹೆಸರನ್ನು ಬದಲಾಯಿಸಿ ಮತ್ತೆ ಅಪ್ಲೋಡ್ ಮಾಡಲು ಪ್ರಯತ್ನಿಸಿ.',
'badfilename'                 => 'ಚಿತ್ರದ ಹೆಸರನ್ನು $1 ಗೆ ಬದಲಾಯಿಸಲಾಗಿದೆ.',
'filetype-badmime'            => '"$1" MIME ಪ್ರಕಾರದ ಫೈಲುಗಳನ್ನು ಅಪ್ಲೋಡ ಮಾಡುವಂತಿಲ್ಲ.',
'filetype-unwanted-type'      => "'''\".\$1\"''' ಒಂದು ಬೇಡವಾದ ಫೈಲಿನ ಮಾದರಿ. ಐಚ್ಛಿಕ ಫೈಲಿನ {{PLURAL:\$3|ಮಾದರಿಯು|ಮಾದರಿಗಳು}} \$2.",
'filetype-banned-type'        => "'''\".\$1\"''' ಒಂದು ನಿರ್ಬಂಧಿತ ಫೈಲಿನ ಮಾದರಿ.  ನಿರ್ಬಂಧನೆಯಿಲ್ಲದ ಫೈಲಿನ {{PLURAL:\$3|ಮಾದರಿಯು|ಮಾದರಿಗಳು}} \$2.",
'filetype-missing'            => 'ಈ ಫೈಲಿಗೆ ಉಪನಾಮ (extension ಉದಾ ".jpg") ಇಲ್ಲ.',
'large-file'                  => 'ಫೈಲುಗಳು $1 ಗಿಂತ ದೊಡ್ಡದಾಗಿರಬಾರದೆಂದು ಶಿಫಾರಿತ;
ಈ ಫೈಲಿನ ಗಾತ್ರ $2.',
'largefileserver'             => 'ಈ ಫೈಲು ಸರ್ವರ್‍ನಲ್ಲಿ ಸೇರ್ಪಡೆ ಮಾಡಲು ಶಿಫಾರಿತ ಗಾತ್ರಕ್ಕಿಂತ ದೊಡ್ಡದಾಗಿದೆ.',
'emptyfile'                   => 'ನೀವು ಅಪ್ಲೋಡ್ ಮಾಡಿದ ಫೈಲು ಖಾಲಿಯಿದ್ದಂತಿದೆ. ಫೈಲಿನ ಹೆಸರು ಬಹುಶಃ ತಪ್ಪಾಗಿರಬಹುದು.
ದಯವಿಟ್ಟು ನೀವು ಅಪ್ಲೋಡ್ ಮಾಡಬೇಕೆಂದಿರುವುದು ಇದೇ ಫೈಲು ಎಂದು ಖಾತ್ರಿ ಮಾಡಿ.',
'fileexists'                  => 'ಈ ಹೆಸರಿನ ಫೈಲ್ ಆಗಲೇ ಅಸ್ತಿತ್ವದಲ್ಲಿದೆ. ಈ ಹೆಸರನ್ನು ಬದಲಾಯಿಸಲು ಇಚ್ಛೆಯಿಲ್ಲದಿದ್ದರೆ, ದಯವಿಟ್ಟು <strong><tt>$1</tt></strong> ಅನ್ನು ಪರೀಕ್ಷಿಸಿ.',
'filepageexists'              => 'ಈ ಫೈಲಿಗೆ ಮಾಹಿತಿ ಪುಟವೊಂದು ಆಗಲೆ <strong><tt>$1</tt></strong> ಎಂಬಲ್ಲಿ ಇದೆ, ಆದರೆ ಈ ಹೆಸರಿನಲ್ಲಿ ಯಾವ ಫೈಲೂ ಅಸ್ಥಿತ್ವದಲ್ಲಿ ಇಲ್ಲ.
ನೀವು ನೀಡುವ ಸಾರಾಂಶವು ಮಾಹಿತಿ ಪುಟದಲ್ಲಿ ತೋರುವುದಿಲ್ಲ.
ಸಾರಾಂಶವು ಅಲ್ಲಿ ತೋರಲು ನೀವು ಆನಂತರ ಕೈಯಾರೆ ಸಂಪಾದನೆ ಮಾಡಬೇಕು',
'fileexists-extension'        => 'ಈ ಹೆಸರನ್ನು ಹೋಲುವಂತಹ ಫೈಲೊಂದು ಆಗಲೇ ಇದೆ:<br />
ಅಪ್ಲೋಡ್ ಮಾಡುತ್ತಿರುವ ಫೈಲಿನ ಹೆಸರು: <strong><tt>$1</tt></strong><br />
ಅಸ್ಥಿತ್ವದಲ್ಲಿರುವ ಫೈಲಿನ ಹೆಸರು: <strong><tt>$2</tt></strong><br />
ದಯವಿಟ್ಟು ಬೇರೆ ಹೆಸರೊಂದನ್ನು ಆಯ್ಕೆಮಾಡಿ.',
'fileexists-thumb'            => "<center>'''ಅಸ್ಥಿತ್ವದಲ್ಲಿರುವ ಫೈಲು'''</center>",
'fileexists-thumbnail-yes'    => 'ಈ ಫೈಲು ಯಾವುದೋ ಚಿತ್ರದ ಕಿರುನೋಟ <i>(thumbnail)</i> ಇರಬಹುದೆಂದು ಅನಿಸುತ್ತದೆ .
ದಯವಿಟ್ಟು <strong><tt>$1</tt></strong> ಫೈಲನ್ನೊಮ್ಮೆ ಪರೀಕ್ಷಿಸಿ.<br />
ನೀವು ಪರೀಕ್ಷಿಸಿದ ಫೈಲು ಆ ಚಿತ್ರದ ಮೂಲ ಗಾತ್ರದ್ದಾಗಿದ್ದಲ್ಲಿ ಈ ಕಿರುನೋಟವನ್ನು ಅಪ್ಲೋಡ್ ಮಾಡುವ ಅಗತ್ಯವಿಲ್ಲ.',
'file-thumbnail-no'           => 'ಈ ಫೈಲಿನ ಹೆಸರು <strong><tt>$1</tt></strong> ಇಂದ ಶುರುವಾಗುತ್ತಿದೆ.
ಈ ಫೈಲು ಯಾವುದೋ ಚಿತ್ರದ ಕಿರುನೋಟ <i>(thumbnail)</i> ಇರಬಹುದೆಂದು ಅನಿಸುತ್ತದೆ .
ಮೂಲ ಗಾತ್ರದ ಆ ಚಿತ್ರ ನಿಮ್ಮ ಬಳಿಯಿದ್ದಲ್ಲಿ ಅದನ್ನು ಅಪ್ಲೋಡ್ ಮಾಡಿ, ಇಲ್ಲ ದಯವಿಟ್ಟು ಫೈಲಿನ ಹೆಸರನ್ನು ಬದಲಾಯಿಸಿ.',
'fileexists-forbidden'        => 'ಆ ಹೆಸರಿನಲ್ಲಿ ಫೈಲೊಂದು ಆಗಲೆ ಇದೆ;
ದಯವಿಟ್ಟು ಹಿಂದಕ್ಕೆ ಹೋಗಿ ಈ ಫೈಲನ್ನು ಹೊಸ ಹೆಸರಿನಲ್ಲಿ ಅಪ್ಲೋಡ್ ಮಾಡಿ. [[Image:$1|thumb|center|$1]]',
'fileexists-shared-forbidden' => 'ಆ ಹೆಸರಿನಲ್ಲಿ ಫೈಲೊಂದು ಸಾಮೂಹಿಕ ಫೈಲಿನ ಆಗರದಲ್ಲಿ ಆಗಲೆ ಇದೆ;
ದಯವಿಟ್ಟು ಹಿಂದಕ್ಕೆ ಹೋಗಿ ಈ ಫೈಲನ್ನು ಹೊಸ ಹೆಸರಿನಲ್ಲಿ ಅಪ್ಲೋಡ್ ಮಾಡಿ. [[Image:$1|thumb|center|$1]]',
'successfulupload'            => 'ಯಶಸ್ವಿ ಅಪ್ಲೋಡ್',
'uploadwarning'               => 'ಅಪ್ಲೋಡ್ ಎಚ್ಚರಿಕೆ',
'savefile'                    => 'ಕಡತವನ್ನು ಉಳಿಸಿ',
'uploadedimage'               => '"[[$1]]" ಅಪ್ಲೋಡ್ ಆಯಿತು',
'overwroteimage'              => '"[[$1]]" ಫೈಲಿನ ಹೊಸ ಆವೃತ್ತಿಯನ್ನು ಅಪ್ಲೋಡ್ ಮಾಡಲಾಯಿತು',
'uploaddisabled'              => 'ಅಪ್ಲೋಡ್‍ಗಳು ನಿರ್ಬಂಧಿತವಾಗಿದೆ',
'uploaddisabledtext'          => '{{SITENAME}} ತಾಣದಲ್ಲಿ ಫೈಲುಗಳ ಅಪ್ಲೋಡ್ ಮಾಡುವಿಕೆ ತಡೆಗಟ್ಟಲ್ಪಟ್ಟಿದೆ.',
'uploadcorrupt'               => 'ಈ ಫೈಲು ಕುಲಗೆಟ್ಟಿದೆ ಅಥವ ತಪ್ಪಾದ ಉಪನಾಮವನ್ನು (extension) ಹೊಂದಿದೆ.
ದಯವಿಟ್ಟು ಮತ್ತೊಮ್ಮೆ ಫೈಲನ್ನು ಪರೀಕ್ಷಿಸಿ ನಂತರ ಅಪ್ಲೋಡ್ ಮಾಡಲು ಪ್ರಯತ್ನಿಸಿ.',
'uploadvirus'                 => 'ಈ ಫೈಲಿನಲ್ಲಿ ಒಂದು ವೈರಸ್ ಇದೆ! ಮಾಹಿತಿ: $1',
'sourcefilename'              => 'ಮೂಲ ಫೈಲಿನ ಹೆಸರು:',
'upload-maxfilesize'          => 'ಗರಿಷ್ಠ ಫೈಲು ಗಾತ್ರ: $1',
'watchthisupload'             => 'ಈ ಪುಟವನ್ನು ವೀಕ್ಷಿಸಿ',
'filewasdeleted'              => 'ಈ ಹೆಸರಿನ ಫೈಲು ಮುಂಚೆ ಅಪ್ಲೋಡ್ ಮಾಡಲಾಗಿ ಅದನ್ನು ಆನಂತರ ಅಳಿಸಲಾಗಿತ್ತು.
ಇದನ್ನು ಮತ್ತೊಮ್ಮೆ ಅಪ್ಲೋಡ್ ಮಾಡುವ ಮುನ್ನ ನೀವು $1 ಅನ್ನು ಪರೀಕ್ಷಿಸಬೇಕು.',
'upload-wasdeleted'           => "'''ಎಚ್ಚರಿಕೆ: ನೀವು ಮುಂಚೆ ಅಳಿಸಲ್ಪಟ್ಟ ಫೈಲೊಂದನ್ನು ಅಪ್ಲೋಡ್ ಮಾಡುತ್ತಿರುವಿರಿ.'''

ನೀವು ಈ ಫೈಲನ್ನು ಅಪ್ಲೋಡ್ ಮಾಡುವುದು ಸರಿಯೇ ಎಂದು ಮತ್ತೊಮ್ಮೆ ಪರೀಕ್ಷಿಸಿ.
ತೀರ್ಮಾನಕ್ಕೆ ಪೂರಕವಾಗಲು ಈ ಫೈಲಿನ ಅಳಿಸುವಿಕೆ ದಾಖಲೆಯನ್ನು ನೀಡಲಾಗಿದೆ:",

'upload-file-error'      => 'ಆಂತರಿಕ ದೋಷ',
'upload-file-error-text' => 'ಸರ್ವರ್‍ನಲ್ಲಿ ತಾತ್ಕಾಲಿಕ ಫೈಲನ್ನು ಸೃಷ್ಟಿಸುವಲ್ಲಿ ಒಂದು ಆಂತರಿಕ ದೋಷವಾಯಿತು.
ದಯವಿಟ್ಟು ವ್ಯವಸ್ಥಾಪಕರೊಬ್ಬರನ್ನು ಸಂಪರ್ಕಿಸಿ.',
'upload-misc-error'      => 'ತಿಳಿದಿಲ್ಲದ ಅಪ್ಲೋಡ್ ದೋಷ',

# Some likely curl errors. More could be added from <http://curl.haxx.se/libcurl/c/libcurl-errors.html>
'upload-curl-error6'      => 'URL ಅನ್ನು ತಲುಪಲು ಆಗಲಿಲ್ಲ',
'upload-curl-error6-text' => 'ನೀಡಲ್ಪಟ್ಟ URL ಅನ್ನು ತಲುಪಲು ಆಗಲಿಲ್ಲ.
ಈ URL ಸರಿಯಿದೆ ಮತ್ತು ಆ ತಾಣ ಕಾರ್ಯ ಮಾಡುತ್ತಿದೆ ಎಂದು ಮತ್ತೊಮ್ಮೆ ಪರೀಕ್ಷಿಸಿ.',
'upload-curl-error28'     => 'ಅಪ್ಲೋಡ್ ಕಾಲಾವಧಿ ಮೀರಿದೆ',

'upload_source_url'  => ' (ಒಂದು ಮನ್ನಿತ, ಸಾರ್ವಜನಿಕವಾಗಿ ಎಟಕುವ URL)',
'upload_source_file' => ' (ನಿಮ್ಮ ಗಣಕಯಂತ್ರದಲ್ಲಿರುವ ಒಂದು ಫೈಲು)',

# Special:ImageList
'imagelist-summary'     => 'ಈ ವಿಶೇಷ ಪುಟವು ಎಲ್ಲಾ ಅಪ್ಲೋಡ್ ಆಗಿರುವ ಫೈಲುಗಳನ್ನು ತೋರುತ್ತದೆ.
ವಸ್ತುಸ್ಥಿತಿಯಲ್ಲಿ, ಕೊನೆಯದಾಗಿ ಅಪ್ಲೋಡ್ ಆಗಿರುವ ಫೈಲುಗಳು ಪಟ್ಟಿಯ ಪ್ರಾರಂಭದಲ್ಲಿ ಕಾಣುತ್ತವೆ.
ಪಟ್ಟಿಯ ವಿಭಾಗದ ತಲೆಬರಹವನ್ನು ಕ್ಲಿಕ್ ಮಾಡಿದರೆ ಪಟ್ಟಿಯ ರಚನೆ ಬದಲಾಗುತ್ತದೆ.',
'imgfile'               => 'ಫೈಲು',
'imagelist'             => 'ಚಿತ್ರಗಳ ಪಟ್ಟಿ',
'imagelist_date'        => 'ದಿನಾಂಕ',
'imagelist_name'        => 'ಹೆಸರು',
'imagelist_user'        => 'ಸದಸ್ಯ',
'imagelist_size'        => 'ಗಾತ್ರ',
'imagelist_description' => 'ವಿವರ',

# Image description page
'filehist'                  => 'ಕಡತದ ಇತಿಹಾಸ',
'filehist-help'             => 'ದಿನ/ಕಾಲ ಒತ್ತಿದರೆ ಆ ಸಮಯದಲ್ಲಿ ಈ ಕಡತದ ವಸ್ತುಸ್ಥಿತಿ ತೋರುತ್ತದೆ.',
'filehist-deleteall'        => 'ಎಲ್ಲವನ್ನೂ ಅಳಿಸು',
'filehist-deleteone'        => 'ಅಳಿಸು',
'filehist-current'          => 'ಪ್ರಸಕ್ತ',
'filehist-datetime'         => 'ದಿನ/ಕಾಲ',
'filehist-user'             => 'ಸದಸ್ಯ',
'filehist-dimensions'       => 'ಆಯಾಮಗಳು',
'filehist-filesize'         => 'ಫೈಲಿನ ಗಾತ್ರ',
'filehist-comment'          => 'ವಕ್ಕಣೆ',
'imagelinks'                => 'ಕೊಂಡಿಗಳು',
'linkstoimage'              => 'ಈ ಕೆಳಗಿನ {{PLURAL:$1|ಪುಟವು|$1 ಪುಟಗಳು}} ಈ ಚಿತ್ರಕ್ಕೆ ಸಂಪರ್ಕ {{PLURAL:$1|ಹೊಂದಿದೆ|ಹೊಂದಿವೆ}}:',
'nolinkstoimage'            => 'ಈ ಫೈಲಿಗೆ ಯಾವ ಪುಟವೂ ಸಂಪರ್ಕ ಹೊಂದಿಲ್ಲ.',
'sharedupload'              => 'ಈ ಫೈಲಿನ ಮೂಲವನ್ನು ಹಲವರು ಹಂಚಿಕೊಂಡಿರುವರು ಮತ್ತು ಅನೇಕ ಯೋಜನೆಗಳಲ್ಲಿ ಇದು ಉಪಯೋಗದಲ್ಲಿರಬಹುದು.',
'shareduploadwiki'          => 'ಹೆಚ್ಚನ ಮಾಹಿತಿಗೆ $1 ಅನ್ನು ನೋಡಿ.',
'shareduploadwiki-linktext' => 'ಫೈಲಿನ ಮಾಹಿತಿ ಪುಟ',
'noimage'                   => 'ಈ ಹೆಸರಿನ ಫೈಲು ಯಾವುದೂ ಇಲ್ಲ. ನಿಮಗೆ ಆದರೆ ಅದನ್ನು $1.',
'noimage-linktext'          => 'ಅಪ್ಲೋಡ್ ಮಾಡಿ',
'uploadnewversion-linktext' => 'ಈ ಫೈಲಿನ ಹೊಸ ಆವೃತ್ತಿಯನ್ನು ಅಪ್ಲೋಡ್ ಮಾಡಿ',
'imagepage-searchdupe'      => 'ದ್ವಿಪ್ರತಿಗಳಿರುವ ಫೈಲುಗಳನ್ನು ಹುಡುಕಿ',

# File deletion
'filedelete'                  => '$1 ಅನ್ನು ಅಳಿಸು',
'filedelete-legend'           => 'ಫೈಲನ್ನು ಅಳಿಸು',
'filedelete-intro'            => "'''[[Media:$1|$1]]''' ಅನ್ನು ಅಳಿಸುತ್ತಿರುವಿರಿ.",
'filedelete-intro-old'        => "ನೀವು '''[[Media:$1|$1]]''' ಮೀಡಿಯಾದ [$4 $3, $2] ಅಂದಿನಂತಹ ಆವೃತ್ತಿಯನ್ನು ಅಳಿಸುತ್ತಿರುವಿರಿ.",
'filedelete-comment'          => 'ಅಳಿಸುವಿಕೆಗೆ ಕಾರಣ:',
'filedelete-submit'           => 'ಅಳಿಸು',
'filedelete-success'          => "'''$1''' ಅಳಿಸಲಾಗಿದೆ.",
'filedelete-success-old'      => '<span class="plainlinks">\'\'\'[[Media:$1|$1]]\'\'\' ಮೀಡಿಯಾದ $3, $2 ರಂದಿನ ಆವೃತ್ತಿಯನ್ನು ಅಳಿಸಲಾಗಿದೆ.</span>',
'filedelete-nofile'           => "'''$1''' {{SITENAME}} ಅಲ್ಲಿ ಅಸ್ಥಿತ್ವದಲ್ಲಿಲ್ಲ.",
'filedelete-otherreason'      => 'ಇತರ/ಹೆಚ್ಚುವರಿ ಕಾರಣ:',
'filedelete-reason-otherlist' => 'ಇತರ ಕಾರಣ',
'filedelete-reason-dropdown'  => '*ಸಾಮಾನ್ಯ ಅಳಿಸುವಿಕೆ ಕಾರಣಗಳು
** ಕೃತಿಸ್ವಾಮ್ಯತೆ ಉಲ್ಲಂಘನೆ
** ದ್ವಿಪ್ರತಿಗಳಿರುವ ಫೈಲು',
'filedelete-edit-reasonlist'  => 'ಅಳಿಸುವಿಕೆಯ ಕಾರಣಗಳನ್ನು ಸಂಪಾದಿಸು',

# MIME search
'mimesearch' => 'MIME ಹುಡುಕಾಟ',
'mimetype'   => 'MIME ಪ್ರಕಾರ:',
'download'   => 'ಡೌನ್‍ಲೋಡ್',

# Unwatched pages
'unwatchedpages' => 'ಯಾರೂ ವೀಕ್ಷಿಸುತ್ತಿರದ ಪುಟಗಳು',

# List redirects
'listredirects' => 'ರೀಡೈರೆಕ್ಟ್ ಪುಟಗಳ ಪಟ್ಟಿ',

# Unused templates
'unusedtemplates'     => 'ಉಪಯೋಗದಲ್ಲಿರದ ಟೆಂಪ್ಲೇಟುಗಳು',
'unusedtemplatestext' => 'ಯಾವ ಪುಟದಲ್ಲೂ ಉಪಯೋಗದಲ್ಲಿ ಇರದ ಟೆಂಪ್ಲೇಟುಗಳನ್ನು ಇಲ್ಲಿ ಪಟ್ಟಿ ಮಾಡಲಾಗಿದೆ. ಇವನ್ನು ಅಳಿಸುವ ಮುನ್ನ ಟೆಂಪ್ಲೇಟುಗಳಿಗೆ ಇತರ ಲಿಂಕುಗಳಿದೆಯೆ ಎಂದು ಪರೀಕ್ಷಿಸಲು ಮರೆಯದಿರಿ.',
'unusedtemplateswlh'  => 'ಇತರ ಕೊಂಡಿಗಳು',

# Random page
'randompage'         => 'ಯಾದೃಚ್ಛಿಕ ಪುಟ',
'randompage-nopages' => 'ಈ ಪುಟಪ್ರಬೇಧದಲ್ಲಿ ಯಾವ ಪುಟವೂ ಇಲ್ಲ.',

# Random redirect
'randomredirect'         => 'ಯದೃಚ್ಛಿಕ ಪುನರ್ನಿರ್ದೇಶಿತ ಪುಟ',
'randomredirect-nopages' => 'ಈ ಪುಟಪ್ರಬೇಧದಲ್ಲಿ ಯಾವ ಪುನರ್ನಿರ್ದೇಶನಗಳೂ ಇಲ್ಲ.',

# Statistics
'statistics'             => 'ಅಂಕಿ ಅಂಶಗಳು',
'sitestats'              => 'ತಾಣದ ಅಂಕಿಅಂಶಗಳು',
'userstats'              => 'ಸದಸ್ಯರ ಅಂಕಿ ಅಂಶ',
'sitestatstext'          => "ಡೇಟಾಬೇಸ್‍ನಲ್ಲಿ ಒಟ್ಟು {{PLURAL:\$1|'''೧''' ಪುಟವಿದೆ|'''\$1''' ಪುಟಗಳಿವೆ}}.
ಇದರಲ್ಲಿ \"ಚರ್ಚೆ\" ಪುಟಗಳು, {{SITENAME}} ಬಗ್ಗೆ ಪುಟಗಳು, \"ಚುಟುಕು\" ಪುಟಗಳು, ಪುನರ್ನಿರ್ದೇಶನಗಳು, ಮತ್ತು ಇತರೆ ಪುಟಗಳು ಸೇರಿವೆ .
ಅವುಗಳನ್ನು ಬಿಟ್ಟು, ಒಟ್ಟು {{PLURAL:\$2|'''೧''' ಪುಟ|'''\$2''' ಪುಟಗಳು}} ಬಹುಶಃ ನಿಜವಾದ ಲೇಖನಗಳಿಂದ ಕೂಡಿರುವ {{PLURAL:\$2|ಪುಟವಿದೆ|ಪುಟಗಳಿವೆ}}.

'''\$8''' {{PLURAL:\$8|ಫೈಲು|ಫೈಲುಗಳು}} ಅಪ್ಲೋಡ್ {{PLURAL:\$8|ಆಗಿದೆ|ಆಗಿವೆ}}.

{{SITENAME}} ಸ್ಥಾಪಿತವಾದ ಮೇಲೆ ಒಟ್ಟು '''\$3''' ಪುಟ {{PLURAL:\$3|ವೀಕ್ಷಣೆ ಆಗಿದೆ|ವೀಕ್ಷಣೆಗಳು ಆಗಿವೆ}}, ಮತ್ತು '''\$4''' ಪುಟ {{PLURAL:\$4|ಸಂಪಾದನೆ ಆಗಿದೆ|ಸಂಪಾದನೆಗಳು ಆಗಿವೆ}}.
ಆ ಲೆಕ್ಕದಲ್ಲಿ ಸರಸರಿ ಪುಟಕ್ಕೆ '''\$5''' ಸಂಪಾದನೆಗಳು, ಮತ್ತು '''\$6''' ವೀಕ್ಷಣೆಗಳು ಆಗಿವೆ.

ಈಗಿನ [http://www.mediawiki.org/wiki/Manual:Job_queue ಕೆಲಸದ ಸಾಲಿನ] ಉದ್ದ '''\$7'''.",
'userstatstext'          => "ಇಲ್ಲಿ ಒಟ್ಟು {{PLURAL:$1|'''೧''' ನೊಂದಾಯಿತ [[Special:ListUsers|ಬಳಕೆದಾರ]]|'''$1''' ನೊಂದಾಯಿತ [[Special:ListUsers|ಬಳಕೆದಾರರು]]}} ಇದ್ದಾರೆ, ಮತ್ತು ಅವರಲ್ಲಿ {{PLURAL:$2|ಒಬ್ಬರಿಗೆ|'''$2''' ಬಳಕೆದಾರರಿಗೆ}} (ಅಂದರೆ '''$4%''') $5 ಹಕ್ಕುಗಳಿವೆ.",
'statistics-mostpopular' => 'ಅತ್ಯಂತ ಹೆಚ್ಚು ವೀಕ್ಷಿತ ಪುಟಗಳು',

'disambiguations'     => 'ದ್ವಂದ್ವನಿವಾರಣಾ ಪುಟಗಳು',
'disambiguationspage' => 'Template:ದ್ವಂದ್ವ ನಿವಾರಣೆ',

'doubleredirects' => 'ಮರುಕಳಿಸಿದ ಪುನರ್ನಿರ್ದೇಶನಗಳು',

'brokenredirects'        => 'ಮುರಿದ ರಿಡೈರೆಕ್ಟ್‌ಗಳು',
'brokenredirectstext'    => 'ಕೆಳಗಿನ ರಿಡೈರೆಕ್ಟುಗಳು ವಿಕಿಯಲ್ಲಿ ಇಲ್ಲದ ಪುಟಗಳಿಗೆ ಸಂಪರ್ಕ ಹೊಂದಿವೆ:',
'brokenredirects-edit'   => '(ಸಂಪಾದಿಸಿ)',
'brokenredirects-delete' => '(ಅಳಿಸಿ)',

'withoutinterwiki'         => 'ಬೇರೆ ಭಾಷೆಗಳಿಗೆ ಸಂಪರ್ಕ ಹೊಂದಿರದ ಪುಟಗಳು',
'withoutinterwiki-summary' => 'ಈ ಕೆಳಗಿನ ಪುಟಗಳು ಅವುಗಳ ಇತರ ಭಾಷೆಯಲ್ಲಿರುವ ಪುಟಗಳಿಗೆ ಕೊಂಡಿಯನ್ನು ಹೊಂದಿಲ್ಲ:',
'withoutinterwiki-submit'  => 'ತೋರಿಸು',

'fewestrevisions' => 'ಅತ್ಯಂತ ಕಡಿಮೆ ಬದಲಾವಣೆಗಳನ್ನು ಹೊಂದಿರುವ ಪುಟಗಳು',

# Miscellaneous special pages
'nbytes'                  => '$1 {{PLURAL:$1|ಬೈಟ್|ಬೈಟ್‍ಗಳು}}',
'ncategories'             => '$1 {{PLURAL:$1|ವರ್ಗ|ವರ್ಗಗಳು}}',
'nlinks'                  => '$1 {{PLURAL:$1|ಸಂಪರ್ಕ|ಸಂಪರ್ಕಗಳು}}',
'nmembers'                => '$1 {{PLURAL:$1|ಸದಸ್ಯ|ಸದಸ್ಯರು}}',
'nrevisions'              => '$1 {{PLURAL:$1|ಬದಲಾವಣೆ|ಬದಲಾವಣೆಗಳು}}',
'nviews'                  => '$1 {{PLURAL:$1|ನೋಟ|ನೋಟಗಳು}}',
'lonelypages'             => 'ಒಬ್ಬಂಟಿ ಪುಟಗಳು',
'lonelypagestext'         => 'ಈ ಕೆಳಗಿನ ಪುಟಗಳು {{SITENAME}} ಅಲ್ಲಿರುವ ಇತರ ಯಾವ ಪುಟದಿಂದಲೂ ಕೊಂಡಿಯನ್ನು ಹೊಂದಿಲ್ಲ.',
'uncategorizedpages'      => 'ವರ್ಗ ಗೊತ್ತು ಮಾಡದ ಪುಟಗಳು',
'uncategorizedcategories' => 'ಅವರ್ಗೀಕೃತ ವರ್ಗಗಳು',
'uncategorizedimages'     => 'ಅವರ್ಗೀಕೃತ ಫೈಲುಗಳು',
'uncategorizedtemplates'  => 'ಅವರ್ಗೀಕೃತ ಟೆಂಪ್ಲೇಟುಗಳು',
'unusedcategories'        => 'ಬಳಕೆಯಲ್ಲಿರದ ವರ್ಗಗಳು',
'unusedimages'            => 'ಉಪಯೋಗಿಸದ ಚಿತ್ರಗಳು',
'popularpages'            => 'ಜನಪ್ರಿಯ ಪುಟಗಳು',
'wantedcategories'        => 'ಬೇಕಾಗಿರುವ ವರ್ಗಗಳು',
'wantedpages'             => 'ಬೇಕಾಗಿರುವ ಪುಟಗಳು',
'mostlinked'              => 'ಅತ್ಯಂತ ಹೆಚ್ಚು ಸಂಪರ್ಕಗಳನ್ನು ಹೊಂದಿರುವ ಪುಟಗಳು',
'mostlinkedcategories'    => 'ಅತ್ಯಂತ ಹೆಚ್ಚು ಸಂಪರ್ಕಗಳನ್ನು ಹೊಂದಿರುವ ವರ್ಗಗಳು',
'mostlinkedtemplates'     => 'ಅತ್ಯಂತ ಹೆಚ್ಚು ಸಂಪರ್ಕಗಳನ್ನು ಹೊಂದಿರುವ ಟೆಂಪ್ಲೇಟುಗಳು',
'mostcategories'          => 'ಅತ್ಯಂತ ಹೆಚ್ಚು ವರ್ಗಗಳನ್ನು ಹೊಂದಿರುವ ಪುಟಗಳು',
'mostimages'              => 'ಅತಿ ಹೆಚ್ಚು ಸಂಪರ್ಕಗಳನ್ನು ಹೊಂದಿರುವ ಫೈಲುಗಳು',
'mostrevisions'           => 'ಅತ್ಯಂತ ಹೆಚ್ಚು ಬದಲಾವಣೆಗಳಾಗಿವು ಪುಟಗಳು',
'prefixindex'             => 'ಪೂರ್ವನಾಮಗಳ ಸೂಚಿಕೆ',
'shortpages'              => 'ಪುಟ್ಟ ಪುಟಗಳು',
'longpages'               => 'ಉದ್ದನೆಯ ಪುಟಗಳು',
'deadendpages'            => 'ಕೊನೆಯಂಚಿನ ಪುಟಗಳು',
'deadendpagestext'        => 'ಈ ಕೆಳಗಿನ ಪುಟಗಳು {{SITENAME}} ಅಲ್ಲಿ ಇರುವ ಇತರ ಪುಟಗಳಿಗೆ ಕೊಂಡಿಯನ್ನು ಹೊಂದಿಲ್ಲ.',
'protectedpages'          => 'ಸಂರಕ್ಷಿತ ಪುಟಗಳು',
'protectedpages-indef'    => 'ಅನಿಯಮಿತ ಸಂರಕ್ಷಣೆಗಳು ಮಾತ್ರ',
'protectedpagestext'      => 'ಈ ಕೆಳಗಿನ ಪುಟಗಳು ಸ್ಥಳಾಂತರಿಕೆ ಅಥವ ಸಂಪಾದನೆ ಸಂರಕ್ಷಣೆಯನ್ನು ಹೊಂದಿವೆ',
'protectedpagesempty'     => 'ಈ ನಿಯಮಾವಳಿಗಳಲ್ಲಿ ಯಾವ ಪುಟವೂ ಸಂರಕ್ಷಿತವಾಗಿಲ್ಲ.',
'protectedtitles'         => 'ಸಂರಕ್ಷಿತ ಶೀರ್ಷಿಕೆಗಳು',
'protectedtitlestext'     => 'ಈ ಕೆಳಗಿನ ಶೀರ್ಷಿಕೆಗಳನ್ನು ಸೃಷ್ಟಿಸಲಾಗದಂತೆ ಸಂರಕ್ಷಿಸಲಾಗಿದೆ',
'listusers'               => 'ಸದಸ್ಯರ ಪಟ್ಟಿ',
'newpages'                => 'ಹೊಸ ಪುಟಗಳು',
'newpages-username'       => 'ಬಳಕೆದಾರ ಹೆಸರು:',
'ancientpages'            => 'ಹಳೆಯ ಪುಟಗಳು',
'move'                    => 'ಸ್ಥಳಾಂತರಿಸಿ',
'movethispage'            => 'ಈ ಪುಟವನ್ನು ಸ್ಥಳಾಂತರಿಸಿ',
'unusedcategoriestext'    => 'ಈ ಕೆಳಗಿನ ವರ್ಗ ಪುಟಗಳು ಅಸ್ಥಿತ್ವದಲ್ಲಿ ಇದ್ದರೂ ಬೇರೆ ಯಾವ ಪುಟವಾಗಲಿ ಅಥವ ವರ್ಗವಾಗಲಿ ಅವನ್ನು ಉಪಯೋಗಿಸುತ್ತಿಲ್ಲ.',
'pager-newer-n'           => '{{PLURAL:$1|ಹೊಸ ೧|ಹೊಸ $1}}',
'pager-older-n'           => '{{PLURAL:$1|ಹಳೆ ೧|ಹಳೆ $1}}',
'suppress'                => 'ನಿಗಾ ಇಡುವವ',

# Book sources
'booksources'               => 'ಪುಸ್ತಕಗಳ ಮೂಲ',
'booksources-search-legend' => 'ಪುಸ್ತಕ ಮೂಲಗಳಿಗೆ ಹುಡುಕು',
'booksources-go'            => 'ಹೋಗು',

# Special:Log
'specialloguserlabel'  => 'ಸದಸ್ಯ:',
'speciallogtitlelabel' => 'ಶೀರ್ಷಿಕೆ:',
'log'                  => 'ದಾಖಲೆಗಳು',
'all-logs-page'        => 'ಎಲ್ಲಾ ದಾಖಲೆಗಳು',
'log-search-legend'    => 'ದಾಖಲೆಗಳಿಗೆ ಹುಡುಕು',
'log-search-submit'    => 'ಹೋಗು',
'logempty'             => 'ದಾಖಲೆಗಳಲ್ಲಿ ಇದಕ್ಕೆ ಹೋಲುವ ಯಾವ ವಸ್ತುವೂ ಇಲ್ಲ.',
'log-title-wildcard'   => 'ಈ ಪದಗಳಿಂದ ಪ್ರಾರಂಭವಾಗುವ ಶೀರ್ಷಿಕೆಗಳನ್ನು ಹುಡುಕು',

# Special:AllPages
'allpages'          => 'ಎಲ್ಲ ಪುಟಗಳು',
'alphaindexline'    => '$1 ಇಂದ $2',
'nextpage'          => 'ಮುಂದಿನ ಪುಟ ($1)',
'prevpage'          => 'ಹಿಂದಿನ ಪುಟ ($1)',
'allpagesfrom'      => 'ಇದರಿಂದ ಪ್ರಾರಂಭವಾಗುವ ಪುಟಗಳನ್ನು ತೋರಿಸು:',
'allarticles'       => 'ಎಲ್ಲ ಲೇಖನಗಳು',
'allinnamespace'    => 'ಎಲ್ಲಾ ಪುಟಗಳೂ ($1 ಪುಟಪ್ರಬೇಧ)',
'allnotinnamespace' => 'ಎಲ್ಲಾ ಪುಟಗಳು ($1 ಪುಟಪ್ರಬೇಧ ಹೊರತುಪಡಿಸಿ)',
'allpagesprev'      => 'ಹಿಂದಕ್ಕೆ',
'allpagesnext'      => 'ಮುಂದಕ್ಕೆ',
'allpagessubmit'    => 'ಹೋಗು',
'allpagesprefix'    => 'ಈ ಪೂರ್ವಪದವನ್ನು ಹೊಂದಿರುವ ಪುಟಗಳನ್ನು ತೋರಿಸು:',
'allpages-bad-ns'   => '{{SITENAME}} ಅಲ್ಲಿ "$1" ಪುಟಪ್ರಬೇಧ ಇಲ್ಲ.',

# Special:Categories
'categories'                    => 'ವರ್ಗಗಳು',
'categoriespagetext'            => 'ಈ ಕೆಳಗಿನ ವರ್ಗಗಳು ಪುಟಗಳನ್ನು ಅಥವ ಮೀಡಿಯಗಳನ್ನು ಹೊಂದಿವೆ.
[[Special:UnusedCategories|ಅನುಪಯೋಗಿತ ವರ್ಗಗಳು]] ಇಲ್ಲಿ ತೋರಲಾಗಿಲ್ಲ.
ಇದನ್ನೂ ನೋಡಿ: [[Special:WantedCategories|ಬೇಕಾಗಿರುವ ವರ್ಗಗಳು]].',
'special-categories-sort-count' => 'ಎಣಿಕೆಯ ಪ್ರಕಾರ ಜೋಡಿಸು',
'special-categories-sort-abc'   => 'ಅಕ್ಷರಮಾಲೆಯ ಪ್ರಕಾರ ಜೋಡಿಸು',

# Special:ListUsers
'listusersfrom'      => 'ಇದರಿಂದ ಪ್ರಾರಂಭವಾಗುವ ಬಳಕೆದಾರರನ್ನು ತೋರಿಸು:',
'listusers-submit'   => 'ತೋರು',
'listusers-noresult' => 'ಯಾವ ಬಳಕೆದಾರರೂ ಸಿಗಲಿಲ್ಲ.',

# Special:ListGroupRights
'listgrouprights'          => 'ಬಳಕೆದಾರ ಗುಂಪು ಹಕ್ಕುಗಳು',
'listgrouprights-summary'  => 'ಈ ವಿಕಿಯಲ್ಲಿ ಪ್ರಚಲಿತವಾಗಿರುವ ಬಳಕೆದಾರ ಗುಂಪುಗಳು ಮತ್ತು ಆ ಗುಂಪುಗಳಿಗೆ ಅನ್ವಯಿಸುವ ಹಕ್ಕುಗಳು ಈ ಕೆಳಗಿನಂತಿದೆ.',
'listgrouprights-group'    => 'ಗುಂಪು',
'listgrouprights-rights'   => 'ಹಕ್ಕುಗಳು',
'listgrouprights-helppage' => 'Help:ಗುಂಪು ಹಕ್ಕುಗಳು',

# E-mail user
'mailnologin'     => 'ಕಳುಹಿಸುವ ವಿಳಾಸ ಇಲ್ಲ',
'mailnologintext' => 'ಇತರ ಬಳಕೆದಾರರಿಗೆ ಇ-ಅಂಚೆ ಕಳುಹಿಸಲು ನೀವು [[Special:UserLogin|ಲಾಗ್ ಇನ್]] ಆಗಿರಬೇಕು ಮತ್ತು ನಿಮ್ಮ [[Special:Preferences|ಪ್ರಾಶಸ್ತ್ಯಗಳ ಪುಟದಲ್ಲಿ]] ಒಂದು ಧೃಡೀಕೃತ ಇ-ಅಂಚೆ ವಿಳಾಸ ನೀಡಿರಬೇಕು.',
'emailuser'       => 'ಈ ಸದಸ್ಯರಿಗೆ ಇ-ಅಂಚೆ ಕಳಿಸಿ',
'emailpage'       => 'ಸದಸ್ಯರಿಗೆ ವಿ-ಅ೦ಚೆ ಕಳಿಸಿ',
'defemailsubject' => 'ವಿಕಿಪೀಡಿಯ ವಿ-ಅ೦ಚೆ',
'noemailtitle'    => 'ಯಾವುದೇ ಇ-ಅಂಚೆ ವಿಳಾಸ ಇಲ್ಲ',
'noemailtext'     => 'ಈ ಸದಸ್ಯ ಯಾವುದೇ ಇ-ಅಂಚೆ ವಿಳಾಸ ನೀಡಿಲ್ಲ, ಅಥವ ಬೇರೆ ಸದಸ್ಯರಿಂದ ಇ-ಅಂಚೆ ಪಡೆಯಲು ಒಪ್ಪಿಕೊಂಡಿಲ್ಲ.',
'emailfrom'       => 'ಇಂದ:',
'emailto'         => 'ಗೆ:',
'emailsubject'    => 'ವಿಷಯ:',
'emailmessage'    => 'ಸಂದೇಶ:',
'emailsend'       => 'ಕಳುಹಿಸಿ',
'emailccme'       => 'ನನ್ನ ಸಂದೇಶದ ಪ್ರತಿಯೊಂದನ್ನು ನನಗೆ ಇ-ಅಂಚೆ ಮೂಲಕ ಕಳಿಸು.',
'emailccsubject'  => '$1 ಅವರಿಗೆ ನೀವು ಕಳುಹಿಸಿದ ಸಂದೇಶದ ಪ್ರತಿ: $2',
'emailsent'       => 'ಇ-ಅಂಚೆ ಕಳುಹಿಸಲಾಯಿತು',
'emailsenttext'   => 'ನಿಮ್ಮ ಇ-ಅಂಚೆ ಕಳುಹಿಸಲಾಗಿದೆ.',

# Watchlist
'watchlist'            => 'ವೀಕ್ಷಣಾ ಪಟ್ಟಿ',
'mywatchlist'          => 'ನನ್ನ ವೀಕ್ಷಣಾಪಟ್ಟಿ',
'watchlistfor'         => "('''$1''' ಅವರ)",
'nowatchlist'          => 'ನಿಮ್ಮ ವೀಕ್ಷಣಾಪಟ್ಟಿಯಲ್ಲಿ ಯಾವುದೇ ಪುಟಗಳಿಲ್ಲ',
'watchlistanontext'    => 'ನಿಮ್ಮ ವೀಕ್ಷಣಾಪಟ್ಟಿಯನ್ನು ನೋಡಲು ಅಥವ ಸಂಪಾದಿಸಲು ದಯವಿಟ್ಟು $1 ಮಾಡಿ.',
'watchnologin'         => 'ಲಾಗಿನ್ ಆಗಿಲ್ಲ',
'watchnologintext'     => 'ನಿಮ್ಮ ವೀಕ್ಷಣಾಪಟ್ಟಿಯನ್ನು ಬದಲಾಯಿಸಲು ನೀವು [[Special:UserLogin|ಲಾಗಿನ್]] ಆಗಿರಬೇಕು.',
'addedwatch'           => 'ವೀಕ್ಷಣಾ ಪಟ್ಟಿಗೆ ಸೇರಿಸಲಾಯಿತು',
'addedwatchtext'       => '"<nowiki>$1</nowiki>" ಪುಟವನ್ನು ನಿಮ್ಮ [[Special:Watchlist|ವೀಕ್ಷಣಾಪಟ್ಟಿಗೆ]] ಸೇರಿಸಲಾಗಿದೆ. ಈ ಪುಟದ ಮತ್ತು ಇದರ ಚರ್ಚಾ ಪುಟದ ಮುಂದಿನ ಬದಲಾವಣೆಗಳು ವೀಕ್ಷಣಾ ಪಟ್ಟಿಯಲ್ಲಿ ಕಾಣಸಿಗುತ್ತವೆ, ಮತ್ತು [[Special:RecentChanges|ಇತ್ತೀಚೆಗಿನ ಬದಲಾವಣೆಗಳ]] ಪಟ್ಟಿಯಲ್ಲಿ ಈ ಪುಟಗಳನ್ನು ದಪ್ಪಕ್ಷರಗಳಲ್ಲಿ ಕಾಣಿಸಲಾಗುವುದು.

<p>ಈ ಪುಟವನ್ನು ವೀಕ್ಷಣಾ ಪಟ್ಟಿಯಿಂದ ತೆಗೆಯಬಯಸಿದಲ್ಲಿ, ಮೇಲ್ಪಟ್ಟಿಯಲ್ಲಿ ಕಾಣಿಸಿರುವ "ವೀಕ್ಷಣಾ ಪುಟದಿಂದ ತೆಗೆ" ಅನ್ನು ಕ್ಲಿಕ್ಕಿಸಿ.',
'removedwatch'         => 'ವೀಕ್ಷಣಾಪಟ್ಟಿಯಿಂದ ತೆಗೆಯಲಾಗಿದೆ',
'removedwatchtext'     => '"[[:$1]]" ಪುಟವನ್ನು ನಿಮ್ಮ ವೀಕ್ಷಣಾಪಟ್ಟಿಯಿಂದ ತೆಗೆಯಲಾಗಿದೆ.',
'watch'                => 'ವೀಕ್ಷಿಸಿ',
'watchthispage'        => 'ಈ ಪುಟವನ್ನು ವೀಕ್ಷಿಸಿ',
'unwatch'              => 'ವೀಕ್ಷಣಾ ಪಟ್ಟಿಯಿಂದ ತೆಗೆ',
'unwatchthispage'      => 'ವೀಕ್ಷಣೆ ನಿಲ್ಲಿಸು',
'notvisiblerev'        => 'ಆವೃತ್ತಿಯನ್ನು ಅಳಿಸಲಾಗಿದೆ',
'watchlist-details'    => 'ಚರ್ಚೆ ಪುಟಗಳನ್ನು ಹೊರತುಪಡಿಸಿ {{PLURAL:$1|$1 ಪುಟ|$1 ಪುಟಗಳು}} ವೀಕ್ಷಣಾಪಟ್ಟಿಯಲ್ಲಿದೆ.',
'wlheader-showupdated' => "* ನೀವು ಕೊನೆಯ ಬಾರಿ ಭೇಟಿ ನೀಡಿದ ನಂತರ ಬದಲಾವಣೆಗಳು ಆಗಿರುವ ಪುಟಗಳು '''ದಪ್ಪ ಅಕ್ಷರಗಳಲ್ಲಿ''' ತೋರಿಸಲಾಗಿದೆ",
'watchmethod-recent'   => 'ಇತ್ತೀಚಿನ ಸಂಪಾದನೆಗಳಲ್ಲಿ ವೀಕ್ಷಣಾಪಟ್ಟಿಗೆ ಸೇರುವ ಪುಟಗಳ ಹುಡುಕು',
'watchmethod-list'     => 'ವೀಕ್ಷಣಾಪಟ್ಟಿಗೆ ಸೇರುವ ಪುಟಗಳಲ್ಲಿ ಇತ್ತೀಚಿನ ಸಂಪಾದನೆಗಳಿಗೆ ಹುಡುಕು',
'watchlistcontains'    => 'ನಿಮ್ಮ ವೀಕ್ಷಣಾಪಟ್ಟಿಯಲ್ಲಿ $1 {{PLURAL:$1|ಪುಟ|ಪುಟಗಳು}} ಇವೆ.',
'wlshowlast'           => 'ಕೊನೆಯ $1 ಗಂಟೆ $2 ದಿನಗಳು $3 ಅನ್ನು ತೋರಿಸು',
'watchlist-show-bots'  => 'ಬಾಟ್ ಸಂಪಾದನೆಗಳನ್ನು ತೋರಿಸು',
'watchlist-hide-bots'  => 'ಬಾಟ್ ಸಂಪಾದನೆಗಳನ್ನು ಅಡಗಿಸು',
'watchlist-show-own'   => 'ನನ್ನ ಸಂಪಾದನೆಗಳನ್ನು ತೋರಿಸು',
'watchlist-hide-own'   => 'ನನ್ನ ಸಂಪಾದನೆಗಳನ್ನು ಅಡಗಿಸು',
'watchlist-show-minor' => 'ಚಿಕ್ಕಪುಟ್ಟ ಬದಲಾವಣೆಗಳನ್ನು ತೋರಿಸು',
'watchlist-hide-minor' => 'ಚಿಕ್ಕಪುಟ್ಟ ಬದಲಾವಣೆಗಳನ್ನು ಅಡಗಿಸು',

# Displayed when you click the "watch" button and it is in the process of watching
'watching'   => 'ವೀಕ್ಷಣೆಗೆ ಸೇರಿಸಲಾಗುತ್ತಿದೆ...',
'unwatching' => 'ವೀಕ್ಷಣೆಯಿಂದ ತೆಗೆಯಲಾಗುತ್ತಿದೆ...',

'enotif_reset'       => 'ಭೇಟಿಯಿತ್ತ ಎಲ್ಲಾ ಪುಟಗಳನ್ನು ಗುರುತು ಮಾಡಿ',
'enotif_newpagetext' => 'ಇದೊಂದು ಹೊಸ ಪುಟ.',
'changed'            => 'ಬದಲಾಯಿಸಲಾಗಿದೆ',
'created'            => 'ಸೃಷ್ಟಿಸಲ್ಪಟ್ಟಿದೆ',
'enotif_lastvisited' => 'ನಿಮ್ಮ ಕಳೆದ ಭೇಟಿಯ ನಂತರದ ಎಲ್ಲಾ ಬದಲಾವಣೆಗಳಿಗೆ $1 ನೋಡಿ.',
'enotif_anon_editor' => 'ಅನಾಮಧೇಯ ಸದಸ್ಯ $1',

# Delete/protect/revert
'deletepage'                  => 'ಪುಟವನ್ನು ಅಳಿಸಿ',
'confirm'                     => 'ಧೃಡಪಡಿಸು',
'exblank'                     => 'ಪುಟ ಖಾಲಿ ಇತ್ತು',
'delete-confirm'              => '"$1" ಅಳಿಸುವಿಕೆ',
'delete-legend'               => 'ಅಳಿಸು',
'historywarning'              => 'ಎಚ್ಚರಿಕೆ: ನೀವು ಅಳಿಸಲು ಹೊರಟಿರುವ ಪುಟಕ್ಕೆ ಸಂಪಾದನೆಯ ಇತಿಹಾಸವಿದೆ:',
'confirmdeletetext'           => 'ಒಂದು ಪುಟವನ್ನು ಮತ್ತು ಅದರ ಸಂಪೂರ್ಣ ಇತಿಹಾಸವನ್ನು ನೀವು ಶಾಶ್ವತವಾಗಿ ಅಳಿಸಿಹಾಕುತ್ತಿರುವಿರಿ.
ಇದನ್ನು ನೀವು ಮಾಡಬಯಸುವಿರಿ, ಇದರ ಪರಿಣಾಮಗಳನ್ನು ಬಲ್ಲಿರಿ, ಮತ್ತು [[{{MediaWiki:Policy-url}}|ಕಾರ್ಯನೀತಿಗಳ]] ಅನುಸಾರ ಇದನ್ನು ಮಾಡುತ್ತಿದ್ದೀರಿ ಎಂದು ದೃಢಪಡಿಸಿ.',
'actioncomplete'              => 'ಕಾರ್ಯ ಸಂಪೂರ್ಣ',
'deletedtext'                 => '"<nowiki>$1</nowiki>" ಅನ್ನು ಅಳಿಸಲಾಯಿತು.
ಇತ್ತೀಚೆಗಿನ ಅಳಿಸುವಿಕೆಗಳ ಪಟ್ಟಿಗಾಗಿ $2 ಅನ್ನು ನೋಡಿ.',
'deletedarticle'              => '"$1" ಅಳಿಸಲಾಯಿತು',
'dellogpage'                  => 'ಅಳಿಸುವಿಕೆ ದಾಖಲೆ',
'dellogpagetext'              => 'ಇತ್ತೀಚಿನ ಅಳಿಸುವಿಕೆಗಳ ಪಟ್ಟಿ ಕೆಳಗಿದೆ.',
'deletionlog'                 => 'ಅಳಿಸುವಿಕೆ ದಿನಚರಿ',
'deletecomment'               => 'ಅಳಿಸುವುದರ ಕಾರಣ',
'deleteotherreason'           => 'ಇತರ/ಹೆಚ್ಚುವರಿ ಕಾರಣ:',
'deletereasonotherlist'       => 'ಇತರ ಕಾರಣ',
'deletereason-dropdown'       => '*ಸಾಮಾನ್ಯ ಅಳಿಸುವಿಕೆಯ ಕಾರಣಗಳು
** ಸಂಪಾದಕರ ಕೋರಿಕೆ
** ಕೃತಿಸ್ವಾಮ್ಯತೆಯ ಉಲ್ಲಂಘನೆ
** Vandalism',
'delete-edit-reasonlist'      => 'ಅಳಿಸುವಿಕೆ ಕಾರಣಗಳನ್ನು ಸಂಪಾದಿಸು',
'rollback_short'              => 'ತೊಡೆದುಹಾಕು',
'rollbacklink'                => 'ತೊಡೆದುಹಾಕು',
'protectlogpage'              => 'ಸಂರಕ್ಷಣೆ ದಿನಚರಿ',
'protectedarticle'            => '"[[$1]]" ಸಂರಕ್ಷಿಸಲಾಗಿದೆ.',
'modifiedarticleprotection'   => '"[[$1]]" ಪುಟದ ಸಂರಕ್ಷಣೆ ಮಟ್ಟವನ್ನು ಬದಲಾಯಿಸಲಾಯಿತು',
'unprotectedarticle'          => '"[[$1]]" ಪುಟದ ಸಂರಕ್ಷಣೆ ತೆಗೆಯಲಾಯಿತು',
'protect-title'               => '"$1" ಪುಟದ ಸಂರಕ್ಷಣೆ ಮಟ್ಟವನ್ನು ಬದಲಾಯಿಸು',
'protect-legend'              => 'ಸಂರಕ್ಷಣೆ ಧೃಡಪಡಿಸಿ',
'protectcomment'              => 'ಸಂರಕ್ಷಿಸಲು ಕಾರಣ:',
'protectexpiry'               => 'ಮುಕ್ತಾಯ:',
'protect_expiry_invalid'      => 'ಮುಕ್ತಾಯದ ಕಾಲ ಸಿಂಧುವಲ್ಲ.',
'protect_expiry_old'          => 'ಮುಕ್ತಾಯದ ಕಾಲ ಭೂತಕಾಲದಲ್ಲಿ ಇದೆ.',
'protect-unchain'             => 'ಸ್ಥಳಾತಂರಿಸುವ ಅನುಮತಿಗಳನ್ನು ತೆರೆ',
'protect-text'                => 'ನೀವು ಇಲ್ಲಿ <strong><nowiki>$1</nowiki></strong> ಪುಟದ ಸಂರಕ್ಷಣೆ ಮಟ್ಟವನ್ನು ವೀಕ್ಷಿಸಬಹುದು ಮತ್ತು ಬದಲಾಯಿಸಬಹುದು.',
'protect-locked-access'       => 'ನಿಮ್ಮ ಖಾತೆಗೆ ಪುಟ ಸಂರಕ್ಷಣ ಮಟ್ಟಗಳನ್ನು ಬದಲಾಯಿಸುವ ಅನುಮತಿ ಇಲ್ಲ. 
ಈ ಪುಟದ ಪ್ರಸಕ್ತ ವಸ್ತುಸ್ಥಿತಿ ಹೀಗಿದೆ: <strong>$1</strong>:',
'protect-cascadeon'           => 'ಈ ಕೆಳಗಿನ ತಡಸಲು ಸಂರಕ್ಷಣೆ (cascading protection) ಹೊಂದಿರುವ {{PLURAL:$1|ಪುಟದಲ್ಲಿ|ಪುಟಗಳಲ್ಲಿ}} ಸೇರ್ಪಡೆ ಆಗಿರುವುದರಿಂದ ಈ ಪುಟವೂ ಸಂರಕ್ಷಿತವಾಗಿದೆ.
ನೀವು ಈ ಪುಟದ ಸಂರಕ್ಷಣೆ ಮಟ್ಟವನ್ನು ಬದಲಾಯಿಸಬಹುದು, ಆದರೆ ಅದು ತಡಸಲು ಸಂರಕ್ಷಣೆಯನ್ನು ಬದಲಾಯಿಸುವುದಿಲ್ಲ.',
'protect-default'             => '(ಸಾಮಾನ್ಯ ಸ್ಥಿತಿ)',
'protect-fallback'            => '"$1" ಅನುಮತಿ ಬೇಕಾಗಿದೆ',
'protect-level-autoconfirmed' => 'ನೋಂದಾವಣೆ ಆಗಿಲ್ಲದ ಸದಸ್ಯರನ್ನು ತಡೆಹಿಡಿ',
'protect-level-sysop'         => 'ನಿರ್ವಾಹಕರು ಮಾತ್ರ',
'protect-summary-cascade'     => 'ತಡಸಲು (cascading)',
'protect-expiring'            => 'ಮುಕ್ತಾಯ $1 (UTC)',
'protect-cascade'             => 'ಈ ಪುಟದಲ್ಲಿ ಸೇರಿಸಲಾಗಿರುವ ಪುಟಗಳನ್ನು ಸಂರಕ್ಷಿಸು (ತಡಸಲು ಸಂರಕ್ಷಣೆ - cascading protection)',
'protect-cantedit'            => 'ನೀವು ಈ ಪುಟದ ಸಂರಕ್ಷಣೆ ಮಟ್ಟವನ್ನು ಬದಲಾಯಿಸುವ ಅನುಮತಿಯನ್ನು ಹೊಂದಿಲ್ಲ.',
'restriction-type'            => 'ಅನುಮತಿ:',
'restriction-level'           => 'ನಿರ್ಬಂಧನೆಯ ಮಟ್ಟ:',
'minimum-size'                => 'ಕನಿಷ್ಠ ಗಾತ್ರ',
'maximum-size'                => 'ಗರಿಷ್ಠ ಗಾತ್ರ:',
'pagesize'                    => '(ಬೈಟ್‍ಗಳು)',

# Restrictions (nouns)
'restriction-edit'   => 'ಸಂಪಾದನೆ',
'restriction-move'   => 'ಸ್ಥಳಾಂತರ',
'restriction-create' => 'ಸೃಷ್ಟಿ',

# Restriction levels
'restriction-level-sysop'         => 'ಪೂರ್ಣವಾಗಿ ಸಂರಕ್ಷಿತ',
'restriction-level-autoconfirmed' => 'ಅರೆ ಸಂರಕ್ಷಿತ',
'restriction-level-all'           => 'ಯಾವುದೇ ಮಟ್ಟ',

# Undelete
'undelete'               => 'ಅಳಿಸಲ್ಪಟ್ಟ ಪುಟಗಳನ್ನು ವೀಕ್ಷಿಸು',
'viewdeletedpage'        => 'ಅಳಿಸಲ್ಪಟ್ಟ ಪುಟಗಳನ್ನು ವೀಕ್ಷಿಸು',
'undeletehistorynoadmin' => 'ಈ ಪುಟವನ್ನು ಅಳಿಸಲಾಗಿದೆ.
ಅಳಿಸುವಿಕೆಯ ಕಾರಣ ಕೆಳಗಿನ ತಾತ್ಪರ್ಯದಲ್ಲಿ ತೋರಲಾಗಿದೆ. ಅಳಿಸುವಿಕೆಗೆ ಮುನ್ನ ಈ ಪುಟವನ್ನು ಸಂಪಾದಿಸಿದ ಬಳಕೆದಾರರ ವಿವರವನ್ನೂ ನೀಡಲಾಗಿದೆ.
ಅಳಿಸಲಾದ ಆವೃತ್ತಿಗಳ ಸಂಪಾದನೆಗಳು ಕೇವಲ ನಿರ್ವಾಹಕರಿಗೆ ಲಭ್ಯ.',
'undelete-nodiff'        => 'ಯಾವ ಪೂರ್ವ ಬದಲಾವಣೆಯೂ ಸಿಗಲಿಲ್ಲ.',
'undeletebtn'            => 'ಹಿಂದೆ ಇದ್ದಂತೆ ಮಾಡು',
'undelete-header'        => 'ಇತ್ತೀಚೆಗೆ ಅಳಿಸಲಾದ ಪುಟಗಳಿಗೆ [[Special:Log/delete|ಅಳಿಸುವಿಕೆ ದಿನಚರಿ]] ಅನ್ನು ನೋಡಿ.',
'undelete-search-box'    => 'ಅಳಿಸಲ್ಪಟ್ಟ ಪುಟಗಳನ್ನು ಹುಡುಕು',
'undelete-search-prefix' => 'ಇದರಿಂದ ಪ್ರಾರಂಭವಾಗುವ ಪುಟಗಳನ್ನು ತೋರು:',
'undelete-search-submit' => 'ಹುಡುಕು',
'undelete-no-results'    => 'ಅಳಿಸುವಿಕೆ ದಾಖಲೆಯಲ್ಲಿ ಹೋಲುವ ಯಾವ ಪುಟಗಳೂ ದೊರಕಲಿಲ್ಲ.',

# Namespace form on various pages
'namespace'      => 'ಹೆಸರಿನ ಬಗೆ:',
'invert'         => 'ಆಯ್ಕೆಯನ್ನು ತಿರುಗಿಸು',
'blanknamespace' => '(ಮುಖ್ಯ)',

# Contributions
'contributions' => 'ಸದಸ್ಯರ ಕಾಣಿಕೆಗಳು',
'mycontris'     => 'ನನ್ನ ಕಾಣಿಕೆಗಳು',
'contribsub2'   => '$1 ($2) ಗೆ',
'uctop'         => ' (ಮೇಲಕ್ಕೆ)',
'month'         => 'ಈ ತಿಂಗಳಿಂದ (ಮತ್ತು ಮುಂಚಿನ):',
'year'          => 'ಈ ವರ್ಷದಿಂದ (ಮತ್ತು ಮುಂಚಿನ):',

'sp-contributions-newbies'     => 'ಹೊಸ ಖಾತೆಗಳ ಕಾಣಿಕೆಗಳನ್ನು ಮಾತ್ರ ತೋರಿಸು',
'sp-contributions-newbies-sub' => 'ಹೊಸ ಖಾತೆಗಳಿಗೆ',
'sp-contributions-blocklog'    => 'ತಡೆಹಿಡಿಯುವಿಕೆ ದಾಖಲೆ',
'sp-contributions-search'      => 'ಸಂಪಾದನೆಗಳನ್ನು ಹುಡುಕು',
'sp-contributions-username'    => 'IP ವಿಳಾಸ ಅಥವ ಬಳಕೆಯ ಹೆಸರು:',
'sp-contributions-submit'      => 'ಹುಡುಕು',

# What links here
'whatlinkshere'            => 'ಇಲ್ಲಿಗೆ ಯಾವ ಸಂಪರ್ಕ ಕೂಡುತ್ತದೆ',
'whatlinkshere-title'      => '"$1" ಪುಟಕ್ಕೆ ಸಂಪರ್ಕ ಹೊಂದಿರುವ ಪುಟಗಳು',
'whatlinkshere-page'       => 'ಪುಟ:',
'linklistsub'              => '(ಸಂಪರ್ಕಗಳ ಪಟ್ಟಿ)',
'linkshere'                => "'''[[:$1]]'''ಗೆ ಈ ಪುಟಗಳು ಸಂಪರ್ಕ ಹೊಂದಿವೆ:",
'nolinkshere'              => "'''[[:$1]]''' ಗೆ ಯಾವ ಪುಟಗಳೂ ಸಂಪರ್ಕ ಹೊಂದಿಲ್ಲ.",
'nolinkshere-ns'           => "ಆಯ್ಕೆ ಮಾಡಿದ ಪುಟಪ್ರಬೇಧದಲ್ಲಿ ಯಾವ ಪುಟವೂ '''[[:$1]]''' ಅಲ್ಲಿಗೆ ಸಂಪರ್ಕ ಹೊಂದಿಲ್ಲ.",
'isredirect'               => 'ಪುನರ್ನಿರ್ದೇಶನ ಪುಟ',
'istemplate'               => 'ಸೇರ್ಪಡೆ',
'whatlinkshere-prev'       => '{{PLURAL:$1|ಹಿಂದಿನ|ಹಿಂದಿನ $1}}',
'whatlinkshere-next'       => '{{PLURAL:$1|ಮುಂದಿನ|ಮುಂದಿನ $1}}',
'whatlinkshere-links'      => '← ಕೊಂಡಿಗಳು',
'whatlinkshere-hideredirs' => '$1 ಪುನರ್ನಿರ್ದೇಶನಗಳು',
'whatlinkshere-hidelinks'  => '$1 ಕೊಂಡಿಗಳು',

# Block/unblock
'blockip'                  => 'ಈ ಸದಸ್ಯನನ್ನು ತಡೆ ಹಿಡಿಯಿರಿ',
'blockip-legend'           => 'ಬಳಕೆದಾರನನ್ನು ತಡೆಹಿಡಿ',
'ipaddress'                => 'IP ವಿಳಾಸ:',
'ipadressorusername'       => 'IP ವಿಳಾಸ ಅಥವ ಬಳಕೆಯ ಹೆಸರು:',
'ipbexpiry'                => 'ಅಂತ್ಯ:',
'ipbreason'                => 'ಕಾರಣ',
'ipbreasonotherlist'       => 'ಇತರ ಕಾರಣ',
'ipbreason-dropdown'       => '*ತಡೆಹಿಡಿಯುವಿಕೆಗೆ ಸಾಧಾರಣ ಕಾರಣಗಳು
** ತಪ್ಪು ಮಾಹಿತಿಯನ್ನು ಸೇರಿಸುವುದು
** ಪುಟದಲ್ಲಿರುವ ಮಾಹಿತಿಯನ್ನು ತೆಗೆಯುವುದು
** ಬಾಹ್ಯ ತಾಣಗಳಿಗೆ ಜಾಹೀರಾತಿಗೆ ಕೊಂಡಿ ಸೇರಿಸುವುದು
** ಪುಟಗಳಲ್ಲಿ ಅರ್ಥವಿಲ್ಲದ ಮಾಹಿತಿ ಸೇರಿಸುವುದು
** ಬೇರೆಯವರನ್ನು ಬೆದರಿಸುವ/ಕಾಡುವ ವರ್ತನೆ
** ಒಂದಕ್ಕಿಂತ ಹೆಚ್ಚು ಖಾತೆಗಳ ದುರುಪಯೋಗ
** ಒಪ್ಪಿಗೆಯಿರದಂತಹ ಬಳಕೆಯ ಹೆಸರು',
'ipbanononly'              => 'ಅನಾಮಧೇಯ ಬಳಕೆದಾರರನ್ನು ಮಾತ್ರ ತಡೆ ಹಿಡಿ',
'ipbcreateaccount'         => 'ಖಾತೆ ಸೃಷ್ಟಿಯನ್ನು ನಿರ್ಬಂಧಿಸು',
'ipbemailban'              => 'ಬಳಕೆದಾರನು ಇ-ಅಂಚೆ ಕಳುಹಿಸುವುದನ್ನು ತಡೆಗಟ್ಟು',
'ipbsubmit'                => 'ಈ ಸದಸ್ಯರನ್ನು ತಡೆಹಿಡಿಯಿರಿ',
'ipbother'                 => 'ಇತರ ಕಾಲಾವಧಿ:',
'ipboptions'               => '೨ ಗಂಟೆಗಳು:2 hours,೧ ದಿನ:1 day,೩ ದಿನಗಳು:3 days,೧ ವಾರ:1 week,೨ ವಾರಗಳು:2 weeks,೧ ತಿಂಗಳು:1 month,೩ ತಿಂಗಳುಗಳು:3 months,೬ ತಿಂಗಳುಗಳು:6 months,೧ ವರ್ಷ:1 year,ಅನಿರ್ಧಿಷ್ಟ:infinite', # display1:time1,display2:time2,...
'ipbotheroption'           => 'ಇತರ',
'ipbotherreason'           => 'ಇತರ/ಹೆಚ್ಚುವರಿ ಕಾರಣ:',
'badipaddress'             => 'ಸರಿಯಿಲ್ಲದ IP ವಿಳಾಸ',
'blockipsuccesssub'        => 'ತಡೆಹಿಡಿಯುವಿಕೆ ಯಶಸ್ವಿಯಾಯಿತು.',
'blockipsuccesstext'       => '"$1" ಐಪಿ ಸಂಖ್ಯೆಯನ್ನು ತಡೆ ಹಿಡಿಯಲಾಗಿದೆ. <br /> ತಡೆಗಳನ್ನು ಪರಿಶೀಲಿಸಲು [[Special:IPBlockList|ತಡೆ ಹಿಡಿಯಲಾಗಿರುವ ಐಪಿ ಸಂಖ್ಯೆಗಳ ಪಟ್ಟಿ]] ನೋಡಿ.',
'ipb-edit-dropdown'        => 'ತಡೆಹಿಡಿಯುವಿಕೆ ಕಾರಣಗಳನ್ನು ಸಂಪಾದಿಸು',
'ipb-unblock-addr'         => '$1 ಖಾತೆಯ ತಡೆಯನ್ನು ತೆಗೆ',
'ipb-unblock'              => 'ಬಳಕೆದಾರರ ಅಥವ IP ವಿಳಾಸದ ತಡೆಯನ್ನು ತೆಗೆ',
'ipb-blocklist-addr'       => '$1 ಖಾತೆಯ ಪ್ರಸಕ್ತ ತಡೆಗಳನ್ನು ವೀಕ್ಷಿಸು',
'ipb-blocklist'            => 'ಅಸ್ಥಿತ್ವದಲ್ಲಿರುವ ತಡೆಗಳನ್ನು ನೋಡು',
'unblockip'                => 'ಬಳಕೆದಾರನ ತಡೆಯನ್ನು ತೆಗೆ',
'ipusubmit'                => 'ಈ ವಿಳಾಸದ ತಡೆಯನ್ನು ತೆಗೆ',
'unblocked'                => '[[User:$1|$1]] ಖಾತೆಯ ತಡೆಯನ್ನು ತೆಗೆಯಲಾಗಿದೆ',
'unblocked-id'             => '$1 ತಡೆಯನ್ನು ತೆಗೆಯಲಾಗಿದೆ',
'ipblocklist'              => 'ನಿರ್ಬಂಧಿಸಲಾಗಿರುವ IP ವಿಳಾಸಗಳು ಹಾಗೂ ಬಳಕೆಯ ಹೆಸರುಗಳು',
'ipblocklist-legend'       => 'ತಡೆಹಿಡಿಯಲಾದ ಬಳಕೆದಾರನನ್ನು ಹುಡುಕು',
'ipblocklist-username'     => 'ಬಳಕೆಯ ಹೆಸರು ಅಥವ IP ವಿಳಾಸ:',
'ipblocklist-submit'       => 'ಹುಡುಕು',
'infiniteblock'            => 'ಅನಂತ',
'anononlyblock'            => 'ಅನಾಮಧೇಯ ಮಾತ್ರ',
'createaccountblock'       => 'ಖಾತೆ ಸೃಷ್ಟಿ ನಿಷೇಧಿಸಲಾಗಿದೆ',
'emailblock'               => 'ಇ-ಅಂಚೆ ತಡೆಹಿಡಿಯಲಾಗಿದೆ',
'ipblocklist-empty'        => 'ತಡೆಗಳ ಪಟ್ಟಿಯು ಖಾಲಿ ಇದೆ.',
'ipblocklist-no-results'   => 'ಕೋರಿದ IP ವಿಳಾಸ ಅಥವ ಬಳಕೆದಾರ ಹೆಸರು ತಡೆಹಿಡಿಯಲಾಗಿಲ್ಲ.',
'blocklink'                => 'ತಡೆ ಹಿಡಿಯಿರಿ',
'unblocklink'              => 'ತಡೆಯನ್ನು ತಗೆ',
'contribslink'             => 'ಕಾಣಿಕೆಗಳು',
'blocklogpage'             => 'ತಡೆಹಿಡಿದ ಸದಸ್ಯರ ದಿನಚರಿ',
'blocklogentry'            => '[[$1]] ಖಾತೆಯನ್ನು $2 $3 ಸಮಯದವರೆಗೆ ತಡೆಹಿಡಿಯಲಾಗಿದೆ',
'unblocklogentry'          => '$1 ಖಾತೆಯ ತಡೆ ತೆಗೆಯಲಾಗಿದೆ',
'block-log-flags-anononly' => 'ಅನಾಮಧೇಯ ಬಳಕೆದಾರರು ಮಾತ್ರ',
'block-log-flags-nocreate' => 'ಖಾತೆ ಸೃಷ್ಟಿ ತಡೆಹಿಡಿಯಲಾಗಿದೆ',
'block-log-flags-noemail'  => 'ಇ-ಅಂಚೆ ತಡೆಹಿಡಿಯಲಾಗಿದೆ',
'ipb_already_blocked'      => '"$1" ಆಗಲೆ ತಡೆ ಹಿಡಿಯಲಾಗಿದೆ',
'proxyblocksuccess'        => 'ಮುಗಿಯಿತು.',

# Developer tools
'lockdb'              => 'ಡೇಟಾಬೇಸ್ ಅನ್ನು ಮುಚ್ಚು',
'unlockdb'            => 'ಡೇಟಾಬೇಸ್ ಅನ್ನು ತೆಗೆ',
'lockdbtext'          => 'ಡೇಟಾಬೇಸ್ ಅನ್ನು ಮುಚ್ಚುವುದರಿಂದ ಎಲ್ಲಾ ಬಳಕೆದಾರರೂ ಪುಟಗಳ ಸಂಪಾದನೆ, ತಮ್ಮ ಪ್ರಾಶಸ್ತ್ಯಗಳ ಬದಲಾವಣೆ, ವೀಕ್ಷಣಾ ಪಟ್ಟಿಗಳ ಸಂಪಾದನೆ, ಮತ್ತು ಇತರ ಡೇಟಾಬೇಸ್‍ನಲ್ಲಿ ಬದಲಾವಣೆಗಳು ಬೇಕಾಗುವ ಕಾರ್ಯಗಳನ್ನು ಮಾಡಲು ಆಗದಂತಾಗುತ್ತದೆ.
ದಯವಿಟ್ಟು ಇದನ್ನು ನೀವು ಮಾಡಬಯಸುವಿರಿ, ಮತ್ತು ಡೇಟಾಬೇಸ್ ಮೇಲಿನ ನಿಮ್ಮ ಕಾರ್ಯಗಳು ಮುಗಿದ ಮೇಲೆ ಅದನ್ನು ಮತ್ತೆ ತೆಗೆಯುವಿರಿ ಎಂದು ಖಾತ್ರಿ ಮಾಡಿ.',
'unlockdbtext'        => 'ಡೇಟಾಬೇಸ್ ಅನ್ನು ತೆಗೆಯುವುದರಿಂದ ಎಲ್ಲಾ ಬಳಕೆದಾರರೂ ಪುಟಗಳ ಸಂಪಾದನೆ, ತಮ್ಮ ಪ್ರಾಶಸ್ತ್ಯಗಳ ಬದಲಾವಣೆ, ವೀಕ್ಷಣಾ ಪಟ್ಟಿಗಳ ಸಂಪಾದನೆ, ಮತ್ತು ಇತರ ಡೇಟಾಬೇಸ್‍ನಲ್ಲಿ ಬದಲಾವಣೆಗಳು ಬೇಕಾಗುವ ಕಾರ್ಯಗಳನ್ನು ಮಾಡಲು ಮತ್ತೆ ಸಾಧ್ಯವಾಗುವಂತೆ ಆಗುತ್ತದೆ.
ದಯವಿಟ್ಟು ಇದನ್ನು ನೀವು ಮಾಡಬಯಸುವಿರಿ ಎಂದು ಖಾತ್ರಿ ಮಾಡಿ.',
'lockconfirm'         => 'ಹೌದು, ನಾನು ಡೇಟಬೇಸ್ ಅನ್ನು ಮುಚ್ಚಬೇಕು.',
'unlockconfirm'       => 'ಹೌದು, ನಾನು ಡೇಟಬೇಸ್ ಅನ್ನು ತೆರೆಯಬೇಕು.',
'lockbtn'             => 'ಡೇಟಾಬೇಸ್ ಅನ್ನು ಮುಚ್ಚು',
'unlockbtn'           => 'ಡೇಟಾಬೇಸ್ ಅನ್ನು ತೆಗೆ',
'lockdbsuccesssub'    => 'ಡೇಟಬೇಸ್ ಮುಚ್ಚುವಿಕೆ ಯಶಸ್ವಿಯಾಯಿತು',
'unlockdbsuccesssub'  => 'ಡೇಟಬೇಸ್ ತೆರೆಯಲ್ಪಟ್ಟಿದೆ',
'unlockdbsuccesstext' => 'ಡೇಟಬೇಸ್ ಅನ್ನು ತೆರೆಯಲಾಗಿದೆ.',
'databasenotlocked'   => 'ಈ ಡೇಟಬೇಸ್ ಮುಚ್ಚಲ್ಪಟ್ಟಿಲ್ಲ.',

# Move page
'move-page'               => '$1 ಪುಟದ ಸ್ಥಳಾಂತರಿಕೆ',
'move-page-legend'        => 'ಪುಟವನ್ನು ಸ್ಥಳಾಂತರಿಸಿ',
'movepagetext'            => "ಈ ಕೆಳಗಿನ ಫಾರ್ಮನ್ನು ಉಪಯೋಗಿಸಿದಲ್ಲಿ ಪುಟವನ್ನು ಪುನರ್ನಾಮಕರಣ ಮಾಡಲಾಗುವುದು ಮತ್ತು ಅದರ ಸಂಪಾದನೆಯ ಇತಿಹಾಸವನ್ನು ಹೊಸ ಹೆಸರಿಗೆ ವರ್ಗಾಯಿಸಲಾಗುವುದು.
ಹಳೆ ಶೀರ್ಷಿಕೆ ಹೊಸ ಶೀರ್ಷಿಕೆಗೆ ಪುನರ್ನಿರ್ದೇಶಿಸಲಾಗುವುದು.
ಹಳೆ ಶೀರ್ಷಿಕೆಗೆ ಇರುವ ಸಂಪರ್ಕಗಳನ್ನು ಬದಲಾಯಿಸಲಾಗುವುದಿಲ್ಲ;
ದಯವಿಟ್ಟು ಹಳೆ ಶೀರ್ಷಿಕೆಗೆ ಪುನರ್ನಿರ್ದೇಶಿತವಾಗಿದ್ದ ಪುಟಗಳನ್ನು ಕೈಯಾರೆ ಹೊಸ ಶೀರ್ಷಿಕೆಗೆ ಬದಲಾಯಿಸಿ.
ಇತರ ಸಂಪರ್ಕಗಳು ಯಾವೂ ಮುರಿದಿಲ್ಲವೆಂದು ಖಚಿತಪಡಿಸುವುದು ನಿಮ್ಮ ಜವಾಬ್ದಾರಿ.

ಗಮನಿಸಿ: ನೀವು ಸೂಚಿಸಿರುವ ಹೊಸ ಶೀರ್ಷಿಕೆಯಡಿಯಲ್ಲಿ ಆಗಲೇ ಪುಟವೊಂದು ಇದ್ದಲ್ಲಿ ಈ ಸ್ಥಳಾಂತರವನ್ನು ಮಾಡಲು ಸಾಮಾನ್ಯವಾಗಿ ''ಆಗುವುದಿಲ್ಲ'' - ಕೇವಲ ಆ ಪುಟ ಖಾಲಿ ಇದ್ದರೆ ಮತ್ತು ಯಾವುದೂ ಸಂಪಾದನೆ ಇತಿಹಾಸವು ಇಲ್ಲದಿದ್ದರೆ ಮಾತ್ರ ಸಾಧ್ಯ.

'''ಎಚ್ಚರಿಕೆ!'''
ಅನೇಕ ಸಂಪರ್ಕಗಳಿರುವ ಪುಟವನ್ನು ನೀವು ಸ್ಥಳಾಂತರಿಸುತ್ತಿರುವುದೇ ಆದರೆ ಇದೊಂದು ದೊಡ್ಡ ಹಾಗು ಅನಿರೀಕ್ಷಿತ ಬದಲಾವಣೆಯಾಗಬಹುದು;
ದಯವಿಟ್ಟು ನೀವು ಮಾಡುತ್ತಿರುವ ಕ್ರಮದ ಪರಿಣಾಮಗಳನ್ನು ಅರಿತಿರುವಿರೆಂದು ಖಾತ್ರಿ ಪಡಿಸಿಕೊಂಡ ನಂತರ ಮುನ್ನಡೆಯಿರಿ.",
'movepagetalktext'        => "ಜೊತೆಗಿನ ಚರ್ಚೆ ಪುಟವೂ ಸ್ಥಳಾಂತರಿಸಲಾಗುವುದು. ಈ ಸ್ಥಳಾಂತರ '''ಆಗದಿರುವ''' ಪ್ರಸಂಗಗಳು:
*ಸ್ಥಳಾಂತರಿಕೆಯ ಹೆಸರಿನಲ್ಲಿ ಆಗಲೇ ಖಾಲಿಯಲ್ಲದ ಒಂದು ಪುಟವು ಇದ್ದಲ್ಲಿ, ಅಥವ
*ಕೆಳಗಿನ ಚೌಕದಲ್ಲಿರುವ tick mark ಅನ್ನು ನೀವು ತಗೆದಲ್ಲಿ. 

ಈ ಪ್ರಸಂಗಗಳಲ್ಲಿ ನೀವು ಸ್ವತಃ ಚರ್ಚೆ ಪುಟವನ್ನು ಸ್ಥಳಾಂತರಿಸಬೇಕು ಅಥವ ಒಂದುಗೂಡಿಸಬೇಕು.",
'movearticle'             => 'ಪುಟವನ್ನು ಸ್ಥಳಾಂತರಿಸಿ',
'movenotallowed'          => 'ನಿಮಗೆ {{SITENAME}} ಅಲ್ಲಿ ಪುಟಗಳನ್ನು ಸ್ಥಳಾಂತರಿಸುವ ಅನುಮತಿ ಇಲ್ಲ.',
'newtitle'                => 'ಈ ಹೊಸ ಶೀರ್ಷಿಕೆಗೆ:',
'move-watch'              => 'ಈ ಪುಟವನ್ನು ವೀಕ್ಷಿಸು',
'movepagebtn'             => 'ಪುಟವನ್ನು ಸ್ಥಳಾಂತರಿಸಿ',
'pagemovedsub'            => 'ಸ್ಥಳಾಂತರಿಸುವಿಕೆ ಯಶಸ್ವಿಯಾಯಿತು',
'movepage-moved'          => '<big>\'\'\'"$1" ಪುಟವನ್ನು "$2" ಹೆಸರಿಗೆ ಸ್ಥಳಾಂತರಿಸಲಾಗಿದೆ\'\'\'</big>', # The two titles are passed in plain text as $3 and $4 to allow additional goodies in the message.
'articleexists'           => 'ಆ ಹೆಸರಿನಲ್ಲಿ ಒಂದು ಪುಟ ಆಗಲೇ ಅಸ್ಥಿತ್ವದಲ್ಲಿದೆ ಅಥವ ನೀವು ಆಯ್ಕೆ ಮಾಡಿರುವ ಹೆಸರು ಇತರ ಕಾರಣಗಳಿಗೆ ಸ್ವೀಕಾರಾರ್ಹವಾಗಿಲ್ಲ.
ದಯವಿಟ್ಟು ಬೇರೆ ಹೆಸರನ್ನು ಆಯ್ಕೆ ಮಾಡಿ.',
'cantmove-titleprotected' => 'ಈ ಜಾಗಕ್ಕೆ ಪುಟವನ್ನು ಸ್ಥಳಾಂತರಿಸಲು ಆಗುವುದಿಲ್ಲ, ಯಾಕೆಂದರೆ ಆ ಶೀರ್ಷಿಕೆಯು ಸೃಷ್ಟಿಯಾಗದಂತೆ ಸಂರಕ್ಷಿತವಾಗಿದೆ',
'talkexists'              => "'''ಪುಟವು ಯಶಸ್ವಿಯಾಗಿ ಸ್ಥಳಾಂತರಿಸಲ್ಪಟ್ಟಿತು, ಆದರೆ ಹೊಸದಾಗಿ ಸ್ಥಳಾಂತರಿಸಲ್ಪಟ್ಟ ಜಾಗದಲ್ಲಿ ಆಗಲೇ ಒಂದು ಚರ್ಚೆ ಪುಟ ಇರುವುದರಿಂದ ಈ ಪುಟದ ಚರ್ಚೆ ಪುಟವನ್ನು ಸ್ಥಳಾಂತರಿಸಲಾಗಲಿಲ್ಲ.
ದಯವಿಟ್ಟು ಕೈಯಾರೆ ಈ ಎರಡು ಪುಟಗಳನ್ನು ಒಂದಾಗಿಸಿ.'''",
'movedto'                 => 'ಸ್ಥಳಾಂತರಿಸಲ್ಪಟ್ಟ ನೆಲೆ',
'movetalk'                => 'ಜೊತೆಗಿನ ಚರ್ಚೆ ಪುಟವನ್ನೂ ಸ್ಥಳಾಂತರಿಸು',
'1movedto2'               => '[[$1]] - [[$2]] ಪುಟಕ್ಕೆ ಸ್ಥಳಾಂತರಿಸಲಾಗಿದೆ',
'1movedto2_redir'         => '[[$1]] - [[$2]] ಪುಟ ರಿಡೈರೆಕ್ಟ್ ಮೂಲಕ ಸ್ಥಳಾಂತರಿಸಲಾಗಿದೆ',
'movelogpage'             => 'ಸ್ಥಳಾಂತರಿಕೆ ದಾಖಲೆ',
'movelogpagetext'         => 'ಸ್ಥಳಾಂತರಿಸಲಾಗಿರುವ ಪುಟಗಳ ಪಟ್ಟಿ ಕೆಳಗಿದೆ.',
'movereason'              => 'ಕಾರಣ',
'revertmove'              => 'ಹಿಂದಿನಂತಾಗಿಸು',
'delete_and_move'         => 'ಅಳಿಸು ಮತ್ತು ಸ್ಥಳಾಂತರಿಸು',
'delete_and_move_text'    => '==ಅಳಿಸುವಿಕೆ ಬೇಕಾಗಿದೆ==
ಸ್ಥಳಾಂತರಿಬೇಕೆಂದಿರುವ ಪುಟ "[[:$1]]" ಆಗಲೆ ಅಸ್ಥಿತ್ವದಲ್ಲಿ ಇದೆ.
ಸ್ಥಳಾಂತರಿಕೆಗೆ ಜಾಗ ಮಾಡಲು ಆ ಪುಟವನ್ನು ಅಳಿಸಬೇಕೆ?',
'delete_and_move_confirm' => 'ಹೌದು, ಪುಟವನ್ನು ಅಳಿಸಿ',
'delete_and_move_reason'  => 'ಸ್ಥಳಾಂತರಿಕೆಗೆ ಜಾಗ ಮಾಡಲು ಪುಟವನ್ನು ಅಳಿಸಲಾಯಿತು',
'selfmove'                => 'ಸ್ಥಳಾಂತರಿಕೆಯ ಮೂಲ ಮತ್ತು ಲಕ್ಷ್ಯ ಪುಟಗಳ ಹೆಸರು ಒಂದೇ ಇದೆ;
ತನ್ನ ಮೇಲೆಯೇ ಪುಟವನ್ನು ಸ್ಥಳಾಂತರಿಸಲು ಆಗುವುದಿಲ್ಲ.',

# Export
'export'            => 'ಪುಟಗಳನ್ನು ರಫ್ತು ಮಾಡಿ',
'exportcuronly'     => 'ಪ್ರಸಕ್ತ ಆವೃತ್ತಿಯನ್ನು ಮಾತ್ರ ಸೇರಿಸು, ಪೂರ್ಣ ಇತಿಹಾಸವನ್ನಲ್ಲ',
'export-submit'     => 'ರಫ್ತು',
'export-addcattext' => 'ಈ ವರ್ಗದಿಂದ ಪುಟಗಳನ್ನು ಸೇರಿಸು:',
'export-addcat'     => 'ಸೇರಿಸು',
'export-download'   => 'ಫೈಲಾಗಿ ಉಳಿಸು',
'export-templates'  => 'ಟೆಂಪ್ಲೇಟುಗಳನ್ನು ಸೇರಿಸು',

# Namespace 8 related
'allmessages'         => 'ಸಂಪರ್ಕ ಸಾಧನದ ಎಲ್ಲ ಸಂದೇಶಗಳು',
'allmessagesname'     => 'ಹೆಸರು',
'allmessagesmodified' => 'ಬದಲಾವಣೆ ಮಾಡಿದ್ದನ್ನು ಮಾತ್ರ ತೋರಿಸು',

# Thumbnails
'thumbnail-more'  => 'ದೊಡ್ಡದಾಗಿಸು',
'filemissing'     => 'ಫೈಲು ಕಾಣೆಯಾಗಿದೆ',
'thumbnail_error' => 'ಮುನ್ನೋಟ ಚಿತ್ರವನ್ನು ಸೃಷ್ಟಿಸುವಲ್ಲಿ ದೋಷ: $1',

# Special:Import
'import'                     => 'ಪುಟಗಳನ್ನು ಅಮದು ಮಾಡಿ',
'import-interwiki-submit'    => 'ಆಮದು',
'import-interwiki-namespace' => 'ಪುಟಗಳನ್ನು ಈ ಪುಟಪ್ರಬೇಧಕ್ಕೆ ವರ್ಗಾಯಿಸು:',
'importstart'                => 'ಪುಟಗಳು ಆಮದಾಗುತ್ತಿದೆ...',
'import-revision-count'      => '$1 {{PLURAL:$1|ಬದಲಾವಣೆ|ಬದಲಾವಣೆಗಳು}}',
'importnopages'              => 'ಆಮದು ಮಾಡಲು ಯಾವ ಪುಟವೂ ಇಲ್ಲ.',
'importfailed'               => 'ಆಮದು ಯಶಸ್ವಿಯಾಗಲಿಲ್ಲ: $1',
'importunknownsource'        => 'ತಿಳಿದಿಲ್ಲದ ಪ್ರಕಾರದ ಆಮದು ಮೂಲ',
'importcantopen'             => 'ಆಮದು ಫೈಲನ್ನು ತೆಗೆಯಲಾಗಲಿಲ್ಲ',
'importbadinterwiki'         => 'ಇಂಟರ್‍ವಿಕಿ ಲಿಂಕ್ ಸರಿಯಾಗಿಲ್ಲ',
'importnotext'               => 'ಖಾಲಿ ಅಥವಾ ಯಾವುದೇ ಶಬ್ಧಗಳಿಲ್ಲ',
'importsuccess'              => 'ಆಮದು ಯಶಸ್ವಿಯಾಯಿತು!',
'import-noarticle'           => 'ಆಮದು ಮಾಡಲು ಯಾವ ಪುಟವೂ ಇಲ್ಲ!',
'import-nonewrevisions'      => 'ಎಲ್ಲಾ ಬದಲಾವಣೆಗಳನ್ನೂ ಮುಂಚೆಯೆ ಆಮದು ಮಾಡಲಾಗಿದೆ.',

# Import log
'importlogpage'                 => 'ಆಮದುಗಳ ದಾಖಲೆ',
'import-logentry-upload'        => 'ಫೈಲು ಅಪ್ಲೋಡ್ ಮೂಲಕ [[$1]] ಅನ್ನು ಆಮದು ಮಾಡಲಾಗಿದೆ',
'import-logentry-upload-detail' => '$1 {{PLURAL:$1|ಬದಲಾವಣೆ|ಬದಲಾವಣೆಗಳು}}',

# Tooltip help for the actions
'tooltip-pt-userpage'             => 'ನನ್ನ ಸದಸ್ಯ ಪುಟ',
'tooltip-pt-anonuserpage'         => 'ನೀವು ಸಂಪಾದನೆ ಮಾಡುತ್ತಿರುವ ipಯ ಬಳಕೆದಾರ ಪುಟ',
'tooltip-pt-mytalk'               => 'ನನ್ನ ಚರ್ಚೆ ಪುಟ',
'tooltip-pt-anontalk'             => 'ಈ ip ವಿಳಾಸದಿಂದ ಮಾಡಲಾದ ಸಂಪಾದನೆಗಳ ಬಗ್ಗೆ ಚರ್ಚೆ',
'tooltip-pt-preferences'          => 'ನನ್ನ ಆಯ್ಕೆಗಳು',
'tooltip-pt-watchlist'            => 'ನೀವು ಬದಲಾವಣೆಗಳ ಮೇಲೆ ನಿಗಾ ವಹಿಸುತ್ತಿರುವ ಪುಟಗಳ ಪಟ್ಟಿ',
'tooltip-pt-mycontris'            => 'ನನ್ನ ಕಾಣಿಕೆಗಳ ಪಟ್ಟಿ',
'tooltip-pt-login'                => 'ನೀವು ಲಾಗ್ ಇನ್ ಆಗಬೇಕೆಂದು ಕೋರುತ್ತೇವೆ, ಆದರೆ ಅದು ಖಡ್ಡಾಯ ಏನು ಅಲ್ಲ.',
'tooltip-pt-logout'               => 'ಲಾಗ್ ಔಟ್',
'tooltip-ca-talk'                 => 'ಮಾಹಿತಿ ಪುಟದ ಬಗ್ಗೆ ಚರ್ಚೆ',
'tooltip-ca-edit'                 => 'ಈ ಪುಟವನ್ನು ನೀವು ಸಂಪಾದಿಸಬಹುದು. ಉಳಿಸುವ ಮುನ್ನ ಮುನ್ನೋಟವನ್ನು ಉಪಯೋಗಿಸಿ.',
'tooltip-ca-addsection'           => 'ಈ ಚರ್ಚೆಗೆ ನಿಮ್ಮ ಅಭಿಪ್ರಾಯವನ್ನು ಸೇರಿಸಿ.',
'tooltip-ca-viewsource'           => 'ಈ ಪುಟ ಸಂರಕ್ಷಿತವಾಗಿದೆ. ಅದರ ಮೂಲವನ್ನು ನೀವು ವೀಕ್ಷಿಸಬಹುದು.',
'tooltip-ca-history'              => 'ಈ ಪುಟದ ಹಳೆಯ ಆವೃತ್ತಿಗಳು.',
'tooltip-ca-protect'              => 'ಈ ಪುಟವನ್ನು ಸಂರಕ್ಷಿಸು',
'tooltip-ca-delete'               => 'ಈ ಪುಟವನ್ನು ಅಳಿಸು',
'tooltip-ca-move'                 => 'ಈ ಪುಟವನ್ನು ಸ್ಥಳಾಂತರಿಸು',
'tooltip-ca-watch'                => 'ಈ ಪುಟವನ್ನು ನಿಮ್ಮ ವೀಕ್ಷಣಾಪಟ್ಟಿಗೆ ಸೇರಿಸಿ',
'tooltip-ca-unwatch'              => 'ಈ ಪುಟವನ್ನು ನಿಮ್ಮ ವೀಕ್ಷಣಾ ಪಟ್ಟಿಯಿಂದ ತೆಗೆ',
'tooltip-search'                  => '{{SITENAME}} ಅನ್ನು ಹುಡುಕಿ',
'tooltip-search-go'               => 'ಇದೇ ಹೆಸರಿನ ಪುಟವಿದ್ದಲ್ಲಿ ಅಲ್ಲಿಗೆ ಹೋಗು',
'tooltip-search-fulltext'         => 'ಈ ಪಠ್ಯವನ್ನು ಹೊಂದಿರುವ ಪುಟಗಳನ್ನು ಹುಡುಕು',
'tooltip-p-logo'                  => 'ಮುಖ್ಯ ಪುಟ',
'tooltip-n-mainpage'              => 'ಮುಖ್ಯ ಪುಟ ನೋಡಿ',
'tooltip-n-portal'                => 'ಯೋಜನೆಯ ಬಗ್ಗೆ, ನೀವು ಏನು ಮಾಡಬಹುದು, ಎಲ್ಲಿ ಇದರ ಬಗ್ಗೆ ತಿಳಿದುಕೊಳ್ಳಬಹುದು',
'tooltip-n-currentevents'         => 'ಪ್ರಸಕ್ತ ಆಗುಹೋಗುಗಳ ಬಗ್ಗೆ ಹಿನ್ನಲೆ ಮಾಹಿತಿ ಪಡೆಯಿರಿ',
'tooltip-n-recentchanges'         => 'ವಿಕಿಯಲ್ಲಿನ ಇತ್ತೀಚಿನ ಬದಲಾವಣೆಗಳ ಪಟ್ಟಿ.',
'tooltip-n-randompage'            => 'ಯದೃಚ್ಛಿಕ ಪುಟವೊಂದನ್ನು ತೋರಿಸು',
'tooltip-n-help'                  => 'ಇದರ ಬಗ್ಗೆ ತಿಳಿದುಕೊಳ್ಳಲು ಜಾಗ.',
'tooltip-t-whatlinkshere'         => 'ಇಲ್ಲಿಗೆ ಸಂಪರ್ಕ ಹೊಂದಿರುವ ಎಲ್ಲಾ ವಿಕಿ ಪುಟಗಳ ಪಟ್ಟಿ',
'tooltip-t-recentchangeslinked'   => 'ಈ ಪುಟದಿಂದ ಸಂಪರ್ಕ ಹೊಂದಿರುವ ಪುಟಗಳಲ್ಲಿನ ಇತ್ತೀಚಿನ ಬದಲಾವಣೆಗಳು',
'tooltip-feed-rss'                => 'ಈ ಪುಟಕ್ಕೆ RSS ಫೀಡು',
'tooltip-feed-atom'               => 'ಈ ಪುಟಕ್ಕೆ Atom ಫೀಡು',
'tooltip-t-contributions'         => 'ಈ ಸದಸ್ಯರ ಕಾಣಿಕೆಗಳ ಪಟ್ಟಿಯನ್ನು ತೋರಿಸು',
'tooltip-t-emailuser'             => 'ಈ ಸದಸ್ಯರಿಗೆ ಇ-ಅಂಚೆಯನ್ನು ಕಳುಹಿಸು',
'tooltip-t-upload'                => 'ಫೈಲನ್ನು ಅಪ್ಲೋಡ್ ಮಾಡಿ',
'tooltip-t-specialpages'          => 'ಎಲ್ಲಾ ವಿಶೇಷ ಪುಟಗಳ ಪಟ್ಟಿ',
'tooltip-t-print'                 => 'ಈ ಪುಟದ ಮುದ್ರಣ ಮಾಡಬಹುದಾದಂತ ಆವೃತ್ತಿ',
'tooltip-t-permalink'             => 'ಪುಟದ ಈ ಆವೃತ್ತಿಗೆ ಶಾಶ್ವತ ಕೊಂಡಿ',
'tooltip-ca-nstab-main'           => 'ಮಾಹಿತಿ ಪುಟವನ್ನು ನೋಡಿ',
'tooltip-ca-nstab-user'           => 'ಸದಸ್ಯರ ಪುಟವನ್ನು ವೀಕ್ಷಿಸು',
'tooltip-ca-nstab-special'        => 'ಇದೊಂದು ವಿಶೇಷ ಪುಟ, ಇದನ್ನು ಯಾರೂ ಸಂಪಾದಿಸಲು ಬರುವುದಿಲ್ಲ',
'tooltip-ca-nstab-project'        => 'ಯೋಜನೆಯ ಪುಟವನ್ನು ನೋಡಿ',
'tooltip-ca-nstab-image'          => 'ಕಡತದ ಪುಟ ವೀಕ್ಷಿಸಿ',
'tooltip-ca-nstab-template'       => 'ಟೆಂಪ್ಲೇಟನ್ನು ವೀಕ್ಷಿಸು',
'tooltip-ca-nstab-help'           => 'ಸಹಾಯ ಪುಟವನ್ನು ವೀಕ್ಷಿಸು',
'tooltip-ca-nstab-category'       => 'ವರ್ಗದ ಪುಟವನ್ನು ನೋಡಿ',
'tooltip-minoredit'               => 'ಇದನ್ನು ಚುಟುಕಾದ ಬದಲಾವಣೆಯೆಂದು ಗುರುತಿಸು',
'tooltip-save'                    => 'ನಿಮ್ಮ ಬದಲಾವಣೆಗಳನ್ನು ಉಳಿಸಿ',
'tooltip-preview'                 => 'ನೀವು ಮಾಡಿದ ಬದಲಾವಣೆಗಳ ಮುನ್ನೋಟ - ದಯವಿಟ್ಟು ಪುಟ ಉಳಿಸುವ ಮುನ್ನ ಇದನ್ನೊಮ್ಮೆ ನೋಡಿ!',
'tooltip-diff'                    => 'ನೀವು ಮಾಡಿದ ಬದಲಾವಣೆಗಳನ್ನು ತೋರುತ್ತದೆ.',
'tooltip-compareselectedversions' => 'ಆರಿಸಿದ ಎರಡು ಆವೃತ್ತಿಗಳ ಮಧ್ಯದ ವ್ಯತ್ಯಾಸಗಳನ್ನು ನೋಡು.',
'tooltip-watch'                   => 'ಈ ಪುಟವನ್ನು ನಿಮ್ಮ ವೀಕ್ಷಣಾ ಪಟ್ಟಿಗೆ ಸೇರಿಸು',
'tooltip-upload'                  => 'ಅಪ್ಲೋಡ್ ಅನ್ನು ಪ್ರಾರಂಭಿಸು',

# Attribution
'anonymous'     => '{{SITENAME}} : ಅನಾಮಧೇಯ ಬಳಕೆದಾರ(ರು)',
'siteuser'      => '{{SITENAME}} ಬಳಕೆದಾರ $1',
'othercontribs' => '$1 ರ ಕೆಲಸವನ್ನು ಆಧರಿಸಿ.',
'others'        => 'ಇತರರು',
'siteusers'     => '{{SITENAME}} ಸದಸ್ಯ(ರು) $1',
'creditspage'   => 'ಪುಟದ ಗೌರವಗಳು',

# Info page
'infosubtitle' => 'ಪುಟದ ಬಗ್ಗೆ ಮಾಹಿತಿ',
'numedits'     => 'ಸಂಪಾದನೆಗಳ ಸಂಖ್ಯೆ (ಪುಟ): $1',
'numtalkedits' => 'ಸಂಪಾದನೆಗಳ ಸಂಖ್ಯೆ (ಚರ್ಚೆ ಪುಟ): $1',
'numwatchers'  => 'ವೀಕ್ಷಿಸುತ್ತಿರುವವರ ಸಂಖ್ಯೆ: $1',

# Math options
'mw_math_png'    => 'ಯಾವಾಗಲೂ PNG ಪ್ರಕಾರ ತೋರಿಸು',
'mw_math_simple' => 'ಸರಳವಾಗಿದ್ದಲ್ಲಿ HTML ಇಲ್ಲದಿದ್ದಲ್ಲಿ PNG',
'mw_math_html'   => 'ಸಾಧ್ಯವಾದಲ್ಲಿ HTML ಇಲ್ಲದಿದ್ದರೆ PNG',

# Image deletion
'deletedrevision'       => 'ಹಳೆ ಆವೃತ್ತಿ $1 ಅನ್ನು ಅಳಿಸಲಾಗಿದೆ',
'filedeleteerror-short' => 'ಈ ಫೈಲನ್ನು ಅಳಿಸುವುದರಲ್ಲಿ ದೋಷ: $1',
'filedeleteerror-long'  => 'ಫೈಲನ್ನು ಅಳಿಸುವಾಗ ಉಂಟಾದ ದೋಷಗಳು:

$1',
'filedelete-missing'    => '"$1" ಫೈಲು ಅಸ್ಥಿತ್ವದಲ್ಲಿ ಇಲ್ಲದಿರುವುದರಿಂದ ಅದನ್ನು ಅಳಿಸಲು ಬರುವುದಿಲ್ಲ.',

# Browsing diffs
'previousdiff' => '← ಹಿಂದಿನ ವ್ಯತ್ಯಾಸ',
'nextdiff'     => 'ಮುಂದಿನ ವ್ಯತ್ಯಾಸ',

# Media information
'thumbsize'            => 'ಕಿರುನೋಟದ ಗಾತ್ರ:',
'widthheightpage'      => '$1×$2, $3 {{PLURAL:$3|ಪುಟ|ಪುಟಗಳು}}',
'file-info'            => '(ಫೈಲಿನ ಗಾತ್ರ: $1, MIME ಪ್ರಕಾರ: $2)',
'file-info-size'       => '($1 × $2 ಚಿತ್ರಬಿಂದು, ಫೈಲಿನ ಗಾತ್ರ: $3, MIME ಪ್ರಕಾರ: $4)',
'file-nohires'         => '<small>ಇದಕ್ಕಿಂತ ಹೆಚ್ಚಿನ ವಿವರವಾದ ನೋಟ ಇಲ್ಲ.</small>',
'svg-long-desc'        => '(SVG ಫೈಲು, ಸುಮಾರಾಗಿ $1 × $2 ಚಿತ್ರಬಿಂದುಗಳು, ಫೈಲಿನ ಗಾತ್ರ: $3)',
'show-big-image'       => 'ಅತಿ ಹೆಚ್ಚು ವಿವರವಾದ ನೋಟ',
'show-big-image-thumb' => '<small>ಈ ಮುನ್ನೋಟದ ಅಳತೆ: $1 × $2 ಚಿತ್ರಬಿಂದುಗಳು</small>',

# Special:NewImages
'newimages'             => 'ಹೊಸ ಫೈಲುಗಳ ಪ್ರದರ್ಶನ',
'imagelisttext'         => "ಕೆಳಗೆ ಇರುವುದು '''$1''' {{PLURAL:$1|ಫೈಲಿನ|ಫೈಲುಗಳ}} ಪಟ್ಟಿ, $2 ಏರ್ಪಾಟಾಗಿದೆ.",
'newimages-summary'     => 'ಈ ವಿಶೇಷ ಪುಟವು ಕೊನೆಯದಾಗಿ ಅಪ್ಲೋಡ್ ಆಗಿರುವ ಫೈಲುಗಳನ್ನು ತೋರುತ್ತದೆ',
'showhidebots'          => '($1 ಬಾಟ್‍ಗಳು)',
'noimages'              => 'ನೋಡಲು ಏನೂ ಇಲ್ಲ.',
'ilsubmit'              => 'ಹುಡುಕು',
'bydate'                => 'ದಿನಾಂಕಕ್ಕನುಗುಣವಾಗಿ',
'sp-newimages-showfrom' => '$2, $1 ಇಂದ ಪ್ರಾರಂಭಿಸಿ ಹೊಸ ಫೈಲುಗಳನ್ನು ತೋರು',

# Bad image list
'bad_image_list' => 'ವ್ಯವಸ್ಥೆಯ ಆಕಾರ ಈ ರೀತಿ:

ಪಟ್ಟಿಯಲ್ಲಿರುವ ದಾಖಲೆಗಳನ್ನು (* ಇಂದ ಪ್ರಾರಂಭವಾಗುವ ಸಾಲುಗಳು) ಮಾತ್ರ ಪರಿಗಣಿಸಲಾಗುತ್ತದೆ.
ಪ್ರತಿ ಸಾಲಿನ ಮೊದಲ ಕೊಂಡಿಯು ಒಂದು ದೋಷಯುಕ್ತ ಫೈಲಿಗೆ ಕೊಂಡಿಯಾಗಿರಬೇಕು.
ಅದೇ ಸಾಲಿನ ಮುಂದಿನ ಎಲ್ಲಾ ಕೊಂಡಿಗಳನ್ನು ಪರಿಗಣನೆಯಿಂದ ವಿನಾಯತಿ ಮಾಡಲಾಗುತ್ತದೆ, ಅಂದರೆ ಎಲ್ಲಿ ಪುಟಗಳ ಒಳಗೆ ಫೈಲು ಇರುತ್ತದೆಯೊ ಅಲ್ಲಿ.',

# Metadata
'metadata'          => 'ಮೇಲ್ದರ್ಜೆ ಮಾಹಿತಿ',
'metadata-help'     => 'ಈ ಫೈಲಿನಲ್ಲಿ ಹೆಚ್ಚಿನ ಮಾಹಿತಿ ಇದೆ. ಪ್ರಾಯಶಃ ಫೈಲನ್ನು ಸೃಷ್ಟಿಸಲು ಉಪಯೋಗಿಸಲಾದ ಡಿಜಿಟಲ್ ಕ್ಯಾಮೆರದಿಂದ ಅಥವ ಸ್ಕ್ಯಾನರ್ ಇಂದ ಈ ಮಾಹಿತಿ ಸೇರಿಸಲ್ಪಟ್ಟಿದೆ.
ಮೂಲಪ್ರತಿಯಿಂದ ಈ ಫೈಲು ಮಾರ್ಪಾಟಾಗಿದ್ದಲ್ಲಿ, ಈ ಮಾಹಿತಿ ಮಾರ್ಪಟ್ಟ ಫೈಲಿನ ವಿವರಗಳಿಗೆ ಸರಿಯಾಗಿ ಹೊಂದದೆ ಇರಬಹುದು.',
'metadata-expand'   => 'ವಿಸ್ತಾರವಾದ ವಿವರಗಳನ್ನು ತೋರಿಸು',
'metadata-collapse' => 'ವಿಸ್ತಾರವಾದ ವಿವರಗಳನ್ನು ಅಡಗಿಸು',
'metadata-fields'   => 'ಈ ಸಂದೇಶದಲ್ಲಿ ಪಟ್ಟಿ ಮಾಡಲಾಗಿರುವ EXIF ಮೇಲ್ದರ್ಜೆ ಮಾಹಿತಿ ಚಿತ್ರ ಪುಟದಲ್ಲಿ ಸೇರಿಸಲಾಗುತ್ತದೆ. ಪುಟದಲ್ಲಿ ಮೇಲ್ದರ್ಜೆ ಮಾಹಿತಿ ಪಟ್ಟಿಯನ್ನು ತೆರೆದಾಗ ಇವು ಕಾಣುತ್ತದೆ.
ಉಳಿದವುಗಳು ಮೂಲಸ್ಥಿತಿಯಲ್ಲಿ ಅಗೋಚರವಾಗಿರುತ್ತವೆ.
* make
* model
* datetimeoriginal
* exposuretime
* fnumber
* focallength', # Do not translate list items

# EXIF tags
'exif-imagewidth'                => 'ಅಗಲ',
'exif-imagelength'               => 'ಎತ್ತರ',
'exif-bitspersample'             => 'ಪ್ರತಿ ಭಾಗಕ್ಕಿರುವ ಬಿಟ್‍ಗಳು',
'exif-compression'               => 'ಕುಗ್ಗಿಸಲು ಉಪಯೋಗಿಸಿರುವ ಪ್ರಕಾರ',
'exif-photometricinterpretation' => 'ಚಿತ್ರಬಿಂದು ರಚನೆ',
'exif-ycbcrpositioning'          => 'Y ಮತ್ತು C ಸ್ಥಾನ',
'exif-datetime'                  => 'ಫೈಲು ಬದಲಾದ ದಿನಾಂಕ ಮತ್ತು ಕಾಲ',
'exif-imagedescription'          => 'ಚಿತ್ರದ ಶೀರ್ಷಿಕೆ',
'exif-make'                      => 'ಕ್ಯಾಮೆರಾದ ತಯಾರಕರು',
'exif-model'                     => 'ಕ್ಯಾಮೆರಾ ಮಾದರಿ',
'exif-software'                  => 'ಉಪಯೋಗಿಸಲ್ಪಟ್ಟ ತಂತ್ರಾಂಶ',
'exif-artist'                    => 'ಕರ್ತೃ',
'exif-copyright'                 => 'ಕೃತಿಸ್ವಾಮ್ಯತೆಯನ್ನು ಹೊಂದಿರುವವರು',
'exif-exifversion'               => 'Exif ಆವೃತ್ತಿ',
'exif-pixelydimension'           => 'ಸಿಂಧುವಾದ ಚಿತ್ರದ ಅಗಲ',
'exif-pixelxdimension'           => 'ಸಿಂಧುವಾದ ಚಿತ್ರದ ಎತ್ತರ',
'exif-makernote'                 => 'ತಯಾರಕರ ಟಿಪ್ಪಣಿಗಳು',
'exif-usercomment'               => 'ಬಳಕೆದಾರನ ಟಿಪ್ಪಣಿ',
'exif-relatedsoundfile'          => 'ಸಂಬಂಧಿತ ಧ್ವನಿ ಫೈಲು',
'exif-datetimeoriginal'          => 'ಮಾಹಿತಿ ಸೃಷ್ಟಿಯಾದ ದಿನಾಂಕ ಮತ್ತು ಕಾಲ',
'exif-exposuretime-format'       => '$1 ಕ್ಷಣ ($2)',
'exif-fnumber'                   => 'F ಸಂಖ್ಯೆ',
'exif-brightnessvalue'           => 'ಪ್ರಕಾಶತೆ',
'exif-lightsource'               => 'ಬೆಳಕಿನ ಮೂಲ',
'exif-filesource'                => 'ಫೈಲಿನ ಮೂಲ',
'exif-gpsaltitude'               => 'ಎತ್ತರ',
'exif-gpstimestamp'              => 'GPS ಕಾಲ (ಅಣು ಗಡಿಯಾರ)',
'exif-gpssatellites'             => 'ಅಳತೆಗೆ ಉಪಯೋಗಿಸಲಾದ ಉಪಗ್ರಹಗಳು',
'exif-gpsmeasuremode'            => 'ಅಳತೆಯ ವಿಧ',
'exif-gpsspeedref'               => 'ವೇಗದ ಘಟಕ',
'exif-gpsareainformation'        => 'GPS ಪ್ರದೇಶದ ಹೆಸರು',
'exif-gpsdatestamp'              => 'GPS ದಿನಾಂಕ',

'exif-unknowndate' => 'ದಿನಾಂಕ ತಿಳಿದಿಲ್ಲ',

'exif-orientation-3' => '180° ತಿರುಗಿಸಲ್ಪಟ್ಟಿದೆ', # 0th row: bottom; 0th column: right

'exif-componentsconfiguration-0' => 'ಅಸ್ಥಿತ್ವದಲ್ಲಿ ಇಲ್ಲ',

'exif-meteringmode-0'   => 'ತಿಳಿದಿಲ್ಲ',
'exif-meteringmode-1'   => 'ಸರಾಸರಿ',
'exif-meteringmode-255' => 'ಇತರ',

'exif-lightsource-0'   => 'ತಿಳಿದಿಲ್ಲ',
'exif-lightsource-1'   => 'ದಿನದ ಬೆಳಕು',
'exif-lightsource-3'   => 'ಟಂಗ್ಸ್ಟನ್ (ಪ್ರಕಾಶಮಾನ ಬೆಳಕು)',
'exif-lightsource-11'  => 'ನೆರಳು',
'exif-lightsource-17'  => 'ನಿರ್ದಿಷ್ಟ ಬೆಳಕು A',
'exif-lightsource-18'  => 'ನಿರ್ದಿಷ್ಟ ಬೆಳಕು B',
'exif-lightsource-19'  => 'ನಿರ್ದಿಷ್ಟ ಬೆಳಕು C',
'exif-lightsource-255' => 'ಇತರೆ ಬೆಳಕಿನ ಮೂಲ',

'exif-focalplaneresolutionunit-2' => 'ಇಂಚುಗಳು',

'exif-scenetype-1' => 'ನೇರವಾಗಿ ಛಾಯಾಚಿತ್ರಣಗೊಂಡ ಒಂದು ಚಿತ್ರ',

'exif-gaincontrol-0' => 'ಯಾವುದೂ ಇಲ್ಲ',

'exif-gpsstatus-a' => 'ಅಳತೆ ಪ್ರಗತಿಯಲ್ಲಿದೆ',

'exif-gpsmeasuremode-2' => '೨-ಆಯಾಮಗಳಲ್ಲಿ ಅಳತೆ',
'exif-gpsmeasuremode-3' => '೩-ಆಯಾಮಗಳಲ್ಲಿ ಅಳತೆ',

# Pseudotags used for GPSSpeedRef and GPSDestDistanceRef
'exif-gpsspeed-k' => 'ಪ್ರತಿ ಗಂಟೆಗೆ ಕಿಲೊಮೀಟರ್‍ಗಳು',
'exif-gpsspeed-m' => 'ಪ್ರತಿ ಗಂಟೆಗೆ ಮೈಲಿಗಳು',
'exif-gpsspeed-n' => 'ಕ್ನಾಟ್‍ಗಳು',

# Pseudotags used for GPSTrackRef, GPSImgDirectionRef and GPSDestBearingRef
'exif-gpsdirection-t' => 'ನಿಜ ದಿಕ್ಕು',
'exif-gpsdirection-m' => 'ಆಯಸ್ಕಾಂತೀಯ ದಿಕ್ಕು',

# External editor support
'edit-externally'      => 'ಬಾಹ್ಯ ತಂತ್ರಾಂಶವನ್ನು ಉಪಯೋಗಿಸಿ ಇದನ್ನು ಸಂಪಾದಿಸಿ',
'edit-externally-help' => 'ಹೆಚ್ಚಿನ ಮಾಹಿತಿಗೆ [http://www.mediawiki.org/wiki/Manual:External_editors ಸ್ಥಾಪನೆಯ ನಿರ್ದೇಶಗಳನ್ನು] ನೋಡಿ.',

# 'all' in various places, this might be different for inflected languages
'recentchangesall' => 'ಎಲ್ಲಾ',
'imagelistall'     => 'ಎಲ್ಲಾ',
'watchlistall2'    => 'ಎಲ್ಲಾ',
'namespacesall'    => 'ಎಲ್ಲಾ',
'monthsall'        => 'ಎಲ್ಲಾ',

# E-mail address confirmation
'confirmemail'             => 'ಇ-ಅಂಚೆ ವಿಳಾಸವನ್ನು ಖಾತ್ರಿ ಮಾಡಿ',
'confirmemail_noemail'     => 'ನಿಮ್ಮ [[Special:Preferences|ಬಳಕೆದಾರ ಪ್ರಾಶಸ್ತ್ಯಗಳಲ್ಲಿ]] ಸರಿಯಾದ ಇ-ಅಂಚೆ ವಿಳಾಸವಿಲ್ಲ.',
'confirmemail_pending'     => '<div class="error">ನಿಮಗೆ ಧೃಡೀಕರಣ ಕೋಡ್ ಒಂದನ್ನು ಆಗಲೆ ಇ-ಅಂಚೆಯ ಮೂಲಕ ಕಳುಹಿಸಲಾಗಿದೆ;
ನೀವು ಇತ್ತೀಚೆಗೆ ಖಾತೆಯನ್ನು ಸೃಷ್ಟಿಸಿದ್ದಲ್ಲಿ, ಸ್ವಲ್ಪ ನಿಮಿಷಗಳು ಕಾಯ್ದು ಅದು ತಲುಪಿಲ್ಲವೆಂದು ಖಾತ್ರಿ ಮಾಡಿಕೊಂಡ ನಂತರ ಹೊಸ ಕೋಡ್ ಒಂದನ್ನು ಕೋರಿ. </div>',
'confirmemail_send'        => 'ಧೃಡೀಕರಣ ಕೋಡ್ ಒಂದನ್ನು ಇ-ಅಂಚೆ ಮೂಲಕ ರವಾನಿಸಿ',
'confirmemail_sent'        => 'ಧೃಡೀಕರಣ ಇ-ಅಂಚೆ ಕಳುಹಿಸಲಾಯಿತು.',
'confirmemail_oncreate'    => 'ನಿಮ್ಮ ಇ-ಅಂಚೆ ವಿಳಾಸಕ್ಕೆ ಧೃಡೀಕರಣ ಕೋಡ್ ಒಂದನ್ನು ಕಳುಹಿಸಲಾಗಿದೆ.
ನೀವು ಲಾಗ್ ಇನ್ ಆಗಲು ಆ ಕೋಡ್ ಬೇಕಿಲ್ಲ, ಆದರೆ ಈ ವಿಕಿಯಲ್ಲಿ ಇ-ಅಂಚೆ ಸಂಬಂಧಿಸಿದ ಸೌಲಭ್ಯಗಳನ್ನು ಉಪಯೋಗಿಸಲು ಅದನ್ನು ನೀವು ನೀಡಬೇಕು.',
'confirmemail_sendfailed'  => 'ಧೃಡೀಕರಣ ಅಂಚೆಯನ್ನು ಕಳುಹಿಸಲು ಆಗಲಿಲ್ಲ.
ದಯವಿಟ್ಟು ವಿಳಾಸದಲ್ಲಿ ತಪ್ಪುಗಳಿಲ್ಲವೆಂದು ಖಾತ್ರಿ ಮಾಡಿ.

ಅಂಚೆ ವ್ಯವಸ್ಥೆ ಹಿಂದಿರುಗಿಸಿದ ಸಂದೇಶ: $1',
'confirmemail_invalid'     => 'ಸರಿಯಿಲ್ಲದ ಧೃಡೀಕರಣ ಕೋಡ್.
ಆ ಕೋಡ್ ಗತಿಸಿರಬಹುದು.',
'confirmemail_needlogin'   => 'ನಿಮ್ಮ ಇ-ಅಂಚೆ ವಿಳಾಸವನ್ನು ಧೃಡೀಕರಿಸಲು ನೀವು $1 ಮಾಡಬೇಕು.',
'confirmemail_success'     => 'ನಿಮ್ಮ ಇ-ಅಂಚೆ ವಿಳಾಸ ಖಾತ್ರಿಗೊಂಡಿದೆ. ಈಗ ನೀವು ಲಾಗಿನ್ ಆಗಿ ವಿಕಿಯನ್ನು ಉಪಯೋಗಿಸಬಹುದು.',
'confirmemail_loggedin'    => 'ನಿಮ್ಮ ಇ-ಅಂಚೆ ವಿಳಾಸ ಈಗ ಖಾತ್ರಿಗೊಂಡಿದೆ.',
'confirmemail_error'       => 'ನಿಮ್ಮ ಧೃಡೀಕರಣವನ್ನು ಉಳಿಸುವಲ್ಲಿ ಏನೋ ದೋಷವಾಯಿತು.',
'confirmemail_subject'     => '{{SITENAME}} ಇ-ಅಂಚೆ ವಿಳಾಸ ಧೃಡೀಕರಣ',
'confirmemail_body'        => 'ಈ ಇ-ಅಂಚೆ ವಿಳಾಸದೊಂದಿಗೆ {{SITENAME}} ಅಲ್ಲಿ, ಯಾರೊ (ಪ್ರಾಯಶಃ ನೀವು) $1 ಐಪಿ ವಿಳಾಸದಿಂದ , 
"$2" ಖಾತೆಯನ್ನು ತೆರೆದಿದ್ದಾರೆ.

ಈ ಖಾತೆಯು ನಿಮ್ಮದೇ ಎಂದು ಧೃಡೀಕರಿಸಲು ಮತ್ತು ಆ ಖಾತೆಯಲ್ಲಿ ಇ-ಅಂಚೆ ಸಂಬಂಧಿತ ಸೌಲಭ್ಯಗಳನ್ನು ಕ್ರಿಯಾತ್ಮಕಗೊಳಿಸಲು,
ನಿಮ್ಮ ಬ್ರೌಸರ್‍ನಲ್ಲಿ ಈ ಕೆಳಗಿನ ಕೊಂಡಿಯನ್ನು ತೆಗೆಯಿರಿ:

$3

ನೀವು ಈ ಖಾತೆಯನ್ನು *ತೆಗೆದಿಲ್ಲದಿದ್ದರೆ*, ಈ ಇ-ಅಂಚೆ ಧೃಡೀಕರಣವನ್ನು ರದ್ದುಮಾಡಲು
ಈ ಕೆಳಗಿನ ಕೊಂಡಿಯನ್ನು ಉಪಯೋಗಿಸಿ:

$5

ಈ ಧೃಡೀಕರಣ ಕೋಡ್ $4 ಹೊತ್ತಿಗೆ ಗತಿಸುತ್ತದೆ.',
'confirmemail_invalidated' => 'ಇ-ಅಂಚೆ ಧೃಡೀಕರಣ ರದ್ದು ಮಾಡಲಾಯಿತು',
'invalidateemail'          => 'ಇ-ಅಂಚೆ ಧೃಡೀಕರಣವನ್ನು ರದ್ದು ಮಾಡಿ',

# Scary transclusion
'scarytranscludetoolong' => '[URL ತುಂಬ ಉದ್ದವಾಗಿದೆ; ಕ್ಷಮಿಸಿ]',

# Trackbacks
'trackbackremove' => ' ([$1 ಅಳಿಸು])',

# Delete conflict
'deletedwhileediting' => 'ಸೂಚನೆ: ನೀವು ಸಂಪಾದನೆ ಪ್ರಾರಂಭಿಸಿದ ನಂತರ ಈ ಪುಟವನ್ನು ಅಳಿಸಲಾಗಿದೆ!',
'confirmrecreate'     => "ಸದಸ್ಯ [[User:$1|$1]] ([[User talk:$1|ಚರ್ಚೆ]]) ನೀವು ಸಂಪಾದನೆ ಶುರು ಮಾಡಿದ ಮೇಲೆ ಕೆಳಗಿನ ಕಾರಣ ನೀಡಿ ಈ ಪುಟವನ್ನು ಅಳಿಸಿದ್ದಾರೆ:
: ''$2''
ದಯವಿಟ್ಟು ಈ ಪುಟವನ್ನು ನೀವು ಪುನಃ ಸೃಷ್ಟಿಸಬೇಕೆಂದಿರುವಿರಿ ಎಂದು ಧೃಡೀಕರಿಸಿ.",
'recreate'            => 'ಪುನಃ ಸೃಷ್ಟಿಸು',

# HTML dump
'redirectingto' => '[[:$1]] ಪುಟಕ್ಕೆ ಪುನರ್ನಿರ್ದೇಶಿತವಾಗುತ್ತಿದೆ...',

# AJAX search
'searchcontaining' => "''$1'' ಅನ್ನು ಹೊಂದಿರುವ ಪುಟಗಳನ್ನು ಹುಡುಕು.",
'searchnamed'      => "''$1'' ಎಂದು ಹೆಸರಿಸಲಾದ ಪುಟಗಳನ್ನು ಹುಡುಕು.",
'articletitles'    => "''$1'' ಇಂದ ಪ್ರಾರಂಭವಾಗುವ ಪುಟಗಳು",
'hideresults'      => 'ಫಲಿತಾಂಶಗಳನ್ನು ಅಡಗಿಸು',
'useajaxsearch'    => 'AJAX ಹುಡುಕಾಟವನ್ನು ಉಪಯೋಗಿಸಿ',

# Multipage image navigation
'imgmultipageprev' => '← ಹಿಂದಿನ ಪುಟ',
'imgmultipagenext' => 'ಮುಂದಿನ ಪುಟ →',
'imgmultigo'       => 'ಹೋಗು!',

# Table pager
'ascending_abbrev'         => 'ಏರು',
'descending_abbrev'        => 'ಇಳಿ',
'table_pager_next'         => 'ಮುಂದಿನ ಪುಟ',
'table_pager_prev'         => 'ಹಿಂದಿನ ಪುಟ',
'table_pager_first'        => 'ಮೊದಲ ಪುಟ',
'table_pager_last'         => 'ಕೊನೆಯ ಪುಟ',
'table_pager_limit'        => 'ಪ್ರತಿ ಪುಟಕ್ಕೆ $1 ಅಂಶಗಳನ್ನು ತೋರಿಸು',
'table_pager_limit_submit' => 'ಹೋಗು',
'table_pager_empty'        => 'ಯಾವ ಫಲಿತಾಂಶಗಳೂ ಇಲ್ಲ',

# Auto-summaries
'autosumm-blank'   => 'ಪುಟದಲ್ಲಿರುವ ಎಲ್ಲಾ ಮಾಹಿತಿಯನ್ನೂ ತಗೆಯುತ್ತಿರುವೆ',
'autosumm-replace' => "ಪುಟದ ಮಾಹಿತಿ ತಗೆದು '$1' ಎಂದು ಬರೆಯಲಾಗಿದೆ",
'autoredircomment' => '[[$1]] ಪುಟಕ್ಕೆ ಪುನರ್ನಿರ್ದೇಶನ',
'autosumm-new'     => 'ಹೊಸ ಪುಟ: $1',

# Friendlier slave lag warnings
'lag-warn-normal' => '$1 {{PLURAL:$1|ಕ್ಷಣಕ್ಕಿಂತ|ಕ್ಷಣಗಳಿಗಿಂತ}} ಹೊಸದಾದ ಬದಲಾವಣೆಗಳು ಈ ಪಟ್ಟಿಯಲ್ಲಿ ತೋರದೆ ಇರಬಹುದು.',

# Watchlist editor
'watchlistedit-numitems'       => 'ಚರ್ಚೆ ಪುಟಗಳನ್ನು ಹೊರತುಪಡಿಸಿ, ನಿಮ್ಮ ವೀಕ್ಷಣಾಪಟ್ಟಿಯಲ್ಲಿ {{PLURAL:$1|೧ ಶೀರ್ಷಿಕೆ ಇದೆ|$1 ಶೀರ್ಷಿಕೆಗಳು ಇವೆ}}.',
'watchlistedit-noitems'        => 'ನಿಮ್ಮ ವೀಕ್ಷಣಾಪಟ್ಟಿಯಲ್ಲಿ ಯಾವುದೂ ಪುಟಗಳಿಲ್ಲ.',
'watchlistedit-normal-title'   => 'ವೀಕ್ಷಣಾಪಟ್ಟಿಯನ್ನು ಸಂಪಾದಿಸು',
'watchlistedit-normal-legend'  => 'ವೀಕ್ಷಣಾಪಟ್ಟಿಯಿಂದ ಶೀರ್ಷಿಕೆಗಳನ್ನು ತೆಗೆ',
'watchlistedit-normal-explain' => 'ನಿಮ್ಮ ವೀಕ್ಷಣಾಪಟ್ಟಿಯಲ್ಲಿ ಇರುವ ಶೀರ್ಷಿಕೆಗಳನ್ನು ಕೆಳಗೆ ತೋರಿಸಲಾಗಿದೆ.
ಯಾವುದೇ ಶೀರ್ಷಿಕೆಯನ್ನು ತಗೆಯಲು, ಅದರ ಪಕ್ಕದಲ್ಲಿರುವ ಚೌಕವನ್ನು ಗುರುತು ಮಾಡಿ ಮತ್ತು "ಶೀರ್ಷಿಕೆಗಳನ್ನು ತೆಗೆ" ಗುಂಡಿಯನ್ನು ಒತ್ತಿ.
ನೀವು ವೀಕ್ಷಣಾಪಟ್ಟಿಯನ್ನು [[Special:Watchlist/raw|ನೇರವಾಗಿ ಸಂಪಾದಿಸಬಹುದು]] ಕೂಡ.',
'watchlistedit-normal-submit'  => 'ಶೀರ್ಷಿಕೆಗಳನ್ನು ತೆಗೆ',
'watchlistedit-normal-done'    => 'ನಿಮ್ಮ ವೀಕ್ಷಣಾಪಟ್ಟಿಯಿಂದ {{PLURAL:$1|೧ ಶೀರ್ಷಿಕೆಯನ್ನು|$1 ಶೀರ್ಷಿಕೆಗಳನ್ನು}} ತೆಗೆಯಲಾಯಿತು:',
'watchlistedit-raw-title'      => 'ಮೂಲ ವೀಕ್ಷಣಾಪಟ್ಟಿಯನ್ನು ಸಂಪಾದಿಸು',
'watchlistedit-raw-legend'     => 'ಮೂಲ ವೀಕ್ಷಣಾಪಟ್ಟಿಯನ್ನು ಸಂಪಾದಿಸು',
'watchlistedit-raw-titles'     => 'ಶೀರ್ಷಿಕೆಗಳು:',
'watchlistedit-raw-added'      => '{{PLURAL:$1|೧ ಶೀರ್ಷಿಕೆಯನ್ನು|$1 ಶೀರ್ಷಿಕೆಗಳನ್ನು}} ಸೇರಿಸಲಾಯಿತು:',
'watchlistedit-raw-removed'    => '{{PLURAL:$1|೧ ಶೀರ್ಷಿಕೆಯನ್ನು|$1 ಶೀರ್ಷಿಕೆಗಳನ್ನು}} ತೆಗೆಯಲಾಯಿತು:',

# Watchlist editing tools
'watchlisttools-view' => 'ಸೂಚಿಸಲ್ಪಟ್ಟ ಬದಲಾವಣೆಗಳನ್ನು ವೀಕ್ಷಿಸಿ',
'watchlisttools-edit' => 'ವೀಕ್ಷಣಾಪಟ್ಟಿಯನ್ನು ನೋಡು ಮತ್ತು ಸಂಪಾದಿಸು',
'watchlisttools-raw'  => 'ಮೂಲ ವೀಕ್ಷಣಾಪಟ್ಟಿಯನ್ನು ಸಂಪಾದಿಸು',

# Special:Version
'version'                  => 'ಆವೃತ್ತಿ', # Not used as normal message but as header for the special page itself
'version-specialpages'     => 'ವಿಶೇಷ ಪುಟಗಳು',
'version-other'            => 'ಇತರ',
'version-version'          => 'ಆವೃತ್ತಿ',
'version-software'         => 'ಸಂಸ್ಥಾಪಿಸಲಾಗಿರುವ ತಂತ್ರಾಂಶ',
'version-software-version' => 'ಆವೃತ್ತಿ',

# Special:FilePath
'filepath'      => 'ಫೈಲಿನ ಮಾರ್ಗ',
'filepath-page' => 'ಫೈಲು:',

# Special:FileDuplicateSearch
'fileduplicatesearch'          => 'ದ್ವಿಪ್ರತಿ ಫೈಲುಗಳಿಗೆ ಹುಡುಕು',
'fileduplicatesearch-legend'   => 'ದ್ವಿಪ್ರತಿಯನ್ನು ಹುಡುಕು',
'fileduplicatesearch-filename' => 'ಫೈಲಿನ ಹೆಸರು:',
'fileduplicatesearch-submit'   => 'ಹುಡುಕು',
'fileduplicatesearch-info'     => '$1 × $2 ಚಿತ್ರಬಿಂದು<br />ಫೈಲಿನ ಗಾತ್ರ: $3<br />MIME ಪ್ರಕಾರ: $4',
'fileduplicatesearch-result-1' => '"$1" ಫೈಲಿಗೆ ಯಾವ ಅವಳಿ ದ್ವಿಪ್ರತಿಗಳೂ ಇಲ್ಲ.',
'fileduplicatesearch-result-n' => '"$1" ಫೈಲು {{PLURAL:$2|೧ ದ್ವಿಪ್ರತಿಯನ್ನು|$2 ದ್ವಿಪ್ರತಿಗಳನ್ನು}} ಹೊಂದಿದೆ.',

# Special:SpecialPages
'specialpages'                   => 'ವಿಶೇಷ ಪುಟಗಳು',
'specialpages-group-maintenance' => 'ಸಲಹುವಿಕೆ ವರದಿಗಳು',
'specialpages-group-other'       => 'ಇತರ ವಿಶೇಷ ಪುಟಗಳು',
'specialpages-group-login'       => 'ಲಾಗ್ ಇನ್ / ಖಾತೆ ಸೃಷ್ಟಿಸಿ',
'specialpages-group-changes'     => 'ಇತ್ತೀಚಿನ ಬದಲಾವಣೆಗಳು ಮತ್ತು ದಾಖಲೆಗಳು',
'specialpages-group-media'       => 'ಮೀಡಿಯ ವರದಿಗಳು ಮತ್ತು ಅಪ್ಲೋಡ್‍ಗಳು',
'specialpages-group-users'       => 'ಬಳಕೆದಾರರು ಮತ್ತು ಹಕ್ಕುಗಳು',
'specialpages-group-highuse'     => 'ಹೆಚ್ಚು ಬಳಕೆಯಲ್ಲಿರುವ ಪುಟಗಳು',

);
